<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Arch tutorial/cs</span></h1><?xml encoding="UTF-8"><div class="mw-parser-output"><div class="mw-pt-languages noprint" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../de/Arch_tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Arch Tutorium (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Arch_tutorial.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Arch tutorial (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/Arch_tutorial.html" class="mw-pt-progress mw-pt-progress--stub" title="Tutorial M&oacute;dulo de Arquitectura (12% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/Arch_tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Arch Tutoriel (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/Arch_tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Tutorial di Architettura (100% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Arch_tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Poradnik dla &#347;rodowiska pracy Architektura (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt-br/Arch_tutorial.html" class="mw-pt-progress mw-pt-progress--stub" title="Tutorial do M&oacute;dulo de Arquitetura (15% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../ro/Arch_tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Tutorial Atelierul Arch(itectur&#259;) (82% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="cs" dir="ltr">&#269;e&scaron;tina</span></li>
<li><a href="../ru/Arch_tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="&#1059;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082; &#1087;&#1086; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1085;&#1086;&#1084;&#1091; &#1084;&#1086;&#1076;&#1091;&#1083;&#1102; (83% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li>
<li><a href="../uk/Arch_tutorial.html" class="mw-pt-progress mw-pt-progress--stub" title="&#1055;&#1110;&#1076;&#1088;&#1091;&#1095;&#1085;&#1080;&#1082; Arch (2% translated)" lang="uk" dir="ltr">&#1091;&#1082;&#1088;&#1072;&#1111;&#1085;&#1089;&#1100;&#1082;&#1072;</a></li></ul></div>
<div class="mw-translate-fuzzy">
<table class="fcinfobox wikitable ct" style="width: 230px; float: right; margin-left: 1em">
<tbody><tr>
<td class="ctTitle" style="font-weight: bold; font-size: 125%;"><span typeof="mw:File"><span><img src="../File/Freecad.svg" decoding="async" width="32" height="32"></span></span> Tutorial
</td></tr>
<tr>
<th class="ctOdd">Topic
</th></tr>
<tr>
<td class="ctEven">Modeling
</td></tr>
<tr>
<th class="ctOdd">Level
</th></tr>
<tr>
<td class="ctEven">Intermediate
</td></tr>
<tr>
<th class="ctOdd">Time to complete
</th></tr>
<tr>
<td class="ctEven">
</td></tr>
<tr>
<th class="ctOdd">Authors
</th></tr>
<tr>
<td class="ctEven"><a href="../User;Yorik.html" title="User:Yorik">Yorik</a>
</td></tr>
<tr>
<th class="ctOdd">FreeCAD version
</th></tr>
<tr>
<td class="ctEven">0.14
</td></tr>
<tr>
<th class="ctOdd">Example files
</th></tr>
<tr>
<td class="ctEven">
</td></tr>
<tr>
<th class="ctOdd">See also
</th></tr>
<tr>
<td class="ctEven"><i>None</i>
</td></tr>
<tr>
<td class="ctToc"><br><meta property="mw:PageProp/toc">
</td></tr></tbody></table>
</div>
<p><span typeof="mw:File"><a href="../File/Arch_tutorial_00.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_00.jpg" decoding="async" width="600" height="312"></a></span>
</p><p><span id="Introduction"></span>
</p>
<h2><span id=".C3.9Avod"></span><span class="mw-headline" id="&Uacute;vod">&Uacute;vod</span></h2>
<div class="mw-translate-fuzzy">
<p>Z&aacute;m&#283;rem v&yacute;ukov&eacute;ho program je p&#345;edstavit z&aacute;klady pr&aacute;ce v <a href="../cs/Arch_Workbench.html" title="Arch Workbench/cs">Pracovn&iacute; plo&scaron;e Architektura</a>. Pokus&iacute;m se podat to tak jednodu&scaron;e aby i u&#382;ivateli bez p&#345;edchoz&iacute;ch zku&scaron;enost&iacute; s FreeCADem, ale s n&#283;jak&yacute;mi zku&scaron;enostmi s 3D nebo <a rel="nofollow" class="external text" href="http://en.wikipedia.org/wiki/Building_Information_Modeling">BIM</a> aplikacemi byl tento v&yacute;ukov&yacute; program u&#382;ite&#269;n&yacute;. V ka&#382;d&eacute;m p&#345;&iacute;pad&#283; po&#269;&iacute;tejte s t&iacute;m, &#382;e si budete muset vyhledat dal&scaron;&iacute; informace o pr&aacute;ci s FreeCADem na str&aacute;nce <a href="../Main_Page.html" title="Main Page">FreeCAD documentace wiki</a>. Jestli&#382;e nem&aacute;te &#382;&aacute;dn&eacute; zku&scaron;enosti s FreeCADem, existuje str&aacute;nka <a href="../cs/Getting_started.html" title="Getting started/cs">Za&#269;&iacute;n&aacute;me</a>, kterou byste si m&#283;li p&#345;e&#269;&iacute;st. Tak&eacute; si projd&#283;te na&scaron;i str&aacute;nku  <a href="../cs/Tutorials.html" title="Tutorials/cs">V&yacute;ukov&eacute; programy</a> a na str&aacute;nce <a rel="nofollow" class="external text" href="http://www.youtube.com/results?search_query=freecad">youtube</a> najdete tak&eacute; spoustu dal&scaron;&iacute;ch v&yacute;ukov&yacute;ch program&#367; FreeCADu.
</p>
</div>
<div class="mw-translate-fuzzy">
<p>C&iacute;lem <a href="../cs/Arch_Workbench.html" title="Arch Workbench/cs">Pracovn&iacute; plochy Architektura</a> je nab&iacute;dnout kompletn&iacute; pracovn&iacute; postup <a rel="nofollow" class="external text" href="http://en.wikipedia.org/wiki/Building_Information_Modeling">BIM</a> uvnit&#345; FreeCADu. Vzhledem k tomu, &#382;e je zat&iacute;m ve v&yacute;voji, neo&#269;ek&aacute;vejte, &#382;e hned najdete stejn&eacute; n&aacute;stroje na stejn&eacute; &uacute;rovni jako v obdobn&yacute;ch komer&#269;n&iacute;ch alternativ&aacute;ch jako je  <a rel="nofollow" class="external text" href="http://en.wikipedia.org/wiki/Revit">Revit</a> nebo <a rel="nofollow" class="external text" href="http://en.wikipedia.org/wiki/Archicad">ArchiCAD</a>, ale an druhou stranu je vyu&#382;&iacute;v&aacute;n v mnohem v&#283;t&scaron;&iacute;m rozsahu ne&#382; tyto aplikace. <a href="../cs/Arch_Workbench.html" title="Arch Workbench/cs">Pracovn&iacute; plocha Architektura</a> v&yacute;znamn&#283; vyu&#382;&iacute;v&aacute; v&yacute;hod ostatn&iacute;ch discipl&iacute;n, kter&eacute; FreeCAD poskytuje a nab&iacute;z&iacute; n&#283;kter&eacute; vlastnosti, kter&eacute; jsou z&#345;&iacute;dka vid&#283;ny u tradi&#269;n&iacute;ch BIM aplikac&iacute;.
</p>
</div>
<div class="mw-translate-fuzzy">
<p>Zde je nap&#345;&iacute;klad n&#283;kolik zaj&iacute;mav&yacute;ch vlastnost&iacute; <a href="../cs/Arch_Workbench.html" title="Arch Workbench/cs">Pracovn&iacute; plochy Architektura </a> ve FreeCADu, kter&eacute; byste obt&iacute;&#382;n&#283; hledali v jin&yacute;ch BIM aplikac&iacute;ch:
</p>
</div>
<ul><li>Architektonick&eacute; objekty jsou v&#382;dy t&#283;lesa. Ze siln&yacute;ch mechanick&yacute;ch z&aacute;klad&#367; FreeCADu zn&aacute;me d&#367;le&#382;itost toho aby struktur&aacute;ln&iacute; objekty byly v&#382;dy t&#283;lesy. To zaji&scaron;&#357;uje mnohem bezchybn&#283;j&scaron;&iacute; pr&aacute;ci a velmi spolehliv&eacute; logick&eacute; operace. Proto&#382;e mo&#382;nost d&#283;lat kapsy ve 3D objektech pomoc&iacute; 2D plochy je tak&eacute; logick&aacute; operace, hned vid&iacute;te d&#367;le&#382;itost v takov&eacute;m p&#345;&iacute;pad&#283;.</li></ul>
<ul><li>Stavebn&iacute; objekty mohou m&iacute;t kdykoliv jak&yacute;koliv tvar. Nejsou &#382;&aacute;dn&aacute; omezen&iacute;. Zdi nemusej&iacute; b&yacute;t svisl&eacute;, desky nemusej&iacute; vypadat jako desky. Jak&eacute;koliv t&#283;leso se m&#367;&#382;e kdykoliv st&aacute;t stavebn&iacute;m objektem. Velmi slo&#382;it&eacute; v&#283;ci, oby&#269;ejn&#283; t&#283;&#382;ce definovateln&eacute; v jin&yacute;ch BIM aplikac&iacute;ch, jako jsou podlahov&eacute; desky zat&aacute;&#269;ej&iacute;c&iacute; se nahoru a p&#345;ech&aacute;zej&iacute;c&iacute; v ze&#271; (ano Zaho Hadide, to je to o &#269;em jsi mluvil), nep&#345;edstavuj&iacute; &#382;&aacute;dn&yacute; mimo&#345;&aacute;dn&yacute; probl&eacute;m ve FreeCADu.</li></ul>
<div class="mw-translate-fuzzy">
<ul><li>Celou s&iacute;lu FreeCDAu m&aacute;te na &scaron;pi&#269;ce prstu. M&#367;&#382;ete vytv&aacute;&#345;et architektonick&eacute; objekty pomoc&iacute; jak&eacute;hokoliv n&aacute;stroje FreeCADu, jako je <a href="../cs/PartDesign_Workbench.html" title="PartDesign Workbench/cs">Pracovn&iacute; plocha N&aacute;vrh d&iacute;lu</a> a kdy&#382; jsou p&#345;ipraveny, konvertujete je do architektonick&yacute;ch objekt&#367;. Objekty si podr&#382;&iacute; celou svoji modelovac&iacute; historii a jsou d&aacute;le zcela editovateln&eacute;. <a href="../cs/Arch_Workbench.html" title="Arch Workbench/cs">Pracovn&iacute; plocha Atchitektura</a> tak&eacute; d&#283;d&iacute; mnoho z funkcionality <a href="../cs/Draft_Workbench.html" title="Draft Workbench/cs">Pracovn&iacute; plochy Kreslen&iacute;</a> jako je t&#345;eba <a href="../cs/Draft_Snap.html" title="Draft Snap/cs">zachycov&aacute;n&iacute;</a> a <a href="../cs/Draft_SelectPlane.html" title="Draft SelectPlane/cs">pracovn&iacute; roviny</a>.</li></ul>
</div>
<div class="mw-translate-fuzzy">
<ul><li>/cs|Pracovn&iacute; plocha Architektura je velmi sp&#345;&aacute;telen&aacute; s <a href="../cs/Mesh_Workbench.html" title="Mesh Workbench/cs">modulem s&iacute;&#357;</a>. Snadno m&#367;&#382;ete vytv&aacute;&#345;et architektonick&eacute; modely v aplikac&iacute;ch zalo&#382;en&yacute;ch na s&iacute;t&iacute;ch jako je <a rel="nofollow" class="external text" href="http://en.wikipedia.org/wiki/Blender_%28software%29">Blender</a> nebo <a rel="nofollow" class="external text" href="http://en.wikipedia.org/wiki/Sketchup">SketchUp</a> a importovat je do FreeCADu. Jestli&#382;e se star&aacute;te o kvalitu Va&scaron;eho modelu a jeho objekty jsou non-manifold (nejsou r&#367;znorod&aacute;) t&#283;lesa, jejich p&#345;evod do architektonick&yacute;ch objekt&#367; vy&#382;aduje pouze stisknut&iacute; tla&#269;&iacute;tka.</li></ul>
</div>
<div class="mw-translate-fuzzy">
<p>V dob&#283;, kdy je ps&aacute;n tento text,  <a href="../cs/Arch_Workbench.html" title="Arch Workbench/cs">Pracovn&iacute; ploch Architektura</a>, stejn&#283; jako zbytek FreeCADu trp&iacute; n&#283;kter&yacute;mi omezen&iacute;mi. Nicm&eacute;n&#283;, na v&#283;t&scaron;in&#283; se pracuje a budou k dispozici pozd&#283;ji.
</p>
</div>
<div class="mw-translate-fuzzy">
<ul><li>FreeCAD nen&iacute; 2D aplikace. Je d&#283;l&aacute;n pro 3D. Je v n&#283;m dostate&#269;n&eacute; mno&#382;stv&iacute; n&aacute;stroj&#367; pro kreslen&iacute; a &uacute;pravy 2D objekt&#367; v <a href="../cs/Draft_Workbench.html" title="Draft Workbench/cs">Pracovn&iacute; plo&scaron;e Kreslen&iacute;</a> a <a href="../cs/Sketcher_Workbench.html" title="Sketcher Workbench/cs">Pracovn&iacute; plo&scaron;e Skic&aacute;&#345;</a>, ate ty nejsou ur&#269;eny pro pr&aacute;ci s velk&yacute;mi a (n&#283;kdy &scaron;patn&#283; nakreslen&yacute;mi) 2D CAD soubory. B&#283;&#382;n&#283; m&#367;&#382;ete usp&#283;&scaron;n&#283; importovat 2D soubory, ale neo&#269;ek&aacute;vejte vysok&yacute; v&yacute;kon, pokud na nich budte cht&iacute;t pokra&#269;ovat ve 2D. Byli jste varov&aacute;ni.</li></ul>
</div>
<div class="mw-translate-fuzzy">
<ul><li>&#381;&aacute;dn&aacute; podpora materi&aacute;l&#367;. FreeCAD bude m&iacute;t kompletn&iacute; <a href="../Material.html" title="Material">Materi&aacute;lov&yacute;</a> syst&eacute;m, kter&yacute; bude schopen definovat velmi komplexn&iacute; materi&aacute;ly, se v&scaron;emi v&yacute;hodmai, kter&eacute; m&#367;&#382;ete o&#269;ek&aacute;vat (u&#382;ivatelsk&eacute; vlastnosti, materi&aacute;lov&eacute; skupiny, vykreslov&aacute;n&iacute; a vizu&aacute;ln&iacute; vlastnosti, atd.) a <a href="../cs/Arch_Workbench.html" title="Arch Workbench/cs">pracovn&iacute; plocha Architektura</a> jej bude vyu&#382;&iacute;vat hned jak bude p&#345;ipraven.</li></ul>
</div>
<ul><li>Je nainstalov&aacute;na velmi p&#345;edb&#283;&#382;b&eacute; podpora <a rel="nofollow" class="external text" href="http://en.wikipedia.org/wiki/Industry_Foundation_Classes">IFC</a>. U&#382; te&#271; m&#367;&#382;ete docela spolehliv&#283; <a href="../cs/Arch_IFC.html" title="Arch IFC/cs">importovat IFC soubory</a>, poskytovan&eacute; z <a rel="nofollow" class="external text" href="http://ifcopenshell.org">IfcOpenShell</a>, ale exportov&aacute;n&iacute; je&scaron;t&#283; nen&iacute; ofici&aacute;ln&#283; podporov&aacute;no. V&yacute;voj&aacute;&#345;i pracuj&iacute; na FreeCADu i na IfcOpenShellu a v budoucnu m&#367;&#382;eme o&#269;ek&aacute;vay plnou podporu IFC.</li></ul>
<ul><li>Mnogo n&aacute;stroj&#367; Architektury je st&aacute;le je&scaron;t&#283; ve v&yacute;voji. Znamen&aacute; to, &#382;e automatick&eacute; "wizardy", kter&eacute; jsou schopny vytv&aacute;&#345;et automaticky komplexn&iacute; konstrukce, jako jsou <a href="../cs/Arch_Roof.html" title="Arch Roof/cs">St&#345;echa</a> nebo <a href="../cs/Arch_Stairs.html" title="Arch Stairs/cs">Schody</a> mohou zat&iacute;m vytv&aacute;&#345;et jen ur&#269;it&eacute; typy t&#283;chto objekt&#367; a dal&scaron;&iacute; n&aacute;stroje, kter&eacute; maj&iacute; p&#345;edvolby jako jsou <a href="../cs/Arch_Structure.html" title="Arch Structure/cs">Struktura</a> nebo <a href="../cs/Arch_Window.html" title="Arch Window/cs">Okno</a> maj&iacute; jen n&#283;kolik z&aacute;kladn&iacute;ch p&#345;edvoleb. To se samoz&#345;ejm&#283; &#269;asem zlep&scaron;&iacute;.</li></ul>
<ul><li>Vlastnost <a href="../cs/Units.html" title="Units/cs">Jednotky</a> jsou pr&aacute;v&#283; implementov&aacute;ny ve FreeCADu, co&#382; umo&#382;&#328;uje pr&aacute;ci s jak&yacute;mikoliv jednotkami (dokonce i imperi&aacute;ln&iacute;mi jednotkami, vy ho&scaron;i z USA m&#367;&#382;ete b&yacute;t trvale vd&#283;&#269;n&iacute; J&uuml;rgenovi, patronovi a hlavn&iacute;mu &scaron;&eacute;foviFreeCADu). Ale v tomto okam&#382;iku nen&iacute; implementace kompletn&iacute; a pracovn&iacute; plocha Architektura zat&iacute;m tyto jednotky nepodporuje. Zat&iacute;m mus&iacute;te po&#269;&iacute;tat s t&iacute;m, &#382;e je "bezjednotkov&aacute;".</li></ul>
<div class="mw-translate-fuzzy">
<div class="note"><b>FreeCAD verze 0.14 je po&#382;adov&aacute;na</b>
<p>Tento v&yacute;ukov&yacute; program byl ps&aacute;n za pou&#382;it&iacute; <a href="../cs/Release_notes_0.14.html" title="Release notes 0.14/cs">FreeCAD verze 0.14</a>. Pokud budete zkou&scaron;et podle tohoto programu, budete pot&#345;ebovat minim&aacute;ln&#283; tuto verzi. D&#345;&iacute;v&#283;j&scaron;&iacute; verze nemusej&iacute; obsahovat v&scaron;echny pot&#345;ebn&eacute; n&aacute;stroje nebo volby pou&#382;&iacute;van&eacute; zde.
</p>
</div>
</div>
<p><span id="Typical_workflows"></span>
</p>
<h2><span id="Typick.C3.BD_pracovn.C3.AD_postup"></span><span class="mw-headline" id="Typick&yacute;_pracovn&iacute;_postup">Typick&yacute; pracovn&iacute; postup</span></h2>
<div class="mw-translate-fuzzy">
<p><a href="../cs/Arch_Workbench.html" title="Arch Workbench/cs">Pracovn&iacute; plocha Architektura</a>  je p&#345;ipravena hlavn&#283; pro dva druhy pracovn&iacute;ch postup&#367;:
</p>
</div>
<ul><li>Vytvo&#345;&iacute; se model v rychlej&scaron;&iacute;, na s&iacute;t&iacute;ch zalo&#382;en&eacute; aplikaci jako je <a rel="nofollow" class="external text" href="http://en.wikipedia.org/wiki/Blender_%28software%29">Blender</a> nebo <a rel="nofollow" class="external text" href="http://en.wikipedia.org/wiki/Sketchup">SketchUp</a> a ten se importuje do FreeCADu za &uacute;&#269;elem extrakce pl&aacute;n&#367; a &#345;ez&#367;. FreeCAD je za&#345;&iacute;zen na p&#345;esn&eacute; modelov&aacute;n&iacute; na mnohem vy&scaron;&scaron;&iacute; &uacute;rovni ne&#382; je vyadov&aacute;no v architektu&#345;e. Vytv&aacute;&#345;en&iacute; model&#367; p&#345;&iacute;mo ve FreeCADu m&#367;&#382;e b&yacute;t obt&iacute;&#382;n&eacute; a pomal&eacute;. Z toho d&#367;vodu m&aacute; tento pracovn&iacute; postup velk&eacute; v&yacute;hody. Popsal jsem to v <a rel="nofollow" class="external text" href="http://yorik.uncreated.net/guestblog.php?2012=180">tomto &#269;l&aacute;nku</a> na m&eacute;m blogu. Jestli m&aacute;te z&aacute;jem modelovat spr&aacute;vn&#283; a p&#345;esn&#283; (clean, solid, non-manifold meshes), d&aacute;v&aacute; V&aacute;m tento pracovn&iacute; postup stejnou &uacute;rove&#328; v&yacute;konu a p&#345;esnosti jako jin&eacute;.</li></ul>
<div class="mw-translate-fuzzy">
<ul><li>Vytv&aacute;&#345;en&iacute; modelu p&#345;&iacute;mo ve FreeCADu. To je to co V&aacute;m uk&aacute;&#382;u v tomto v&yacute;ukov&eacute;m programu. V&#283;t&scaron;inou budeme vyu&#382;&iacute;vat t&#345;i pracovn&iacute; plochy: <a href="../cs/Arch_Workbench.html" title="Arch Workbench/cs">Architektura</a>, samoz&#345;ejm&#283;, ale tak&eacute; <a href="../cs/Draft_Workbench.html" title="Draft Workbench/cs">Kreslen&iacute;</a>, jeho&#382; v&scaron;echny n&aacute;stroje jsou v&#269;len&#283;ny do Architektury, tak&#382;e nen&iacute; pot&#345;eba p&#345;ep&iacute;nat pracovn&iacute; plochy a <a href="../cs/Sketcher_Workbench.html" title="Sketcher Workbench/cs">Skic&aacute;&#345;</a>. S v&yacute;hodou to m&#367;&#382;ete ud&#283;lat jak to b&#283;&#382;n&#283; d&#283;l&aacute;m j&aacute;, &#382;e si vytvo&#345;&iacute;m u&#382;ivatelsk&yacute; n&aacute;strojov&yacute; pruh v pracovn&iacute; plo&scaron;e Architektura, pomoc&iacute; N&aacute;stroje &rarr; U&#382;ivatelsk&eacute;, a p&#345;id&aacute;m ze Skic&aacute;&#345;e n&aacute;stroje, kter&eacute; budu &#269;asto pou&#382;&iacute;vat. Toto je moje "u&#382;ivatelsk&aacute;" pracovn&iacute; plocha Architektura:</li></ul>
</div>
<p><span class="mw-default-size" typeof="mw:File"><a href="../File/Arch_tutorial_01.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_01.jpg" decoding="async" width="1024" height="658"></a></span>
</p><p>V tomto v&yacute;ukov&eacute;m programu budeme modelovat d&#367;m ve 3D, zalo&#382;en&yacute; na 3D v&yacute;kresu, kter&yacute; st&aacute;hneme z netu a extrahujeme z 2D dokumentu pl&aacute;ny, v&yacute;&scaron;ky a &#345;ezy.
</p><p><span id="Preparation"></span>
</p>
<h2><span id="P.C5.99.C3.ADprava"></span><span class="mw-headline" id="P&#345;&iacute;prava">P&#345;&iacute;prava</span></h2>
<p>M&iacute;sto vytv&aacute;&#345;en&iacute; projektu od za&#269;&aacute;tku, vezm&#283;me si pro modelov&aacute;n&iacute; projekt z p&#345;&iacute;kladu, u&scaron;et&#345;&iacute; n&aacute;m to &#269;as. Vybral jsem n&aacute;dhern&yacute; d&#367;m zn&aacute;m&eacute;ho architekta <a rel="nofollow" class="external text" href="http://en.wikipedia.org/wiki/Jo%C3%A3o_Batista_Vilanova_Artigas">Vilanova Artigas</a> (pod&iacute;vejte se na s&eacute;rii <a rel="nofollow" class="external text" href="http://www.leonardofinotti.com/projects/architects-second-house/image/40409-130405-010d">obr&aacute;zk&#367;</a> od  Leonardo Finotti), proto&#382;e je to bl&iacute;zko od m&eacute;ho bydli&scaron;t&#283;, proto&#382;e je to jednoduch&eacute; a proto&#382;e je to par&aacute;dn&iacute; p&#345;&iacute;klad modernistick&eacute; architektury v Sao Paulu a dwg v&yacute;kresy jsou <a rel="nofollow" class="external text" href="http://www.bibliocad.com/library/second-house-vilanova-artigas_72926#">snadno dostupn&eacute;</a>.
</p><p>Pou&#382;ijeme 2D DWG v&yacute;kresy z&iacute;skan&eacute; z odkazu naho&#345;e (mus&iacute;te se registrovat ke sta&#382;en&iacute;, ale je to zdarma) jako z&aacute;klad pro tvorbu na&scaron;eho modelu. Tak&#382;e prvn&iacute; v&#283;c je sta&#382;en&iacute; souboru, jeho rozzipov&aacute;n&iacute; a otev&#345;en&iacute; DWG souboru v n&#283;jak&eacute; dwg aplikaci jeko je t&#345;eba  <a rel="nofollow" class="external text" href="http://www.3ds.com/products-services/draftsight/overview/">DraftSight</a>. Alternativn&#283; m&#367;&#382;ete jej konvertovat do DXF pomoc&iacute; bezplatn&eacute; utility, t&#345;eba <a rel="nofollow" class="external text" href="https://www.opendesign.com/guestfiles/oda_file_converter">ODA File Converter</a>. M&aacute;te-li konvertor ODA nainstalov&aacute;n (a cestu k n&#283;mu nastavenou v p&#345;edvolb&aacute;ch Architektury), pak je FreeCAD tak&eacute; <a href="../cs/Draft_DXF.html" title="Draft DXF/cs">schopen naimportovat DWG soubory p&#345;&iacute;mo</a>. Ale proto&#382;e tyto soubory &#269;asto m&iacute;vaj&iacute; &scaron;patnou kvalitu a jsou velmi t&#283;&#382;kop&aacute;dn&eacute;, je oby&#269;ejn&#283; lep&scaron;&iacute; otev&#345;&iacute;t je ve 2D CAD aplikaci a pro&#269;istit je.
</p><p>Zde jsem vyhodil v&scaron;echny v&yacute;kresy detail&#367;, v&scaron;echny r&aacute;me&#269;ky s informacemi o v&yacute;krese, "vy&#269;istil" jsem jej (v AutoCADu je to "purge") pro odstran&#283;n&iacute; v&scaron;ech zbyte&#269;n&yacute;ch entit, zreorganizoval jsem &#345;ezy do logick&eacute;ho um&iacute;st&#283;n&iacute; v relaci s ohledem na pl&aacute;n a p&#345;esunul jsem v&scaron;echno k po&#269;&aacute;tku (0,0). Potom m&#367;&#382;e b&yacute;t n&aacute;&scaron; soubor otev&#345;en ve FreeCADu efektivn&#283;. Zkontrolujte r&#367;zn&eacute; odli&scaron;n&eacute; volby dostupn&eacute; v menu &Uacute;pravy &rarr; P&#345;edvolby &rarr; Kreslen&iacute; &rarr; Import/Export, kter&eacute; mohou ovlivnit jak (a jak rychle) jsou soubory DXF/DWG importov&aacute;ny.
</p><p>Takto vypad&aacute; soubor po otev&#345;en&iacute; ve FreeCADu. Zm&#283;nil jsem taky tlou&scaron;&#357;ku zd&iacute; (obsah skupiny "muros") a prohodil p&aacute;r dve&#345;&iacute;, kter&eacute; byly importov&aacute;ny se &scaron;patn&yacute;m m&#283;&#345;&iacute;tkem v ose X, pomoc&iacute; n&aacute;stroje <a href="../cs/Draft_Scale.html" title="Draft Scale/cs">Kreslen&iacute; M&#283;&#345;&iacute;tko</a>:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../File/Arch_tutorial_02.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_02.jpg" decoding="async" width="1024" height="445"></a></span>
</p><p><a href="../cs/Draft_DXF.html" title="Draft DXF/cs">DXF importer</a> (kter&yacute; se tak&eacute; um&iacute; postarat o DWG soubory, proto&#382;e p&#345;i importu DWG soubor&#367; jsou nejd&#345;&iacute;ve jednodu&scaron;e zkonvertov&aacute;ny do DXF) seskupuje importovan&eacute; objekty podle vrstev. Ve FreeCADu nejsou vrstvy, ale <a href="../index.php?title=Std_Group/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Std Group/cs (page does not exist)">skupiny</a>. <a href="../index.php?title=Std_Group/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Std Group/cs (page does not exist)">Skupiny</a> nab&iacute;zej&iacute; jednoduch&yacute; zp&#367;sob organizace objekt&#367; v souborech, ale nemaj&iacute; specifick&eacute; vlastnosti jako vrstvy v AutoCADu, kter&eacute; se aplikuj&iacute; na jejich obsah. Ale mohou b&yacute;t um&iacute;st&#283;ny uvnit&#345; jin&yacute;ch skupin co&#382; je velmi &scaron;ikovn&eacute;. Prvn&iacute; v&#283;c, kterou zde budeme cht&iacute;t ud&#283;lat je vytvo&#345;it novou <a href="../index.php?title=Std_Group/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Std Group/cs (page does not exist)">skupinu</a> (v <a href="../cs/Document_structure.html" title="Document structure/cs">okn&#283; stromu</a>), klikn&#283;te prav&yacute;m tla&#269;&iacute;tkem my&scaron;i na ikonu dokumentu, p&#345;idejte skupinu, klikn&#283;te na ni prav&yacute;m tla&#269;&iacute;tkem my&scaron;i a p&#345;ejmenujte ji na  "base 2D plans" a p&#345;et&aacute;hn&#283;te do n&iacute; v&scaron;echny ostatn&iacute; objekty .
</p><p><span id="Building_the_walls"></span>
</p>
<h2><span id="V.C3.BDstavba_zd.C3.AD"></span><span class="mw-headline" id="V&yacute;stavba_zd&iacute;">V&yacute;stavba zd&iacute;</span></h2>
<div class="mw-translate-fuzzy">
<p>Jako v&#283;t&scaron;ina  <a href="../cs/Arch_Workbench.html" title="Arch Workbench/cs">Architektonick&yacute;ch</a> objekt&#367;, mohou b&yacute;t <a href="../cs/Arch_Wall.html" title="Arch Wall/cs">zdi</a> stav&#283;ny na rozmanit&yacute;ch objektech: <a href="../cs/Draft_Line.html" title="Draft Line/cs">p&#345;&iacute;mky</a>, <a href="../cs/Draft_Wire.html" title="Draft Wire/cs">dr&aacute;ty</a> (lomen&eacute; &#269;&aacute;ry), <a href="../cs/Sketcher_Workbench.html" title="Sketcher Workbench/cs">n&aacute;&#269;rty</a>, plochy nebo t&#283;lesa (nebo dokonce na ni&#269;em, kdy&#382; jsou definov&aacute;ny v&yacute;&scaron;kou, &scaron;&iacute;&#345;kou a d&eacute;lkou). V&yacute;sledn&aacute; konstrukce zdi z&aacute;vis&iacute; na konstrukci z&aacute;kladu a vlastnostech, kter&eacute; zad&aacute;te, jako jsou &scaron;&iacute;&#345;ka a v&yacute;&scaron;ka. Jak asi uhodnete, ze&#271; zalo&#382;en&aacute; na p&#345;&iacute;mce ji vyu&#382;ije jeko p&#345;&iacute;mku, podle kter&eacute; se ze&#271; zarovn&aacute;, zat&iacute;mco ze&#271; zalo&#382;en&aacute; na plo&scaron;e vyu&#382;ije plochu jako sv&#367;j z&aacute;kladov&yacute; obrys a ze&#271; zalo&#382;en&aacute; na t&#283;lese jednodu&scaron;e p&#345;evezme rozm&#283;ry zadan&eacute;ho t&#283;lesa. To umo&#382;&#328;uje jak&eacute;mukoliv tvaru st&aacute;t se zd&iacute;.
</p>
</div>
<div class="mw-translate-fuzzy">
<p>Ve FreeCADu existuje n&#283;kolik mo&#382;n&yacute;ch strategi&iacute; jak stav&#283;t zdi. Jedna umo&#382;&#328;uje vystv&#283;t kompletn&iacute; "pl&aacute;n podla&#382;&iacute;" pomoc&iacute; <a href="../cs/Sketcher_Workbench.html" title="Sketcher Workbench/cs">skic&aacute;&#345;e</a> a pak z n&iacute; vystv&#283;t jedne velk&yacute; objekt zdi. Tato technika funguje, ale m&#367;&#382;ete zadat pouze jednu tlou&scaron;&#357;ku pro v&scaron;echny zdi v projektu. Nebo m&#367;&#382;ete vystv&#283;t ka&#382;dou za&#271; samostatn&#283; ze segment&#367; p&#345;&iacute;mek. Nebo (a to bude vyu&#382;ito zde) m&#367;&#382;et vyu&#382;&iacute;t mix z obou zp&#367;sob&#367;: ud&#283;l&aacute;me p&aacute;r <a href="../cs/Draft_Wire.html" title="Draft Wire/cs">dr&aacute;t&#367;</a> nad importovan&yacute;m pl&aacute;nem, jeden pro ka&#382;d&yacute; typ zdi:
</p>
</div>
<p><span class="mw-default-size" typeof="mw:File"><a href="../File/Arch_tutorial_03.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_03.jpg" decoding="async" width="1024" height="412"></a></span>
</p><p>Jak vid&iacute;te nakreslil jsem &#269;erven&#283; p&#345;&iacute;mky, ze kter&yacute;ch budou betonov&eacute; zdi (<a rel="nofollow" class="external text" href="http://www.google.com/search?tbm=isch&amp;q=casa+artigas+brooklin">vyhled&aacute;n&iacute; obr&aacute;zk&#367;</a> domu V&aacute;m m&#367;&#382;e usnadnit rozli&scaron;en&iacute; r&#367;zn&yacute;ch typ&#367; zd&iacute;), zelen&eacute; p&#345;&iacute;mky jsou vn&#283;j&scaron;&iacute; cihlov&eacute; zdi a modr&eacute; p&#345;&iacute;mky se stanou vnit&#345;n&iacute;mi zdmi. P&#345;&iacute;mky proch&aacute;zej&iacute; i dve&#345;mi, proto&#382;e dve&#345;e budou vlo&#382;eny do zd&iacute; pozd&#283;ji a vytvo&#345;&iacute; si otvory automaticky samostatn&#283;. Zdi mohou b&yacute;t k jejich z&aacute;kladov&eacute; p&#345;&iacute;mce zarovn&aacute;ny zleva, zprava nebo centr&aacute;ln&#283;, tak&#382;e nez&aacute;le&#382;&iacute; na tom, po kter&eacute; stran&#283; z&aacute;kladovou p&#345;&iacute;mku nakresl&iacute;te. Tak&eacute; jsem si d&aacute;val pozor abych se co nejv&iacute;ce vyhnul prot&iacute;n&aacute;ni, proto&#382;e tak se model stane co nej&#269;ist&scaron;&iacute;m. Ale o prot&iacute;n&aacute;n&iacute; se postar&aacute;me pozd&#283;ji.
</p><p>Kdy&#382; je to hotovo, m&#367;&#382;ete v&scaron;echny tyto p&#345;&iacute;mky um&iacute;stit do nov&eacute; <a href="../index.php?title=Std_Group/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Std Group/cs (page does not exist)">skupinu</a>. Postupn&#283; vyb&iacute;rejte p&#345;&iacute;mky a stiskem tla&#269;&iacute;tka <a href="../cs/Arch_Wall.html" title="Arch Wall/cs">Ze&#271;</a> z nich stav&#283;jte zdi. M&#367;&#382;ete vybrat i n&#283;kolik p&#345;&iacute;mek z&aacute;rove&#328;. Po dokon&#269;en&iacute; a &uacute;prav&#283; &scaron;&iacute;&#345;ek (extern&iacute; zdi jsou &scaron;irok&eacute; 25cm, vnit&#345;n&iacute; 15cm) a n&#283;kter&yacute;ch zarovn&aacute;n&iacute;. My u&#382; m&aacute;me zdi p&#345;ipraveny:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../File/Arch_tutorial_04.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_04.jpg" decoding="async" width="1024" height="408"></a></span>
</p><p>Ze&#271; m&#367;&#382;eme budovat i z &uacute;pln&eacute;ho za&#269;&aacute;tku.  Kdy&#382; stisknete tla&#269;&iacute;tko <a href="../cs/Arch_Wall.html" title="Arch Wall/cs">Ze&#271;</a> bez vybran&eacute;ho objektu, m&#367;&#382;ete kliknout na dva body na obrazovce a nakreslit ze&#271;. Ale na pozad&iacute; n&aacute;stroj Ze&#271; ve skute&#269;nosti nakresl&iacute; p&#345;&iacute;mku a na n&iacute; postav&iacute; ze&#271;. Ale v tomto p&#345;&iacute;pad&#283; pova&#382;uji za mnohem pou&#269;n&#283;j&scaron;&iacute; uk&aacute;zat jak to funguje.
</p><p>V&scaron;imli jste si, &#382;e jsem si hodn&#283; d&aacute;val pozor abych nek&#345;&iacute;&#382;il zdi? Pozd&#283;ji n&aacute;m to u&scaron;et&#345;&iacute; hodn&#283; bolen&iacute; hlavy, nap&#345;&iacute;klad kdy&#382; na&scaron;i pr&aacute;ci exportujeme do jin&yacute;ch aplikac&iacute;, kter&eacute; to nemaj&iacute; r&aacute;dy. J&aacute; zde m&aacute;m pouze jedno k&#345;&iacute;&#382;en&iacute;, kdy&#382; jsem byl l&iacute;n&yacute; nakreslit dva kr&aacute;tk&eacute; p&#345;&iacute;mkov&eacute; segmenty a nakreslil jsem jednu velkou lomenou &#269;&aacute;ru, kter&aacute; p&#345;ek&#345;&iacute;&#382;ila jinou. To mus&iacute; b&yacute;t opraveno. Na&scaron;t&#283;st&iacute; maj&iacute; v&scaron;echny objekty Architektury skv&#283;lou vlastnost: m&#367;&#382;ete p&#345;idat jednu na druhou. Kdy&#382; to ud&#283;l&aacute;me, sjednot&iacute; se jejich konstrukce, ale st&aacute;le potom z&#367;stanou editovateln&eacute; a nez&aacute;visl&eacute;. P&#345;id&aacute;n&iacute; jedn&eacute; z na&scaron;ich p&#345;ek&#345;&iacute;&#382;en&yacute;ch zd&iacute; na druhou ud&#283;l&aacute;me tak, &#382;e jednu z nich vybereme, potom CTRL+v&yacute;b&#283;r druh&eacute; a stiskneme n&aacute;stroj <a href="../cs/Arch_Add.html" title="Arch Add/cs">P&#345;idat</a>:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../File/Arch_tutorial_05.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_05.jpg" decoding="async" width="1024" height="414"></a></span>
</p><p>Vlevo jsou dv&#283; p&#345;ek&#345;&iacute;&#382;en&eacute; zdi, napravo v&yacute;sledek po p&#345;id&aacute;n&iacute; jedn&eacute; na druhou.
</p>
<div class="mw-translate-fuzzy">
<div class="note"><b>D&#367;le&#382;it&aacute; pozn&aacute;mka k parametrick&yacute;m objekt&#367;m</b>
<p>Existuje n&#283;co d&#367;le&#382;it&eacute;ho s &#269;&iacute;m je ji&#382; pot&#345;eba po&#269;&iacute;tat. Jak v&iacute;te, ve FreeCADu je v&scaron;echno parametrick&eacute;: Na&scaron;e nov&aacute; "sjednocen&aacute;" ze&#271; je vytvo&#345;ena ze dvou zd&iacute;, z nich&#382; ka&#382;d&aacute; je zalo&#382;ena na z&aacute;kladov&eacute; p&#345;&iacute;mce. Kdy&#382; je rozbal&iacute;te v <a href="../cs/Document_structure.html" title="Document structure/cs">okn&#283; stromu</a>, uvid&iacute;te &#345;et&#283;z z&aacute;vislos&iacute;. Jak si m&#367;&#382;ete p&#345;edstavit, takov&aacute; h&#345;&iacute;&#269;ka se rychle m&#367;&#382;e st&aacute;t velmi slo&#382;itou. D&aacute;le, kdy&#382; u&#382; v&iacute;te jak se pracuje se <a href="../cs/Sketcher_Workbench.html" title="Sketcher Workbench/cs">skic&aacute;&#345;em</a>, mohli bychom cht&iacute;t nakreslit z&aacute;kladov&eacute; p&#345;&iacute;mky s vazben&yacute;mi n&aacute;&#269;rty. Cel&aacute; ta slo&#382;itost n&#283;co stoj&iacute;: exponenci&aacute;ln&#283; nar&#367;st&aacute; mno&#382;stv&iacute; v&yacute;po&#269;t&#367;, kter&eacute; msu&iacute; FreeCAD prov&aacute;d&#283;t aby udr&#382;el konstrukci modelu aktu&aacute;ln&iacute;. Tak, kdy&#382; se nad t&iacute;m zamysl&iacute;te, nezvy&scaron;ujte zbyte&#269;n&#283; slo&#382;itost, pokud to nen&iacute; pot&#345;eba. Udr&#382;ujte spr&aacute;vnou rovnov&aacute;hu mezi jednoduch&yacute;mi a slo&#382;it&yacute;mi objekty a ty si nechte pro p&#345;&iacute;pady, kdy budete slo&#382;itost skute&#269;n&#283; pot&#345;ebovat.
</p>
</div>
</div>
<p>Nap&#345;&iacute;klad, j&aacute; jsem mohl nakreslit z&aacute;kladov&eacute; p&#345;&iacute;mky bez ohledu na jejich k&#345;&iacute;&#382;en&iacute; a upravit to pozd&#283;ji pomoc&iacute; n&aacute;stroje <a href="../cs/Arch_Add.html" title="Arch Add/cs">P&#345;idat</a>. Ale t&iacute;m bych zna&#269;n&#283; zv&yacute;&scaron;il slo&#382;itost modelu bez jak&eacute;hokoliv p&#345;&iacute;nosu. Lep&scaron;&iacute; je to d&#283;lat spr&aacute;vn&#283; od za&#269;&aacute;tku a udr&#382;ovat je jako velmi jednoduch&eacute; &#269;&aacute;sti konstrukce.
</p><p>Te&#271; u&#382; jsou na&scaron;e zdi v po&#345;&aacute;dku a pot&#345;ebujeme zdvihnout jejich v&yacute;&scaron;ku a&#382; se protne se st&#345;echou. Potom, proto&#382;e ze&#271; nem&#367;&#382;e b&yacute;t automaticky useknuta st&#345;echou (nicm&eacute;n&#283; jednoho dne k tomu dojde), vytvo&#345;&iacute;me "fiktivn&iacute;" objekt, kter&yacute; kop&iacute;ruje tvar st&#345;echy, pro odebr&aacute;n&iacute; z na&scaron;&iacute; zdi.
</p><p>Nejprve, kdy&#382; se pod&iacute;v&aacute;me na 2D v&yacute;kresy, vid&iacute;me, &#382;e nejvy&scaron;&scaron;&iacute; bod st&#345;echy nad 5.6m nad podlahou. Proto nastavme v&yacute;&scaron;ku na&scaron;&iacute; zdi na 6m a t&iacute;m si zajist&iacute;me, &#382;e bude odebr&aacute;na na&scaron;&iacute;m fiktivn&iacute;m objemem zdi. M&#367;&#382;ete se pt&aacute;t pro&#269; 6m a ne 5.6m? Dobr&aacute;, jestli&#382;e u&#382; jste n&#283;kdy pracovali s logick&yacute;mi operacemi (p&#345;id&aacute;n&iacute;, odebr&aacute;n&iacute;, pr&#367;niky), mus&iacute;te u&#382; v&#283;d&#283;t, &#382;e tyto operace nemaj&iacute; moc r&aacute;dy "face-on-face" (povrch na povrch) situace. Maj&iacute; r&aacute;dy &#269;ist&eacute;, opravdu se prot&iacute;naj&iacute;c&iacute; objekty, Tak&#382;e, kdy&#382; to ud&#283;l&aacute;me takto, m&aacute;me to poji&scaron;t&#283;n&eacute;.
</p><p>Pro zdvihnut&iacute; v&yacute;&scaron;ky na&scaron;&iacute;ch zd&iacute;, jednodu&scaron;e v&scaron;echny vyberte (nezapome&#328;te tu, kterou jsme p&#345;idali na dal&scaron;&iacute;) v okn&#283; stromu a zm&#283;&#328;te hodnotu jejich vlastnosti "v&yacute;&scaron;ka".
</p><p>P&#345;ed vytvo&#345;en&iacute;m st&#345;echy a sn&iacute;&#382;en&iacute;m zd&iacute; ud&#283;lejme i ostatn&iacute; objekty, kter&eacute; budou pot&#345;ebovat sn&iacute;&#382;en&iacute;: Zdi horn&iacute;ho studia a sloupy. Zdi studia jsou ud&#283;l&aacute;ny stejn&yacute;m zp&#367;sobem, jak&yacute; u&#382; jsme pou&#382;ili, na pl&aacute;nech horn&iacute;ho patra, ale budou zv&yacute;&scaron;eny na &uacute;rove&#328; 2.6m. Proto jim d&aacute;me po&#382;adovanou v&yacute;&scaron;ku, vrchol je ve v&yacute;&scaron;ce 6m, tak&#382;e v&yacute;&scaron;ka bude 3.4m. Kdy&#382; je to hotovo, zdvihn&#283;me zdi na &uacute;rove&#328; 2.6m: Ob&#283; vybereme, p&#345;ejdeme do pohledu zep&#345;edu (Pohled &rarr; Standardn&iacute; pohledy &rarr; Zep&#345;edu), stiskn&#283;te tla&#269;&iacute;tko <a href="../cs/Draft_Move.html" title="Draft Move/cs">Posun</a>, vyberte prvn&iacute; bod, potom zadejte 0, 2.6, 0 jako sou&#345;adnice a stiskn&#283;te ENTER. Objekty vysko&#269;&iacute; do v&yacute;&scaron;ky 2.6m:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../File/Arch_tutorial_06.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_06.jpg" decoding="async" width="1024" height="377"></a></span>
</p>
<div class="mw-translate-fuzzy">
<div class="note"><b>O sou&#345;adnic&iacute;ch</b>
<p>Objekty <a href="../cs/Draft_Workbench.html" title="Draft Workbench/cs">Kreslen&iacute;</a> a tak&eacute; v&#283;t&scaron;ina objekt&#367; <a href="../cs/Arch_Workbench.html" title="Arch Workbench/cs">Architektury</a> se &#345;&iacute;d&iacute; syst&eacute;mem Kreslen&iacute; zvan&yacute;m <a href="../cs/Draft_SelectPlane.html" title="Draft SelectPlane/cs">pracovn&iacute; roviny</a>. Tento syst&eacute;m definuje 2D rovinu, na kter&eacute; se budou odehr&aacute;vat n&aacute;sleduj&iacute;c&iacute; operace. Jestli&#382;e nedefinujete &#382;&aacute;dnou rovinu, pak se pracovn&iacute; rovina p&#345;izp&#367;sob&iacute; do aktu&aacute;ln&iacute;ho pohledu. To je d&#367;vod pro&#269; p&#345;ep&iacute;n&aacute;me do pohledu zep&#345;edu a vid&iacute;te, &#382;e posun v X je 0 a Y je 2.6. Tak&eacute; m&#367;&#382;eme ur&#269;it, &#382;e pracovn&iacute; rovina bude v p&#345;&iacute;zem&iacute;, pou&#382;it&iacute;m n&aacute;stroje <a href="../cs/Draft_SelectPlane.html" title="Draft SelectPlane/cs">v&yacute;b&#283;r roviny</a>. Pak jsme zadali posun X rovno 0, Y rovno 0 a Z rovno 2.6. 
</p>
</div>
</div>
<p>Te&#271; posu&#328;me na&scaron;e zdi vodorovn&#283; na jejich spr&aacute;vnou pozici. Proto&#382;e m&aacute;me zachycovac&iacute; body je to snadn&#283;j&scaron;&iacute;: Vybereme ob&#283; zdi, stiskneme n&aacute;stroj <a href="../cs/Draft_Move.html" title="Draft Move/cs">Posun</a> a posuneme je z jednoho bodu do druh&eacute;ho:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../File/Arch_tutorial_07.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_07.jpg" decoding="async" width="1024" height="531"></a></span>
</p><p>Nakonec jsem zm&#283;nil barvu n&#283;kter&yacute;ch zd&iacute; na cihlovou (je to snadn&#283;j&scaron;&iacute; pro odli&scaron;en&iacute;) a ud&#283;lal malou korekci: N&#283;kter&eacute; zdi nejdou a&#382; ke st&#345;e&scaron;e, ale skon&#269;&iacute; na v&yacute;&scaron;ce 2.60m. Upravil jsem v&yacute;&scaron;ku t&#283;chto zd&iacute;.
</p><p><span id="Raising_the_structure"></span>
</p>
<h2><span id="Zvednut.C3.AD_struktury"></span><span class="mw-headline" id="Zvednut&iacute;_struktury">Zvednut&iacute; struktury</span></h2>
<p>Nyn&iacute;, proto&#382;e mus&iacute;me sn&iacute;&#382;it zdi odebr&aacute;n&iacute;m objektu, mohli bychom se pod&iacute;vat jestli tam nejsou dal&scaron;&iacute; objekty, kter&eacute; budou pot&#345;ebovat t&iacute;mto zp&#367;sobem sn&iacute;&#382;it. Jsou tam, n&#283;kter&eacute; ze sloup&#367;. To je dobr&aacute; p&#345;&iacute;le&#382;itost p&#345;edstavit dal&scaron;&iacute; z objekt&#367; architektury: <a href="../cs/Arch_Structure.html" title="Arch Structure/cs">Strukturu</a>. Objekty struktury se v&iacute;cem&eacute;n&#283; chovaj&iacute; jako zdi, ale nejsou vytvo&#345;eny ze z&aacute;kladov&eacute; p&#345;&iacute;mky. Sp&iacute;&scaron;e preferuj&iacute; pr&aacute;ci z profilu, kter&yacute; se vysune (pod&eacute;l p&#345;&iacute;mky profilu nebo ne) Jak&yacute;koliv ploch&yacute; objekt m&#367;&#382;e slou&#382;it jako profil pro strukturu, s jedin&yacute;m po&#382;adavkem: mus&iacute; tvo&#345;it uzav&#345;en&yacute; tvar.
</p><p>Pro na&scaron;e sloupy pou&#382;ijeme jinou strategii ne&#382; jsme pou&#382;ili pro zdi. M&iacute;sto "kreslen&iacute;" na 2D pl&aacute;nech, pou&#382;ijeme p&#345;&iacute;mo objekty z nich: kru&#382;nice, kter&eacute; reprezentuj&iacute; sloupy v pohledu pl&aacute;nu. Teoreticky bychom mohli vybrat jeden z nich a stisknout tla&#269;&iacute;tko <a href="../cs/Arch_Structure.html" title="Arch Structure/cs">Struktura</a>. Nicm&eacute;n&#283;, pokud bychom to ud&#283;lali takto, vytvo&#345;&iacute;me "pr&aacute;zdn&yacute;" struktur&aacute;ln&iacute; objekt. Je to kv&#367;li tomu, &#382;e si nikdy nem&#367;&#382;ete b&yacute;t jisti jak dob&#345;e byly objekty nakresleny v DWG souboru a tyto objekty &#269;asto nejsou uzav&#345;eny. Tak&#382;e p&#345;ed jejich zformov&aacute;n&iacute;m ve sloupy je zm&#283;n&iacute;me na plochy dvojn&aacute;sobn&yacute;m pou&#382;it&iacute;m n&aacute;stroje <a href="../cs/Draft_Upgrade.html" title="Draft Upgrade/cs">Vylep&scaron;it</a>. P&#345;i prvn&iacute;m je zkonvertujeme do uzav&#345;en&yacute;ch dr&aacute;t&#367; (lomen&yacute;ch &#269;&aacute;r), p&#345;i druh&eacute;m zkonvertujeme dr&aacute;ty do ploch. Druh&yacute; krok nen&iacute; povinn&yacute;, ale kdy&#382; m&aacute;te plochy, m&#367;&#382;ete si b&yacute;t na 100% jisti, &#382;e jsou uzav&#345;en&eacute; (jinak nem&#367;&#382;e b&yacute;t plocha vytvo&#345;ena).
</p><p>Kdy&#382; jsme zkonvertovali v&scaron;echny sloupy do ploch, m&#367;&#382;eme na n&#283; pou&#382;&iacute;t n&aacute;stroj <a href="../cs/Arch_Structure.html" title="Arch Structure/cs">Struktura</a> a nastavit v&yacute;&scaron;ku (n&#283;kter&eacute; maj&iacute; 6m, dal&scaron;&iacute; pouze 2.25m):
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../File/Arch_tutorial_08.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_08.jpg" decoding="async" width="1024" height="434"></a></span>
</p><p>Na obr&aacute;zku naho&#345;e vid&iacute;te dva sloupy, kter&eacute; jsou tak jak byly v DWG souboru, dva byly vylep&scaron;eny na plochy a dva byly zformov&aacute;ny do struktur&aacute;ln&iacute;ch objekt&#367; a jejich v&yacute;&scaron;ka nastavena na 6m a 2.25m.
</p><p>P&#345;ipom&iacute;n&aacute;m, &#382;e tyto r&#367;zn&eacute; architektonick&eacute; objekty (zdi, struktury a dal&scaron;&iacute;, kter&eacute; je&scaron;t&#283; objev&iacute;me) v&scaron;echny sd&iacute;lej&iacute; spoustu v&#283;ci mezi sebou (nap&#345;&iacute;klad v&scaron;echny mohou b&yacute;t p&#345;id&aacute;ny jedna na druhou, jako jsme to ji&#382; ud&#283;lali se zdmi, a kter&aacute;koliv z nich m&#367;&#382;e b&yacute;t zkonverov&aacute;na do jin&eacute;). Je to v&iacute;ce ot&aacute;zka vkusu, sloupy m&#367;&#382;eme tak&eacute; ud&#283;lat pomoc&iacute; n&aacute;stroje pro ze&#271; a podle pot&#345;eby zkonvertovat. Ve skute&#269;nosti n&#283;kter&eacute; z na&scaron;ich zd&iacute; jsou betonov&eacute; zdi, pozd&#283;ji je m&#367;&#382;eme zkonvertovat do struktur.
</p><p><span id="Subtractions"></span>
</p>
<h2><span id="Odebr.C3.A1n.C3.AD"></span><span class="mw-headline" id="Odebr&aacute;n&iacute;">Odebr&aacute;n&iacute;</span></h2>
<p>Nyn&iacute; je &#269;as vytvo&#345;it n&aacute;&scaron; ode&#269;&iacute;tac&iacute; objem. Nejjednodu&scaron;&scaron;&iacute;m zp&#367;sobem je nakreslit jeho profil nad &#345;ezem. Potom jej oto&#269;&iacute;me a um&iacute;st&iacute;me jej do spr&aacute;vn&eacute; pozice. Pod&iacute;vejte se pro&#269; jsem um&iacute;stil &#345;ez a sklon p&#345;ed za&#269;&aacute;tkem? Bude to velmi &scaron;ikovn&eacute; pro nakreslen&iacute; toho objemu zde, potom jeho posunut&iacute; do spr&aacute;vn&eacute; pozice na modelu.
</p><p>Nakresleme tedy ten objem, v&#283;t&scaron;&iacute; ne&#382; st&#345;echa, kter&yacute; bude ode&#269;ten ze zd&iacute;. Ud&#283;l&aacute;m to tak, &#382;e nakresl&iacute;m dv&#283; p&#345;&iacute;mky nad z&aacute;kladnou st&#345;echy, potom jej trochu prodlou&#382;&iacute;m pomoc&iacute; n&aacute;stroje <a href="../cs/Draft_Trimex.html" title="Draft Trimex/cs">O&#345;&iacute;znout</a>. Potom nakresl&iacute;m <a href="../cs/Draft_Wire.html" title="Draft Wire/cs">dr&aacute;t</a>, zachycen&iacute;m k uveden&yacute;m p&#345;&iacute;mk&aacute;m a  p&#345;echodem nahoru na na&scaron;ich 6 metr&#367;. Tak&eacute; jsem nakreslil modrou p&#345;&iacute;mku na &uacute;rovni p&#345;&iacute;zem&iacute; (0.00), kter&aacute; bude na&scaron;&iacute; osou rotace.
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_09.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_09.jpg" decoding="async" width="1024" height="479"></a></span>
</p><p>A te&#271; ta finta: Pou&#382;ijeme n&aacute;stroj <a href="../cs/Draft_Rotate.html" title="Draft Rotate/cs">Oto&#269;en&iacute;</a> pro pooto&#269;en&iacute; na&scaron;eho profilu o 90 stup&#328;&#367; nahoru, do spr&aacute;vn&eacute; pozice kde bude vysunut. Ud&#283;l&aacute;me to tak, &#382;e nejd&#345;&iacute;ve mus&iacute;me zm&#283;nit <a href="../cs/Draft_SelectPlane.html" title="Draft SelectPlane/cs">pracovn&iacute; rovinu</a> na rovinu YZ. Kdy&#382; je to provedeno, bude oto&#269;en&iacute; provedeno v t&eacute;to rovin&#283;. Kdybychom cht&#283;li a ud&#283;lali to trochu d&#345;&iacute;ve a nastavili bo&#269;n&iacute; pohled, bylo by obt&iacute;&#382;n&eacute; vid&#283;t a vybrat n&aacute;&scaron; profil a zjistit kde je z&aacute;kladn&iacute; bod kolem kter&eacute;ho to mus&iacute; rotovat, jasn&eacute;? Potom mus&iacute;me nastavit pracovn&iacute; rovinu ru&#269;n&#283;: Stiskneme tla&#269;&iacute;tko <a href="../cs/Draft_SelectPlane.html" title="Draft SelectPlane/cs">Vybrat rovinu</a> (je to v z&aacute;lo&#382;ce "&uacute;koly" v okn&#283; stromu) a nastav&iacute;me ji na YZ (co&#382; je "bo&#269;n&iacute;" rovina). Kdy&#382; nastav&iacute;te pracovn&iacute; rovinu ru&#269;n&#283;, jako zde, nezm&#283;n&iacute; to z&aacute;vislost na Va&scaron;em pohledu. Nyn&iacute; m&#367;&#382;ete oto&#269;it pohled tak, abyste m&#283;li dobr&yacute; v&yacute;hled na v&scaron;echny v&#283;ci, kter&eacute; mus&iacute;te vybrat. Pro pozd&#283;j&scaron;&iacute; p&#345;epnut&iacute; pracovn&iacute; roviny zp&#283;t "automatick&eacute;ho" m&oacute;du, stiskn&#283;te op&#283;t tla&#269;&iacute;tko <a href="../cs/Draft_SelectPlane.html" title="Draft SelectPlane/cs">Vybrat rovinu</a>  a nastavte ji na "&#381;&aacute;dn&aacute;".
</p><p>Nyn&iacute; bude snadn&eacute; prov&eacute;st oto&#269;en&iacute;: Vyberte profil, stiskn&#283;te tla&#269;&iacute;tko <a href="../cs/Draft_Rotate.html" title="Draft Rotate/cs">Oto&#269;en&iacute;</a>, klikn&#283;te na bod v modr&eacute; p&#345;&iacute;mce, zadejte 0 jako po&#269;&aacute;te&#269;n&iacute; &uacute;hel a 90 jako rotace:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_10.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_10.jpg" decoding="async" width="1024" height="441"></a></span>
</p><p>A v&scaron;e co mus&iacute;me ud&#283;lat te&#271; je posunout profil trochu bl&iacute;&#382;e k modelu (pokud je to pot&#345;eba, nastavte pracovn&iacute; rovinu na XY) a vysunout jej. M&#367;&#382;ete to ud&#283;lat bu&#271; pomoc&iacute; n&aacute;stroje <a href="../cs/Part_Extrude.html" title="Part Extrude/cs">D&iacute;l Vysunout</a> nebo pomoc&iacute; n&aacute;stroje <a href="../cs/Draft_Trimex.html" title="Draft Trimex/cs">Kreslen&iacute; O&#345;&iacute;znout</a>, kter&yacute; m&aacute; tak&eacute; speci&aacute;ln&iacute; skrytou schopnost vysunovat plochy. V&#382;dy se ujist&#283;te, &#382;e vysunut&iacute; je del&scaron;&iacute; ne&#382; v&scaron;echny zdi, kter&eacute; z n&#283;j budou ode&#269;teny abyste se vyhnuli problematick&eacute; face-on-face situaci p&#345;i ode&#269;&iacute;t&aacute;n&iacute;:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_11.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_11.jpg" decoding="async" width="1024" height="462"></a></span>
</p><p>A nyn&iacute; p&#345;&iacute;ch&aacute;z&iacute; na &#345;adu akce opa&#269;n&aacute; k n&aacute;stroji <a href="../cs/Arch_Add.html" title="Arch Add/cs">P&#345;idat</a> a to <a href="../cs/Arch_Remove.html" title="Arch Remove/cs">Odebrat</a>. Jak asi uhodnete, tak&eacute; to vytv&aacute;&#345;&iacute; objekt jako d&iacute;t&#283; jin&eacute;ho, ale jeho tvar je  ode&#269;ten z hostitelsk&eacute;ho objektu m&iacute;sto jejich sjednocen&iacute;. Tak&#382;e je to jednoduch&eacute;: Vyberte objem k ode&#269;ten&iacute; (pojmenoval jsem jej jako "Roof volume to subtract" (Objem st&#345;echy k odebr&aacute;n&iacute;) v okn&#283; stromu, tak&#382;e ho snadno najdete), CTRL + v&yacute;b&#283;r zdi, a stisknout tla&#269;&iacute;tko <a href="../cs/Arch_Remove.html" title="Arch Remove/cs">Odebrat</a>. Tohle uvid&iacute;te po odebr&aacute;n&iacute;, objem pro odebr&aacute;n&iacute; zmizel ze 3D pohledu i z okna stromu. Je to proto, &#382;e byl ozna&#269;en jako d&iacute;t&#283; zdi a "spolknut" zd&iacute;. Vyberte ze&#271;, rozbalte ji v okn&#283; stromu a m&aacute;te tady V&aacute;&scaron; objem.
</p><p>Nyn&iacute; vyberte ten objem v okn&#283; stromu, CTRL + v&yacute;b&#283;r dal&scaron;&iacute; zdi a stiskn&#283;te <a href="../cs/Arch_Remove.html" title="Arch Remove/cs">Odebrat</a>. Opakujte pro v&scaron;echny zdi a&#382; budou v&scaron;echny p&#345;&iacute;slu&scaron;n&#283; zkr&aacute;ceny:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_12.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_12.jpg" decoding="async" width="1024" height="370"></a></span>
</p><p>Pamatujte si, &#382;e pro oba n&aacute;stroje <a href="../cs/Arch_Add.html" title="Arch Add/cs">P&#345;idat</a> i <a href="../cs/Arch_Remove.html" title="Arch Remove/cs">Odebrat</a>, je d&#367;le&#382;it&eacute; po&#345;ad&iacute; ve kter&eacute;m se objekty vyb&iacute;raj&iacute;. Hostuj&iacute;c&iacute; objekt je v&#382;dy jako posledn&iacute;, jako "Odebrat X z Y" nebo "P&#345;idat X k Y"
</p>
<div class="note"><b>Pozn&aacute;mka k p&#345;id&aacute;v&aacute;n&iacute; a odeb&iacute;r&aacute;n&iacute;</b>
<p>Architektonick&eacute; objekty kter&eacute; podporuj&iacute; takov&eacute;to p&#345;id&aacute;v&aacute;n&iacute; a odeb&iacute;r&aacute;n&iacute; (v&scaron;echny krom&#283; pomocn&yacute;ch "visual" objekt&#367; jako jsou osy) sleduj&iacute; takov&eacute; objekty pomoc&iacute; dvou vlastnost&iacute; , resp. "P&#345;&iacute;davky" a "Odb&#283;ry", kter&eacute; obsahuj&iacute; seznam odkaz&#367; na jin&eacute; objekty, kter&eacute; jsou odebr&aacute;ny nebo p&#345;id&aacute;ny.N&#283;jak&yacute; objekt m&#367;&#382;e b&yacute;t na seznamech n&#283;kter&yacute;ch jin&yacute;ch objekt&#367;, stejn&#283; jako n&aacute;&scaron; odeb&iacute;ran&yacute; objem zde. Ka&#382;d&yacute; z "otc&#367;" jej bude cht&iacute;t hodit do sebe v okn&#283; stromu, nicm&eacute;n&#283; oby&#269;ejn&#283; z&#367;stane v posledn&iacute;m objektu. Ale v&#382;dy m&#367;&#382;ete tento seznam pro ka&#382;d&yacute; objekt upravit, dvojklikem v okn&#283; stromu, co&#382; ve FreeCADu znamen&aacute;, &#382;e se p&#345;ech&aacute;z&iacute; do edita&#269;n&iacute;ho m&oacute;du. Edita&#269;n&iacute; m&oacute;d ukon&#269;&iacute;te stisknut&iacute;m kl&aacute;vesy ESC.
</p>
</div>
<p><br>
<span id="Making_the_roofs"></span>
</p>
<h2><span id="Vytvo.C5.99en.C3.AD_st.C5.99ech"></span><span class="mw-headline" id="Vytvo&#345;en&iacute;_st&#345;ech">Vytvo&#345;en&iacute; st&#345;ech</span></h2>
<p>Nyn&iacute; co n&aacute;m zb&yacute;v&aacute; k dokompletov&aacute;n&iacute; struktur je vytvo&#345;en&iacute; st&#345;ech a men&scaron;&iacute;ch vnit&#345;n&iacute;ch desek. Op&#283;t nejjednodu&scaron;&scaron;&iacute; cestou je nakreslit jejich profil nad &#345;ezem pomoc&iacute; n&aacute;stroje <a href="../cs/Draft_Wire.html" title="Draft Wire/cs">Dr&aacute;t</a>. Tady jsem nakreslil 3 profily jeden nad druh&yacute;m (odsunul jsem je od sebe, v pohledu dole to m&#367;&#382;eme vid&#283;t l&eacute;pe). Zelen&yacute; bude pou&#382;it pro pozd&#283;j&scaron;&iacute; ohrani&#269;en&iacute; desky st&#345;echy, potom modr&yacute; pro bo&#269;n&iacute; &#269;&aacute;sti a &#269;erven&yacute; pro st&#345;edn&iacute; &#269;&aacute;st, kter&eacute; je nad blokem koupelny:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_13.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_13.jpg" decoding="async" width="1024" height="325"></a></span>
</p><p>Pak mus&iacute;me opakovat operaci oto&#269;en&iacute; jako naho&#345;e, oto&#269;it objekty ve svisl&eacute; pozici, potom jejich posunut&iacute; na jejich spr&aacute;vn&eacute; um&iacute;st&#283;n&iacute; a zkop&iacute;rov&aacute;n&iacute; n&#283;kter&yacute;ch z nich, kter&eacute; budou vysunuty dvakr&aacute;t pomoc&iacute; n&aacute;stroje <a href="../cs/Draft_Move.html" title="Draft Move/cs">Posun</a>, a to stisknut&iacute;m kl&aacute;vesy ALT, co&#382; vytvo&#345;&iacute; kopie m&iacute;sto pouh&eacute;ho p&#345;esunut&iacute; aktu&aacute;ln&iacute;ho objektu. Tak&eacute; jsem p&#345;idal dal&scaron;&iacute; dva profily pro bo&#269;n&iacute; zdi otvor&#367;  koupelny.
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_14.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_14.jpg" decoding="async" width="1024" height="466"></a></span>
</p><p>Kdy&#382; je v&scaron;echno na m&iacute;st&#283;, je to u&#382; jen v&#283;c&iacute; pou&#382;it&iacute; n&aacute;stroje <a href="../cs/Draft_Trimex.html" title="Draft Trimex/cs">O&#345;&iacute;znut&iacute;</a> na vysunut&iacute; a potom je zkonvertovat od objekt&#367; <a href="../cs/Arch_Structure.html" title="Arch Structure/cs">Architektura Struktura</a>. 
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_15.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_15.jpg" decoding="async" width="1024" height="412"></a></span>
</p><p>Pak vid&iacute;me, &#382;e vyvstaly dal&scaron;&iacute; probl&eacute;my: dva ze sloup&#367; vpravo jsou p&#345;&iacute;li&scaron; kr&aacute;tk&eacute; (m&#283;ly dosahovat a&#382; ke st&#345;e&scaron;e) a taky je mezera mezi deskou a zd&iacute; studia vpravo vzadu (symbol &uacute;rovn&#283; 2.6 na &#345;ezu byl z&#345;ejm&#283; &scaron;patn&#283;). D&iacute;ky parametrick&yacute;m objekt&#367;m nen&iacute; probl&eacute;m to vy&#345;e&scaron;it: Pro sloupy jenom zm&#283;n&iacute;me jejich v&yacute;&scaron;ku 6m, vyberte objekt odebr&aacute;n&iacute; st&#345;ech z okna stromu a odeberte jej ze sloup&#367;. Pro zdi je to je&scaron;t&#283; jednodu&scaron;&scaron;&iacute;: posu&#328;te je trochu dolu. Proto&#382;e odeb&iacute;rac&iacute; objem z&#367;st&aacute;v&aacute; st&aacute;le na sv&eacute;m m&iacute;st&#283;, konstrukce zdi se p&#345;izp&#367;sob&iacute; automaticky.
</p><p>A je&scaron;t&#283; mus&iacute; b&yacute;t opravena jedna v&#283;c, v koupeln&#283; je mal&aacute; betonov&aacute; deska, kter&aacute; prot&iacute;n&aacute; n&#283;kter&eacute; zdi. Opravme to vytvo&#345;en&iacute;m nov&eacute;ho odeb&iacute;rac&iacute;ho objemu a odeberme jej z t&#283;chto zd&iacute;. Dal&scaron;&iacute; vlastnost&iacute; n&aacute;stroje <a href="../cs/Draft_Trimex.html" title="Draft Trimex/cs">O&#345;&iacute;znut&iacute;</a>, kter&yacute; pou&#382;&iacute;v&aacute;me k vysunut&iacute; hmoty, je to, &#382;e tak&eacute; m&#367;&#382;e vysunout jednu plochu existuj&iacute;c&iacute;ho objektu. To vytvo&#345;&iacute; nov&yacute; samostatn&yacute; objekt, tak&#382;e neriskujete "po&scaron;kozen&iacute;" jin&eacute;ho objektu. Tak&#382;e m&#367;&#382;eme vybrat z&aacute;kladovou plochu z mal&eacute; betonov&eacute; desky (pod&iacute;vejte se na n&iacute; zespodu modelu), potom stiskn&#283;te tla&#269;&iacute;tko <a href="../cs/Draft_Trimex.html" title="Draft Trimex/cs">O&#345;&iacute;znut&iacute;</a> a vysu&#328;te ji a&#382; ke st&#345;e&scaron;e. Pak ji odeberte z obou vnit&#345;n&iacute;ch zd&iacute; koupelny pomoc&iacute; n&aacute;stroje <a href="../cs/Arch_Remove.html" title="Arch Remove/cs">Odebrat</a>:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_16.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_16.jpg" decoding="async" width="1024" height="457"></a></span>
</p><p><span id="Floors,_stairs_and_chimney"></span>
</p>
<h2><span id="Podlahy.2C_schodi.C5.A1t.C4.9B_a_kom.C3.ADn"></span><span class="mw-headline" id="Podlahy,_schodi&scaron;t&#283;_a_kom&iacute;n">Podlahy, schodi&scaron;t&#283; a kom&iacute;n</span></h2>
<p>Te&#271; je na&scaron;e struktura kompletn&iacute; a zb&yacute;v&aacute; u&#382; jen dod&#283;lat p&aacute;r m&#283;n&scaron;&iacute;ch objekt&#367;. 
</p><p><span id="The_chimney"></span>
</p>
<h3><span id="Kom.C3.ADn"></span><span class="mw-headline" id="Kom&iacute;n">Kom&iacute;n</span></h3>
<p>Pus&#357;me se do kom&iacute;na. Nyn&iacute; u&#382; v&iacute;te jak to funguje? Nakreslete p&aacute;r uzav&#345;en&yacute;ch <a href="../cs/Draft_Wire.html" title="Draft Wire/cs">dr&aacute;t&#367;</a>, posu&#328;te je nahoru do jejich spr&aacute;vn&eacute; v&yacute;&scaron;ky n&aacute;strojem <a href="../cs/Draft_Move.html" title="Draft Move/cs">Posun</a>, vysu&#328;te je n&aacute;strojem <a href="../cs/Draft_Trimex.html" title="Draft Trimex/cs">O&#345;&iacute;znout</a>, zm&#283;&#328;te ten v&#283;t&scaron;&iacute; na <a href="../cs/Arch_Structure.html" title="Arch Structure/cs">strukturu</a>, a ode&#269;t&#283;te ten men&scaron;&iacute;. V&scaron;imn&#283;te si, &#382;e kom&iacute;nov&yacute; pr&#367;duch nebyl na pl&aacute;nu zakreslen, ale na&scaron;el jsem jeho pozici p&#345;eta&#382;en&iacute;m modr&yacute;ch &#269;ar z pohledu &#345;ezu.
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_17.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_17.jpg" decoding="async" width="1024" height="466"></a></span>
</p><p><span id="The_floors"></span>
</p>
<h3><span class="mw-headline" id="Podlahy">Podlahy</span></h3>
<p>Podlahy nejsou v z&aacute;kladn&iacute;m v&yacute;kresu p&#345;&iacute;li&scaron; dob&#345;e zobrazeny. P&#345;i pohledu na &#345;ezy nepozn&aacute;te kde a jak tlust&eacute; jsou podlahov&eacute; desky. Tak budeme p&#345;edpokl&aacute;dat, &#382;e zdi stoj&iacute; na z&aacute;kladech na &uacute;rovni 0.00 a &#382;e stejn&eacute; je to s podlahami tlust&yacute;mi 15 cm, kter&eacute; le&#382;&iacute; p&#345;&iacute;mo na z&aacute;kladov&eacute; desce. Tak&#382;e podlahov&aacute; deska nezasahuje pod zdi, ale je kolem nich. M&#367;&#382;eme je vytvo&#345;it z jedn&eacute; velk&eacute; obd&eacute;ln&iacute;kov&eacute; desky a pak z n&iacute; ode&#269;&iacute;st zdi, ale v&iacute;me, &#382;e ode&#269;&iacute;tac&iacute; operace je dost n&aacute;ro&#269;n&aacute; na prost&#345;edky. Lep&scaron;&iacute; je ud&#283;lat podlahy z men&scaron;&iacute;ch kus&#367;, bude to "levn&#283;j&scaron;&iacute;" na v&yacute;po&#269;etn&iacute; po&#382;adavky a ud&#283;l&aacute;me to tedy rozumn&#283; pokoj po pokoji, bude se to pozd&#283;ji hodit p&#345;i v&yacute;po&#269;tech podlahov&yacute;ch ploch:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_18.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_18.jpg" decoding="async" width="1024" height="351"></a></span>
</p><p>Kdy&#382; jsou nakresleny dr&aacute;ty, jen je p&#345;evedeme do <a href="../cs/Arch_Structure.html" title="Arch Structure/cs">struktur</a>, a d&aacute;me jim v&yacute;&scaron;ku 0.15:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_19.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_19.jpg" decoding="async" width="1024" height="459"></a></span>
</p><p><span id="The_stairs"></span>
</p>
<h3><span id="Schodi.C5.A1t.C4.9B"></span><span class="mw-headline" id="Schodi&scaron;t&#283;">Schodi&scaron;t&#283;</span></h3>
<p>A te&#271; schodi&scaron;t&#283;. Seznamte se s dal&scaron;&iacute;m n&aacute;strojem Architektury <a href="../cs/Arch_Stairs.html" title="Arch Stairs/cs">schodi&scaron;t&#283;m</a>. Tento n&aacute;stroj je zat&iacute;m ve velmi rann&eacute; f&aacute;zi v&yacute;voje, tak&#382;e od n&#283;ho moc neo&#269;ek&aacute;vejte. Ale je u&#382; docela &scaron;ikovn&yacute; pro vytvo&#345;en&iacute; jednoduch&eacute;ho, p&#345;&iacute;m&eacute;ho schodi&scaron;t&#283;. Je d&#367;le&#382;it&eacute; zn&aacute;t jejich koncept, n&aacute;stroj pro schodi&scaron;t&#283; je zam&yacute;&scaron;len pro vybudov&aacute;n&iacute; schodi&scaron;t&#283; z rovn&eacute; podlahy na vr&scaron;ek zdi. Jin&yacute;mi slovy, p&#345;i pohledu shora objekt schodi&scaron;t&#283; zab&iacute;r&aacute; p&#345;esn&#283; stejnou plochu jakou zab&iacute;r&aacute; na p&#367;dorysu, tak&#382;e posledn&iacute; stupe&#328; nen&iacute; zakreslen (ale samoz&#345;ejm&#283; je zapo&#269;ten p&#345;i v&yacute;po&#269;tu v&yacute;&scaron;ky).
</p><p>V tomto p&#345;&iacute;kladu jsem dal p&#345;ednost vytvo&#345;en&iacute; schodi&scaron;t&#283; v &#345;ezu, proto&#382;e budme pot&#345;ebovat mnoho rozm&#283;r&#367;, kter&eacute; se snadn&#283;ji z&iacute;skaj&iacute; z tohoto pohledu. Nakreslil jsem p&aacute;r &#269;erven&yacute;ch vodic&iacute;ch p&#345;&iacute;mek, potom dv&#283; modr&eacute; p&#345;&iacute;mky, kter&eacute; budou z&aacute;kladem dvou &#269;&aacute;st&iacute; schodi&scaron;t&#283; a dva zelen&eacute; uzav&#345;en&eacute; dr&aacute;ty, kter&eacute; vytvo&#345;&iacute; chyb&#283;j&iacute;c&iacute; &#269;&aacute;sti. Nyn&iacute; vybereme prvn&iacute; modrou p&#345;&iacute;mku, stiskneme n&aacute;stroj <a href="../cs/Arch_Stairs.html" title="Arch Stairs/cs">Schodi&scaron;t&#283;</a>, zad&aacute;me po&#269;et stup&#328;&#367; na 5, v&yacute;&scaron;ku na 0.875,&scaron;&iacute;&#345;ku na 1.30, typ struktury na "massive" a tlou&scaron;&#357;ku struktury na 0.12. Opakujte pro dal&scaron;&iacute; &#269;&aacute;st.
</p><p>Pak vysu&#328;te oba zelen&eacute; dr&aacute;ty o 1.30 a oto&#269;te je a posu&#328;te do spr&aacute;vn&eacute; pozice:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_20.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_20.jpg" decoding="async" width="1024" height="483"></a></span>
</p><p>Na bo&#269;n&iacute;m pohledu nakreslete (potom oto&#269;te) okraj:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_21.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_21.jpg" decoding="async" width="1024" height="378"></a></span>
</p><p>Potom v&scaron;echno posu&#328;te na m&iacute;sto:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_22.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_22.jpg" decoding="async" width="1024" height="420"></a></span>
</p><p>Tak&eacute; nezapome&#328;te sn&iacute;&#382;it sloup, kter&yacute; prot&iacute;n&aacute; schodi&scaron;t&#283;, proto&#382;e v BIM je v&#382;dy &scaron;patn&eacute;, kdy&#382; se objekty prot&iacute;naj&iacute;. Pamatujte, &#382;e stav&iacute;me stejn&#283; jako v re&aacute;ln&eacute;m sv&#283;t&#283;, kde se taky pevn&eacute; objekty nemohou prot&iacute;nat. Tady jsem necht&#283;l ode&#269;&iacute;st sloup p&#345;&iacute;mo od schodi&scaron;t&#283; (proto&#382;e jinak by objekt sloupu byl pohlcen objektem schodi&scaron;t&#283; a to se mi nel&iacute;b&iacute;), proto jsem vzal plochu, na kter&eacute; byl sloup postaven a znovu jsem ji vysunul. Toto nov&eacute; vysunut&iacute; pak bylo ode&#269;teno ze schodi&scaron;t&#283;.
</p><p>V&yacute;born&#283;! V&scaron;echna t&#283;&#382;k&aacute; pr&aacute;ce je nyn&iacute; ud&#283;l&aacute;na a nyn&iacute; se dejme do mnohem t&#283;&#382;&scaron;&iacute; pr&aacute;ce!
</p><p><span id="Doors_and_windows"></span>
</p>
<h2><span id="Dve.C5.99e_a_okna"></span><span class="mw-headline" id="Dve&#345;e_a_okna">Dve&#345;e a okna</span></h2>
<p>N&aacute;stroj <a href="../cs/Arch_Window.html" title="Arch Window/cs">Architektura Okno</a> je p&#283;kn&#283; slo&#382;it&aacute; z&aacute;le&#382;itost. Pou&#382;&iacute;v&aacute; se pro vytvo&#345;en&iacute; v&scaron;ech druh&#367; "vlo&#382;en&yacute;ch" objekt&#367; jako jsou okna nebo dve&#345;e. Ano, ve FreeCADu jsou dve&#345;e speci&aacute;ln&iacute;m druhem okna. Ve skute&#269;n&eacute;m &#382;ivot&#283; taky, nemysl&iacute;te? N&aacute;stroj <a href="../cs/Arch_Window.html" title="Arch Window/cs">Architektura Okno</a> m&#367;&#382;e b&yacute;t st&aacute;le je&scaron;t&#283; pon&#283;kud obt&iacute;&#382;n&#283;j&scaron;&iacute; na pou&#382;&iacute;v&aacute;n&iacute; , ale to je za to, &#382;e byl sestaven pro maxim&aacute;ln&iacute; v&yacute;kon. M&#367;&#382;e s n&iacute;m b&yacute;t vytvo&#345;en t&eacute;m&#283;&#345; jak&yacute;koliv druh okna podle va&scaron;ich p&#345;edstav. Ale a&#382; tento n&aacute;stroj bude m&iacute;t v budoucnosti v&iacute;c p&#345;edvoleb, situace bude lep&scaron;&iacute;.
</p>
<div class="mw-translate-fuzzy">
<p>Objekt <a href="../cs/Arch_Window.html" title="Arch Window/cs">Architektura Okno</a> funguje n&aacute;sledovn&#283;: Je zalo&#382;en na 2D pl&aacute;nu (jak&yacute;koliv 2D objekt, ale p&#345;ednost m&aacute; <a href="../cs/Sketcher_Workbench.html" title="Sketcher Workbench/cs">n&aacute;&#269;rt</a>, kter&yacute; obsahuje uzav&#345;en&eacute; dr&aacute;ty (lomen&eacute; &#269;&aacute;ry)). Tyto dr&aacute;ty definuj&iacute; r&#367;zn&eacute; &#269;&aacute;sti okna: vn&#283;j&scaron;&iacute; r&aacute;me&#269;ky, vnit&#345;n&iacute; r&aacute;me&#269;ky, okenn&iacute; panely, pevn&eacute; panely, atd. Objekt okno m&aacute; vlastnosti, kter&eacute; obsahuj&iacute; co d&#283;lat se kter&yacute;m dr&aacute;tem: vysunout je, um&iacute;stit je s ur&#269;it&yacute;m odsunut&iacute;m, atd. Nakonec m&#367;&#382;e b&yacute;t okno vlo&#382;eno do hostitelsk&eacute;ho objektu jako je ze&#271; nebo struktura, do kter&eacute; automaticky vytvo&#345;&iacute; otvor. Otvor bude vypo&#269;ten podle nejv&#283;t&scaron;&iacute;ho dr&aacute;tu nalezen&eacute;ho ve 2D pl&aacute;nu.
</p>
</div>
<p>Ve FreeCADu jsou dva zp&#367;soby jak vytvo&#345;it takov&eacute; objekty: Pou&#382;it&iacute;m p&#345;edvoleb nebo nakreslen&iacute;m pl&aacute;nu okna od za&#269;&aacute;tku. Zde se pod&iacute;v&aacute;me na oba zp&#367;soby. Ale pamatujte, &#382;e metoda s p&#345;edvolbami ned&#283;l&aacute; nic jin&eacute;ho, ne&#382; &#382;e vytvo&#345;&iacute; objekt pl&aacute;nu a definuje pot&#345;ebn&aacute; vysunut&iacute;.
</p><p><span id="Using_presets"></span>
</p>
<h3><span id="Pou.C5.BEit.C3.AD_p.C5.99edvoleb"></span><span class="mw-headline" id="Pou&#382;it&iacute;_p&#345;edvoleb">Pou&#382;it&iacute; p&#345;edvoleb</span></h3>
<p>P&#345;i stisknut&iacute; n&aacute;stroje <a href="../cs/Arch_Window.html" title="Arch Window/cs">Architektura Okno</a> bez vybr&aacute;n&iacute; objektu, jste po&#382;&aacute;d&aacute;ni o zad&aacute;n&iacute; 2D pl&aacute;nu nebo zad&aacute;n&iacute; p&#345;edvoleb. Pou&#382;ijme p&#345;edvolbu "Jednoduch&eacute; dve&#345;e" pro um&iacute;st&#283;n&iacute; hlavn&iacute;ch vchodov&yacute;ch dve&#345;&iacute; na&scaron;eho modelu. Zad&aacute;me &scaron;&iacute;&#345;ku 1m, v&yacute;&scaron;ku 2.45m a rozm&#283;r W1 0.15m, ostatn&iacute; parametry ponechte na 0.05m. Kdy&#382; pak kliknete na lev&yacute; spodn&iacute; roh zdi, vytvo&#345;&iacute; se nov&eacute; dve&#345;e:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_23.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_23.jpg" decoding="async" width="1024" height="425"></a></span>
</p><p>V&scaron;imnete si, &#382;e ty Va&scaron;e nov&eacute; dve&#345;e se nezobraz&iacute; v okn&#283; stromu. Je to kv&#367;li tomu, &#382;e zachycen&iacute;m zdi  jsme ozna&#269;ili ze&#271; jako hostitelsk&yacute; objekt. N&aacute;sledn&#283; byl "pohlcen" zd&iacute;. Ale kliknut&iacute;m pravou my&scaron;&iacute; na ze&#271; &rarr; Jdi na v&yacute;b&#283;r najdete dve&#345;e ve strom&#283;.
</p><p>V tomto p&#345;&iacute;pad&#283;, proto&#382;e na&scaron;e okno nen&iacute; vlo&#382;eno do &#382;&aacute;dn&eacute; zdi (otvor u&#382; tam byl), m&#367;&#382;eme odd&#283;lit okno od hostuj&iacute;c&iacute; zdi. Ud&#283;l&aacute; se to dvojklikem na hostuj&iacute;c&iacute; ze&#271; v pohledu stromu pro p&#345;echod do edita&#269;n&iacute;ho m&oacute;du. Tam uvid&iacute;te okno v jeho "Ode&#269;&iacute;tac&iacute;" skupin&#283;. Jednodu&scaron;e tam vyberte okno, stiskn&#283;te tla&#269;&iacute;tko "odstranit prvek" a potom OK. Na&scaron;e okno bylo odstran&#283;no z hostuj&iacute;c&iacute; zdi a le&#382;&iacute; na konci pohledu stromu.
</p><p>M&aacute;me druh&eacute; dve&#345;e, p&#345;esn&#283; stejn&eacute; jako ty prvn&iacute;, trochu vlevo. M&iacute;sto vytv&aacute;&#345;en&iacute; nov&yacute;ch dve&#345;&iacute; od za&#269;&aacute;tku, m&aacute;me dva zp&#367;soby jak vytvo&#345;it kopii t&#283;ch prvn&iacute;ch: Pou&#382;it&iacute;m n&aacute;stroje <a href="../cs/Draft_Move.html" title="Draft Move/cs">Kreslen&iacute; Posun</a> se sou&#269;asn&#283; stisknutou kl&aacute;vesou ALT, kter&aacute; jak jist&#283; v&iacute;te, objekt kop&iacute;ruje m&iacute;sto p&#345;esunut&iacute;. Nebo, je&scaron;t&#283; l&eacute;pe, m&#367;&#382;eme pou&#382;&iacute;t n&aacute;stroj <a href="../cs/Draft_Clone.html" title="Draft Clone/cs">Kreslen&iacute; Klon</a>. N&aacute;stroj Klon vytv&aacute;&#345;&iacute; "klon" vybran&eacute;ho objektu, se kter&yacute;m m&#367;&#382;ete pohybovat, ale dr&#382;&iacute; si tvar p&#367;vodn&iacute;ho objektu. Kdy&#382; se zm&#283;n&iacute; p&#367;vodn&iacute; objekt, zm&#283;n&iacute; se z&aacute;rove&#328; i klon.
</p><p>Tak&#382;e v&scaron;echno co mus&iacute;me ud&#283;lat je vybrat dve&#345;e, stisknout n&aacute;stroj <a href="../cs/Draft_Clone.html" title="Draft Clone/cs">Kreslen&iacute; Klon</a> a potom p&#345;esunot klon na jeho spr&aacute;vnou pozici pomoc&iacute; n&aacute;stroje <a href="../cs/Draft_Move.html" title="Draft Move/cs">Kreslen&iacute; Posun</a>.
</p><p><span id="Organizing_your_model"></span>
</p>
<h3><span class="mw-headline" id="Organizace_modelu">Organizace modelu</span></h3>
<figure class="mw-halign-left" typeof="mw:File"><a href="../File/Arch_tutorial_24.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_24.jpg" decoding="async" width="400" height="417"></a><figcaption></figcaption></figure>
<p>Nyn&iacute; je vhodn&yacute; &#269;as ud&#283;lat malou o&#269;istu domu. Proto&#382;e u&#382; m&aacute;me dv&#283; okna, je vhodn&yacute; &#269;as pro pro&#269;i&scaron;t&#283;n&iacute; okna stromu: Vytvo&#345;te novou <a href="../index.php?title=Std_Group/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Std Group/cs (page does not exist)">skupinu</a>, p&#345;ejmenujte ji na "Windows" a p&#345;esu&#328;te do n&iacute; ob&#283; okna. Doporu&#269;uji V&aacute;m tak&eacute; dal&scaron;&iacute; prvky odd&#283;lit t&iacute;mto zp&#367;sobem, jako jsou zdi a struktury. Proto&#382;e m&#367;&#382;ete vytvo&#345;it i skupiny uvnit&#345; <a href="../index.php?title=Std_Group/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Std Group/cs (page does not exist)">skupin</a>, m&#367;&#382;ete organizovat d&aacute;le, nap&#345;&iacute;klad um&iacute;st&#283;n&iacute; v&scaron;ech prvk&#367;, kter&eacute; vytv&aacute;&#345;ej&iacute; st&#345;echu  do samostatn&eacute; skupiny, tak&#382;e bude snadn&eacute; ji zapnout nebo vypnout (p&#345;ep&iacute;n&aacute;n&iacute; viditelnosti skupin plat&iacute; i pro v&scaron;echny objekty uvnit&#345; nich).
</p>
<div class="mw-translate-fuzzy">
<p><a href="../cs/Arch_Workbench.html" title="Arch Workbench/cs">Pracovn&iacute; plocha Architektura</a> m&aacute; n&#283;kolik p&#345;idan&yacute;ch n&aacute;stroj&#367; pro organizaci modelu: <a href="../cs/Arch_Site.html" title="Arch Site/cs">Staveni&scaron;t&#283;</a>, <a href="../cs/Arch_Building.html" title="Arch Building/cs">Budova</a> a <a href="../cs/Arch_Floor.html" title="Arch Floor/cs">Podla&#382;&iacute;</a>. Tyto 3 objekty jsou zalo&#382;eny na standardn&iacute;ch skupin&aacute;ch FreeCADu, tak&#382;e se chovaj&iacute; p&#345;esn&#283; stejn&#283; jako skupiny, ale maj&iacute; n&#283;kolik vlastnost&iacute; nav&iacute;c. Nap&#345;&iacute;klad, <a href="../cs/Arch_Floor.html" title="Arch Floor/cs">podla&#382;&iacute;</a> m&aacute; schopnost nastavit a &#345;&iacute;dit v&yacute;&scaron;ku obsa&#382;en&yacute;ch zd&iacute; a struktur, a kdy&#382; jsou p&#345;esunuty, cel&yacute; jejich obsah je p&#345;esunut tak&eacute;.
</p>
</div>
<p>Ale zde, proto&#382;e m&aacute;me pouze jednu budovu s pouze jedn&iacute;m (a p&#367;l) podla&#382;&iacute;m, nen&iacute; ve skute&#269;nosti pot&#345;eba pou&#382;&iacute;vat takov&eacute; objekty, tak&#382;e vysta&#269;&iacute;me jen s jednoduch&yacute;mi skupinami.
</p>
<div style="clear:both"></div>
<p>Vra&#357;me se zp&#283;t k pr&aacute;ci. Vypn&#283;te skupinu st&#345;echy, tak budme l&eacute;pe vid&#283;t dovnit&#345; a p&#345;epn&#283;te Zobrazovac&iacute; m&oacute;d objekt&#367; podla&#382;&iacute; na Dr&aacute;tov&yacute; model (nebo pou&#382;ijte n&aacute;stroj <a href="../cs/Draft_ToggleDisplayMode.html" title="Draft ToggleDisplayMode/cs">Kreslen&iacute; P&#345;epnout zobrazovac&iacute; m&oacute;d</a>) tak&#382;e je m&#367;&#382;eme zachycovat, ale m&#367;&#382;eme vid&#283;t p&#367;dorys i zespodu. Ale m&#367;&#382;eme tak&eacute; vypnout podlahy kompletn&#283;, potom um&iacute;stit dve&#345;e na &uacute;rove&#328; 0, potom je zvednout o 15cm pomoc&iacute; n&aacute;stroje <a href="../cs/Draft_Move.html" title="Draft Move/cs">Kreslen&iacute; Posun</a>.
</p>
<div class="mw-translate-fuzzy">
<p>Te&#271; um&iacute;st&iacute;me vnit&#345;n&iacute; dve&#345;e. Op&#283;t pou&#382;ijte p&#345;edvolbu "Jednoduch&eacute; dve&#345;e" a vytvo&#345;te dve&#345;e &scaron;irok&eacute; 1.00m a 0.70m a vysok&eacute; 2.1 s rozm&#283;rem W1 0.1m. Ujist&#283;te se, &#382;e zachyt&iacute;te spr&aacute;vnou ze&#271; a&#382; je budete umis&#357;ovat a ony vytvo&#345;&iacute; automaticky otvor v t&eacute; zdi. Jestli&#382;e je obt&iacute;&#382;n&eacute; um&iacute;stit je spr&aacute;vn&#283;, m&#367;&#382;ete je um&iacute;stit na snadn&#283;j&scaron;&iacute; m&iacute;sto (nap&#345;&iacute;klad na roh zdi) a potom je posunout. Otvor se posune s nimi.
</p>
</div>
<p>Pokud omylem vlo&#382;&iacute;te okno do &scaron;patn&eacute; zdi, je snadn&eacute; to napravit: Odstra&#328;te okno se skupiny "Substraction (Odebran&eacute;)" u hostuj&iacute;c&iacute; zdi v edita&#269;n&iacute;m m&oacute;du, jak jsme vid&#283;li v&yacute;&scaron;e a potom je vlo&#382;te do skupiny "Substraction (Odebran&eacute;)" u spr&aacute;vn&eacute; zdi stejnym zp&#367;sobem nebo jednodu&scaron;e pou&#382;it&iacute;m n&aacute;stroje <a href="../cs/Arch_Remove.html" title="Arch Remove/cs">Architektura Odebrat</a>.
</p><p>O trochu pr&aacute;ce pozd&#283;ji, v&scaron;echny dve&#345;e jsou na m&iacute;st&#283;:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_25.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_25.jpg" decoding="async" width="1024" height="573"></a></span>
</p><p>P&#345;i bli&#382;&scaron;&iacute;m pohledu na bokorys, najdeme dal&scaron;&iacute; chybu: Vrchol cihlov&eacute; zdi nen&iacute; na 2.60m, ale o 17.5cm n&iacute;&#382;e, tj. 2.425cm. Na&scaron;t&#283;st&iacute; okna zalo&#382;en&aacute; na p&#345;edvolb&aacute;ch maj&iacute; v&yacute;hodu: M&#367;&#382;ete zm&#283;nit jejich hlavn&iacute; rozm&#283;ry (&scaron;&iacute;&#345;ku a v&yacute;&scaron;ku) v jejich vlastnostech. Tak&#382;e zm&#283;&#328;me jejich v&yacute;&scaron;ku na 2.425-0.15, tj. na 2.275. Druh&eacute; okno, proto&#382;e je to klon prvn&iacute;ho okna, je p&#345;evezme tak&eacute;. To je to z&aacute;sadn&iacute; v &#269;em se projev&iacute; kouzlo parametrick&eacute;ho n&aacute;vrhu.
</p><p>A te&#271; je pod&iacute;vejme na opravdu zaj&iacute;mavou v&#283;c: Jak navrhnout na&scaron;e vlastn&iacute; u&#382;ivatelsk&eacute; okno.
</p><p><span id="Creating_custom_windows"></span>
</p>
<h3><span id="Vytv.C3.A1.C5.99en.C3.AD_u.C5.BEivatelsk.C3.BDch_oken"></span><span class="mw-headline" id="Vytv&aacute;&#345;en&iacute;_u&#382;ivatelsk&yacute;ch_oken">Vytv&aacute;&#345;en&iacute; u&#382;ivatelsk&yacute;ch oken</span></h3>
<div class="mw-translate-fuzzy">
<p>Jak jsem vysv&#283;tlil v&yacute;&scaron;e, objekty  <a href="../cs/Arch_Window.html" title="Arch Window/cs">Architektura Okno</a> se vytv&aacute;&#345;ej&iacute; z 2D pl&aacute;n&#367;, sestaven&yacute;ch z uzav&#345;en&yacute;ch prvk&#367; (dr&aacute;ty (lomen&eacute; &#269;&aacute;ry), kru&#382;nice, obd&eacute;ln&iacute;ky, cokoliv). Objekty <a href="../cs/Draft_Workbench.html" title="Draft Workbench/cs">Kreslen&iacute;</a> nemohou dr&#382;et v&iacute;ce ne&#382; jeden z t&#283;chto prvk&#367;, doporu&#269;ovan&yacute; n&aacute;stroj pro kreslen&iacute; pl&aacute;n&#367; oken je <a href="../cs/Sketcher_Workbench.html" title="Sketcher Workbench/cs">Skic&aacute;&#345;</a>. Bohu&#382;el, u skic&aacute;&#345;e nen&iacute; mo&#382;n&eacute; zachytit vn&#283;j&scaron;&iacute; objekt jako u pracovn&iacute; plochy Kreslen&iacute;, co&#382; by zde bylo u&#382;ite&#269;n&eacute;, proto&#382;e na&scaron;e n&aacute;rysy u&#382; jsou nakresleny. Na&scaron;t&#283;st&iacute; existuje n&aacute;stroj pro konverzi objekt&#367; Kreslen&iacute; do n&aacute;&#269;rt&#367;: N&aacute;stroj <a href="../cs/Draft_Draft2Sketch.html" title="Draft Draft2Sketch/cs">Kreslen&iacute; do N&aacute;&#269;rtu</a>.
</p>
</div>
<p>Za&#269;n&#283;me tedy s kreslen&iacute;m na&scaron;eho prvn&iacute;ho pl&aacute;nu okna. nakreslil jsem jej v n&aacute;rysu, pou&#382;it&iacute;m n&#283;kolika <a href="../cs/Draft_Rectangle.html" title="Draft Rectangle/cs">obd&eacute;ln&iacute;k&#367;</a>: Jeden z nich pro vn&#283;j&scaron;&iacute; linky, a 4 pro vnit&#345;n&iacute; linky. Zastavil jsem se p&#345;ede dve&#345;mi, proto&#382;e, p&#345;ipom&iacute;n&aacute;m, na&scaron;e dve&#345;e u&#382; r&aacute;m maj&iacute;:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_26.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_26.jpg" decoding="async" width="1024" height="343"></a></span>
</p><p>Potom vyberte v&scaron;echny obd&eacute;ln&iacute;ky a stiskn&#283;te tla&#269;&iacute;tko  <a href="../cs/Draft_Draft2Sketch.html" title="Draft Draft2Sketch/cs">Kreslen&iacute; do N&aacute;&#269;rtu</a> (a sma&#382;te obd&eacute;ln&iacute;ky, proto&#382;e tento n&aacute;stroj nema&#382;e p&#367;vodn&iacute; objekty, pro p&#345;&iacute;pad, &#382;e n&#283;co nedopadlo dob&#345;e). Potom s vybran&yacute;mi nov&yacute;mi n&aacute;&#269;rty, stiskn&#283;te n&aacute;stroj <a href="../cs/Arch_Window.html" title="Arch Window/cs">Architektura Okno</a>.
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_27.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_27.jpg" decoding="async" width="1024" height="380"></a></span>
</p><p>N&aacute;stroj detekuje, &#382;e pl&aacute;n m&aacute; jeden vn&#283;j&scaron;&iacute; dr&aacute;t a n&#283;kolik vnit&#345;n&iacute;ch dr&aacute;t&#367; a automaticky navrhne deafultn&iacute; konfiguraci: Jeden r&aacute;m vytvo&#345;en&yacute; ode&#269;ten&iacute;m vnit&#345;n&iacute;ch r&aacute;m&#367; od vn&#283;j&scaron;&iacute;ho, vysunut&yacute; o 1m. Zm&#283;&#328;me to p&#345;echodem do edita&#269;n&iacute;ho m&oacute;du okna dvojklikem na n&#283; v okn&#283; stromu:
</p><p>Uvid&iacute;te "Defaultn&iacute;" komponentu, kter&aacute; byla vytvo&#345;ena automaticky n&aacute;strojem Okno, kter&eacute; pou&#382;&iacute;v&aacute; 5 dr&aacute;t&#367; (v&#382;dy ode&#269;&iacute;t&aacute; ostatn&iacute; z nejv&#283;t&scaron;&iacute;ho)  a je vysunuto o 1. Zmn&#283;&#328;me hodnotu vysunut&iacute; na 0.1 , aby odpov&iacute;dalo tomu, jak&eacute; jsme pou&#382;ili u dve&#345;&iacute;.
</p><p>Potom p&#345;id&aacute;me 4 nov&eacute; sklen&#283;n&eacute; panely, ka&#382;d&yacute; z nich vyu&#382;ije jeden dr&aacute;t a d&aacute;me jim vysunut&iacute; 0.01 a odsun 0.05, tak&#382;e jsou um&iacute;st&#283;ny ve st&#345;edu r&aacute;mu. Takto bude Va&scaron;e okno vypadat, kdy&#382; dokon&#269;&iacute;te &uacute;pravy:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_28.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_28.jpg" decoding="async" width="1024" height="496"></a></span>
</p><p>P&#345;edpokl&aacute;d&aacute;m, &#382;e nyn&iacute; u&#382; byste m&#283;li rozum&#283;t s&iacute;le tohoto syst&eacute;mu: Je mo&#382;n&aacute; jak&aacute;koliv kombinace r&aacute;m&#367; a panel&#367;. Jestli je um&iacute;te kreslit ve 2D, pak mohou existovat jako zcela platn&eacute; 3D objekty.
</p><p>A te&#271; nakresleme ostatn&iacute; &#269;&aacute;sti, potom je p&#345;esuneme na jejich m&iacute;sto sou&#269;asn&#283;. Ale nejd&#345;&iacute;ve mus&iacute;me ud&#283;lat n&#283;jak&eacute; &uacute;pravy v z&aacute;kladn&iacute;m 2D v&yacute;kresu, proto&#382;e n&#283;kter&eacute; linky z&#345;ejm&#283; &uacute;pln&#283; chyb&iacute; - tam kde se okna dot&yacute;kaj&iacute; se chodi&scaron;t&#283;m. Opravit to m&#367;&#382;eme odsunut&iacute;m p&#345;&iacute;mky schodi&scaron;t&#283; o 2.5cm pomoc&iacute; n&aacute;stroje <a href="../cs/Draft_Offset.html" title="Draft Offset/cs">Kreslen&iacute; Odsunout</a> (samoz&#345;ejm&#283; se stisknutou kl&aacute;vesou ALT pro kop&iacute;rov&aacute;n&iacute; m&iacute;sto p&#345;esunut&iacute;). Nyn&iacute; m&#367;&#382;eme nakreslit n&aacute;&scaron; pl&aacute;n pomoc&iacute; <a href="../cs/Draft_Wire.html" title="Draft Wire/cs">dr&aacute;t&#367;</a>, potom je konvertovat do n&aacute;&#269;rtu a potom z nich vytvo&#345;it okno.
</p><p>A&#382; to n&#283;kolikr&aacute;t zopakujeme (j&aacute; jsem ud&#283;lal 4 samostatn&eacute; kousky, ale z&aacute;le&#382;&iacute; na V&aacute;s jak se rozhodnete), m&aacute;me fas&aacute;du kompletn&iacute;:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_29.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_29.jpg" decoding="async" width="1024" height="302"></a></span>
</p><p>Nyn&iacute;, stejn&#283; jako p&#345;edt&iacute;m, je to u&#382; jen v&#283;c&iacute; oto&#269;en&iacute; &#269;&aacute;st&iacute; a jejich posunut&iacute;m na spr&aacute;vnou pozici:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_30.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_30.jpg" decoding="async" width="1024" height="412"></a></span>
</p><p>Posledn&iacute; chyb&#283;j&iacute;c&iacute; &#269;&aacute;st je segment zdi, kter&yacute; nen&iacute; vid&#283;t na p&#367;dorysu a kter&yacute; mus&iacute;me p&#345;idat. M&aacute;me n&#283;kolik mo&#382;nost&iacute;, jak to ud&#283;lat, j&aacute; jsem si vybral nakreslit p&#345;&iacute;mku na pl&aacute;nu z&aacute;klad&#367;, potom ji p&#345;esunout na spr&aacute;vnou v&yacute;&scaron;ku a pak z n&iacute; vytvo&#345;it ze&#271;. Potom tak&eacute; mus&iacute;me vyt&aacute;hnout objem pro ode&#269;&iacute;t&aacute;n&iacute; st&#345;echy (mus&iacute; z&#367;stat v posledn&iacute;m sloupci) a potom jej ode&#269;&iacute;st. Nyn&iacute; je hotova tato strana budovy:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_31.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_31.jpg" decoding="async" width="1024" height="455"></a></span>
</p><p>Hotovo? Zat&iacute;m ne. Pod&iacute;vejte se na obr&aacute;zek naho&#345;e, na&scaron;e dve&#345;e jsme ud&#283;lali s 5cm r&aacute;me&#269;kem, vzpom&iacute;n&aacute;te (to bylo defaultn&iacute; v p&#345;edvolb&#283;). Ale ostatn&iacute; okna maj&iacute; r&aacute;me&#269;ky 2.5cm. To tak&eacute; mus&iacute; b&yacute;t opraveno.
</p><p><span id="Editing_windows"></span>
</p>
<h3><span id=".C3.9Apravy_oken"></span><span class="mw-headline" id="&Uacute;pravy_oken">&Uacute;pravy oken</span></h3>
<p>U&#382; jsme si uk&aacute;zali jak vytv&aacute;&#345;et a upravovat komponenty oken, pomoc&iacute; edita&#269;n&iacute;ho m&oacute;du oken, ale m&#367;&#382;eme i editovat podkladov&yacute; n&aacute;&#269;rt. P&#345;edvolby oken se neli&scaron;&iacute; od u&#382;ivatelsk&yacute;ch oken, n&aacute;stroj <a href="../cs/Arch_Window.html" title="Arch Window/cs">Okno</a> pouze vytv&aacute;&#345;&iacute; podkladov&yacute; n&aacute;&#269;rt. Vyberte n&aacute;&scaron; objekt dve&#345;&iacute;  (p&#367;vodn&iacute;, ne kopii, pamatujte, &#382;e je to klon) a rozbalte jej v okn&#283; stromu. Tam je n&aacute;&scaron; n&aacute;&#269;rt. Dvojklikn&#283;te na n&#283;j a p&#345;ejdete do edita&#269;n&iacute;ho m&oacute;du.
</p>
<div class="mw-translate-fuzzy">
<p><a href="../cs/Sketcher_Workbench.html" title="Sketcher Workbench/cs">Pracovn&iacute; plocha Skic&aacute;&#345;</a> je extr&eacute;m&#283; v&yacute;konn&yacute; n&aacute;stroj. Nem&aacute; n&#283;kter&eacute; z v&yacute;hod <a href="../cs/Draft_Workbench.html" title="Draft Workbench/cs">pracovn&iacute; plochy Kreslen&iacute;</a>, jako jsou t&#345;eba zachycov&aacute;n&iacute; a pracovn&iacute; roviny, ale m&aacute; zase mnoho jin&yacute;ch v&yacute;hod. Ve FreeCADu budete &#269;asto pou&#382;&iacute;vat jednu nebo druhou podle pot&#345;eby. Nejd&#367;le&#382;it&#283;j&scaron;&iacute; vlastnost&iacute; skic&aacute;&#345;e jsou vazby. Vazby umo&#382;&#328;uj&iacute; automaticky vz&aacute;jemn&#283; fixovat pozice n&#283;kter&yacute;ch element&#367;. Nap&#345;&iacute;klad m&#367;&#382;ete nastavit, &#382;e segment bude v&#382;dy svisl&yacute; nebo bude v&#382;dy v dan&eacute; vzd&aacute;lenosti od jin&eacute;ho.
</p>
</div>
<p>Kdy&#382; upravujeme n&aacute;&#269;rt na&scaron;ich dve&#345;&iacute;, vid&iacute;me, &#382;e je proveden na pln&#283; vazben&eacute;m n&aacute;&#269;rtu:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_32.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_32.jpg" decoding="async" width="1024" height="493"></a></span>
</p><p>V&scaron;echno co te&#271; mus&iacute;me ud&#283;lat je upravit vzd&aacute;lenost 5cm mezi vn&#283;j&scaron;&iacute; a vnit&#345;n&iacute; linkou dvojklikem na n&#283; a zm&#283;nou jejich hodnoty na 2.5cm (Pamatujte, &#382;e jednotky st&aacute;le je&scaron;t&#283; nejsou pln&#283; funk&#269;n&iacute; v dob&#283;, kdy to p&iacute;&scaron;u). Po kliknut&iacute; na tla&#269;&iacute;tko "OK", jsou dve&#345;e (a jejich klon) aktualizov&aacute;ny.
</p><p><span id="Working_without_2D_support"></span>
</p>
<h2><span id="Pr.C3.A1ce_bez_2D_podpory"></span><span class="mw-headline" id="Pr&aacute;ce_bez_2D_podpory">Pr&aacute;ce bez 2D podpory</span></h2>
<p>Na&scaron;e pr&aacute;ce byla a&#382; dote&#271; relativn&#283; snadn&aacute;, proto&#382;e jsme m&#283;li podkladov&yacute; 2D v&yacute;kres jako z&aacute;klad, nad kter&yacute;m jsme pracovali. Ale te&#271; mus&iacute;me ud&#283;lat prot&#283;j&scaron;&iacute; pr&#367;&#269;el&iacute; a sklen&#283;n&eacute; atrium  a v&#283;ci se za&#269;&iacute;naj&iacute; komplikovat: V&yacute;kres prot&#283;j&scaron;&iacute;ho pr&#367;&#269;el&iacute; m&aacute; spoustu chyb, nep&#345;edstavuje atrium cel&eacute; a jednodu&scaron;e tak&eacute; nem&aacute;me v&yacute;kres vnit&#345;n&iacute;h zd&iacute; atria. Proto si mus&iacute;me p&aacute;r v&#283;c&iacute; vymyslet sami. Ur&#269;it&#283; se pod&iacute;vejte na <a rel="nofollow" class="external text" href="http://www.pedrokok.com.br/2010/02/residencia-artigas-sao-paulo-sp/img_8265-533px/">odkazovan&eacute; obr&aacute;zky</a> pro p&#345;edstavu jak je to ud&#283;l&aacute;no. A nebo si to ud&#283;lejte podle sebe!
</p><p>Je jedna v&#283;c, kterou u&#382; m&#367;&#382;eme ud&#283;lat: zduplikovat komplikovan&eacute; okno na schodech n&aacute;strojem <a href="../cs/Draft_Move.html" title="Draft Move/cs">Posun</a>, proto&#382;e to je stejn&eacute; na obou stran&aacute;ch:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_33.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_33.jpg" decoding="async" width="1024" height="462"></a></span>
</p><p>Tady p&#345;ipom&iacute;n&aacute;m, &#382;e j&aacute; d&aacute;v&aacute;m p&#345;ednost duplikov&aacute;n&iacute; pomoc&iacute; n&aacute;stroje <a href="../cs/Draft_Move.html" title="Draft Move/cs">Posunp</a>&#345;ed pou&#382;it&iacute;m <a href="../cs/Draft_Clone.html" title="Draft Clone/cs">klonov&aacute;n&iacute;</a>, proto&#382;e klon zat&iacute;m nepodporuje r&#367;zn&eacute; barvy uvnit&#345; objektu. Rozd&iacute;l je v tom, &#382;e klon je kopie kone&#269;n&eacute;ho tvaru p&#367;vodn&iacute;ho objektu, zat&iacute;mco kdy&#382; objekt zkop&iacute;rujete, vytvo&#345;&iacute;te nov&yacute; objekt, kter&yacute; m&aacute; stejn&eacute; vlastnosti jako p&#367;vodn&iacute; objekt (proto i z&aacute;kladn&iacute; n&aacute;&#269;rt a jeho defini&#269;n&iacute; komponenty okna, kter&eacute; jsou ulo&#382;eny jako vlastnosti).
</p><p>A te&#271; mus&iacute;me za&uacute;to&#269;it na &#269;&aacute;sti, kter&eacute; nejsou nakreslen&eacute; nikde. Za&#269;n&#283;me se sklen&#283;nou zd&iacute; mezi ob&yacute;vac&iacute;m pokojem a atriem. Snadn&#283;j&scaron;&iacute; bude kreslen&iacute; z bo&#269;n&iacute;ho pohledu, proto&#382;e ten m&aacute;m d&aacute; spr&aacute;vnou v&yacute;&scaron;ku st&#345;echy. Kdy&#382; jste v p&#367;dorysu, m&#367;&#382;ete pohledem ot&aacute;&#269;et z menu Pohled -&gt; Standardn&iacute; pohled -&gt; Oto&#269;it doleva nebo doprava a&#382; dostanete komfortn&iacute; pohled na pr&aacute;ci, jako t&#345;eba:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_34.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_34.jpg" decoding="async" width="1024" height="477"></a></span>
</p><p>V&scaron;imn&#283;te jak jsem na obr&aacute;zku naho&#345;e ud&#283;lal p&#345;&iacute;mku z modelu k lev&eacute;mu &#345;ezu, abych z&iacute;skal p&#345;esnou &scaron;&iacute;&#345;ku okna. Potom jsem tuto &scaron;&iacute;&#345;ku zkop&iacute;roval do bokorysu a rozd&#283;lil jsem ji na 4 &#269;&aacute;sti. Pak jsem vytvo&#345;il jednu hlavn&iacute; &#269;&aacute;st okna, plus 4 dal&scaron;&iacute; okna pro posuvn&eacute; dve&#345;e. Skic&aacute;&#345; m&aacute; ob&#269;as pot&iacute;&#382;e s p&#345;ekr&yacute;vaj&iacute;c&iacute;mi se dr&aacute;ty, proto jsem dal p&#345;ednost dr&#382;et je odd&#283;len&#283;, jak je zde:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_35.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_35.jpg" decoding="async" width="1024" height="454"></a></span>
</p><p>Po nutn&eacute;m oto&#269;en&iacute; v&scaron;echno perfektn&#283; zapadne na m&iacute;sto:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_36.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_36.jpg" decoding="async" width="1024" height="462"></a></span>
</p><p>Je&scaron;t&#283; tady pot&#345;ebujeme n&#283;jakou rohovou &#269;&aacute;st. Mal&yacute; u&#382;ite&#269;n&yacute; trik s n&aacute;strojem <a href="../cs/Draft_SelectPlane.html" title="Draft SelectPlane/cs">Vybrat rovinu</a>, kdy&#382; m&aacute;te vybranou plochu a stisknete toto tla&#269;&iacute;tko, pracovn&iacute; rovina se ztoto&#382;n&iacute; s vybranou plochou (p&#345;inejmen&scaron;&iacute;m s jej&iacute; pozic&iacute; a pokud je plocha obd&eacute;ln&iacute;kov&aacute;, pokus&iacute; se ztoto&#382;nit i jej&iacute; osy). Je to u&#382;ite&#269;n&eacute; p&#345;i kreslen&iacute; 2D objekt&#367; p&#345;&iacute;mo na modelu, jako zde, m&#367;&#382;eme nakreslit obd&eacute;ln&iacute;k, kter&yacute; bude vysunut p&#345;&iacute;mo do jeho spr&aacute;vn&eacute; pozice:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_37.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_37.jpg" decoding="async" width="1024" height="461"></a></span>
</p><p>A te&#271; se pus&#357;me do dvou zb&yacute;vaj&iacute;c&iacute;ch &#269;&aacute;st&iacute;. Jedna je snadn&aacute;, je to kopie toho co je na druh&eacute; stran&#283;, tak&#382;e snadno m&#367;&#382;eme pou&#382;&iacute;t 2D v&yacute;kres:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_38.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_38.jpg" decoding="async" width="1024" height="472"></a></span>
</p>
<div class="mw-translate-fuzzy">
<p>Druh&aacute; &#269;&aacute;st je trochu slo&#382;it&#283;j&scaron;&iacute;. P&#345;i pohledu na obr&aacute;zky vid&iacute;me, &#382;e m&aacute; mnoho svisl&yacute;ch sekc&iacute;, jako jsou okna na schodi&scaron;t&iacute;ch. N&aacute;hodou (nebo velice dobr&yacute;m designem z Vilanova Artigas) &scaron;&iacute;&#345;ka na&scaron;ich oken (4.50m) je p&#345;esn&#283; stejn&aacute; jako &scaron;&iacute;&#345;ka schodi&scaron;&#357;ov&yacute;ch oken, tak&#382;e m&#367;&#382;eme pou&#382;&iacute;t stejn&eacute; sekce: 15 &#269;&aacute;st&iacute; po 30cm. Zde jsem vyu&#382;il n&aacute;stroj <a href="../cs/Draft_Array.html" title="Draft Array/cs">Kreslen&iacute; Pole</a>  pro kop&iacute;rov&aacute;n&iacute; p&#345;es 2 p&#345;&iacute;mky 15-kr&aacute;t a nad nimi jsem nakreslil obd&eacute;ln&iacute;ky:
</p>
</div>
<p><span typeof="mw:File"><a href="../File/Arch_tutorial_39.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_39.jpg" decoding="async" width="1024" height="544"></a></span>
</p><p>Kdy&#382; je to ud&#283;l&aacute;no, m&#367;&#382;eme vytvo&#345;it okno stejnou metodou, kterou u&#382; zn&aacute;me. Dal&scaron;&iacute; mal&aacute; u&#382;ite&#269;n&aacute; finta, pokud u&#382; jste si j&iacute; nev&scaron;imli d&#345;&iacute;ve: P&#345;i &uacute;prav&#283; okna, kdy&#382; zm&#283;n&iacute;te jm&eacute;no komponenty, vytvo&#345;&iacute; se ve skute&#269;nosti ji zduplikujete. Tak&#382;e 15 vnit&#345;n&iacute;ch sklen&#283;n&yacute;ch panel&#367; vytvo&#345;&iacute;te m&iacute;sto 15 kliknut&iacute; na tla&#269;&iacute;tko "add" a 15-kr&aacute;t vypln&#283;n&iacute; jejich dat, pouze tak, &#382;e uprav&iacute;te jeden a zm&#283;n&iacute;te jeho jm&eacute;no a dr&aacute;t, co&#382; poka&#382;d&eacute; vytvo&#345;&iacute; novou kopii.
</p><p>Po tom co okno oto&#269;&iacute;me a posuneme na m&iacute;sto, je atrium kompletn&iacute;:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_40.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_40.jpg" decoding="async" width="1024" height="479"></a></span>
</p><p><span id="Edits_and_fixes"></span>
</p>
<h2><span id=".C3.9Apravy_a_opravy"></span><span class="mw-headline" id="&Uacute;pravy_a_opravy">&Uacute;pravy a opravy</span></h2>
<p>Kdy&#382; se nyn&iacute; pod&iacute;v&aacute;me na zadn&iacute; pr&#367;&#269;el&iacute; a porovn&aacute;me je s pl&aacute;nem , vid&iacute;me, &#382;e jsou tam n&#283;jak&eacute; rozd&iacute;ly, kter&eacute; musej&iacute; b&yacute;t opraveny. A to, &#382;e lo&#382;nicov&aacute; okna jsou men&scaron;&iacute; ne&#382; jsem si prvn&#283; myslel a budeme muset p&#345;idat n&#283;jak&eacute; dal&scaron;&iacute; zdi. Aby to bylo ud&#283;l&aacute;no spr&aacute;vn&#283;, n&#283;kter&aacute; podla&#382;&iacute; musej&iacute; b&yacute;t sn&iacute;&#382;ena:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_41.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_41.jpg" decoding="async" width="1024" height="442"></a></span>
</p>
<div class="mw-translate-fuzzy">
<p>Samoz&#345;ejm&#283; to m&#367;&#382;emeud&#283;lat n&#283;kolika zp&#367;soby. Snadn&yacute; zp&#367;sob by byl ode&#269;ten&iacute; objemu, ale to by zase p&#345;ineslo zbyte&#269;n&eacute; zeslo&#382;it&#283;n&iacute; modelu. Lep&scaron;&iacute; je &uacute;prava z&aacute;kladov&eacute;ho dr&aacute;tu ka&#382;d&eacute;ho podla&#382;&iacute;. A te&#271; p&#345;ich&aacute;z&iacute; na &#345;adu m&oacute;d <a href="../cs/Draft_Edit.html" title="Draft Edit/cs">Kreslen&iacute; &Uacute;pravy</a>. Rozbalen&iacute;m t&#283;chto podla&#382;&iacute; v okn&#283; stromu a potom zviditeln&#283;n&iacute;m z&aacute;kladov&eacute;ho dr&aacute;tu m&#367;&#382;eme dvojklikem na n&#283;j p&#345;ej&iacute;t do edita&#269;n&iacute;ho m&oacute;du. M&#367;&#382;eme posunovat jeho body nebo p&#345;id&aacute;vat nebo odeb&iacute;rat body. Tak se snadno uprav&iacute; podlahov&eacute; desky.
</p>
</div>
<p><span typeof="mw:File"><a href="../File/Arch_tutorial_42.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_42.jpg" decoding="async" width="1024" height="481"></a></span>
</p><p>Po n&#283;jak&eacute; dal&scaron;&iacute; lopot&#283; (osoba, kter&aacute; d&#283;lala ty v&yacute;kresy, z&#345;ejm&#283; p&#283;kn&#283; zleniv&#283;la, kdy&#382; d&#283;lala posledn&iacute; bokorysy, mnoho jich je nakresleno &scaron;patn&#283;) m&aacute;me nakonec d&#367;m kompletn&iacute;:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_43.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_43.jpg" decoding="async" width="1024" height="425"></a></span>
</p><p>V&scaron;imn&#283;te si, &#382;e kom&iacute;nov&eacute; trubice, kter&aacute; je vytvo&#345;ena z kru&#382;nice, kterou jsem pou&#382;il k vytvo&#345;en&iacute; d&iacute;ry v kom&iacute;nov&eacute;m bloku, kter&yacute; jsem vysunul a potom zkonvertoval do trubice pomoc&iacute; n&aacute;stroje <a href="../cs/Part_Offset.html" title="Part Offset/cs">D&iacute;l odsunut&iacute;</a>.
</p>
<div class="note"><b>Probl&eacute;my v objektech</b>
<p>N&#283;kdy m&#367;&#382;e m&iacute;t V&aacute;&scaron; vytvo&#345;en&yacute; objekt probl&eacute;my. Nap&#345;&iacute;klad objekt, kter&yacute; byl vytvo&#345;en na z&aacute;klad&#283;, kter&yacute; byl smaz&aacute;n a objekt tak nem&#367;&#382;e p&#345;epo&#269;&iacute;t&aacute;vat sv&#367;j tvar. Takov&eacute; jsou oby&#269;ejn&#283; zobrazov&aacute;ny s malou &#269;ervenou zna&#269;kou na jejich ikon&#283; a/nebo s varov&aacute;n&iacute;m ve v&yacute;stupn&iacute;m okn&#283;. Neexistuje obecn&yacute; n&aacute;vod jak takov&eacute; probl&eacute;my opravit, proto&#382;e mohou m&iacute;t mnoho d&#367;vod&#367;. Ale nejsnadn&#283;j&scaron;&iacute; zp&#367;sob &#345;e&scaron;en&iacute; je &#269;asto jejich smaz&aacute;n&iacute; a pokud jste nesmazali jejich z&aacute;kladov&yacute; objekt, znovu je vytvo&#345;it.
</p>
</div>
<p><br>
<span id="Output"></span>
</p>
<h2><span id="V.C3.BDstup"></span><span class="mw-headline" id="V&yacute;stup">V&yacute;stup</span></h2>
<p>A te&#271;, kdy&#382; jsme pro&scaron;li tou t&#283;&#382;kou prac&iacute; p&#345;i budov&aacute;n&iacute; na&scaron;eho modelu, p&#345;ich&aacute;z&iacute; odm&#283;na: Co s t&iacute;m m&#367;&#382;eme d&#283;lat? V z&aacute;klad&#283; je to velk&aacute; v&yacute;hoda, pracovat s BIM, v&scaron;echny na&scaron;e tradi&#269;n&iacute; architektonick&eacute; po&#382;adavky, jako jsou 2D v&yacute;krasy (pl&aacute;ny, &#345;ezy, atd.) vykreslov&aacute;n&iacute; ve 3D a v&yacute;po&#269;ty (v&yacute;kaz v&yacute;m&#283;r - seznam mno&#382;stv&iacute;) mohou b&yacute;t z&iacute;sk&aacute;ny z tohoto modelu. A je&scaron;t&#283; l&eacute;pe, zregeneruj&iacute; se v&#382;dy, kdy&#382; je model upraven. Zde V&aacute;m uk&aacute;&#382;u jak z&iacute;skat tyto r&#367;zn&eacute; dokumenty.
</p><p><span id="Preparations"></span>
</p>
<h2><span id="P.C5.99.C3.ADprava_2"></span><span class="mw-headline" id="P&#345;&iacute;prava_2">P&#345;&iacute;prava</span></h2>
<p>P&#345;ed za&#269;&aacute;tkem exportu je zaj&iacute;mav&eacute; ud&#283;lat zaj&iacute;mavou &uacute;vahu: Jak jste vid&#283;li, n&aacute;&scaron; model se st&aacute;v&aacute; &#269;&iacute;m d&aacute;l t&iacute;m v&iacute;c slo&#382;it&yacute;, se spoustou vztah&#367; mezi objekty. To vy&#382;aduje n&aacute;sledn&eacute; v&yacute;po&#269;tov&eacute; operace, kter&eacute; jsou n&aacute;ro&#269;n&eacute;, jako je pro&#345;ez&aacute;n&iacute; skrz model. Jeden zp&#367;sob jak kouzeln&#283; "zjednodu&scaron;it" drasticky V&aacute;&scaron; model je vyjmut&iacute; cel&eacute; t&eacute;to slo&#382;itosti tak, &#382;e model exportujete do form&aacute;tu  <a rel="nofollow" class="external text" href="http://en.wikipedia.org/wiki/ISO_10303-21">STEP</a>. Tento form&aacute;t zachov&aacute; celou Va&scaron;i konstrukci, ale vypust&iacute; v&scaron;echny vztahy a parametrick&eacute; konstrukce a podr&#382;&iacute; pouze kone&#269;n&yacute; tvar. Kdy&#382; tento STEP soubor potom znovu naimportujete do FreeCADu, z&iacute;sk&aacute;te model, kter&yacute; nem&aacute; &#382;&aacute;dn&eacute; vztahy a m&aacute; mnohem men&scaron;&iacute; velikost souboru. P&#345;edstavte si ho jako "v&yacute;stupn&iacute;" soubor, kter&yacute; m&#367;&#382;ete kdykoliv regenerovat z "hlavn&iacute;ho" souboru:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_44.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_44.jpg" decoding="async" width="1024" height="592"></a></span>
</p><p><span id="Exporting_to_IFC_and_other_applications"></span>
</p>
<h3><span id="Exportov.C3.A1n.C3.AD_do_IFC_a_dal.C5.A1.C3.ADch_aplikac.C3.AD"></span><span class="mw-headline" id="Exportov&aacute;n&iacute;_do_IFC_a_dal&scaron;&iacute;ch_aplikac&iacute;">Exportov&aacute;n&iacute; do IFC a dal&scaron;&iacute;ch aplikac&iacute;</span></h3>
<figure class="mw-halign-left" typeof="mw:File"><a href="../File/Arch_tutorial_45.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_45.jpg" decoding="async" width="400" height="244"></a><figcaption></figcaption></figure>
<p>Jedna ze z&aacute;kladn&iacute;ch v&#283;c&iacute;, kter&eacute; pot&#345;ebujete p&#345;i pr&aacute;ci s BIM je schopnost importu a exportu soubor&#367;  <a rel="nofollow" class="external text" href="http://en.wikipedia.org/wiki/Industry_Foundation_Classes">IFC</a>. To je zat&iacute;m v&#283;c, na kter&eacute; se ve FreeCADu pracuje. Form&aacute;t <a href="../cs/Arch_IFC.html" title="Arch IFC/cs">IFC</a> u&#382; je podporov&aacute;n a import IFC soubor&#367; do FreeCADu je u&#382; docela spolehliv&yacute;. Export je nicm&eacute;n&#283; zat&iacute;m ve stavu experimentov&aacute;n&iacute; a aktu&aacute;ln&#283; m&aacute; mnoho omezen&iacute;. P&#345;esto, stav se zlep&scaron;uje a odpov&iacute;daj&iacute;c&iacute; exportn&iacute; mo&#382;nosti IFC bychom m&#283;li m&iacute;t velmi brzy.
</p><p><a href="../cs/Arch_IFC.html" title="Arch IFC/cs">IFC export</a> po&#382;aduje jenom mal&eacute; nastaven&iacute;, kdy&#382; u&#382; jsou nainstalov&aacute;ny pot&#345;ebn&eacute; softwarov&eacute; knihovny. Pot&#345;ebujete pouze znovuvytvo&#345;it stavebn&iacute; struktury, kter&eacute; jsou pot&#345;ebn&eacute; ve v&scaron;ech IFC souborech, p&#345;id&aacute;n&iacute;m  <a href="../cs/Arch_Building.html" title="Arch Building/cs">Budovy</a> do souboru, potom <a href="../cs/Arch_Floor.html" title="Arch Floor/cs">Podla&#382;&iacute;</a> a potom do n&#283;j p&#345;esunout v&scaron;echny skupiny objektu, ze kter&yacute;ch se model skl&aacute;d&aacute;. Ujist&#283;te se, &#382;e vypust&iacute;te konstruk&#269;n&iacute; geometrii (v&scaron;echny 2D v&#283;ci, kter&eacute; jsme nakreslili), abychom se vyhnuli vytvo&#345;en&iacute; zbyte&#269;n&#283; n&aacute;ro&#269;n&eacute;ho IFC souboru.
</p><p>IFC nem&aacute; &#382;&aacute;dn&yacute; "obecn&yacute;" struktur&aacute;ln&iacute; prvek jako FreeCAD, mus&iacute;me jim p&#345;i&#345;adit role (sloup, nosn&iacute;k, atd.) aby export&eacute;r v&#283;d&#283;l jak&yacute; prvek vytvo&#345;it v IFC souboru.
</p><p>V takov&eacute;m p&#345;&iacute;pad&#283; pot&#345;ebujeme cel&yacute; n&aacute;&scaron;architektonick&yacute; syst&eacute;m, proto IFC exporter v&iacute;, jestli objekt mus&iacute; b&yacute;t exportov&aacute;n jako ze&#271; nebo jako sloup, tak&#382;e pou&#382;&iacute;v&aacute;me n&aacute;&scaron; hlavn&iacute; model a ne v&yacute;stupn&iacute; model.
</p><p>Kdy&#382; je to ud&#283;l&aacute;no, jednodu&scaron;e vybereme stavebn&iacute; objekt a zvol&iacute;me form&aacute;t "Industry Foundation Classes". Exportov&aacute;n&iacute; do ne-BIM aplikace, jako je t&#345;eba <a rel="nofollow" class="external text" href="http://www.sketchup.com/">Sketchup</a> je tak&eacute; velmi jednoduch&eacute;, m&aacute;te k dispozici n&#283;kolik exportn&iacute;ch form&aacute;t&#367;, jako jsou <a href="../cs/Arch_DAE.html" title="Arch DAE/cs">Collada</a>, STEP, IGES nebo OBJ.
</p>
<div style="clear:both"></div>
<h3><span class="mw-headline" id="Rendering">Rendering</span></h3>
<div class="mw-translate-fuzzy">
<p>Ve FreeCADu je tak&eacute; renderovac&iacute; modul  <a href="../cs/Raytracing_Workbench.html" title="Raytracing Workbench/cs">Pracovn&iacute; plocha Raytracing</a>. Tato pracovn&iacute; plocha aktu&aacute;ln&#283; podporuje dva renderovac&iacute; enginy <a rel="nofollow" class="external text" href="http://www.povray.org/">PovRay</a> a <a rel="nofollow" class="external text" href="http://www.luxrender.net">LuxRender</a>. Proto&#382;e FreeCAD nen&iacute; ur&#269;en pro renderov&aacute;n&iacute; obr&aacute;zk&#367;, je nab&iacute;dka pracovn&iacute; plochy Raytracing pon&#283;kud omezen&aacute;. Pokud chcete odpov&iacute;daj&iacute;c&iacute; rendering je nejlep&scaron;&iacute; postup exportovat model do form&aacute;tu zalo&#382;en&eacute;m na s&iacute;ti jako jsou OBJ nebo STL a otev&#345;&iacute;t jej v aplikaci vhodn&#283;j&scaron;&iacute; pro rendering, jako je <a rel="nofollow" class="external text" href="http://www.blender.org">Blender</a>. Obr&aacute;zek dole je renderov&aacute;n pomoc&iacute; cyklovac&iacute;ho enginu Blenderu:
</p>
</div>
<p><span typeof="mw:File"><a href="../File/Arch_tutorial_47.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_47.jpg" decoding="async" width="1024" height="480"></a></span>
</p><p>Ale pro rychl&eacute; renderov&aacute;n&iacute; V&aacute;m pracovn&iacute; plocha Raytracing poskytne u&#382; docela dobr&yacute; v&yacute;sledek, s v&yacute;hodou velmi snadn&eacute;ho nastaven&iacute;, d&iacute;ky jeho syst&eacute;mu &scaron;ablon. Toto je V&aacute;&scaron; model pln&#283; renderovan&yacute; ve FreeCADu pomoc&iacute; enginu Luxrender p&#345;i pou&#382;it&iacute; &scaron;ablony "indoor".
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_48.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_48.jpg" decoding="async" width="1024" height="599"></a></span>
</p><p>Pracovn&iacute; plocha Raytracing zat&iacute;m nab&iacute;z&iacute; velmi omezenou spr&aacute;vu materi&aacute;l&#367;, ale osv&#283;tlen&iacute; a prost&#345;ed&iacute; jsou definov&aacute;ny v &scaron;ablon&aacute;ch a proto mohou b&yacute;t pln&#283; u&#382;ivatelsky upravov&aacute;ny.
</p><p><span id="2D_drawings"></span>
</p>
<h3><span id="2D_v.C3.BDkresy"></span><span class="mw-headline" id="2D_v&yacute;kresy">2D v&yacute;kresy</span></h3>
<p>Nejd&#367;le&#382;it&#283;j&scaron;&iacute;m pou&#382;it&iacute; BIM je ur&#269;it&#283; automatick&aacute; v&yacute;roba 2D v&yacute;kres&#367;. Ve FreeCADu se to d&#283;l&aacute; n&aacute;strojem <a href="../cs/Arch_SectionPlane.html" title="Arch SectionPlane/cs">Architektura Rovina &#345;ezu</a>. Tento n&aacute;stroj umo&#382;&#328;uje um&iacute;stit objekt roviny &#345;ezu ve 3D pohledu, kter&yacute;m m&#367;&#382;ete orientovat v&yacute;robu pl&aacute;n&#367;, &#345;ez&#367; a n&aacute;rys&#367;. Roviny &#345;ez&#367; mus&iacute; zn&aacute;t objekty, kter&eacute; mus&iacute; obsahovat, proto jakmile n&#283;jak&yacute; vytvo&#345;&iacute;te, mus&iacute;te jej p&#345;idat n&aacute;strojem <a href="../cs/Arch_Add.html" title="Arch Add/cs">P&#345;idat</a>. M&#367;&#382;ete p&#345;idat jednotliv&eacute; objekty nebo je&scaron;t&#283; v&yacute;hodn&#283;ji skupinu, podla&#382;&iacute; nebo celou budovu. To V&aacute;m umo&#382;n&iacute; snadno pozd&#283;ji zm&#283;nit rozsah ur&#269;it&eacute; roviny &#345;ezu p&#345;id&aacute;n&iacute;m nebo odebr&aacute;n&iacute;m objekt&#367; z nebo do takov&eacute; skupiny. Jak&aacute;koliv zm&#283;na t&#283;chto objekt&#367; se odraz&iacute; v pohledech vytvo&#345;en&yacute;ch rovinou &#345;ezu.
</p><p>Rovina &#345;ezu automaticky vytv&aacute;&#345;&iacute; pr&#367;&#345;ezy objekt&#367;. Jin&yacute;mi slovy vytv&aacute;&#345;&iacute; pohledy m&iacute;sto &#345;ez&#367;, Vy pouze mus&iacute;te um&iacute;stit rovinu &#345;ezu mimo V&aacute;&scaron; objekt.
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_49.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_49.jpg" decoding="async" width="1024" height="470"></a></span>
</p>
<div class="mw-translate-fuzzy">
<p>Roviny &#345;ez&#367; mohou vytv&aacute;&#345;et dva r&#367;zn&eacute; v&yacute;stupy: objekty <a href="../cs/Part_Workbench.html" title="Part Workbench/cs">tvar</a>, kter&eacute; jsou ve stejn&eacute;m dokumentu jako V&aacute;&scaron; 3D model nebo <a href="../cs/Drawing_Workbench.html" title="Drawing Workbench/cs">v&yacute;kresy pohled&#367;</a>, kter&eacute; jsou vytvo&#345;eny k pou&#382;it&iacute; na v&yacute;kresech vytv&aacute;&#345;en&yacute;ch pomoc&iacute; <a href="../cs/Drawing_Workbench.html" title="Drawing Workbench/cs">Pracovn&iacute; plochy Kreslen&iacute;</a>. Ka&#382;d&yacute; z nich se chov&aacute; odli&scaron;n&#283; a m&aacute; svoje v&yacute;hody.
</p>
</div>
<p><b>Pohledy tvar&#367;</b>
</p>
<div class="mw-translate-fuzzy">
<p>Tento v&yacute;stup vznik&aacute; pou&#382;it&iacute;m n&aacute;stroje <a href="../cs/Draft_Shape2DView.html" title="Draft Shape2DView/cs">Kreslen&iacute; Tvar2DPohled</a> na vybran&eacute; rovin&#283; &#345;ezu. Vytvo&#345;&iacute;te 2D pohled modelu p&#345;&iacute;mo ve 3D prostoru, jako je na obr&aacute;zku naho&#345;e. Zde je hlavn&iacute; v&yacute;hodou to, &#382;e na n&#283;m m&#367;&#382;ete pracovat s pou&#382;it&iacute;m n&aacute;stroj&#367; <a href="../cs/Draft_Workbench.html" title="Draft Workbench/cs">Kreslen&iacute;</a> (nebo jak&yacute;mkoliv standardn&iacute;m n&aacute;strojem FreeCADu), tak&#382;e m&#367;&#382;ete p&#345;idat texty, k&oacute;ty, symboly atd.:
</p>
</div>
<p><span typeof="mw:File"><a href="../File/Arch_tutorial_50.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_50.jpg" decoding="async" width="1024" height="457"></a></span>
</p><p>Na obr&aacute;zku naho&#345;e byly vytvo&#345;eny dva <a href="../cs/Draft_Shape2DView.html" title="Draft Shape2DView/cs">2DTvar pohledy</a> pro ka&#382;d&yacute; &#345;ez, jeden, kter&yacute; zobrazuje v&scaron;echno, druh&yacute;, kter&yacute; zobrazuje pouze &#345;ezn&eacute; &#269;&aacute;ry. To n&aacute;m umo&#382;&#328;uje d&aacute;t odli&scaron;n&eacute; tlou&scaron;&#357;ky &#269;ar a zapnout &scaron;rafov&aacute;n&iacute;. Potom byly p&#345;id&aacute;ny k&oacute;ty, texty a symboly a bylo importov&aacute;no n&#283;kolik DXF blok&#367; p&#345;edstavuj&iacute;c&iacute;ch n&aacute;bytek. Tyto pohledy jsou pak snadno exportovateln&eacute; do DXF nebo DWG a lze je otev&#345;&iacute;t ve Va&scaron;&iacute; obl&iacute;ben&eacute; 2D CAD aplikaci, jako je <a rel="nofollow" class="external text" href="http://www.librecad.org">LibreCAD</a> nebo <a rel="nofollow" class="external text" href="http://www.3ds.com/products-services/draftsight/overview/">DraftSight</a>, kde na nich m&#367;&#382;ete d&aacute;l pracovat:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_51.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_51.jpg" decoding="async" width="1024" height="541"></a></span>
</p><p>P&#345;ipom&iacute;n&aacute;m, &#382;e n&#283;kter&eacute; vlastnosti zat&iacute;m st&aacute;le je&scaron;t&#283; nejsou podporov&aacute;ny <a href="../cs/Draft_DXF.html" title="Draft DXF/cs">DXF/DWG exporterem</a>, proto v&yacute;sledek ve va&scaron;&iacute; 2D aplikaci se m&#367;&#382;e trochu li&scaron;it. nap&#345;&iacute;klad u obr&aacute;zku naho&#345;e jsem musel vr&aacute;tit &scaron;rafov&aacute;n&iacute; a opravit pozice n&#283;kter&yacute;ch text&#367; u k&oacute;t. Jestli&#382;e um&iacute;st&iacute;te objekty v r&#367;zn&yacute;ch skupin&aacute;ch ve FreeCADu, stanou se tyto skupiny vrstvami ve 2D CAD aplikaci.
</p><p><b>ArchViews</b>
</p><p>The other kind of output that can be produced from <a href="../Arch_SectionPlane.html" title="Arch SectionPlane">section planes</a> are <a href="../TechDraw_ArchView.html" title="TechDraw ArchView">TechDraw ArchViews</a>. This method has one big limitation compared to the previous one: you have limited possibilities to edit the results, and at the moment, things like dimensioning or hatching are still not natively supported.
</p><p>Na druhou stranu m&#367;&#382;e b&yacute;t fin&aacute;ln&yacute; v&yacute;stup snadn&#283;ji manipulovateln&yacute; a grafick&eacute; mo&#382;nosti form&aacute;tu SVG jsou obrovsk&eacute;. V budoucnosti bude toto nepochybn&#283; preferovan&aacute; metoda. Ale v sou&#269;asnosti dostanete lep&scaron;&iacute; v&yacute;sledky p&#345;i pou&#382;it&iacute; prvn&iacute; metody.
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_52.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_52.jpg" decoding="async" width="1024" height="631"></a></span>
</p>
<div class="mw-translate-fuzzy">
<p>Na obr&aacute;zku naho&#345;e, konstrukce je p&#345;&iacute;m&yacute; v&yacute;stup z roviny &#345;azu, ale byly p&#345;id&aacute;ny dal&scaron;&iacute; objekty Kreslen&iacute; jako jsou k&oacute;ty a &scaron;rafovan&eacute; v&iacute;ce&uacute;heln&iacute;ky. Dal&scaron;&iacute; objekt pohledu se stejn&yacute;m m&#283;&#345;&iacute;tkem a hodnotami odsunut&iacute; byl vytvo&#345;en n&aacute;strojem <a href="../cs/Draft_Drawing.html" title="Draft Drawing/cs">V&yacute;kres</a>. V budoucnosti bude takov&aacute; operace d&#283;l&aacute;na p&#345;&iacute;mo na v&yacute;kresov&eacute; str&aacute;nce, ponech&aacute;vaj&iacute;c model zcela &#269;ist&yacute;.
</p>
</div>
<p><span id="Quantities_extraction"></span>
</p>
<h3><span id="Zji.C5.A1.C5.A5ov.C3.A1n.C3.AD_mno.C5.BEstv.C3.AD"></span><span class="mw-headline" id="Zji&scaron;&#357;ov&aacute;n&iacute;_mno&#382;stv&iacute;">Zji&scaron;&#357;ov&aacute;n&iacute; mno&#382;stv&iacute;</span></h3>
<div class="mw-translate-fuzzy">
<p>To je tak&eacute; dal&scaron;&iacute; velmi d&#367;le&#382;it&aacute; uloha prov&aacute;d&#283;n&aacute; modly BIM. Ve FreeCADu vypadaj&iacute; v&#283;ci dob&#345;e u&#382; od za&#269;&aacute;tku, proto&#382;e OpenCasCade j&aacute;dro FreeCADu u&#382; se star&aacute; o v&yacute;po&#269;ty d&eacute;lek, ploch a objem&#367; v&scaron;ech tvar&#367;, kter&eacute; jsou vytv&aacute;&#345;eny. Proto&#382;e v&scaron;echny objekty <a href="../cs/Arch_Workbench.html" title="Arch Workbench/cs">Modulu Architektura</a> jsou t&#283;lesa, m&aacute;te v&#382;dy jistotu, &#382;e budete schopni zjistit jejich objem.
</p>
</div>
<p><b>Pou&#382;it&iacute; tabulkov&yacute;ch kalkul&aacute;tor&#367;</b>
</p><p>To populate a spreadsheet with values extracted from the model the Arch_Schedule tool can be used.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../File/Arch_schedule_example03.jpg" class="mw-file-description"><img src="../File/Arch_schedule_example03.jpg" decoding="async" width="858" height="555"></a></span>
</p><p><b>P&#345;ehledov&yacute; m&oacute;d</b>
</p><p>Dal&scaron;&iacute;m zp&#367;sobem jak prozkoumat model a vyt&aacute;hnout z n&#283;j hodnoty, je pou&#382;it&iacute; m&oacute;du <a href="../cs/Arch_Survey.html" title="Arch Survey/cs">Architektura P&#345;ehled</a>. V tomto m&oacute;du m&#367;&#382;ete kliknout na bod, hranu, plochu nebo dvojkliknout pro v&yacute;b&#283;r cel&eacute;ho objektu a z&iacute;skat hodnoty v&yacute;&scaron;ky, d&eacute;lky, plochy nebo objemu, zobrazen&eacute; na modelu, vyti&scaron;t&#283;n&eacute; ve v&yacute;stupn&iacute;m okn&#283; FreeCADu a zkop&iacute;rovan&eacute; do schr&aacute;nky, tak&#382;e hodnoty m&#367;&#382;ete vz&iacute;t a vlo&#382;it do jin&eacute; otev&#345;en&eacute; aplikace.
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_54.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_54.jpg" decoding="async" width="1024" height="666"></a></span>
</p><p><span id="Conclusion"></span>
</p>
<h2><span id="Z.C3.A1v.C4.9Br"></span><span class="mw-headline" id="Z&aacute;v&#283;r">Z&aacute;v&#283;r</span></h2>
<div class="mw-translate-fuzzy">
<p>Douf&aacute;m, &#382;e tento v&yacute;ukov&yacute; program V&aacute;m dal dobr&yacute; p&#345;ehled dostupn&yacute;ch n&aacute;stroj&#367;. Ur&#269;it&#283; se pro dal&scaron;&iacute; informace pod&iacute;vejte na dokumentaci <a href="../cs/Arch_Workbench.html" title="Arch Workbench/cs">Pracovn&iacute; plocha Architektura</a> a <a href="../cs/Draft_Workbench.html" title="Draft Workbench/cs">Pracovn&iacute; plocha Kreslen&iacute;</a> (je tam mnoho dal&scaron;&iacute;ch n&aacute;stroj&#367;, kter&eacute; jsem zde nezm&iacute;nil) a je&scaron;t&#283; obecn&#283;ji na zb&yacute;vaj&iacute;c&iacute; <a href="../cs/Main_Page.html" title="Main Page/cs">documentaci FreeCADu</a>. Nav&scaron;tivte tak&eacute; <a rel="nofollow" class="external text" href="http://forum.freecadweb.org">f&oacute;rum</a>, mnoho probl&eacute;m&#367; zde m&#367;&#382;e b&yacute;t oby&#269;ejn&#283; vy&#345;e&scaron;eno b&#283;hem chv&iacute;le a tak&eacute; se pod&iacute;vejte na m&#367;j <a rel="nofollow" class="external text" href="http://yorik.uncreated.net/guestblog.php?tag=freecad">blog</a>, kde jsou novinky o v&yacute;voji pracovn&iacute; plochy Architektura.
</p>
</div>
<div class="mw-translate-fuzzy">
<p>Soubor vytvo&#345;en&yacute; t&iacute;mto v&yacute;ukov&yacute;m programem najdete <a rel="nofollow" class="external text" href="http://yorik.uncreated.net/archive/freecad/casa_artigas.fcstd">zde</a>.
</p>
</div>
<p><br>
</p>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: #fefefe;"><span typeof="mw:File"><a href="../File/Workbench_BIM.svg" class="mw-file-description"><img src="../File/Workbench_BIM.svg" decoding="async" width="24" height="24"></a></span> <a href="../index.php?title=BIM_Workbench/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Workbench/cs (page does not exist)">BIM</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid #aaaaaa; text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: #fefefe;">
<ul><li><b>2D drafting:</b> <a href="../index.php?title=BIM_Sketch/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Sketch/cs (page does not exist)">Sketch</a>, <a href="../cs/Draft_Line.html" title="Draft Line/cs">Line</a>, <a href="../cs/Draft_Wire.html" title="Draft Wire/cs">Polyline</a>, <a href="../cs/Draft_Circle.html" title="Draft Circle/cs">Circle</a>, <a href="../cs/Draft_Arc.html" title="Draft Arc/cs">Arc</a>, <a href="../index.php?title=Draft_Arc_3Points/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Draft Arc 3Points/cs (page does not exist)">Arc by 3 points</a>, <a href="../index.php?title=Draft_Fillet/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Draft Fillet/cs (page does not exist)">Fillet</a>, <a href="../cs/Draft_Ellipse.html" title="Draft Ellipse/cs">Ellipse</a>, <a href="../cs/Draft_Polygon.html" title="Draft Polygon/cs">Polygon</a>, <a href="../cs/Draft_Rectangle.html" title="Draft Rectangle/cs">Rectangle</a>, <a href="../cs/Draft_BSpline.html" title="Draft BSpline/cs">B-spline</a>, <a href="../cs/Draft_BezCurve.html" title="Draft BezCurve/cs">B&eacute;zier curve</a>, <a href="../index.php?title=Draft_CubicBezCurve/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Draft CubicBezCurve/cs (page does not exist)">Cubic B&eacute;zier curve</a>, <a href="../cs/Draft_Point.html" title="Draft Point/cs">Point</a></li></ul>
<hr>
<ul><li><b>3D/BIM:</b> <a href="../index.php?title=BIM_Project/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Project/cs (page does not exist)">Project</a>, <a href="../cs/Arch_Site.html" title="Arch Site/cs">Site</a>, <a href="../cs/Arch_Building.html" title="Arch Building/cs">Building</a>, <a href="../cs/Arch_Floor.html" title="Arch Floor/cs">Level</a>, <a href="../cs/Arch_Space.html" title="Arch Space/cs">Space</a>, <a href="../cs/Arch_Wall.html" title="Arch Wall/cs">Wall</a>, <a href="../index.php?title=Arch_CurtainWall/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Arch CurtainWall/cs (page does not exist)">Curtain Wall</a>, <a href="../index.php?title=BIM_Column/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Column/cs (page does not exist)">Column</a>, <a href="../index.php?title=BIM_Beam/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Beam/cs (page does not exist)">Beam</a>, <a href="../index.php?title=BIM_Slab/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Slab/cs (page does not exist)">Slab</a>, <a href="../index.php?title=BIM_Door/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Door/cs (page does not exist)">Door</a>, <a href="../cs/Arch_Window.html" title="Arch Window/cs">Window</a>, <a href="../index.php?title=Arch_Pipe/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Arch Pipe/cs (page does not exist)">Pipe</a>, <a href="../index.php?title=Arch_PipeConnector/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Arch PipeConnector/cs (page does not exist)">Pipe Connector</a>, <a href="../cs/Arch_Stairs.html" title="Arch Stairs/cs">Stairs</a>, <a href="../cs/Arch_Roof.html" title="Arch Roof/cs">Roof</a>, <a href="../index.php?title=Arch_Panel/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Arch Panel/cs (page does not exist)">Panel</a>, <a href="../cs/Arch_Frame.html" title="Arch Frame/cs">Frame</a>, <a href="../index.php?title=Arch_Fence/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Arch Fence/cs (page does not exist)">Fence</a>, <a href="../index.php?title=Arch_Truss/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Arch Truss/cs (page does not exist)">Truss</a>, <a href="../index.php?title=Arch_Equipment/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Arch Equipment/cs (page does not exist)">Equipment</a>
<ul><li><b>Reinforcement tools:</b> <a href="../cs/Arch_Rebar.html" title="Arch Rebar/cs">Custom Rebar</a>, <a href="../index.php?title=Reinforcement_StraightRebar/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Reinforcement StraightRebar/cs (page does not exist)">Straight Rebar</a>, <a href="../index.php?title=Reinforcement_UShapeRebar/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Reinforcement UShapeRebar/cs (page does not exist)">U-Shape Rebar</a>, <a href="../index.php?title=Reinforcement_LShapeRebar/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Reinforcement LShapeRebar/cs (page does not exist)">L-Shape Rebar</a>, <a href="../index.php?title=Reinforcement_StirrupRebar/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Reinforcement StirrupRebar/cs (page does not exist)">Stirrup</a>, <a href="../index.php?title=Reinforcement_BentShapeRebar/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Reinforcement BentShapeRebar/cs (page does not exist)">Bent-Shape Rebar</a>, <a href="../index.php?title=Reinforcement_HelicalRebar/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Reinforcement HelicalRebar/cs (page does not exist)">Helical Rebar</a>, <a href="../index.php?title=Reinforcement_ColumnRebars/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Reinforcement ColumnRebars/cs (page does not exist)">Column Reinforcement</a>, <a href="../index.php?title=Reinforcement_BeamRebars/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Reinforcement BeamRebars/cs (page does not exist)">Beam Reinforcement</a>, <a href="../index.php?title=Reinforcement_SlabRebars/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Reinforcement SlabRebars/cs (page does not exist)">Slab Reinforcement</a>, <a href="../index.php?title=Reinforcement_FootingRebars/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Reinforcement FootingRebars/cs (page does not exist)">Footing Reinforcement</a></li>
<li><b>Generic 3D tools:</b> <a href="../index.php?title=Arch_Profile/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Arch Profile/cs (page does not exist)">Profile</a>, <a href="../index.php?title=BIM_Box/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Box/cs (page does not exist)">Box</a>, <a href="../cs/Part_Builder.html" title="Part Builder/cs">Shape builder...</a>, <a href="../cs/Draft_Facebinder.html" title="Draft Facebinder/cs">Facebinder</a>, <a href="../index.php?title=BIM_Library/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Library/cs (page does not exist)">Objects library</a>, <a href="../index.php?title=Arch_Component/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Arch Component/cs (page does not exist)">Component</a>, <a href="../index.php?title=Arch_Reference/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Arch Reference/cs (page does not exist)">External reference</a></li></ul></li></ul>
<hr>
<ul><li><b>Annotation:</b> <a href="../BIM_Text.html" title="BIM Text">Text</a>, <a href="../cs/Draft_ShapeString.html" title="Draft ShapeString/cs">Shape from text</a>, <a href="../index.php?title=BIM_DimensionAligned/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM DimensionAligned/cs (page does not exist)">Aligned dimension</a>, <a href="../index.php?title=BIM_DimensionHorizontal/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM DimensionHorizontal/cs (page does not exist)">Horizontal dimension</a>, <a href="../index.php?title=BIM_DimensionVertical/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM DimensionVertical/cs (page does not exist)">Vertical dimension</a>, <a href="../index.php?title=BIM_Leader/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Leader/cs (page does not exist)">Leader</a>, <a href="../index.php?title=Draft_Label/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Draft Label/cs (page does not exist)">Label</a>, <a href="../cs/Arch_Axis.html" title="Arch Axis/cs">Axis</a>, <a href="../index.php?title=Arch_AxisSystem/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Arch AxisSystem/cs (page does not exist)">Axes System</a>, <a href="../index.php?title=Arch_Grid/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Arch Grid/cs (page does not exist)">Grid</a>, <a href="../cs/Arch_SectionPlane.html" title="Arch SectionPlane/cs">Section Plane</a>, <a href="../index.php?title=Draft_Hatch/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Draft Hatch/cs (page does not exist)">Hatch</a>, <a href="../index.php?title=BIM_TDPage/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM TDPage/cs (page does not exist)">Page</a>, <a href="../index.php?title=BIM_TDView/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM TDView/cs (page does not exist)">View</a>, <a href="../index.php?title=BIM_Shape2DView/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Shape2DView/cs (page does not exist)">Shape-based view</a></li></ul>
<hr>
<ul><li><b><a href="../cs/Draft_Snap.html" title="Draft Snap/cs">Snapping</a>:</b> <a href="../cs/Draft_Snap_Lock.html" title="Draft Snap Lock/cs">Snap lock</a>, <a href="../index.php?title=Draft_Snap_Endpoint/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Draft Snap Endpoint/cs (page does not exist)">Snap endpoint</a>, <a href="../index.php?title=Draft_Snap_Midpoint/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Draft Snap Midpoint/cs (page does not exist)">Snap midpoint</a>, <a href="../index.php?title=Draft_Snap_Center/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Draft Snap Center/cs (page does not exist)">Snap center</a>, <a href="../index.php?title=Draft_Snap_Angle/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Draft Snap Angle/cs (page does not exist)">Snap angle</a>, <a href="../index.php?title=Draft_Snap_Intersection/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Draft Snap Intersection/cs (page does not exist)">Snap intersection</a>, <a href="../index.php?title=Draft_Snap_Perpendicular/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Draft Snap Perpendicular/cs (page does not exist)">Snap perpendicular</a>, <a href="../index.php?title=Draft_Snap_Extension/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Draft Snap Extension/cs (page does not exist)">Snap extension</a>, <a href="../index.php?title=Draft_Snap_Parallel/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Draft Snap Parallel/cs (page does not exist)">Snap parallel</a>, <a href="../index.php?title=Draft_Snap_Special/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Draft Snap Special/cs (page does not exist)">Snap special</a>, <a href="../index.php?title=Draft_Snap_Near/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Draft Snap Near/cs (page does not exist)">Snap near</a>, <a href="../index.php?title=Draft_Snap_Ortho/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Draft Snap Ortho/cs (page does not exist)">Snap ortho</a>, <a href="../index.php?title=Draft_Snap_Grid/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Draft Snap Grid/cs (page does not exist)">Snap grid</a>, <a href="../index.php?title=Draft_Snap_WorkingPlane/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Draft Snap WorkingPlane/cs (page does not exist)">Snap working plane</a>, <a href="../index.php?title=Draft_Snap_Dimensions/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Draft Snap Dimensions/cs (page does not exist)">Snap dimensions</a>, <a href="../cs/Draft_ToggleGrid.html" title="Draft ToggleGrid/cs">Toggle grid</a>, <a href="../index.php?title=BIM_SetWPTop/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM SetWPTop/cs (page does not exist)">Working Plane Top</a>, <a href="../index.php?title=BIM_SetWPFront/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM SetWPFront/cs (page does not exist)">Working Plane Front</a>, <a href="../index.php?title=BIM_SetWPSide/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM SetWPSide/cs (page does not exist)">Working Plane Side</a></li></ul>
<hr>
<ul><li><b>Modify:</b> <a href="../cs/Draft_Move.html" title="Draft Move/cs">Move</a>, <a href="../index.php?title=BIM_Copy/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Copy/cs (page does not exist)">Copy</a>, <a href="../cs/Draft_Rotate.html" title="Draft Rotate/cs">Rotate</a>, <a href="../index.php?title=BIM_Clone/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Clone/cs (page does not exist)">Clone</a>, <a href="../cs/BIM_SimpleCopy.html" class="mw-redirect" title="BIM SimpleCopy/cs">Create simple copy</a>, <a href="../cs/BIM_Compound.html" class="mw-redirect" title="BIM Compound/cs">Make compound</a>, <a href="../cs/Draft_Offset.html" title="Draft Offset/cs">Offset</a>, <a href="../cs/BIM_Offset2D.html" class="mw-redirect" title="BIM Offset2D/cs">2D Offset...</a>, <a href="../cs/Draft_Trimex.html" title="Draft Trimex/cs">Trimex</a>, <a href="../index.php?title=Draft_Join/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Draft Join/cs (page does not exist)">Join</a>, <a href="../index.php?title=Draft_Split/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Draft Split/cs (page does not exist)">Split</a>, <a href="../cs/Draft_Scale.html" title="Draft Scale/cs">Scale</a>, <a href="../index.php?title=Draft_Stretch/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Draft Stretch/cs (page does not exist)">Stretch</a>, <a href="../cs/Draft_Draft2Sketch.html" title="Draft Draft2Sketch/cs">Draft to sketch</a>, <a href="../cs/Draft_Upgrade.html" title="Draft Upgrade/cs">Upgrade</a>, <a href="../cs/Draft_Downgrade.html" title="Draft Downgrade/cs">Downgrade</a>, <a href="../cs/Arch_Add.html" title="Arch Add/cs">Add component</a>, <a href="../cs/Arch_Remove.html" title="Arch Remove/cs">Remove component</a>, <a href="../index.php?title=Draft_OrthoArray/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Draft OrthoArray/cs (page does not exist)">Array</a>, <a href="../cs/Draft_PathArray.html" title="Draft PathArray/cs">Path array</a>, <a href="../index.php?title=Draft_PolarArray/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Draft PolarArray/cs (page does not exist)">Polar array</a>, <a href="../index.php?title=Draft_PointArray/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Draft PointArray/cs (page does not exist)">Point array</a>, <a href="../index.php?title=Arch_CutPlane/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Arch CutPlane/cs (page does not exist)">Cut with plane</a>, <a href="../index.php?title=Draft_Mirror/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Draft Mirror/cs (page does not exist)">Mirror</a>, <a href="../cs/BIM_Extrude.html" class="mw-redirect" title="BIM Extrude/cs">Extrude...</a>, <a href="../cs/BIM_Cut.html" class="mw-redirect" title="BIM Cut/cs">Difference</a>, <a href="../cs/BIM_Fuse.html" class="mw-redirect" title="BIM Fuse/cs">Union</a>, <a href="../cs/BIM_Common.html" class="mw-redirect" title="BIM Common/cs">Intersection</a></li></ul>
<hr>
<ul><li><b>Manage:</b> <a href="../index.php?title=BIM_Setup/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Setup/cs (page does not exist)">BIM Setup...</a>, <a href="../index.php?title=BIM_Views/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Views/cs (page does not exist)">Views manager</a>, <a href="../index.php?title=BIM_ProjectManager/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM ProjectManager/cs (page does not exist)">Manage project...</a>, <a href="../index.php?title=BIM_Windows/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Windows/cs (page does not exist)">Manage doors and windows...</a>, <a href="../index.php?title=BIM_IfcElements/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM IfcElements/cs (page does not exist)">Manage IFC elements...</a>, <a href="../index.php?title=BIM_IfcQuantities/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM IfcQuantities/cs (page does not exist)">Manage IFC quantities...</a>, <a href="../index.php?title=BIM_IfcProperties/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM IfcProperties/cs (page does not exist)">Manage IFC properties...</a>, <a href="../index.php?title=BIM_Classification/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Classification/cs (page does not exist)">Manage classification...</a>, <a href="../index.php?title=BIM_Layers/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Layers/cs (page does not exist)">Manage layers...</a>, <a href="../index.php?title=BIM_Material/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Material/cs (page does not exist)">Material</a>, <a href="../index.php?title=Arch_Schedule/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Arch Schedule/cs (page does not exist)">Schedule</a>, <a href="../index.php?title=BIM_Preflight/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Preflight/cs (page does not exist)">Preflight checks...</a>, <a href="../index.php?title=Draft_AnnotationStyleEditor/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Draft AnnotationStyleEditor/cs (page does not exist)">Annotation styles...</a></li></ul>
<hr>
<ul><li><b>Utils:</b> <a href="../index.php?title=BIM_TogglePanels/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM TogglePanels/cs (page does not exist)">Toggle bottom panels</a>, <a href="../index.php?title=BIM_Trash/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Trash/cs (page does not exist)">Move to Trash</a>, <a href="../index.php?title=BIM_WPView/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM WPView/cs (page does not exist)">Working Plane View</a>, <a href="../cs/Draft_SelectGroup.html" title="Draft SelectGroup/cs">Select group</a>, <a href="../index.php?title=Draft_Slope/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Draft Slope/cs (page does not exist)">Set slope</a>, <a href="../index.php?title=Draft_WorkingPlaneProxy/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Draft WorkingPlaneProxy/cs (page does not exist)">Create working plane proxy</a>, <a href="../index.php?title=Draft_AddConstruction/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Draft AddConstruction/cs (page does not exist)">Add to construction group</a>, <a href="../cs/Arch_SplitMesh.html" title="Arch SplitMesh/cs">Split Mesh</a>, <a href="../cs/Arch_MeshToShape.html" title="Arch MeshToShape/cs">Mesh to Shape</a>, <a href="../cs/Arch_SelectNonSolidMeshes.html" title="Arch SelectNonSolidMeshes/cs">Select non-manifold meshes</a>, <a href="../cs/Arch_RemoveShape.html" title="Arch RemoveShape/cs">Remove Shape from Arch</a>, <a href="../cs/Arch_CloseHoles.html" title="Arch CloseHoles/cs">Close Holes</a>, <a href="../index.php?title=Arch_MergeWalls/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Arch MergeWalls/cs (page does not exist)">Merge Walls</a>, <a href="../cs/Arch_Check.html" title="Arch Check/cs">Check</a>, <a href="../index.php?title=Arch_ToggleIfcBrepFlag/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Arch ToggleIfcBrepFlag/cs (page does not exist)">Toggle IFC Brep flag</a>, <a href="../index.php?title=Arch_ToggleSubs/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Arch ToggleSubs/cs (page does not exist)">Toggle subcomponents</a>, <a href="../cs/Arch_Survey.html" title="Arch Survey/cs">Survey</a>, <a href="../index.php?title=BIM_Diff/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Diff/cs (page does not exist)">IFC Diff</a>, <a href="../cs/BIM_IfcExplorer.html" title="BIM IfcExplorer/cs">IFC explorer</a>, <a href="../index.php?title=Arch_IfcSpreadsheet/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Arch IfcSpreadsheet/cs (page does not exist)">Create IFC spreadsheet...</a>, <a href="../index.php?title=BIM_ImagePlane/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM ImagePlane/cs (page does not exist)">Image plane</a>, <a href="../index.php?title=BIM_Unclone/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Unclone/cs (page does not exist)">Unclone</a>, <a href="../index.php?title=BIM_Rewire/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Rewire/cs (page does not exist)">Rewire</a>, <a href="../index.php?title=BIM_Glue/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Glue/cs (page does not exist)">Glue</a>, <a href="../index.php?title=BIM_Reextrude/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Reextrude/cs (page does not exist)">Reextrude</a>
<ul><li><b>Panel tools:</b> <a href="../index.php?title=Arch_Panel/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Arch Panel/cs (page does not exist)">Panel</a>, <a href="../index.php?title=Arch_Panel_Cut/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Arch Panel Cut/cs (page does not exist)">Panel Cut</a>, <a href="../index.php?title=Arch_Panel_Sheet/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Arch Panel Sheet/cs (page does not exist)">Panel Sheet</a>, <a href="../index.php?title=Arch_Nest/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Arch Nest/cs (page does not exist)">Nest</a></li>
<li><b>Structure tools:</b> <a href="../cs/Arch_Structure.html" title="Arch Structure/cs">Structure</a>, <a href="../index.php?title=Arch_StructuralSystem/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Arch StructuralSystem/cs (page does not exist)">Structural System</a>, <a href="../index.php?title=Arch_StructuresFromSelection/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Arch StructuresFromSelection/cs (page does not exist)">Multiple Structures</a></li>
<li><b>IFC tools:</b> <a href="../index.php?title=IFC_Diff/cs&amp;action=edit&amp;redlink=1.html" class="new" title="IFC Diff/cs (page does not exist)">IFC Diff...</a>, <a href="../index.php?title=IFC_Expand/cs&amp;action=edit&amp;redlink=1.html" class="new" title="IFC Expand/cs (page does not exist)">IFC Expand</a>, <a href="../index.php?title=IFC_MakeProject/cs&amp;action=edit&amp;redlink=1.html" class="new" title="IFC MakeProject/cs (page does not exist)">Make IFC project</a>, <a href="../index.php?title=IFC_UpdateIOS/cs&amp;action=edit&amp;redlink=1.html" class="new" title="IFC UpdateIOS/cs (page does not exist)">IfcOpenShell update</a></li>
<li><b>Nudge:</b> <a href="../index.php?title=BIM_Nudge_Switch/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Nudge Switch/cs (page does not exist)">Nudge Switch</a>, <a href="../index.php?title=BIM_Nudge_Up/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Nudge Up/cs (page does not exist)">Nudge Up</a>, <a href="../index.php?title=BIM_Nudge_Down/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Nudge Down/cs (page does not exist)">Nudge Down</a>, <a href="../index.php?title=BIM_Nudge_Left/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Nudge Left/cs (page does not exist)">Nudge Left</a>, <a href="../index.php?title=BIM_Nudge_Right/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Nudge Right/cs (page does not exist)">Nudge Right</a>, <a href="../index.php?title=BIM_Nudge_RotateLeft/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Nudge RotateLeft/cs (page does not exist)">Nudge Rotate Left</a>, <a href="../index.php?title=BIM_Nudge_RotateRight/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Nudge RotateRight/cs (page does not exist)">Nudge Rotate Right</a>, <a href="../index.php?title=BIM_Nudge_Extend/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Nudge Extend/cs (page does not exist)">Nudge Extend</a>, <a href="../index.php?title=BIM_Nudge_Shrink/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Nudge Shrink/cs (page does not exist)">Nudge Shrink</a></li></ul></li></ul>
<hr>
<ul><li><b>Additional:</b> <a href="../index.php?title=BIM_Preferences/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Preferences/cs (page does not exist)">Preferences</a>, <a href="../index.php?title=Fine-tuning/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Fine-tuning/cs (page does not exist)">Fine tuning</a>, <a href="../index.php?title=Import_Export_Preferences/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Import Export Preferences/cs (page does not exist)">Import Export Preferences</a>, <a href="../cs/Arch_IFC.html" title="Arch IFC/cs">IFC</a>, <a href="../cs/Arch_DAE.html" title="Arch DAE/cs">DAE</a>, <a href="../cs/Arch_OBJ.html" title="Arch OBJ/cs">OBJ</a>, <a href="../index.php?title=Arch_JSON/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Arch JSON/cs (page does not exist)">JSON</a>, <a href="../index.php?title=Arch_3DS/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Arch 3DS/cs (page does not exist)">3DS</a>, <a href="../index.php?title=Arch_SHP/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Arch SHP/cs (page does not exist)">SHP</a></li></ul></div>
    </div></div>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: #fefefe;"><span typeof="mw:File"><a href="../File/User_hub.png" class="mw-file-description"><img src="../File/User_hub.png" decoding="async" width="24" height="24"></a></span> <a href="../cs/User_hub.html" title="User hub/cs">User documentation</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid #aaaaaa; text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: #fefefe;">
<ul><li><b><a href="../cs/Getting_started.html" title="Getting started/cs">Getting started</a></b></li>
<li><b>Installation:</b> <a href="../cs/Download.html" title="Download/cs">Download</a>, <a href="../cs/Installing_on_Windows.html" title="Installing on Windows/cs">Windows</a>, <a href="../cs/Installing_on_Linux.html" title="Installing on Linux/cs">Linux</a>, <a href="../cs/Installing_on_Mac.html" title="Installing on Mac/cs">Mac</a>, <a href="../cs/Installing_additional_components.html" title="Installing additional components/cs">Additional components</a>, <a href="../index.php?title=Compile_on_Docker/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Compile on Docker/cs (page does not exist)">Docker</a>, <a href="../index.php?title=AppImage/cs&amp;action=edit&amp;redlink=1.html" class="new" title="AppImage/cs (page does not exist)">AppImage</a>, <a href="../index.php?title=Ubuntu_Snap/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Ubuntu Snap/cs (page does not exist)">Ubuntu Snap</a></li>
<li><b>Basics:</b> <a href="../cs/About_FreeCAD.html" title="About FreeCAD/cs">About FreeCAD</a>, <a href="../index.php?title=Interface/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Interface/cs (page does not exist)">Interface</a>, <a href="../cs/Mouse_navigation.html" title="Mouse navigation/cs">Mouse navigation</a>, <a href="../index.php?title=Selection_methods/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Selection methods/cs (page does not exist)">Selection methods</a>, <a href="../index.php?title=Object_name/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Object name/cs (page does not exist)">Object name</a>, <a href="../cs/Preferences_Editor.html" title="Preferences Editor/cs">Preferences</a>, <a href="../cs/Workbenches.html" title="Workbenches/cs">Workbenches</a>, <a href="../cs/Document_structure.html" title="Document structure/cs">Document structure</a>, <a href="../cs/Property.html" title="Property/cs">Properties</a>, <a href="../cs/Help_FreeCAD.html" title="Help FreeCAD/cs">Help FreeCAD</a>, <a href="../index.php?title=Donate/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Donate/cs (page does not exist)">Donate</a></li></ul>
<hr>
<ul><li><b>Help:</b> <a href="../cs/Tutorials.html" title="Tutorials/cs">Tutorials</a>, <a href="../cs/Video_tutorials.html" title="Video tutorials/cs">Video tutorials</a></li>
<li><b><a href="../cs/Workbenches.html" title="Workbenches/cs">Workbenches</a>:</b> <a href="../index.php?title=Std_Base/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Std Base/cs (page does not exist)">Std Base</a>, <a href="../cs/Assembly_Workbench.html" title="Assembly Workbench/cs">Assembly</a>, <a href="../index.php?title=BIM_Workbench/cs&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Workbench/cs (page does not exist)">BIM</a>, <a href="../cs/CAM_Workbench.html" title="CAM Workbench/cs">CAM</a>, <a href="../cs/Draft_Workbench.html" title="Draft Workbench/cs">Draft</a>, <a href="../cs/FEM_Workbench.html" title="FEM Workbench/cs">FEM</a>, <a href="../cs/Inspection_Workbench.html" title="Inspection Workbench/cs">Inspection</a>, <a href="../index.php?title=Material_Workbench/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Material Workbench/cs (page does not exist)">Material</a>, <a href="../cs/Mesh_Workbench.html" title="Mesh Workbench/cs">Mesh</a>, <a href="../cs/OpenSCAD_Workbench.html" title="OpenSCAD Workbench/cs">OpenSCAD</a>, <a href="../cs/Part_Workbench.html" title="Part Workbench/cs">Part</a>, <a href="../cs/PartDesign_Workbench.html" title="PartDesign Workbench/cs">PartDesign</a>, <a href="../cs/Points_Workbench.html" title="Points Workbench/cs">Points</a>, <a href="../cs/Reverse_Engineering_Workbench.html" title="Reverse Engineering Workbench/cs">Reverse Engineering</a>, <a href="../cs/Robot_Workbench.html" title="Robot Workbench/cs">Robot</a>, <a href="../cs/Sketcher_Workbench.html" title="Sketcher Workbench/cs">Sketcher</a>, <a href="../cs/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/cs">Spreadsheet</a>, <a href="../cs/Surface_Workbench.html" title="Surface Workbench/cs">Surface</a>, <a href="../cs/TechDraw_Workbench.html" title="TechDraw Workbench/cs">TechDraw</a>, <a href="../index.php?title=Testing/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Testing/cs (page does not exist)">Test Framework</a></li></ul>
<hr>
<ul><li><b><a href="../index.php?title=Addon/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Addon/cs (page does not exist)">Addons</a>:</b> <a href="../index.php?title=Std_AddonMgr/cs&amp;action=edit&amp;redlink=1.html" class="new" title="Std AddonMgr/cs (page does not exist)">Addon Manager</a>, <a href="../index.php?title=External_workbenches/cs&amp;action=edit&amp;redlink=1.html" class="new" title="External workbenches/cs (page does not exist)">External workbenches</a>, <a href="../cs/Scripting_and_macros.html" title="Scripting and macros/cs">Scripting and macros</a></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="../cs/User_hub.html" title="User hub/cs">User hub</a>, <a href="../cs/Power_users_hub.html" title="Power users hub/cs">Power users hub</a>, <a href="../cs/Developer_hub.html" title="Developer hub/cs">Developer hub</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20250613120114
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc, no&#8208;toc&#8208;conversion]
CPU time usage: 0.268 seconds
Real time usage: 0.328 seconds
Preprocessor visited node count: 669/1000000
Post&#8208;expand include size: 25395/2097152 bytes
Template argument size: 12103/2097152 bytes
Highest expansion depth: 5/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 2053/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   28.343      1 -total
 36.98%   10.480      1 Template:BIM_Tools_navi/cs
 25.36%    7.189      1 Template:TutorialInfo/cs
 18.28%    5.182      2 Template:Navigation_menu_2
 14.58%    4.133      1 Template:Userdocnavi/cs
 12.79%    3.626      2 Template:Clear
  6.37%    1.806      5 Template:Note
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:27071-0!canonical and timestamp 20250613120114 and revision id 1591303. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>