<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Manual/zh-cn</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="en" dir="ltr"><p>FreeCAD&#25163;&#20876;
</p><p>&#20026;&#20160;&#20040;FreeCAD&#25163;&#20876;&#20013;&#20250;&#27809;&#26377;&#20869;&#23481;&#21602;&#65311;&#25509;&#19979;&#26469;&#25105;&#20204;&#20250;&#23637;&#24320;&#20998;&#26512;&#36825;&#20010;&#38382;&#39064;&#65292;&#23545;&#20110;FreeCAD&#36719;&#20214;&#65292;&#30456;&#20449;&#22823;&#23478;&#37117;&#24456;&#29087;&#24713;&#65292;&#23545;&#20110;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20250;&#32473;&#20986;&#20197;&#19979;&#31572;&#26696;&#12290;
</p><p>FreeCAD &#25163;&#20876;&#20013;&#21487;&#33021;&#20986;&#29616;&#27809;&#26377;&#20869;&#23481;&#25110;&#20869;&#23481;&#32570;&#22833;&#30340;&#24773;&#20917;&#65292;&#20027;&#35201;&#19982;&#36719;&#20214;&#30340;&#24320;&#21457;&#29305;&#24615;&#12289;&#25991;&#26723;&#29983;&#25104;&#26426;&#21046;&#21644;&#32500;&#25252;&#31649;&#29702;&#31561;&#22240;&#32032;&#26377;&#20851;&#65292;&#20855;&#20307;&#22914;&#19979;&#65306;
</p><p>&bull;&#24320;&#21457;&#26356;&#26032;&#39057;&#32321;&#65288;yorikvanhavre.gitbooks.io&#65289;&#65306;FreeCAD &#26159;&#19968;&#27454;&#19981;&#26029;&#21457;&#23637;&#30340;&#36719;&#20214;&#65292;&#26032;&#21151;&#33021;&#21644;&#24037;&#20855;&#25345;&#32493;&#28155;&#21152;&#12290;&#25163;&#20876;&#20869;&#23481;&#26356;&#26032;&#21487;&#33021;&#36319;&#19981;&#19978;&#36719;&#20214;&#30340;&#24320;&#21457;&#36895;&#24230;&#65292;&#23548;&#33268;&#37096;&#20998;&#26032;&#29305;&#24615;&#26410;&#21450;&#26102;&#32534;&#20889;&#25991;&#26723;&#65292;&#25110;&#32773;&#21407;&#26377;&#25991;&#26723;&#22240;&#36719;&#20214;&#21151;&#33021;&#21464;&#26356;&#32780;&#21464;&#24471;&#36807;&#26102;&#12289;&#32570;&#22833;&#12290;
</p><p>&bull;&#25991;&#26723;&#29983;&#25104;&#26426;&#21046;&#22797;&#26434;&#65306;FreeCAD &#30001; C++ &#21644; Python &#20195;&#30721;&#28151;&#21512;&#32534;&#20889;&#65292;&#31649;&#29702;&#20004;&#31181;&#35821;&#35328;&#30340;&#25991;&#26723;&#36739;&#20026;&#22256;&#38590;&#12290;&#20854;&#20351;&#29992; Doxygen &#29983;&#25104;&#25991;&#26723;&#65292;&#20294; Doxygen &#37197;&#32622;&#22797;&#26434;&#65292;&#19988;&#20195;&#30721;&#31245;&#26377;&#25913;&#21160;&#65292;&#23601;&#21487;&#33021;&#23548;&#33268;&#25991;&#26723;&#37325;&#26032;&#32534;&#35793;&#26102;&#38388;&#36807;&#38271;&#65292;&#36825;&#20351;&#24471;&#23454;&#26102;&#27979;&#35797;&#21644;&#26356;&#26032;&#25991;&#26723;&#21464;&#24471;&#22256;&#38590;&#65292;&#23481;&#26131;&#36896;&#25104;&#25991;&#26723;&#32570;&#22833;&#25110;&#19981;&#20934;&#30830;&#12290;
</p><p>&bull;&#20869;&#23481;&#36716;&#25442;&#38382;&#39064;&#65288;github&#65289;&#65306;FreeCAD &#30340;&#25991;&#26723;&#31995;&#32479;&#22522;&#20110; Qt Assistant&#65292;&#30456;&#20851;&#25991;&#26723;&#26159;&#36890;&#36807;&#25235;&#21462;&#21644;&#36716;&#25442; FreeCAD &#32500;&#22522;&#39029;&#38754;&#29983;&#25104;&#30340;&#12290;&#36825;&#31181;&#26041;&#24335;&#22312;&#29256;&#26412;&#21457;&#24067;&#26102;&#25910;&#38598; HTML &#20869;&#23481;&#65292;&#36807;&#31243;&#32321;&#29712;&#65292;&#29983;&#25104;&#30340;&#25991;&#26723;&#24448;&#24448;&#26159;&#32500;&#22522;&#20869;&#23481;&#30340;&#31616;&#21270;&#29256;&#65292;&#19988;&#23481;&#26131;&#36807;&#26102;&#12290;
</p><p>&bull;&#35821;&#35328;&#29256;&#26412;&#38480;&#21046;&#65288;github&#65289;&#65306;&#30446;&#21069; FreeCAD &#25991;&#26723;&#20027;&#35201;&#20197;&#33521;&#25991;&#20026;&#20027;&#65292;&#32570;&#20047;&#22810;&#35821;&#35328;&#29256;&#26412;&#12290;&#36825;&#23545;&#20110;&#38750;&#33521;&#35821;&#29992;&#25143;&#26469;&#35828;&#65292;&#21487;&#33021;&#20250;&#24863;&#35273;&#26576;&#20123;&#20869;&#23481; &ldquo;&#32570;&#22833;&rdquo;&#65292;&#22240;&#20026;&#20182;&#20204;&#26080;&#27861;&#33719;&#21462;&#21040;&#29087;&#24713;&#35821;&#35328;&#30340;&#30456;&#20851;&#25991;&#26723;&#20449;&#24687;&#12290;
</p><p>&bull;&#25991;&#26723;&#32500;&#25252;&#22256;&#38590;&#65288;github&#65289;&#65306;FreeCAD &#25991;&#26723;&#20381;&#25176;&#20110; MediaWiki &#36719;&#20214;&#65292;&#35813;&#36719;&#20214;&#32500;&#25252;&#38590;&#24230;&#22823;&#65292;&#25968;&#25454;&#38590;&#20197;&#22791;&#20221;&#65292;&#25628;&#32034;&#21151;&#33021;&#34180;&#24369;&#65292;&#20027;&#39064;&#23450;&#21046;&#22797;&#26434;&#65292;&#36825;&#20123;&#22240;&#32032;&#37117;&#32473;&#25991;&#26723;&#30340;&#27491;&#24120;&#32500;&#25252;&#24102;&#26469;&#20102;&#25361;&#25112;&#65292;&#21487;&#33021;&#23548;&#33268;&#37096;&#20998;&#20869;&#23481;&#26410;&#33021;&#21450;&#26102;&#26356;&#26032;&#25110;&#20462;&#22797;&#65292;&#20986;&#29616;&#20869;&#23481;&#32570;&#22833;&#30340;&#24773;&#20917;&#12290;
</p><p>&#31038;&#21306;&#36129;&#29486;&#24046;&#24322;&#65306;FreeCAD &#25163;&#20876;&#30001;&#31038;&#21306;&#25104;&#21592;&#21327;&#20316;&#32534;&#20889;&#65288;freecad-documentation.netlify.app&#65289;&#12290;&#19981;&#21516;&#36129;&#29486;&#32773;&#30340;&#21442;&#19982;&#24230;&#21644;&#26102;&#38388;&#25237;&#20837;&#19981;&#21516;&#65292;&#21487;&#33021;&#23384;&#22312;&#26576;&#20123;&#37096;&#20998;&#26080;&#20154;&#36127;&#36131;&#32534;&#20889;&#25991;&#26723;&#30340;&#24773;&#20917;&#12290;&#21478;&#22806;&#65292;&#26032;&#21151;&#33021;&#30340;&#24320;&#21457;&#32773;&#21487;&#33021;&#19987;&#27880;&#20110;&#20195;&#30721;&#23454;&#29616;&#65292;&#26410;&#21450;&#26102;&#32534;&#20889;&#30456;&#20851;&#25991;&#26723;&#65292;&#20063;&#20250;&#36896;&#25104;&#25163;&#20876;&#20869;&#23481;&#19981;&#23436;&#25972;&#12290;
</p>
<!-- 
NewPP limit report
Cached time: 20251010061503
Cache expiry: 86400
Reduced expiry: false
Complications: []
CPU time usage: 0.003 seconds
Real time usage: 0.003 seconds
Preprocessor visited node count: 1/1000000
Post&#8208;expand include size: 0/2097152 bytes
Template argument size: 0/2097152 bytes
Highest expansion depth: 1/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 0/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    0.000      1 -total
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:393267-0!canonical and timestamp 20251010061503 and revision id 1659984. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>