<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Arch tutorial/de</span></h1><?xml encoding="UTF-8"><div class="mw-parser-output"><div class="mw-pt-languages noprint" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="de" dir="ltr">Deutsch</span></li>
<li><a href="../Arch_tutorial.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Arch tutorial (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/Arch_tutorial.html" class="mw-pt-progress mw-pt-progress--stub" title="Tutorial M&oacute;dulo de Arquitectura (12% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/Arch_tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Arch Tutoriel (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/Arch_tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Tutorial di Architettura (100% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Arch_tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Poradnik dla &#347;rodowiska pracy Architektura (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt-br/Arch_tutorial.html" class="mw-pt-progress mw-pt-progress--stub" title="Tutorial do M&oacute;dulo de Arquitetura (15% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../ro/Arch_tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Tutorial Atelierul Arch(itectur&#259;) (82% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><a href="../cs/Arch_tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Architektura V&yacute;ukov&yacute; program (81% translated)" lang="cs" dir="ltr">&#269;e&scaron;tina</a></li>
<li><a href="../ru/Arch_tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="&#1059;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082; &#1087;&#1086; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1085;&#1086;&#1084;&#1091; &#1084;&#1086;&#1076;&#1091;&#1083;&#1102; (83% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li>
<li><a href="../uk/Arch_tutorial.html" class="mw-pt-progress mw-pt-progress--stub" title="&#1055;&#1110;&#1076;&#1088;&#1091;&#1095;&#1085;&#1080;&#1082; Arch (2% translated)" lang="uk" dir="ltr">&#1091;&#1082;&#1088;&#1072;&#1111;&#1085;&#1089;&#1100;&#1082;&#1072;</a></li></ul></div>
<table class="fcinfobox wikitable ct" style="width: 230px; float: right; margin-left: 1em">
<tbody><tr>
<td class="ctTitle" style="font-weight: bold; font-size: 125%;"><span typeof="mw:File"><span><img src="../File/Freecad.svg" decoding="async" width="32" height="32"></span></span> Tutorium
</td></tr>
<tr>
<th class="ctOdd">Thema
</th></tr>
<tr>
<td class="ctEven">Modellierung
</td></tr>
<tr>
<th class="ctOdd">Niveau
</th></tr>
<tr>
<td class="ctEven">Fortgeschrittener Anf&auml;nger
</td></tr>
<tr>
<th class="ctOdd">Zeit zum Abschluss
</th></tr>
<tr>
<td class="ctEven"><i>Not provided</i>
</td></tr>
<tr>
<th class="ctOdd">Autoren
</th></tr>
<tr>
<td class="ctEven"><a href="../User;Yorik.html" title="User:Yorik">Yorik</a>
</td></tr>
<tr>
<th class="ctOdd">FreeCAD-Version
</th></tr>
<tr>
<td class="ctEven">0.14
</td></tr>
<tr>
<th class="ctOdd">Beispieldateien
</th></tr>
<tr>
<td class="ctEven"><i>None</i>
</td></tr>
<tr>
<th class="ctOdd">Siehe auch
</th></tr>
<tr>
<td class="ctEven"><i>None</i>
</td></tr>
<tr>
<td class="ctToc"><br><meta property="mw:PageProp/toc">
</td></tr></tbody></table>
<p><span typeof="mw:File"><a href="../File/Arch_tutorial_00.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_00.jpg" decoding="async" width="600" height="312"></a></span>
</p><p><span id="Introduction"></span>
</p>
<h2><span class="mw-headline" id="Einleitung">Einleitung</span></h2>
<p>Dieses Tutorial zeigt Ihnen die Grundlagen f&uuml;r das Arbeiten mit dem Arbeitsbereich <a href="../de/Arch_Workbench.html" title="Arch Workbench/de">Arch</a>. Ich werde versuchen alles so einfach zu beschreiben, sodass keine Vorkenntnisse in FreeCAD notwendig sind. Vorliegende Erfahrungen mit 3D oder <a rel="nofollow" class="external text" href="https://de.wikipedia.org/wiki/Building_Information_Modeling">Geb&auml;udedatenmodellierung</a> sind jedoch von Vorteil. Unabh&auml;ngig davon sollten Sie bei Bedarf weitere Informationen &uuml;ber FreeCAD im dazugeh&ouml;rigen <a href="../de/Main_Page.html" title="Main Page/de">Wiki</a> nachschlagen. Besonders wichtig ist die Seite <a href="../de/Getting_started.html" title="Getting started/de">Erste Schritte</a>, die sich FreeCAD-Anf&auml;nger unbedingt durchlesen sollten. Weiterhin empfehlenswert sind die <a href="../de/Tutorials.html" title="Tutorials/de">Tutorien</a> und die dazu passenden Videos auf <a rel="nofollow" class="external text" href="http://www.youtube.com/results?search_query=freecad">Youtube</a>.
</p><p>Der Zweck des Arbeitsbereichs <a href="../de/Arch_Workbench.html" title="Arch Workbench/de">Arch</a> ist es, alle notwendigen Arbeitsschritte f&uuml;r die <a rel="nofollow" class="external text" href="https://de.wikipedia.org/wiki/Building_Information_Modeling">Geb&auml;udedatenmodellierung</a> in FreeCAD zusammenzufassen. Da die Software momentan noch in der Entwicklungsphase ist, ist das Angebot an Werkzeugen im Vergleich zu kommerziellen Alternativen wie <a rel="nofollow" class="external text" href="https://de.wikipedia.org/wiki/Revit">Revit</a> oder <a rel="nofollow" class="external text" href="https://de.wikipedia.org/wiki/ArchiCAD">ArchiCAD</a> kleiner. Andererseits ist FreeCAD f&uuml;r einen gr&ouml;&szlig;eren Aufgabenbereich als diese Programme nutzbar, was beim Arbeiten mit dem Arbeitsbereich <a href="../de/Arch_Workbench.html" title="Arch Workbench/de">Arch</a> einige n&uuml;tzliche M&ouml;glichkeiten mit sich bringt, die klassische BIM-Programme nur selten bieten k&ouml;nnen.
</p><p>Im Folgenden sind einige Merkmale des Arbeitsbereichs <a href="../de/Arch_Workbench.html" title="Arch Workbench/de">Arch</a> gelistet, die nur selten in anderen BIM-Programmen zu finden sind:
</p>
<ul><li>Architekturobjekte sind stets Festk&ouml;rper. Dies ist in Hinsicht des streng technischen Hintergrundes von FreeCAD sehr wichtig. Bool'sche Operationen werden wesentlich fehlerfreier ausgef&uuml;hrt. Dies ist auch in Bezug auf Schnitterstellung ein wichtiger Punkt, da 3D-Objekte durch 2D-Fl&auml;chen geschnitten werden.</li></ul>
<ul><li>Architektonische Objekte k&ouml;nnen grunds&auml;tzlich jede beliebige Form haben. W&auml;nde m&uuml;ssen nicht vertikal sein und Decken m&uuml;ssen nicht wie welche aussehen. Jeder beliebige Volumenk&ouml;rper kann ein architektonisches Objekt sein. Sehr komplexe Dinge, die in anderen BIM Programmen normalerweise nur schwer zu beschreiben sind, z.B. eine Bodenplatte, die sich nach oben kr&uuml;mmt und in die Wand &uuml;bergeht, stellen in FreeCAD kein besonderes Problem dar.</li></ul>
<ul><li>Ihnen stehen die gesamten M&ouml;glichkeiten von FreeCAD zur Verf&uuml;gung. Sie k&ouml;nnen Ihre Objekte in jedem Arbeitsbereich von FreeCAD erstellen (z.B. <a href="../de/PartDesign_Workbench.html" title="PartDesign Workbench/de">PartDesign</a>) und hinterher in Architekturobjekte konvertieren. Das Objekt beh&auml;lt dabei seine Modellierungsgeschichte und seine Eigenschaften k&ouml;nnen nach wie vor ge&auml;ndert werden. Der Arbeitsbereich <a href="../de/Arch_Workbench.html" title="Arch Workbench/de">Arch</a> erbt zudem viele Funktionalit&auml;ten des Arbeitsbereichs <a href="../de/Draft_Workbench.html" title="Draft Workbench/de">Draft</a>, wie z.B. <a href="../de/Draft_Snap.html" title="Draft Snap/de">Draft Snap</a> oder <a href="../de/Draft_SelectPlane.html" title="Draft SelectPlane/de">W&auml;hle Ebene</a>.</li></ul>
<ul><li>Der Arbeitsbereich <a href="../de/Arch_Workbench.html" title="Arch Workbench/de">Arch</a> unterst&uuml;tzt auch Modelle aus <a href="../de/Mesh_Workbench.html" title="Mesh Workbench/de">Polygonnetzen</a>. Sie k&ouml;nnen das gew&uuml;nschte Modell in einer 3D-Grafiksoftware, die mit Polygonnetzen arbeitet (z.B. <a rel="nofollow" class="external text" href="https://de.wikipedia.org/wiki/Blender_%28software%29">Blender</a> oder <a rel="nofollow" class="external text" href="https://de.wikipedia.org/wiki/Sketchup">SketchUp</a>), erstellen und hinterher in FreeCAD importieren. Wenn das Modell sorgf&auml;ltig erstellt wurde und keine &Uuml;berschneidungen von 3D-K&ouml;rpern aufweist, dann ist nur ein Klick notwendig, um daraus ein Architekturobjekt zu erzeugen.</li></ul>
<p>Zum momentanen Zeitpunkt, zu dem ich das Tutorial schreibe, besitzen FreeCAD und auch der Bereich <a href="../de/Arch_Workbench.html" title="Arch Workbench/de">Arch</a> einige Einschr&auml;nkungen. An den meisten davon wird gearbeitet und sie werden wohl in der Zukunft verschwinden.
</p>
<ul><li>FreeCAD ist keine 2D-Anwendung, sondern wurde f&uuml;r 3D gemacht. Es gibt zwar in den Arbeitsbereichen <a href="../de/Draft_Workbench.html" title="Draft Workbench/de">Draft</a> und <a href="../de/Sketcher_Workbench.html" title="Sketcher Workbench/de">Sketcher</a> eine vern&uuml;nftige Menge an Werkzeugen f&uuml;r das Zeichnen und Bearbeiten von zweidimensionalen Objekten, doch das Programm wurde nicht f&uuml;r die Verarbeitung von sehr gro&szlig;en (und manchmal schlecht gezeichneten) zweidimensionalen CAD-Dateien ausgelegt. Im Normalfall k&ouml;nnen solche Dateien zwar mit FreeCAD ge&ouml;ffnet werden, aber man sollte dabei besser keine hohe Leistungsf&auml;higkeit des Programms erwarten. Sie wurden gewarnt.</li></ul>
<ul><li>Momentan keine Unterst&uuml;tzung von Materialien. FreeCAD wird irgendwann ein vollst&auml;ndiges System von <a href="../Material.html" title="Material">Materialien</a> bekommen, das die Definition von komplexen Materialien mit all ihren Eigenschaften erlaubt. Der <a href="../de/Arch_Workbench.html" title="Arch Workbench/de">Arch-Arbeitsbereich</a> wird diese nat&uuml;rlich auch verwenden k&ouml;nnen, wenn es soweit ist.</li></ul>
<ul><li>Nur eingeschr&auml;nkte Unterst&uuml;tzung des offenen Standards <a rel="nofollow" class="external text" href="http://en.wikipedia.org/wiki/Industry_Foundation_Classes">IFC</a>. Die dazugeh&ouml;rigen IFC-Dateien lassen sich zwar schon <a href="../de/Arch_IFC.html" title="Arch IFC/de">importieren</a>, wenn <a rel="nofollow" class="external text" href="http://ifcopenshell.org">IfcOpenShell</a> auf dem PC installiert ist, aber das Exportieren wird momentan offiziell noch nicht unterst&uuml;tzt. Die Entwickler von FreeCAD und IfcOpenShell arbeiten gemeinsam daran, sodass eine vollst&auml;ndige Unterst&uuml;tzung in der Zukunft zu erwarten ist.</li></ul>
<ul><li>Die meisten Werkzeuge im Arbeitsbereich <i>Arch</i> sind noch in Entwicklung. Deshalb k&ouml;nnen viele der Werkzeuge zum automatischen Generieren von komplexen Strukturen, wie z.B. <a href="../de/Arch_Roof.html" title="Arch Roof/de">Arch Roof</a> oder <a href="../de/Arch_Stairs.html" title="Arch Stairs/de">Arch Treppe</a>, bislang nur bestimmte Objekte erzeugen. Andere Werkzeuge mit Voreinstellungen, z.B. <a href="../de/Arch_Structure.html" title="Arch Structure/de">Arch Struktur</a> oder <a href="../de/Arch_Window.html" title="Arch Window/de">Arch Fenster</a>, bieten bisher nur wenige Voreinstellungen zur Auswahl. Der Umfang dieser Werkzeuge wird mit der Zeit sicherlich noch wachsen.</li></ul>
<ul><li><a href="../Units.html" title="Units">Einheiten</a> werden noch in FreeCAD implementiert, was die Arbeit mit jeder beliebigen Einheit erm&ouml;glichen wird. Momentan ist die Implementierung jedoch noch nicht abgeschlossen und der Arbeitsbereich <i>Arch</i> unterst&uuml;tzt sie noch nicht. Die Arbeit geschieht also einheitenlos.</li></ul>
<div class="note"><b>FreeCAD Version 0.14 oder neuer erfordert</b>
<p>Beim Erstellen dieses Tutorials wurde <a href="../Release_notes_0.14.html" title="Release notes 0.14">FreeCAD version 0.14</a> verwendet. Sie werden entweder diese oder eine neuere Version des Programms ben&ouml;tigen, um alle Schritte des Tutorials nachvollziehen zu k&ouml;nnen.
</p>
</div>
<p><br>
<span id="Typical_workflows"></span>
</p>
<h2><span class="mw-headline" id="Typische_Vorgehensweise">Typische Vorgehensweise</span></h2>
<p>Der Arbeitsbereich <a href="../de/Arch_Workbench.html" title="Arch Workbench/de">Arch</a> ist haupts&auml;chlich f&uuml;r zwei Vorgehensweisen ausgelegt:
</p>
<ul><li>Erstellen Sie das Modell mit einem schnelleren, auf Polygonnetzen basierendem Programm (z.B. <a rel="nofollow" class="external text" href="https://de.wikipedia.org/wiki/Blender_%28software%29">Blender</a> oder <a rel="nofollow" class="external text" href="https://de.wikipedia.org/wiki/Sketchup">SketchUp</a>) und importieren Sie das Modell anschlie&szlig;end in FreeCAD, um Pl&auml;ne zu extrahieren und Schnittansichten zu erstellen. FreeCAD wurde f&uuml;r eine hochpr&auml;zise Modellierung ausgelegt, wie sie im Architekturbereich nur selten notwendig ist, sodass die Modellierung von Architekturobjekten unter Umst&auml;nden langsam und schwerlich verl&auml;uft. Aus diesem Grund hat eine Vormodellierung mit 3D-Grafiksoftware mitunter gro&szlig;e Vorteile. Ich habe dies in <a rel="nofollow" class="external text" href="http://yorik.uncreated.net/guestblog.php?2012=180">diesem Artikel</a> in meinem Blog beschrieben. Wenn Sie wirklich pr&auml;zise modellieren wollen (sauber, Volumenk&ouml;rper, ohne &Uuml;berschneidungen der Polygonnetze), dann wird Ihnen diese Vorgehensweise dieselbe Pr&auml;zision und Geschwindigkeit bringen wie die andere.</li></ul>
<ul><li>Erstellen des Modells direkt in FreeCAD. Diese Vorgehensweise wird in diesem Tutorial vorgestellt. Dabei benutzen wir haupts&auml;chlich die drei Arbeitsbereiche <a href="../de/Arch_Workbench.html" title="Arch Workbench/de">Arch</a>, <a href="../de/Sketcher_Workbench.html" title="Sketcher Workbench/de">Sketcher</a> und <a href="../de/Draft_Workbench.html" title="Draft Workbench/de">Draft</a>. Die Werkzeuge von <i>Draft</i> sind bereits in <i>Arch</i> integriert, sodass kein Wechsel des Arbeitsbereichs notwendig ist. Es ist in diesem Fall zweckdienlich, eine eigene Werkzeugleiste im Arbeitsbereich <i>Arch</i> zu erstellen (Men&uuml;: <b>Werkzeuge &rarr; Benutzerdefiniert</b>) und die h&auml;ufiger verwendeten Werkzeuge des Arbeitsbereichs <i>Sketcher</i> hinzuzuf&uuml;gen. Meine benutzerdefinierte Werkzeugleiste sieht wie folgt aus:</li></ul>
<p><span class="mw-default-size" typeof="mw:File"><a href="../File/Arch_tutorial_01.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_01.jpg" decoding="async" width="1024" height="658"></a></span>
</p><p>In diesem Tutorial werden wir ein Haus dreidimensional modellieren, basierend auf zweidimensionalen Zeichnungen, die wir aus dem Internet herunterladen.
</p><p><span id="Preparation"></span>
</p>
<h2><span class="mw-headline" id="Vorbereitung">Vorbereitung</span></h2>
<p>Um Zeit zu sparen, werden wir das Projekt nicht von Grund auf neu erstellen, sondern ein bereits existierendes Beispielprojekt verwenden. Ich habe daf&uuml;r das wundervolle Haus des ber&uuml;hmten Architekten <a rel="nofollow" class="external text" href="http://en.wikipedia.org/wiki/Jo%C3%A3o_Batista_Vilanova_Artigas">Vilanova Artigas</a> ausgew&auml;hlt, weil ich in der N&auml;he davon lebe und weil es ein wunderbares Beispiel f&uuml;r die erstaunliche modernistische Architektur S&atilde;o Paulos ist. Die dazugeh&ouml;rigen .dwg-Dateien sind in gepackter Form <a rel="nofollow" class="external text" href="http://www.bibliocad.com/library/second-house-vilanova-artigas_72926#">frei verf&uuml;gbar</a> (erfordert kostenlose Registrierung). Alternativ kann eine dxf-Version davon <a rel="nofollow" class="external text" href="http://yorik.uncreated.net/scripts/artigas.dxf">hier</a> heruntergeladen werden.
</p><p>Wir werden die 2D-Zeichnungen in der oben verlinkten dwg-Datei als Basis f&uuml;r unser Modell nutzen. Nach dem Entpacken der Datei sollte die resultierende dwg-Datei mit einer passenden Software wie z.B. <a rel="nofollow" class="external text" href="http://www.3ds.com/products-services/draftsight/overview/">DraftSight</a> ge&ouml;ffnet werden. Alternativ kann die Datei auch mit der Software <a rel="nofollow" class="external text" href="https://www.opendesign.com/guestfiles/oda_file_converter">ODA File Converter</a> in eine dxf-Datei umgewandelt werden. Wenn der Converter installiert ist und sein Pfad in den Einstellungen von <i>Arch</i> richtig konfiguriert ist, dann lassen sich mit FreeCAD dwg-Dateien auch <a href="../de/Draft_DXF.html" title="Draft DXF/de">direkt importieren</a>. In der Regel ist es jedoch besser, die Dateien zuerst mit einer 2D-CAD-Software zu &ouml;ffnen und von unn&ouml;tigen Details zu bereinigen.
</p><p>Hier habe ich alle Detailzeichnungen, &Uuml;berschriften und Seitenlayouts entfernt, habe ungenutzte Instanzen beseitigt, die Abschnitte passend zur realen Lage neu angeordnet und alles zum Nullpunkt (0,0) verschoben. Danach kann die Datei ziemlich schnell von FreeCAD ge&ouml;ffnet werden. Pr&uuml;fen Sie die verschiedenen Optionen in <b>Bearbeiten &rarr; Einstellungen &rarr; Import/Export &rarr; DXF/DWG</b>, denn diese beeinflussen wie und wie schnell FreeCAD solche Dateien importiert.
</p><p>So sah die Datei nach dem anschlie&szlig;enden &Ouml;ffnen in FreeCAD aus. Ich habe zudem die Dicke der W&auml;nde der Gruppe "muros" ge&auml;ndert und einige der T&uuml;ren mit dem Werkzeug <a href="../de/Draft_Scale.html" title="Draft Scale/de">Scale</a> umgedreht, weil diese mit der falschen X-Skalierung importiert wurden.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../File/Arch_tutorial_02.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_02.jpg" decoding="async" width="1024" height="445"></a></span>
</p><p>Die <a href="../de/Draft_DXF.html" title="Draft DXF/de">Importfunktion</a> f&uuml;r dxf-Dateien, die auch beim Importieren von dwg-Dateien zur Anwendung kommt, gruppiert die importierten Objekte nach Ebenen. Es gibt zwar keine Ebenen in FreeCAD, aber es gibt <a href="../de/Std_Group.html" title="Std Group/de">Gruppen</a>. <a href="../de/Std_Group.html" title="Std Group/de">Gruppen</a> bieten eine &auml;hnliche Form der Organisation von Objekten, haben jedoch keine spezifischen Eigenschaften, die auf alle enthaltenen Objekte angewandt werden (wie bei Ebenen in <a rel="nofollow" class="external text" href="https://de.wikipedia.org/wiki/AutoCAD">AutoCAD</a>). Gruppen lassen sich jedoch innerhalb anderer Gruppen platzieren, was sehr hilfreich sein kann. Was wir nun als Erstes tun m&ouml;chten, ist das Erstellen einer neuen <a href="../de/Std_Group.html" title="Std Group/de">Gruppe</a> im <a href="../de/Document_structure.html" title="Document structure/de">Modellbaum</a>, indem wir per Rechtsklick das Dokument "artigas" anklicken und dann auf <i>Gruppe erstellen</i> klicken. Die neue Gruppe sollte in "base 2D plans" umbenannt werden und alle anderen Gruppen im Modellbaum sollte in diese Gruppe hinein verschoben werden.
</p><p><span id="Building_the_walls"></span>
</p>
<h2><span id="W.C3.A4nde_aufbauen"></span><span class="mw-headline" id="W&auml;nde_aufbauen">W&auml;nde aufbauen</span></h2>
<p>Ebenso wie die meisten anderen Objekte im Arbeitsbereich <a href="../de/Arch_Workbench.html" title="Arch Workbench/de">Arch</a> k&ouml;nnen auch <a href="../de/Arch_Wall.html" title="Arch Wall/de">W&auml;nde</a> mit Hilfe vieler anderer Objekte erstellt werden: <a href="../de/Draft_Line.html" title="Draft Line/de">Linien</a>, <a href="../de/Draft_Wire.html" title="Draft Wire/de">Polylinien</a>, <a href="../de/Sketcher_Workbench.html" title="Sketcher Workbench/de">Skizzen</a>, Oberfl&auml;chen oder Festk&ouml;rper (oder auch von Grund auf, d.h. durch Angabe von H&ouml;he, Breite und L&auml;nge). Die resultierende Geometrie der Wand h&auml;ngt von der Geometrie der eben genannten Hilfsobjekte und ihren Eigenschaften wie z.B. Breite und H&ouml;he ab. Wie man sich wohl denken kann, wird eine Wand, die auf einer Linie basiert, diese Linie f&uuml;r die Ausrichtung nutzen, w&auml;hrend eine Wand, die auf einer Fl&auml;che basiert, diese Fl&auml;che als Grundfl&auml;che verwendet. Bei Festk&ouml;rpern als Hilfsmittel nimmt die Wand die Form des Festk&ouml;rpern an. Folglich k&ouml;nnen W&auml;nde jede beliebige Form annehmen.
</p><p>Es gibt in FreeCAD mehrere m&ouml;gliche Strategien zum Konstruieren von W&auml;nden. Eine davon ist es, alle vorgesehenen W&auml;nde zun&auml;chst mit dem Werkzeug <a href="../de/Sketcher_Workbench.html" title="Sketcher Workbench/de">Sketcher</a> zu zeichnen und dann ein einzelnes, gro&szlig;es Wandobjekt daraus zu erstellen. Dies funktioniert zwar, hat aber den Nachteil, dass alle W&auml;nde dieselbe Wandst&auml;rke (Dicke) haben werden. Alternativ kann jede Wand einzeln skizziert und umgewandelt werden. Am besten ist jedoch ein Mittelweg: F&uuml;r jede Art von Wand eine <a href="../de/Draft_Wire.html" title="Draft Wire/de">Polylinie</a> zeichnen und in ein Wandobjekt umwandeln. Diesen Weg werden wir im Folgenden nehmen.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../File/Arch_tutorial_03.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_03.jpg" decoding="async" width="1024" height="412"></a></span>
</p><p>Wie Sie in der Abbildung sehen k&ouml;nnen, habe ich Betonw&auml;nde rot (<a rel="nofollow" class="external text" href="http://www.google.com/search?tbm=isch&amp;q=casa+artigas">Vergleichsbilder</a>), die &auml;u&szlig;eren Ziegelw&auml;nde gr&uuml;n und die Innenw&auml;nde blau gezeichnet. Die W&auml;nde schneiden dabei die T&uuml;ren, weil diese erst im Nachhinein eingef&uuml;gt werden. W&auml;nde k&ouml;nnen au&szlig;erdem auch links- oder rechtsb&uuml;ndig oder mittig auf ihrer Basislinie platziert werden, sodass es nicht wichtig ist, auf welcher Seite man die Basislinie zeichnet. Ich habe mich au&szlig;erdem bem&uuml;ht, &Uuml;berschneidungen der Linien bestm&ouml;glich zu vermeiden, weil unser Modell damit sauberer werden wird. Wir werden uns sp&auml;ter nochmal mit &Uuml;berschneidungen besch&auml;ftigen.
</p><p>Wenn dies erledigt ist, sollten alle erstellten Linien in einer <a href="../de/Std_Group.html" title="Std Group/de">Gruppe</a> abgelegt werden. Anschlie&szlig;end sollten alle Linien gleichen Typs bei gedr&uuml;ckter Strg-Taste ausgew&auml;hlt werden und das Werkzeug <a href="../de/Arch_Wall.html" title="Arch Wall/de">Wand</a> verwendet werden. Hinterher m&uuml;ssen noch die Wandst&auml;rken korrigiert werden (Au&szlig;enw&auml;nde: 25 cm, Innenw&auml;nde: 15 cm) und einige Ausrichtungen korrigiert werden. Das Ergebnis sollte wie folgt aussehen:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../File/Arch_tutorial_04.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_04.jpg" decoding="async" width="1024" height="408"></a></span>
</p><p>Wir h&auml;tten unsere W&auml;nde auch von Grund auf erstellen k&ouml;nnen. Wenn Sie den <a href="../de/Arch_Wall.html" title="Arch Wall/de">Wand</a>-Button ohne gew&auml;hltes Objekt dr&uuml;cken, k&ouml;nnen Sie auf dem Bildschirm zwei Punkte anklicken, um eine Wand zu zeichnen. Unter der Haube allerdings wird das Wand-Werkzeug eine Linie zeichnen und eine Wand darauf bauen. In diesem Fall fand ich es didaktischer, Ihnen zu zeigen, wie die Dinge arbeiten.
</p><p>Haben Sie bemerkt, dass ich gro&szlig;en Wert darauf gelegt habe, dass sich die W&auml;nde nicht kreuzen? Dies wird uns sp&auml;ter einige Kopfschmerzen ersparen, wenn wir zum Beispiel unsere Arbeit an andere Anwendungen exportieren, die so etwas nicht m&ouml;gen. Ich habe nur einen Schnittpunkt, wo ich zu faul war, zwei kleine Liniensegmente zu zeichnen und stattdessen eine gro&szlig;e Polygonzugkreuzung gezeichnet habe. Das muss korrigiert werden. Gl&uuml;cklicherweise haben alle Arch-Objekte eine gro&szlig;artige Eigenschaft: Sie k&ouml;nnen eins mit einem anderen verbinden. Dabei werden ihre Geometrien miteinander vereint, sie sind aber immer noch unabh&auml;ngig voneinander &auml;nderbar. Um eine der kreuzenden W&auml;nde mit der anderen zu verbinden, w&auml;hlen Sie einfach eine, dann die andere bei gedr&uuml;ckter <span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px;">Strg</span>-Taste und w&auml;hlen das <a href="../de/Arch_Add.html" title="Arch Add/de">Komponente hinzuf&uuml;gen</a>-Werkzeug:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../File/Arch_tutorial_05.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_05.jpg" decoding="async" width="1024" height="414"></a></span>
</p><p>Links sind die beiden sich kreuzenden W&auml;nde, rechts das Ergebnis nach dem Hinzuf&uuml;gen der einen zu der anderen.
</p>
<div class="note"><b>Eine wichtige Anmerkung zu parametrischen Objekten</b>
<p>Etwas ist bereits jetzt zu ber&uuml;cksichtigen. Wie Sie sehen, ist in FreeCAD alles parametrisch: Unsere neue "vereinigte" Wand besteht aus zwei W&auml;nden, jede basierend auf einer Grundlinie. Wenn Sie diese in der <a href="../Document_structure.html" title="Document structure">Baumansicht</a> aufklappen, sehen Sie die ganzen Abh&auml;ngigkeiten. Wie Sie sich vorstellen k&ouml;nnen, kann dieses kleine Spiel schnell sehr komplex werden. Wenn Sie bereits mit dem <a href="../de/Sketcher_Workbench.html" title="Sketcher Workbench/de">Skizzen-Arbeitsbereich</a> gearbeitet haben, dann h&auml;tten Sie die Grundlinien vermutlich mit beschr&auml;nkten Linien gezeichnet. Diese ganze Komplexit&auml;t hat ihren Preis: die Anzahl der durchzuf&uuml;hrenden Berechnungen w&auml;chst exponentiell, wenn FreeCAD Ihre Modellgeometrie aktuell halten will. Also denken Sie daran, auf unn&ouml;tige Komplexit&auml;t zu verzichten, wenn es nicht notwendig ist. Halten Sie eine gute Balance zwischen einfachen und komplexen Objekten und benutzen Sie letztere in den F&auml;llen, wo Sie diese wirklich ben&ouml;tigen.
</p>
</div>
<p><br>
Ich h&auml;tte beispielsweise alle meine obigen Grundlinien zeichnen k&ouml;nnen, ohne mich um Kreuzungen zu k&uuml;mmern, und dies sp&auml;ter mit dem <a href="../de/Arch_Add.html" title="Arch Add/de">Komponente hinzuf&uuml;gen</a>-Werkzeug reparieren k&ouml;nnen. Allerdings h&auml;tte ich die Komplexit&auml;t meines Modells sehr erh&ouml;ht, ohne etwas zu gewinnen. Es ist also besser, es gleich von Anfang an richtig zu machen und sie aus sehr einfachen Teilen der Geometrie zu erstellen.
</p><p>Nachdem unsere W&auml;nde nun in Ordnung sind, m&uuml;ssen wir ihre H&ouml;he anheben, bis sie das Dach schneiden. Weil das nicht automatisch passiert, wenn Wandobjekte auf D&auml;cher treffen (das wird irgendwann in der Zukunft m&ouml;glich sein), werden wir ein "Dummy"-Objekt erstellen, das der Dachform folgt, das dann von unseren W&auml;nden subtrahiert wird.
</p><p>Beim Blick auf unsere 2D-Zeichnungen sehen wir, dass der h&ouml;chste Punkt des Daches 5,60 m &uuml;ber dem Boden ist. Deshalb werden wir unseren W&auml;nden eine H&ouml;he von 6 m geben, um sicherzustellen, dass sie von unserem Dummy-Dach-Objekt abgeschnitten werden. "Warum 6 m und nicht 5,60 m?" werden Sie vielleicht fragen. Wenn Sie bereits mit Boole'schen Operationen (Vereinigung, Differenz, Schnittmenge) gearbeitet haben, dann wissen Sie, dass diese Operationen "Face-to-Face"-Situationen nicht besonders m&ouml;gen. Sie ziehen klar und eindeutig kreuzende Objekte vor. Mit dem L&auml;ngen&uuml;berschuss erreichen wir das.
</p><p>Um die H&ouml;hen unserer W&auml;nde zu ver&auml;ndern, w&auml;hlen Sie alle (vergessen Sie nicht die eine, die wir zur anderen hinzugef&uuml;gt haben) in der Baumansicht und &auml;ndern Sie den Wert der "Height"-Eigenschaft.
</p><p>Bevor wir das Dach machen und die W&auml;nde abschneiden k&ouml;nnen, m&uuml;ssen wir noch die &uuml;brigen Objekte erstellen, die abzuschneiden sind: die W&auml;nde des obigen Studios und die S&auml;ulen. Die W&auml;nde werden auf dem h&ouml;her gelegenen Grundriss auf die gleiche Art gemacht wie vorher, aber auf einer H&ouml;he von 2,60 m. Damit also die Oberkante auf 6 m ist, bekommen sie eine H&ouml;he von 3,40 m. Sobald dies getan ist, werden wir unsere W&auml;nde auf 2,60 m anheben: W&auml;hlen Sie beide, wechseln in die Frontansicht (Ansicht &rarr; Standardansichten &rarr; Vorne), dr&uuml;cken den <a href="../de/Draft_Move.html" title="Draft Move/de">Verschieben</a>-Button, w&auml;hlen einen ersten Punkt, geben dann 0, 2,6, 0 als Koordinaten ein und dr&uuml;cken Enter. Ihre Objekte sind nun 2,60 m hoch gesprungen:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../File/Arch_tutorial_06.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_06.jpg" decoding="async" width="1024" height="377"></a></span>
</p>
<div class="note"><b>Zu Koordinaten</b>
<p>Die <a href="../de/Draft_Workbench.html" title="Draft Workbench/de">Draft</a>-Objekte und auch die meisten der <a href="../de/Arch_Workbench.html" title="Arch Workbench/de">Arch</a>-Objekte folgen einem Draft-System genannt <a href="../de/Draft_SelectPlane.html" title="Draft SelectPlane/de">Ebene markieren</a>. Dieses System definiert eine 2D-Ebene, auf der die n&auml;chsten Operationen stattfinden. Wenn Sie keine angeben, dann richtet sich die Arbeitsebene nach der aktuellen Ansicht. Deshalb haben wir zur Frontansicht gewechselt, und Sie haben gesehen, dass wir Verschiebungen in der X-Richtung von 0 und der Y-Richtung von 2,6 angegeben haben. Wir h&auml;tten auch mit dem <a href="../de/Draft_SelectPlane.html" title="Draft SelectPlane/de">Ebene markieren</a>-Werkzeug die Arbeitsebene auf dem Boden belassen und dort als Verschiebung 0, 0, 2,6 (X, Y, Z) angeben k&ouml;nnen.
</p>
</div>
<p><br>
Jetzt verschieben wir die W&auml;nde horizontal an ihre richtige Position. Da wir Punkte zum Einrasten haben, ist es einfacher: W&auml;hlen Sie beide W&auml;nde, dr&uuml;cken das <a href="../de/Draft_Move.html" title="Draft Move/de">Verschieben</a>-Werkzeug und bewegen sie von einem Punkt zum anderen:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../File/Arch_tutorial_07.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_07.jpg" decoding="async" width="1024" height="531"></a></span>
</p><p>Schlie&szlig;lich habe ich die Farbe einiger W&auml;nde in eine backstein&auml;hnliche Farbe ge&auml;ndert (damit sie einfacher zu unterscheiden sind) und eine kleine Korrektur durchgef&uuml;hrt: Einige W&auml;nde gehen nicht bis zum Dach, sondern enden in einer H&ouml;he von 2,60 m. Ich habe die H&ouml;he dieser W&auml;nde korrigiert.
</p><p><span id="Raising_the_structure"></span>
</p>
<h2><span class="mw-headline" id="Anheben_der_Struktur">Anheben der Struktur</span></h2>
<p>Jetzt, da wir unsere W&auml;nde mit Hilfe eines Differenzk&ouml;rpers abschneiden wollen, k&ouml;nnen wir auch nachsehen, ob es nicht weitere Objekte gibt, die auf diese Weise behandelt werden m&uuml;ssen. Bei einigen S&auml;ulen ist das so. Dies ist eine gute Gelegenheit, ein zweites Arch-Objekt einzuf&uuml;hren: die <a href="../de/Arch_Structure.html" title="Arch Structure/de">Struktur</a>. Strukturobjekte verhalten sich mehr oder weniger wie W&auml;nde, aber sie sind nicht gemacht, um einer Grundlinie zu folgen. Stattdessen basieren sie auf einem Profil, das extrudiert wird (entlang einer Profillinie oder nicht). Jedes flache Objekt kann ein Profil f&uuml;r eine Struktur sein, mit nur einer Voraussetzung: Sie m&uuml;ssen eine geschlossene Form bilden.
</p><p>Bei unseren S&auml;ulen werden wir eine andere Strategie als bei den W&auml;nden verwenden. Anstatt auf den 2D-Pl&auml;nen zu "zeichnen" werden wir direkt Objekte daraus benutzen: Die Kreise, die die S&auml;ulen in der Planansicht darstellen. In der Theorie k&ouml;nnen wir einfach einen von ihnen w&auml;hlen und den <a href="../de/Arch_Structure.html" title="Arch Structure/de">Struktur</a>-Button dr&uuml;cken. Wenn wir das tun, werden wir allerdings nur ein "leeres" strukturelles Objekt erzeugen. Das liegt daran, dass man nie ganz sicher sein kann, wie gut die Objekte einer DWG-Datei gezeichnet wurden, und oftmals sind es keine geschlossenen Formen. Bevor wir sie also tats&auml;chlich in S&auml;ulen umwandeln, werden wir sie durch zweimaligen Aufruf des <a href="../de/Draft_Upgrade.html" title="Draft Upgrade/de">Hochstufen</a>-Werkzeugs in Fl&auml;chen umwandeln. Beim ersten Mal entstehen daraus geschlossene Polygonz&uuml;ge (Polylinien), beim zweiten Mal werden die Polygonz&uuml;ge zu Fl&auml;chen konvertiert. Der zweite Schritt ist nicht zwingend erforderlich, aber wenn Sie eine Fl&auml;che haben, dann k&ouml;nnen Sie absolut sicher sein, dass sie geschlossen ist (anderenfalls kann keine Fl&auml;che entstehen).
</p><p>Nachdem alle Kreise zu Fl&auml;chen konvertiert wurden, benutzen wir das <a href="../de/Arch_Structure.html" title="Arch Structure/de">Struktur</a>-Werkzeug, und passen die H&ouml;he an (einige haben 6 m, andere nur 2,25 m):
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../File/Arch_tutorial_08.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_08.jpg" decoding="async" width="1024" height="434"></a></span>
</p><p>Auf dem obigen Bild sehen Sie zwei S&auml;ulen, die immer noch so sind wie in der DWG-Datei, zwei, die zu Fl&auml;chen wurden, und zwei, die zu strukturellen Objekten mit einer H&ouml;he von 6 m bzw. 2,25 m wurden.
</p><p>Beachten Sie, dass all diese verschiedenen Arch-Objekte (W&auml;nde, Strukturen, und die anderen, die wir noch entdecken werden) eine Vielzahl von Dingen gemeinsam haben (z.B. k&ouml;nnen alle zusammengef&uuml;gt werden, wie wir das bereits bei den W&auml;nden gesehen haben, und jedes von ihnen kann zu einem anderen konvertiert werden). So ist es mehr eine Frage des Geschmacks, wir h&auml;tten unsere S&auml;ulen auch mit dem Wand-Werkzeug erstellen und sie bei Bedarf konvertieren k&ouml;nnen. Tats&auml;chlich sind einige W&auml;nde aus Beton, wir k&ouml;nnten sie daher sp&auml;ter zu Strukturen konvertieren.
</p><p><span id="Subtractions"></span>
</p>
<h2><span class="mw-headline" id="Subtraktionen">Subtraktionen</span></h2>
<p>Jetzt ist es Zeit, unseren Differenzk&ouml;rper zu erstellen. Der einfachste Weg ist, das Profil auf der Seitenansicht zu zeichnen. Dann drehen wir es und platzieren es an der richtigen Position. Verstehen Sie, warum ich die Ansichten auf diese Weise platziert habe? Es ist sehr bequem, um Dinge dort zu zeichnen, und sie dann an die richtige Position des Modells zu verschieben.
</p><p>Lassen Sie uns einen K&ouml;rper zeichnen, gr&ouml;&szlig;er als das Dach, der von unseren W&auml;nden subtrahiert wird. Um das zu tun, zeichnete ich zwei Linien auf die Basis des Daches und erweiterte sie ein wenig mit dem <a href="../de/Draft_Trimex.html" title="Draft Trimex/de">Trimex</a>-Werkzeug. Dann zeichnete ich einen <a href="../Draft_Wire.html" title="Draft Wire">Polygonzug</a>, auf diesen Linien einrastend und &uuml;ber unsere 6 m hinaus. Au&szlig;erdem zeichnete ich eine blaue Linie auf dem Boden (0,00), die unsere Rotationsachse ist.
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_09.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_09.jpg" decoding="async" width="1024" height="479"></a></span>
</p><p>Nun kommt der knifflige Teil: Wir werden das <a href="../de/Draft_Rotate.html" title="Draft Rotate/de">Drehen</a>-Werkzeug benutzen, um unser Profil um 90&deg; nach oben in die richtige Position zu drehen, damit es extrudiert werden kann. Um das zu tun, m&uuml;ssen wir zuerst die <a href="../de/Draft_SelectPlane.html" title="Draft SelectPlane/de">Arbeitsebene</a> auf die YZ-Ebene setzen. Sobald dies getan ist, wird die Drehung in dieser Ebene stattfinden. Wenn wir es aber so machen w&uuml;rden wie ein wenig zuvor und die Ansicht auf die Seitenansicht setzen w&uuml;rden, w&auml;re es schwierig zu sehen und unser Profil zu w&auml;hlen, und zu wissen, wo der Basispunkt ist, um den gedreht werden muss, stimmt's? Dann m&uuml;ssen wir die Arbeitsebene manuell setzen: Dr&uuml;cken Sie den <a href="../de/Draft_SelectPlane.html" title="Draft SelectPlane/de">Arbeitsebene</a>-Button (er ist im "Aufgaben"-Reiter in der Baumansicht) und setzen Sie ihn auf YZ (welches die "Seiten"-Ebene ist). Sobald Sie die Arbeitsebene manuell auf diese Weise gesetzt haben, wird sie sich nicht mehr abh&auml;ngig von Ihrer Ansicht &auml;ndern. Sie k&ouml;nnen nun Ihre Ansicht drehen, bis Sie einen guten Blick auf die Dinge haben, die Sie ausw&auml;hlen m&uuml;ssen. Um die Arbeitsebene sp&auml;ter wieder zur&uuml;ck auf den "automatischen" Modus zu setzen, dr&uuml;cken Sie den <a href="../de/Draft_SelectPlane.html" title="Draft SelectPlane/de">Ebene markieren</a>-Button erneut und w&auml;hlen "Automatisch".
</p><p>Jetzt ist die Drehung einfach: W&auml;hlen Sie das Profil, dr&uuml;cken den <a href="../de/Draft_Rotate.html" title="Draft Rotate/de">Drehen</a>-Button, klicken auf einen Punkt der blauen Linie, geben 0 als Startwinkel (Base angle) an und 90 als Drehung (Rotation):
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_10.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_10.jpg" decoding="async" width="1024" height="441"></a></span>
</p><p>Jetzt m&uuml;ssen wir nur noch das Profil etwas n&auml;her an das Modell heranschieben (setzen Sie die Arbeitsebene auf XY, falls n&ouml;tig) und extrudieren Sie es. Dies kann entweder mit dem <a href="../de/Part_Extrude.html" title="Part Extrude/de">Extrudieren</a>-Werkzeug oder <a href="../de/Draft_Trimex.html" title="Draft Trimex/de">Trimex</a> geschehen, das ebenfalls die spezielle versteckte Macht hat, um Fl&auml;chen zu extrudieren. Stellen Sie sicher, dass Ihre Extrusion gr&ouml;&szlig;er als alle W&auml;nde ist, die davon subtrahiert werden sollen, um Face-to-Face-Situationen zu vermeiden:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_11.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_11.jpg" decoding="async" width="1024" height="462"></a></span>
</p><p>Nun kommt das Gegenteil des <a href="../de/Arch_Add.html" title="Arch Add/de">Komponente hinzuf&uuml;gen</a>-Werkzeugs zum Einsatz: <a href="../de/Arch_Remove.html" title="Arch Remove/de">Komponente entfernen</a>. Wie Sie vielleicht vermutet haben, macht es ebenfalls ein Objekt zum Kind eines anderen, aber die Form wird vom Host-Objekt subtrahiert anstatt damit vereinigt. Jetzt sind die Dinge einfach: W&auml;hlen Sie den zu subtrahierenden K&ouml;rper (ich habe es in "Roof volume to subtract" umbenannt in der Baumansicht, damit es einfach zu finden ist), w&auml;hlen bei gedr&uuml;ckter <span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px;">Strg</span>-Taste eine Wand und dr&uuml;cken den <a href="../de/Arch_Remove.html" title="Arch Remove/de">Komponente entfernen</a>-Button. Nachdem die Subtraktion durchgef&uuml;hrt wurde, sehen Sie, dass der zu subtrahierende K&ouml;rper aus der 3D-Ansicht und der Baumansicht verschwunden ist. Das liegt daran, dass er als Kind der Wand markiert und von der Wand "verschluckt" wurde. W&auml;hlen Sie die Wand, expandieren Sie diese in der Baumansicht, und dort ist unser K&ouml;rper.
</p><p>W&auml;hlen Sie nun den K&ouml;rper in der Baumansicht, w&auml;hlen bei gedr&uuml;ckter <span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px;">Strg</span>-Taste die n&auml;chste Wand und dr&uuml;cken <a href="../de/Arch_Remove.html" title="Arch Remove/de">Komponente entfernen</a>. Wiederholen Sie das f&uuml;r die verbleibenden W&auml;nde, bis alle sauber abgeschnitten sind:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_12.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_12.jpg" decoding="async" width="1024" height="370"></a></span>
</p><p>Denken Sie daran, dass sowohl f&uuml;r <a href="../de/Arch_Add.html" title="Arch Add/de">Komponente hinzuf&uuml;gen</a> als auch <a href="../de/Arch_Remove.html" title="Arch Remove/de">Komponente entfernen</a> die Reihenfolge bei der Auswahl der Objekte wichtig ist. Der Host ist immer das Letzte, wie in "Entferne X von Y" oder "F&uuml;ge X zu Y hinzu".
</p>
<div class="note"><b>Eine Anmerkung zu Additionen und Subtraktionen</b>
<p>Arch-Objekte, die solche Additionen und Subtraktionen unterst&uuml;tzen (alle von ihnen au&szlig;er den "visuellen" Hilfsobjekten wie etwa Achsen), behalten solche Objekte im Auge durch zwei Eigenschaften, n&auml;mliche "Additions" und "Subtractions", die eine Liste von Verweisen auf andere zu addierende oder subtrahierende Objekte enthalten. Das gleiche Objekt kann in den Listen verschiedener anderer Objekte sein, wie es der Fall bei unserem Differenzk&ouml;rper ist. Jeder der V&auml;ter versucht, es in der Baumansicht zu verschlucken, aber es wird normalerweise nur im letzten "leben". Aber Sie k&ouml;nnen immer die Listen jedes Objekts editieren, indem Sie in der Baumansicht darauf doppelklicken, wodurch in FreeCAD der &Auml;nderungsmodus aufgerufen wird. Dr&uuml;cken von <span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px;">Esc</span> beendet den &Auml;nderungsmodus.
</p>
</div>
<p><br>
<span id="Making_the_roofs"></span>
</p>
<h2><span id="Die_D.C3.A4cher_erstellen"></span><span class="mw-headline" id="Die_D&auml;cher_erstellen">Die D&auml;cher erstellen</span></h2>
<p>Um die Struktur zu vollenden, m&uuml;ssen wir jetzt nur noch das Dach und die kleineren inneren Decken erstellen. Wieder ist der einfachste Weg, die Profile mit dem <a href="../de/Draft_Wire.html" title="Draft Wire/de">Polygonzug</a>-Werkzeug auf der Schnittansicht zu zeichnen. Hier habe ich drei Profile &uuml;bereinander gezeichnet (ich habe sie im folgenden Bild voneinander getrennt, damit man sie besser sehen kann). Das gr&uuml;ne wird f&uuml;r die seitlichen Begrenzungen der Decken benutzt, dann das blaue f&uuml;r die Seitenteile und das rote f&uuml;r das Mittelteil, das &uuml;ber dem Badezimmerblock sitzt:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_13.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_13.jpg" decoding="async" width="1024" height="325"></a></span>
</p><p>Dann m&uuml;ssen wir die Drehungsoperation wiederholen, um die Objekte in eine vertikale Position zu drehen und sie dann an ihre richtigen Pl&auml;tze zu verschieben, und einige kopieren, die zweimal extrudiert werden m&uuml;ssen. Mit dem <a href="../de/Draft_Move.html" title="Draft Move/de">Verschieben</a>-Werkzeug und gedr&uuml;ckter <span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px;">ALT</span>-Taste werden Kopien des aktuellen Objekts angelegt anstatt es zu verschieben. Ich habe auch noch zwei weitere Profile f&uuml;r die Seitenw&auml;nde der Badezimmer&ouml;ffnung hinzugef&uuml;gt.
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_14.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_14.jpg" decoding="async" width="1024" height="466"></a></span>
</p><p>Wenn alles an der richtigen Stelle ist, werden die Teile mit dem <a href="../de/Draft_Trimex.html" title="Draft Trimex/de">Trimex</a>-Werkzeug extrudiert und anschlie&szlig;end zu <a href="../de/Arch_Structure.html" title="Arch Structure/de">Struktur</a>-Objekten konvertiert. 
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_15.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_15.jpg" decoding="async" width="1024" height="412"></a></span>
</p><p>Danach sehen wir einige Probleme auftauchen: zwei der S&auml;ulen rechts sind zu kurz (sie sollten bis zum Dach reichen), und es gibt es eine L&uuml;cke zwischen der Decke und den W&auml;nden des Studios rechts au&szlig;en (die 2,60 m-Bema&szlig;ung in der Schnittansicht war offenkundig falsch). Dank der parametrischen Objekte ist all dies sehr einfach zu korrigieren: &Auml;ndern Sie bei den S&auml;ulen die H&ouml;he einfach auf 6 m, holen Sie den Differenzk&ouml;rper aus der Baumansicht und subtrahieren Sie ihn von den S&auml;ulen. Bei den W&auml;nden ist es noch einfacher: Verschieben Sie diese ein wenig nach unten. Da der Differenzk&ouml;rper am gleichen Platz bleibt, passt sich die Geometrie automatisch an.
</p><p>Nun muss noch ein letztes Teil korrigiert werden, eine kleine Decke im Badezimmer, die einige W&auml;nde schneidet. Lassen Sie uns einen neuen Differenzk&ouml;rper erstellen und diesen von den W&auml;nden subtrahieren. Eine weitere Funktion des <a href="../de/Draft_Trimex.html" title="Draft Trimex/de">Trimex</a>-Werkzeugs, das wir zum extrudieren von Teilen benutzt haben, ist die M&ouml;glichkeit, nur eine einzelne Fl&auml;che eines Objekts zu extrudieren. Dies erstellt ein neues, separates Objekt, so dass keine Gefahr besteht, das andere Objekt zu "besch&auml;digen". Also k&ouml;nnen wir die Basisfl&auml;che der kleinen Decke ausw&auml;hlen (die sichtbar wird, wenn man von unten in das Modell schaut), dann dr&uuml;cken Sie den <a href="../de/Draft_Trimex.html" title="Draft Trimex/de">Trimex</a>-Button und extrudieren Sie diese bis &uuml;ber die D&auml;cher. Dann subtrahieren Sie diese von den beiden inneren Badezimmerw&auml;nden mit dem <a href="../de/Arch_Remove.html" title="Arch Remove/de">Entfernen</a>-Werkzeug:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_16.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_16.jpg" decoding="async" width="1024" height="457"></a></span>
</p><p><span id="Floors,_stairs_and_chimney"></span>
</p>
<h2><span id="Fu.C3.9Fb.C3.B6den.2C_Treppe_und_Kamin"></span><span class="mw-headline" id="Fu&szlig;b&ouml;den,_Treppe_und_Kamin">Fu&szlig;b&ouml;den, Treppe und Kamin</span></h2>
<p>Nachdem unsere Struktur vollst&auml;ndig ist, m&uuml;ssen wir nun eine Reihe kleinerer Objekte erstellen. 
</p><p><span id="The_chimney"></span>
</p>
<h3><span class="mw-headline" id="Der_Kamin">Der Kamin</span></h3>
<p>Lassen Sie uns mit dem Kamin beginnen. Inzwischen wissen Sie, wie es funktioniert, oder? Zeichnen Sie eine Reihe von <a href="../de/Draft_Wire.html" title="Draft Wire/de">Polygonz&uuml;gen</a>, verschieben diese mit dem <a href="../de/Draft_Move.html" title="Draft Move/de">Verschieben</a>-Werkzeug auf die korrekte H&ouml;he, extrudieren sie mit dem <a href="../de/Draft_Trimex.html" title="Draft Trimex/de">Trimex</a>-Werkzeug, konvertieren den gr&ouml;&szlig;eren in eine <a href="../de/Arch_Structure.html" title="Arch Structure/de">Struktur</a>, und subtrahieren die kleineren. Beachten Sie, dass der Kaminabzug nicht auf dem Boden gezeichnet wurde, aber ich habe die Position durch Ziehen von blauen Linien aus der Schnittzeichnung ermittelt.
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_17.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_17.jpg" decoding="async" width="1024" height="466"></a></span>
</p><p><span id="The_floors"></span>
</p>
<h3><span id="Die_Fu.C3.9Fb.C3.B6den"></span><span class="mw-headline" id="Die_Fu&szlig;b&ouml;den">Die Fu&szlig;b&ouml;den</span></h3>
<p>Die Fu&szlig;b&ouml;den sind in den Zeichnungen nicht gut dargestellt. Beim Blick auf die Schnittzeichnungen wei&szlig; man nicht, wo und wie dick die Bodenplatten sind.  Daher werde ich annehmen, dass die W&auml;nde auf den Fundamentbl&ouml;cken stehen, auf 0,00, und dass es Bodenplatten gibt, die ebenfalls auf diesen Bl&ouml;cken liegen, 15 cm dick. Die Bodenplatten verlaufen nicht unter den W&auml;nden, sondern darum herum. Wir k&ouml;nnen das tun, indem wir eine gro&szlig;e rechteckige Bodenplatte erstellen, von der die W&auml;nde subtrahiert werden, aber denken Sie daran, Differenzoperationen kosten uns viel (Rechenzeit). Es ist besser, das in kleineren Teilen zu tun, das wird "billiger" in Bezug auf Berechnungen, und falls wir es intelligent tun, Raum f&uuml;r Raum, dann kann es uns sp&auml;ter bei der Ermittlung der Bodenfl&auml;chen helfen:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_18.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_18.jpg" decoding="async" width="1024" height="351"></a></span>
</p><p>Sobald die Polygonz&uuml;ge gezeichnet sind, k&ouml;nnen diese in <a href="../de/Arch_Structure.html" title="Arch Structure/de">Strukturen</a> umgewandelt werden und eine H&ouml;he von 0,15 m erhalten:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_19.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_19.jpg" decoding="async" width="1024" height="459"></a></span>
</p><p><span id="The_stairs"></span>
</p>
<h3><span class="mw-headline" id="Die_Treppe">Die Treppe</span></h3>
<p>Nun die Treppe. Lernen Sie das n&auml;chste der Arch-Werkzeuge kennen, die <a href="../de/Arch_Stairs.html" title="Arch Stairs/de">Treppe</a>. W&auml;hrend ich dies schreibe, ist das Werkzeug immer noch in einer sehr fr&uuml;hen Entwicklungsphase, also erwarten Sie nicht zuviel. Es ist bereits ziemlich n&uuml;tzlich, um einfache, gerade Treppen zu erstellen. Das Treppen-Werkzeug ist daf&uuml;r gedacht, um Treppen von einem flachen Boden zu einer Wand zu erstellen. Anders gesagt: In der Draufsicht nimmt das Treppenobjekt genau den Platz ein, den auch im Plan einnimmt, so dass die letzte Stufe nicht gezeichnet wird (aber sie wird nat&uuml;rlich bei der Berechnung der H&ouml;hen ber&uuml;cksichtigt).
</p><p>In diesem Fall habe ich es vorgezogen, die Treppen in der Seitenansicht zu erstellen, weil wir viele Ma&szlig;e ben&ouml;tigen, die in dieser Ansicht einfacher zu ermitteln sind. Hier habe ich eine Reihe von roten Hilfslinien gezeichnet, dann zwei blaue Linien, die die Basis f&uuml;r unsere zwei Treppen bilden, und zwei gr&uuml;ne geschlossene Polygonz&uuml;ge, die die fehlenden Teile bilden. W&auml;hlen Sie die erste blaue Linie, dr&uuml;cken das <a href="../de/Arch_Stairs.html" title="Arch Stairs/de">Treppen</a>-Werkzeug, setzen die Anzahl der Stufen auf 5, die H&ouml;he auf 0,875, die Breite auf 1,30, den Strukturtyp auf "massiv" und die Strukturdicke auf 0,12. F&uuml;r das andere Teil gelten die gleichen Werte.
</p><p>Extrudieren Sie die beide gr&uuml;nen Polygonz&uuml;ge auf 1,30, drehen und verschieben sie dann an die richtige Position.
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_20.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_20.jpg" decoding="async" width="1024" height="483"></a></span>
</p><p>Zeichnen (und drehen) Sie in der Draufsicht die Treppeneinfassung.
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_21.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_21.jpg" decoding="async" width="1024" height="378"></a></span>
</p><p>Dann verschieben Sie alles an den vorgesehenen Platz:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_22.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_22.jpg" decoding="async" width="1024" height="420"></a></span>
</p><p>Vergessen Sie nicht, auch die S&auml;ulen zu k&uuml;rzen, die die Treppe schneiden, denn in der Geb&auml;udedatenmodellierung ist es immer schlecht, sich kreuzende Objekte zu haben. Wir bauen wie in der realen Welt und dort k&ouml;nnen sich Festk&ouml;rper nicht kreuzen. Hier wollte ich nicht die S&auml;ule direkt von den Treppen subtrahieren (anderenfalls w&uuml;rde das S&auml;ulenobjekt von den Treppenobjekten in der Baumansicht geschluckt werden, und das mochte ich nicht), so dass ich die Fl&auml;che, auf der die S&auml;ule steht, genommen und sie wieder extrudiert habe. Diese neue Extrusion wurde dann von den Treppen subtrahiert.
</p><p>Gut! All die schwere Arbeit ist nun getan, machen wir mit der sehr schweren Arbeit weiter!
</p><p><span id="Doors_and_windows"></span>
</p>
<h2><span id="T.C3.BCren_und_Fenster"></span><span class="mw-headline" id="T&uuml;ren_und_Fenster">T&uuml;ren und Fenster</span></h2>
<p><a href="../de/Arch_Window.html" title="Arch Window/de">Fenster</a> sind ziemlich komplexe Objekte. Sie werden benutzt, um alle Arten von "eingef&uuml;gten" Objekten, wie etwa Fenster oder T&uuml;ren. Ja, in FreeCAD sind T&uuml;ren einfach nur eine spezielle Art von Fenstern. Im echten Leben auch, wenn Sie dar&uuml;ber nachdenken, oder? Das <a href="../de/Arch_Window.html" title="Arch Window/de">Fenster</a>-Werkzeug kann immer noch ein wenig schwierig zu benutzen sein, aber betrachten Sie das als Kompromiss, da es f&uuml;r maximale Leistung gemacht wurde. Fast jede Art von Fenster, die Sie sich vorstellen k&ouml;nnen, kann damit erstellt werden. Weil das Werkzeug noch weitere Voreinstellungen bekommen wird, verbessert sich dieser Zustand in der Zukunft sicherlich.
</p><p>Das <a href="../de/Arch_Window.html" title="Arch Window/de">Fenster</a>-Objekt arbeitet wie folgt: Es basiert auf einem 2D-Layout, einem beliebiges beliebigem 2D-Objekt, aber vorzugsweise einer <a href="../de/Sketcher_Workbench.html" title="Sketcher Workbench/de">Skizze</a>, die Polygonz&uuml;ge (Polylinien) enth&auml;lt. Diese Polygonz&uuml;ge definieren die verschiedenen Teile des Fensters: Au&szlig;enrahmen, Innenrahmen, Glasscheiben, feste Bestandteile (solid panels), etc. Die Fenster-Objekte haben eine Eigenschaft, in der gespeichert wird, was mit dem jeweiligen Polygonzug zu tun ist: extrudieren, in einem bestimmten Abstand platzieren, etc. Schlie&szlig;lich kann ein Fenster in ein Host-Objekt wie etwa eine Wand oder eine Struktur eingef&uuml;gt werden, und erstellt automatisch ein Loch darin. Die Gr&ouml;&szlig;e des Lochs wird aufgrund des gr&ouml;&szlig;ten im 2D-Layout gefundenen Polygonzugs berechnet.
</p><p>Es gibt zwei Wege, um solch ein Objekt in FreeCAD zu erstellen: Durch Nutzung einer Voreinstellung oder zeichnen der Fensterausf&uuml;hrung von Grund auf. Wir werden uns beide Methoden ansehen. Denken Sie aber daran, dass die Voreinstellungsmethode nichts anderes tut, als f&uuml;r Sie das Layout-Objekt zu erstellen und die notwendigen Extrusionen zu definieren.
</p><p><span id="Using_presets"></span>
</p>
<h3><span class="mw-headline" id="Voreinstellungen_verwenden">Voreinstellungen verwenden</span></h3>
<p>Wenn Sie das <a href="../de/Arch_Window.html" title="Arch Window/de">Fenster</a>-Werkzeug dr&uuml;cken, ohne ein Objekt zu w&auml;hlen, werden Sie aufgefordert, entweder ein 2D-Layout herauszusuchen oder eine der Voreinstellungen zu benutzen. Lassen Sie uns die "Einfache T&uuml;r"-Voreinstellung verwenden, um die Haupteingangst&uuml;r in unserem Modell zu platzieren. Stellen Sie ein Breite von 1 m, eine H&ouml;he von 2,45 m sowie eine W1-Gr&ouml;&szlig;e von 0,15 m ein und belassen Sie die anderen Parameter bei 0,05 m. Klicken Sie dann auf die linke untere Ecke der Wand, und Ihre neue T&uuml;r wurde erstellt:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_23.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_23.jpg" decoding="async" width="1024" height="425"></a></span>
</p><p>Sie werden feststellen, dass Ihre neue T&uuml;r nicht in der Baumansicht auftaucht. Der Grund ist, dass wir durch Einrasten an einer Wand andeuten, dass diese Wand das zugeh&ouml;rige Host-Objekt ist. Konsequenterweise wird es durch die Wand "geschluckt". Durch einen Rechtsklick auf die T&uuml;r &rarr; Gehe zur Auswahl finden Sie es im Baum.
</p><p>Da unser Fenster nicht in irgendeine Wand eingef&uuml;gt wird (die &Ouml;ffnung war bereits vorhanden), k&ouml;nnten wir in diesem Fall unser Fenster von der Host-Wand l&ouml;sen. Dies passiert durch doppelklicken der Host-Wand in der Baumansicht, um den &Auml;nderungsmodus aufzurufen. Dort findet sich das Fenster in der "Subtractions"-Gruppe. W&auml;hlen Sie das Fenster, dr&uuml;cken Sie den "Komponente entfernen"-Button und dr&uuml;cken "OK". Unser Fenster wurde von der Host-Wand entfernt und ist nun am Ende der Baumansicht.
</p><p>Es gibt ein bisschen weiter links eine zweite, genau gleiche, T&uuml;r. Anstatt eine neue T&uuml;r von Grund auf zu erstellen, gibt es zwei Wege, um eine Kopie der ersten zu machen: Durch Nutzung des <a href="../de/Draft_Move.html" title="Draft Move/de">Verschieben</a>-Werkzeugs mit gedr&uuml;ckter <span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px;">Alt</span>-Taste, was, wie Sie bereits wissen, eine Kopie eines Objekts macht anstatt es zu verschieben. Oder sogar noch besser das <a href="../de/Draft_Clone.html" title="Draft Clone/de">Klonen</a>-Werkzeug. Das Klonen-Werkzeug erstellt einen Klon eines gew&auml;hlten Objekts, das Sie herumschieben k&ouml;nnen, das aber die Form des urspr&uuml;nglichen Objekts beibeh&auml;lt. Falls sich das Original &auml;ndert, &auml;ndert sich auch der Klon.
</p><p>Nun bleibt noch, die T&uuml;r zu w&auml;hlen, <a href="../de/Draft_Clone.html" title="Draft Clone/de">Klonen</a> zu dr&uuml;cken und den Klon mit dem <a href="../de/Draft_Move.html" title="Draft Move/de">Verschieben</a>-Werkzeug an die richtige Stelle zu verschieben.
</p><p><span id="Organizing_your_model"></span>
</p>
<h3><span class="mw-headline" id="Das_Modell_organisieren">Das Modell organisieren</span></h3>
<figure class="mw-halign-left" typeof="mw:File"><a href="../File/Arch_tutorial_24.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_24.jpg" decoding="async" width="400" height="417"></a><figcaption></figcaption></figure>
<p>Nun w&auml;re die richtige Zeit, um etwas aufzur&auml;umen. Nachdem wir bereits zwei Fenster haben, bereinigen wir die Baumansicht ein wenig: Erstellen Sie eine neue <a href="../de/Std_Group.html" title="Std Group/de">Gruppe</a>, benennen sie in "windows" um und schieben die zwei Fenster dorthin. Ich empfehle auch, dass Sie mit anderen Elementen auf diese Weise verfahrenvoneinander zu trennen, wie den etwa W&auml;nde und Strukturen. Da Sie auch <a href="../de/Std_Group.html" title="Std Group/de">Gruppen</a> innerhalb von Gruppen anlegen k&ouml;nnen, k&ouml;nnen Sie weiter organisieren, z.B. indem Sie alle Elemente, die das Dach formen, in eine separate Gruppe verschieben, so dass es einfach ist, sie zu aktivieren/deaktivieren (eine Gruppe sichtbar/unsichtbar machen tut das gleiche mit allen Objekten in dieser Gruppe).
</p><p>Der <a href="../de/Arch_Workbench.html" title="Arch Workbench/de">Arch-Arbeitsbereich</a> bietet einige zus&auml;tzliche Werkzeuge, um Ihr Modell zu organisieren: <a href="../de/Arch_Site.html" title="Arch Site/de">Grundst&uuml;ck</a>, <a href="../de/Arch_Building.html" title="Arch Building/de">Geb&auml;ude</a> und <a href="../de/Arch_Floor.html" title="Arch Floor/de">Geschoss</a>. Diese drei Objekte basieren auf der Standard-FreeCAD-Gruppe, so dass sie sich genau wie Gruppen verhalten, aber sie haben eine Reihe von zus&auml;tzlichen Eigenschaften. <a href="../de/Arch_Floor.html" title="Arch Floor/de">Geschoss</a> hat die F&auml;higkeit, die H&ouml;he der enthaltenen W&auml;nde und Strukturen zu setzen und zu verwalten, und wenn sie verschoben werden, werden auch die Inhalte verschoben.
</p><p>Aber nachdem wir hier nur ein Geb&auml;ude mit einem (und einem halben) Geschoss haben, gibt es keine Notwendigkeit, solche Objekte zu benutzen, also lassen Sie uns bei einfachen Gruppen bleiben.
</p>
<div style="clear:both"></div>
<p>Lassen Sie uns zur Arbeit zur&uuml;ckkehren. Schalten Sie die Dach-Gruppe aus, so dass wir besser hineinsehen k&ouml;nnen, und &auml;ndern Sie den Anzeigemodus auf Drahtgitter (oder verwenden Sie das <a href="../de/Draft_ToggleDisplayMode.html" title="Draft ToggleDisplayMode/de">Anzeige-Modus umschalten</a>-Werkzeug), so dass wir weiterhin an sie einrasten k&ouml;nnen, denn auch wenn wir den Plan von unten sehen. Aber Sie k&ouml;nnen auch die Fu&szlig;b&ouml;den komplett ausschalten, dann Ihre T&uuml;ren auf Level 0 platzieren und sie dann mit dem <a href="../de/Draft_Move.html" title="Draft Move/de">Verschieben</a>-Werkzeug um 15 cm anheben.
</p><p>Lassen Sie uns die Innent&uuml;ren platzieren. Verwenden Sie die "Einfache T&uuml;r"-Voreinstellung erneut und erstellen T&uuml;ren von 1,00 m und 0,70 cm Breite, 2,10 m H&ouml;he und W1-Gr&ouml;&szlig;e 0,1 m. Stellen Sie sicher, dass Sie an der richtigen Wand einrasten, wenn Sie platzieren, so dass sie automatisch ein Loch in der Wand erstellen. Falls es schwierig ist, sie richtig zu positionieren, dann k&ouml;nnen Sie sie an einer einfacheren Stelle platzieren, an der Ecke der Wand zum Beispiel, und sie dann verschieben. Das "Loch" wird ebenfalls verschoben.
</p><p>Wenn Sie aus Versehen ein Fenster in der falschen Wand platziert haben, ist das einfach zu korrigieren: Entfernen Sie im &Auml;nderungsmodus das Fenster aus der "Subtraction"-Gruppe der Host-Wand, wie wir das oben gesehen haben, und f&uuml;gen Sie es auf die gleiche Weise in der "Subtraction"-Gruppe der richtigen Wand ein oder nutzen Sie einfach das <a href="../de/Arch_Remove.html" title="Arch Remove/de">Komponente entfernen</a>-Werkzeug.
</p><p>Nach ein wenig Arbeit sind alle T&uuml;ren vorhanden:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_25.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_25.jpg" decoding="async" width="1024" height="573"></a></span>
</p><p>Bei einem genaueren Blick auf die Draufsicht? habe ich einen weiteren Fehler entdeckt: Die Oberkante der Ziegelwand ist nicht 2,60 m, sondern 17,5 cm tiefer, also 2,425 m. Gl&uuml;cklicherweise haben Fenster, die auf Voreinstellungen basieren, eine M&ouml;glichkeit, die allgemeinen Abmessungen (Breite und H&ouml;he) durch die Eigenschaften anzupassen. Lassen Sie uns die H&ouml;he auf 2,425 - 0,15, also 2,275 &auml;ndern. Das zweite Fenster, als ein Klon des ersten, wird sich ebenfalls anpassen. Das ist im Grunde genommen, wo sich die wahre Magie von parametrischem Design zeigt.
</p><p>Nun k&ouml;nnen wir uns mit dem richtig interessanten Zeug befassen: wie man eigene ma&szlig;geschneiderte Fenster entwirft.
</p><p><span id="Creating_custom_windows"></span>
</p>
<h3><span id="Ma.C3.9Fgeschneiderte_Fenster_erstellen"></span><span class="mw-headline" id="Ma&szlig;geschneiderte_Fenster_erstellen">Ma&szlig;geschneiderte Fenster erstellen</span></h3>
<p>Wie ich oben erkl&auml;rt habe, werden <a href="../de/Arch_Window.html" title="Arch Window/de">Fenster</a> aus 2D-Layouts erstellt, die aus geschlossenen Elementen (Polygonz&uuml;ge(Polylinien), Kreisen, Rechtecken, irgendetwas) bestehen. Nachdem <a href="../de/Draft_Workbench.html" title="Draft Workbench/de">Draft</a>-Objekte nicht mehr als eines dieser Elemente enthalten k&ouml;nnen, ist das bevorzugte Werkzeug zum Zeichnen von Fenster-Layouts der <a href="../de/Sketcher_Workbench.html" title="Sketcher Workbench/de">Skizze</a>-Arbeitsbereich. Ungl&uuml;cklicherweise kann man damit nicht an externen Objekten einrasten, wie das beim <a href="../de/Draft_Workbench.html" title="Draft Workbench/de">Draft</a>-Arbeitsbereich m&ouml;glich ist. Da wir bereits dreidimensionale Objekte gezeichnet haben, w&auml;re es sch&ouml;n, diese nutzen zu k&ouml;nnen. Gl&uuml;cklicherweise gibt es Werkzeug, um Draft-Objekte in eine Skizze konvertieren zu k&ouml;nnen: Das <a href="../de/Draft_Draft2Sketch.html" title="Draft Draft2Sketch/de">Entwurf zu Skizze</a>-Werkzeug.
</p><p>Lassen Sie uns also mit unserem ersten Fenster-Layout beginnen. Ich habe auf die Draufsicht mehrere <a href="../de/Draft_Rectangle.html" title="Draft Rectangle/de">Rechtecke</a> gezeichnet: Eins f&uuml;r die &auml;u&szlig;ere Linie und vier f&uuml;r die innere Linie. Ich habe vor der T&uuml;r aufgeh&ouml;rt, denn wie Sie sich erinnern, hat diese bereits einen Rahmen:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_26.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_26.jpg" decoding="async" width="1024" height="343"></a></span>
</p><p>Nach dem Ausw&auml;hlen aller Rechtecke dr&uuml;cken Sie den <a href="../de/Draft_Draft2Sketch.html" title="Draft Draft2Sketch/de">Entwurf zu Skizze</a>-Button (und l&ouml;schen die Rechtecke, denn dieses Werkzeug l&ouml;scht nicht die originalen Objekte, falls etwas schiefgeht). Nach W&auml;hlen der neuen Skizze dr&uuml;cken Sie das <a href="../de/Arch_Window.html" title="Arch Window/de">Fenster</a>-Werkzeug.
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_27.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_27.jpg" decoding="async" width="1024" height="380"></a></span>
</p><p>Das Werkzeug wird feststellen, dass das Layout einen &auml;u&szlig;eren und mehrere innere Polygonz&uuml;ge hat und Ihnen automatisch eine Standardkonfiguration vorschlagen: Ein Rahmen, entstanden durch Subtraktion der vier inneren vom &auml;u&szlig;eren Polygonzug, extrudiert auf 1 m. Lassen Sie uns das durch Doppelklick (Aufruf des &Auml;nderungsmodus) auf das Objekt in der Baumansicht &auml;ndern.
</p><p>Sie werden eine "Default"-Komponente sehen, die automatisch durch das Fenster-Werkzeug erzeugt wurde, die die f&uuml;nf Polygonz&uuml;ge benutzt und einen Extrusionswert von 1 hat. Lassen Sie uns den Wert auf 0,1 &auml;ndern, damit dieser zu denen der T&uuml;ren passt.
</p><p>Lassen Sie uns jetzt vier neue Glasscheiben hinzuf&uuml;gen, die jede einen einzelnen Polygonzug verwenden, und setzen Sie einen Extrusionswert von 0,01 und einen Offset von 0,05, damit sie in die Mitte des Rahmens gesetzt werden. Das Fenster wird am Ende so aussehen:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_28.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_28.jpg" decoding="async" width="1024" height="496"></a></span>
</p><p>Ich vermute, dass Sie nun die Macht des Systems verstehen: Jede Kombination von Rahmen und Feldern beliebiger Form ist m&ouml;glich. Wenn Sie es zweidimensional zeichnen k&ouml;nnen, kann daraus ein g&uuml;ltiges 3D-Objekt werden.
</p><p>Lassen Sie uns jetzt die anderen Teile zeichnen und danach alles an die richtigen Stellen verschieben. Zuerst m&uuml;ssen wir aber in der 2D-Zeichnung noch einige Korrekturen durchf&uuml;hren, weil einige Linien fehlen, wo das Fenster auf die Treppe trifft. Wir k&ouml;nnen das durch Versetzen der Treppe um 2,5 cm erreichen, indem wir das <a href="../de/Draft_Offset.html" title="Draft Offset/de">Draft Offset</a>-Werkzeug benutzen (mit gedr&uuml;ckter <span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px;">Alt</span>-Taste, weil wir die Linien kopieren und nicht verschieben wollen). Jetzt k&ouml;nnen wir mit <a href="../de/Draft_Wire.html" title="Draft Wire/de">Polygonz&uuml;gen</a> ein Layout zeichnen, es zu einer Skizze konvertieren und dann ein Fenster daraus machen.
</p><p>Nach mehrfacher Ausf&uuml;hrung (ich habe es in vier separaten St&uuml;cken gemacht, aber das entscheiden Sie selbst) ist unsere Fassade vollst&auml;ndig:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_29.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_29.jpg" decoding="async" width="1024" height="302"></a></span>
</p><p>Wie vorher auch bleibt jetzt nur die Drehung der St&uuml;cke und das anschlie&szlig;ende Verschieben an die richtige Position:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_30.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_30.jpg" decoding="async" width="1024" height="412"></a></span>
</p><p>Als letztes fehlendes St&uuml;ck gibt es noch ein Wandsegment, das nicht im Plan aufgetaucht ist, und was wir noch hinzuf&uuml;gen m&uuml;ssen. Es gibt mehrere M&ouml;glichkeiten, das zu tun. Ich habe mich entschieden, eine Linie auf dem Fu&szlig;boden zu zeichnen, sie anschlie&szlig;end auf die richtige H&ouml;he anzuheben und dann daraus eine Wand zu erstellen. Ein weiteres Mal nehmen wir den Differenzk&ouml;rper (er m&uuml;sste in der Baumansicht bei der letzten S&auml;ule zu finden sein) und subtrahieren ihn. Nun ist diese Seite des Geb&auml;udes fertig:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_31.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_31.jpg" decoding="async" width="1024" height="455"></a></span>
</p><p>Fertig? Nicht ganz. Auf dem obigen Bild sehen Sie, dass wir unsere T&uuml;ren mit einem 5 cm Rahmen erstellt haben, erinnern Sie sich (das war der Standard der Voreinstellung)? Aber die anderen Fenster haben 2,5 cm Rahmen. Das m&uuml;ssen wir korrigieren.
</p><p><span id="Editing_windows"></span>
</p>
<h3><span id="Fenster_.C3.A4ndern"></span><span class="mw-headline" id="Fenster_&auml;ndern">Fenster &auml;ndern</span></h3>
<p>Wir haben bereits gesehen, wie mit dem Fenster&auml;nderungsmodus Fensterkomponenten erstellt und aktualisiert werden k&ouml;nnen, aber man kann auch die darunterliegende Skizze &auml;ndern. Fenster mit Voreinstellungen unterscheiden sich nicht von ma&szlig;geschneiderten Fenster, das <a href="../de/Arch_Window.html" title="Arch Window/de">Fenster</a>-Werkzeug erstellt nur die darunterliegende Skizze f&uuml;r Sie. W&auml;hlen Sie das T&uuml;robjekt (das Original, nichr die Kopie, Sie erinnern sich, dass wir einen Klon erstellt haben) und expandieren Sie es in der Baumansicht. Das ist unsere Skizze. Doppelklicken Sie es, um den &Auml;nderungsmodus aufzurufen.
</p><p>Der <a href="../de/Sketcher_Workbench.html" title="Sketcher Workbench/de">Skizzen</a>-Arbeitsbereich ist ein extrem m&auml;chtiges Werkzeug. Es fehlen einige Annehmlichkeiten des <a href="../de/Draft_Workbench.html" title="Draft Workbench/de">Draft</a>-Arbeitsbereiches, aber es hat viele andere Vorteile. In FreeCAD werden Sie abh&auml;ngig von Ihren Bed&uuml;rfnisses regelm&auml;&szlig;ig den einen oder anderen nutzen. Das wichtigste Merkmal der Skizze sind Einschr&auml;nkungen. Einschr&auml;nkungen erlauben Ihnen, die Position von Elementen relativ zu anderen automatisch zu fixieren/einzuschr&auml;nken. Sie k&ouml;nnen beispielsweise ein Segment zwingen, immer vertikal zu sein oder immer einen bestimmten Abstand zu einem anderen zu haben.
</p><p>Wenn wir unsere T&uuml;rskizze &auml;ndern, k&ouml;nnen wir sehen, dass sie aus einer vollst&auml;ndig eingeschr&auml;nkten Skizze besteht.
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_32.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_32.jpg" decoding="async" width="1024" height="493"></a></span>
</p><p>Jetzt m&uuml;ssen wir nur den 5 cm Abstand zwischen der &auml;u&szlig;eren und der inneren Linie &auml;ndern, indem wir sie doppelklicken und den Wert aus 2,5 cm &auml;ndern. Nach Klicken des <i>OK</i>-Buttons sind unsere T&uuml;r und ihr Klon aktualisiert.
</p><p><span id="Working_without_2D_support"></span>
</p>
<h2><span id="Arbeiten_ohne_2D-Unterst.C3.BCtzung"></span><span class="mw-headline" id="Arbeiten_ohne_2D-Unterst&uuml;tzung">Arbeiten ohne 2D-Unterst&uuml;tzung</span></h2>
<p>Bisher war unsere Arbeit relativ einfach, weil wir die darunterliegenden 2D-Zeichnungen hatten, auf die wir uns st&uuml;tzen konnten. Jetzt m&uuml;ssen wir aber die gegen&uuml;berliegende Fassade und das Glasatrium erstellen und die Dinge werden komplizierter: die Zeichnung der gegen&uuml;berliegenden Fassade enth&auml;lt eine Menge von falschen Dingen, das Atrium wird &uuml;berhaupt nicht dargestellt und wir haben einfach keine Zeichnung f&uuml;r die inneren W&auml;nde des Atriums. Wir m&uuml;ssen daher selbst eine Reihe von Dingen erfinden. Werfen Sie einen Blick auf  <a rel="nofollow" class="external text" href="http://www.pedrokok.com.br/2010/02/residencia-artigas-sao-paulo-sp/img_8265-533px/">reference pictures</a>, um herauszufinden, wie die Dinge aussehen. Oder machen Sie es nach Ihren W&uuml;nschen!
</p><p>Eine Sache k&ouml;nnen wir bereits tun: Das komplizierte Treppenfenster kann mit dem <a href="../de/Draft_Move.html" title="Draft Move/de">Verschieben</a>-Werkzeug kopiert werden, denn es ist auf beiden Seiten identisch.
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_33.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_33.jpg" decoding="async" width="1024" height="462"></a></span>
</p><p>Beachten Sie, dass ich hier lieber das <a href="../de/Draft_Move.html" title="Draft Move/de">Verschieben</a>-Werkzeug anstatt <a href="../de/Draft_Clone.html" title="Draft Clone/de">Klonen</a> benutzt habe, denn der Klon unterst&uuml;tzt momentan nicht unterschiedliche Farben innerhalb von Objekten. Der Unterschied ist, dass der Klon eine Kopie der endg&uuml;ltigen Form des Originalobjekts ist, w&auml;hrend bei einer Kopie ein neues Objekt mit den gleichen Eigenschaften des Originalobjekts ist (also auch der Basisskizze und der Definition der Fensterkomponenten, die beide als Eigenschaften gespeichert werden).
</p><p>Nun m&uuml;ssen wir die Teile angehen, die nirgends gezeichnet wurden. Starten wir mit der Glaswand zwischen dem Wohnzimmer und dem Atrium. Es ist einfacher, das auf der Draufsicht zu zeichnen, weil wir die richtige H&ouml;he des Daches erhalten. Sobald Sie in der Draufsicht sind, k&ouml;nnen Sie die Ansicht in Ansicht &rarr; Standardansichten &rarr; rechts/links drehen, bis Sie eine passende Sicht auf die Arbeit bekommen, wie hier:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_34.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_34.jpg" decoding="async" width="1024" height="477"></a></span>
</p><p>Beachten Sie, wie ich im obigen Bild eine Linie vom Modell zum linken Schnitt gezogen habe, um die exakte Gr&ouml;&szlig;e des Fensters zu ermitteln. Dann habe ich diese Breite auf die Draufsicht &uuml;bertragen und in vier Teile unterteilt. Anschlie&szlig;end habe ich ein Hauptfenster erstellt plus vier weitere Fenster f&uuml;r die Schiebet&uuml;ren. Der Sketcher hat teilweise Schwierigkeiten mit &uuml;berlappenden Polygonz&uuml;gen, so dass ich sie lieber voneinander getrennt habe.
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_35.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_35.jpg" decoding="async" width="1024" height="454"></a></span>
</p><p>Nach den notwendigen Drehungen passt alles perfekt an den Platz:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_36.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_36.jpg" decoding="async" width="1024" height="462"></a></span>
</p><p>Wir ben&ouml;tigen noch ein Eckst&uuml;ck hier. Ein kleiner n&uuml;tzlicher Trick beim <a href="../de/Draft_SelectPlane.html" title="Draft SelectPlane/de">Ebene markieren</a>-Werkzeug ist, dass es beim Dr&uuml;cken des Buttons die Arbeitsebene an der Fl&auml;che ausrichtet, die gerade ausgew&auml;hlt ist (zumindest an der Position, und falls die Fl&auml;che rechteckig ist, auch an den Kanten). Das ist n&uuml;tzlich, 2D-Objekte direkt auf dem Modell zu zeichnen so wie hier, wo wir ein Rechteck zeichnen k&ouml;nnen, das gleich an der richtigen Position extrudiert werden kann.
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_37.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_37.jpg" decoding="async" width="1024" height="461"></a></span>
</p><p>Befassen wir uns nun mit den zwei verbleibenden St&uuml;cken. Eins ist einfach, es ist eine Kopie dessen, was auf der anderen Seite ist, also k&ouml;nnen wir einfach die 2D-Zeichnung verwenden:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_38.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_38.jpg" decoding="async" width="1024" height="472"></a></span>
</p><p>Das andere ist etwas knifflig. Beim Blick auf die Bilder sehen wir, dass es viele vertikale Abschnitte hat, wie die Treppenfenster. Per Zufall (oder sehr guter Planung durch Vilanove Artigas) ist die Breite unseres Fensters von 4,50 m genau identisch zu dem des Treppenfensters, also k&ouml;nnen wir die gleiche Unterteilung verwenden: 15 St&uuml;cke &agrave; 30 cm. Hier habe ich das <a href="../de/Draft_OrthoArray.html" title="Draft OrthoArray/de">orthogonale Anordnung</a>-Werkzeug verwendet, um die beiden Linien 15 Mal zu kopieren und darauf Rechtecke zu zeichnen:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_39.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_39.jpg" decoding="async" width="1024" height="544"></a></span>
</p><p>Sobald das getan ist, k&ouml;nnen wir unser Fenster auf die bekannte Weise erstellen. Ein weiterer kleiner n&uuml;tzlicher Trick, falls Sie ihn nicht schon selbst gefunden haben: Wenn Sie beim Bearbeiten eines Fensters den Namen einer Komponente &auml;ndern, wird tats&auml;chlich eine Kopie davon erstellt. Um die 15 inneren Glasscheiben zu erstellen, m&uuml;ssen Sie also nicht 15 Mal den "Hinzuf&uuml;gen"-Button dr&uuml;cken und 15 Mal die Daten eingeben, sondern nur eine bearbeiten und den Namen und den Polygonzug &auml;ndern, um jeweils eine Kopie zu erstellen.
</p><p>Nachdem das Fenster gedreht und an den Platz geschoben wurde, ist das Atrium fertiggestellt:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_40.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_40.jpg" decoding="async" width="1024" height="479"></a></span>
</p><p><span id="Edits_and_fixes"></span>
</p>
<h2><span class="mw-headline" id="Bearbeitungen_und_Korrekturen">Bearbeitungen und Korrekturen</span></h2>
<p>Wenn wir jetzt auf die R&uuml;ckseite sehen und mit dem Plan vergleichen, dann stellen wir fest, dass noch einige Unterschiede korrigiert werden m&uuml;ssen. Das Schlafzimmerfenster ist n&auml;mlich kleiner als ich zuerst dachte und wir m&uuml;ssen noch einige W&auml;nde hinzuf&uuml;gen. Um das ordentlich zu tun, m&uuml;ssen zuerst einige Fu&szlig;b&ouml;den aufgeschnitten werden:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_41.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_41.jpg" decoding="async" width="1024" height="442"></a></span>
</p><p>Es gibt mehrere Wege, das zu tun. Einen Differenzk&ouml;rper zu erstellen w&auml;re leicht, aber dadurch w&uuml;rde eine unn&ouml;tige Komplexit&auml;t im Modell entstehen. Es ist besser, den Basispolygonzug jedes Fu&szlig;bodens zu &auml;ndern. Hier kommt der <a href="../de/Draft_Edit.html" title="Draft Edit/de">Bearbeiten</a>-Modus ins Spiel. Durch Expandieren dieser Fu&szlig;b&ouml;den in der Baumansicht werden die Polygonz&uuml;ge sichtbar, so dass wir sie doppelklicken k&ouml;nnen, um in den &Auml;nderungsmodus zu kommen. Dort k&ouml;nnen wir ihre Punkte &auml;ndern oder Punkte hinzuf&uuml;gen oder entfernen. Dadurch wird die &Auml;nderung der Fu&szlig;bodenplatten einfach.
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_42.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_42.jpg" decoding="async" width="1024" height="481"></a></span>
</p><p>Nach ein wenig mehr Schwei&szlig; (die Person, die diese Zeichnungen gemacht hat, wurde offenkundig faul, als sie diese Erhebung gemacht hat, denn viel ist falsch gezeichnet), haben wir unser Haus fertiggestellt.
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_43.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_43.jpg" decoding="async" width="1024" height="425"></a></span>
</p><p>Beachten Sie das Kaminrohr, das aus einem Kreis entstanden ist, den ich benutzt habe, um ein Loch in den Kaminblock zu machen, ihn extrudiert und dann mit dem <a href="../de/Part_Offset.html" title="Part Offset/de">Versatz</a>-Werkzeug zu einer R&ouml;hre konvertiert habe.
</p>
<div class="note"><b>Probleme in Objekten</b>
<p>Manchmal gibt es Probleme bei Objekten, die Sie erstellt haben. Beispielsweise wurde die Basis des Objekts gel&ouml;scht und das Objekt kann daher die Form
nicht erneut berechnen. Dies wird Ihnen durch ein kleines rotes Zeichen am Objekt und eine Warnung im Ausgabefenster angezeigt. Es gibt kein allgemeing&uuml;ltiges Rezept zum Reparieren dieser Probleme, da es vielf&auml;ltige Gr&uuml;nde haben kann. Der einfachste Weg zur L&ouml;sung ist oftmals, es zu l&ouml;schen und erneut zu erstellen, falls das Basisobjekt noch existiert.
</p>
</div>
<p><br>
<span id="Output"></span>
</p>
<h2><span class="mw-headline" id="Ausgabe">Ausgabe</span></h2>
<p>Nachdem wir die ganze schwere Arbeit hinter uns haben, um dieses Modell zu erstellen, kommt die Belohnung: Was k&ouml;nnen wir damit tun? Das ist im Grunde genommen der gro&szlig;e Vorteil von Geb&auml;udedatenmodellierung, dass alle unsere traditionellen Architekturbed&uuml;rfnisse, wie etwa 2D-Zeichnungen (Pl&auml;ne, Schnitte, etc), Renderings und Berechnungen (Massenermittlung, etc.), aus dem Modell ermittelt werden k&ouml;nnen. Und besser noch, sie werden nach jeder &Auml;nderung am Modell wieder erneut generiert. Ich werde Ihnen zeigen, wie Sie diese verschiedenen Dokumente erhalten.
</p><p><span id="Preparations"></span>
</p>
<h3><span class="mw-headline" id="Vorbereitungen">Vorbereitungen</span></h3>
<p>Bevor wir mit dem Export beginnen, gibt es eine interessante &Uuml;berlegung: Wie Sie gesehen haben, wurde unser Modell zunehmend komplex, mit vielen Beziehungen zwischen Objekten. Dies kann bei folgenden Operationen, wie etwa Schnitte durch das Modell, zu umfangreichen Berechnungen f&uuml;hren. Ein schneller Weg, um Ihr Modell auf magische Weise drastisch zu "vereinfachen" besteht darin, diese Komplexit&auml;t durch Export ins <a rel="nofollow" class="external text" href="https://de.wikipedia.org/wiki/Standard_for_the_exchange_of_product_model_data">STEP</a>-Format zu entfernen. Das Format wird Ihre komplette Geometrie erhalten, aber alle Beziehungen und Konstruktionen entfernen, so dass nur die endg&uuml;ltige Form &uuml;brigbleibt. Nach dem Reimport dieser STEP-Datei in FreeCAD erhalten Sie ein Modell ohne Beziehungen und einer viel geringeren Gr&ouml;&szlig;e. Betrachten Sie es als eine "Ausgabe"-Datei, die Sie jederzeit aus Ihrer "Master"-Datei wieder erstellen k&ouml;nnen:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_44.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_44.jpg" decoding="async" width="1024" height="592"></a></span>
</p><p><span id="Exporting_to_IFC_and_other_applications"></span>
</p>
<h3><span class="mw-headline" id="Export_nach_IFC_und_anderen_Anwendungen">Export nach IFC und anderen Anwendungen</span></h3>
<figure class="mw-halign-left" typeof="mw:File"><a href="../File/Arch_tutorial_45.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_45.jpg" decoding="async" width="400" height="244"></a><figcaption></figcaption></figure>
<p>Eins der sehr wesentlichen Dinge bei der Arbeit mit Geb&auml;udedatenmodellierung ist die M&ouml;glichkeit zum Im- und Export von <a rel="nofollow" class="external text" href="https://de.wikipedia.org/wiki/Industry_Foundation_Classes">IFC</a>-Dateien. Diese Arbeit in FreeCAD ist noch nicht abgeschlossen. Das <a href="../de/Arch_IFC.html" title="Arch IFC/de">IFC</a>-Format wird bereits unterst&uuml;tzt und der Import in FreeCAD funktioniert bereits ziemlich zuverl&auml;ssig. Der Export ist allerdings noch experimentell und hat momentan noch viele Einschr&auml;nkungen. Die Dinge werden besser und wir sollten sehr schnell einen sauberen IFC-Export erhalten.
</p><p><a href="../de/Arch_IFC.html" title="Arch IFC/de">IFC-Export</a> erfordert sehr wenig Konfiguration, sobald die notwendigen Software-Bibliotheken installiert sind. Sie m&uuml;ssen nur die Geb&auml;udestruktur auffrischen, was in allen IFC-Dateien n&ouml;tig ist, indem Sie zu Ihrer Datei ein <a href="../de/Arch_Building.html" title="Arch Building/de">Geb&auml;ude</a> hinzuf&uuml;gen, dann ein <a href="../de/Arch_Floor.html" title="Arch Floor/de">Geschoss</a> und anschlie&szlig;end alle Gruppen mit Objekten, aus denen Ihr Modell besteht, dorthin verschieben. Achten Sie darauf, dass Ihre Konstruktionselemente (die ganzen 2D-Objekte, die wir gezeichnet haben) ausgenommen bleiben, denn sonst wird die IFC-Datei unn&ouml;tig aufgebl&auml;ht.
</p><p>Eine weitere Einstellung ist das Pr&uuml;fen der "Rolle"-Eigenschaft von Strukturelementen. Da IFC im Gegensatz zu FreeCAD keine "generischen" Strukturelemente hat, m&uuml;ssen wir ihnen Rollen (S&auml;ule, Balken, etc.) zuweisen, so dass der Export-Prozess wei&szlig;, welches Element in der IFC-Datei zu erzeugen ist.
</p><p>In diesem Fall brauchen wir unser gesamtes Architektursystem, so dass der IFC-Export-Prozess wei&szlig;, ob ein Objekt als Wand oder S&auml;ule exportiert werden muss. Daher verwenden wir unser "Master"-Modell, nicht unser "Ausgabe"-Modell.
</p><p>Sobald dies getan ist, w&auml;hlen Sie einfach Ihr Geb&auml;ude-Objekt aus und w&auml;hlen das "Industry Foundation Classes"-Format. Der Export an Nicht-Geb&auml;udedatenmodellierungs-Anwendungen wie etwa <a rel="nofollow" class="external text" href="http://www.sketchup.com/">Sketchup</a> ist ebenfalls einfach. Es gibt verschiedene Export-Formate zu Ihrer Verf&uuml;gung, u.a. <a href="../de/Arch_DAE.html" title="Arch DAE/de">Collada</a>, STEP, IGES oder OBJ.
</p>
<div style="clear:both"></div>
<h3><span class="mw-headline" id="Rendering">Rendering</span></h3>
<p>FreeCAD bietet auch ein Rendering-Modul, den <a href="../de/Raytracing_Workbench.html" title="Raytracing Workbench/de">Raytracing-Arbeitsbereich</a>. Dieser Arbeitsbereich unterst&uuml;tzt momentan zwei Render-Engines, <a rel="nofollow" class="external text" href="http://www.povray.org/">PovRay</a> und <a rel="nofollow" class="external text" href="http://www.luxrender.net">LuxRender</a>. Da FreeCAD nicht f&uuml;r Image-Rendering geplant ist, sind die M&ouml;glichkeiten des Raytracing-Arbeitsbereich ein wenig eingeschr&auml;nkt. Der beste Weg zu sauberen Renderings ist, Ihr Modell in ein Netz-basiertes Format wie OBJ oder STL zu exportieren und es in einer Anwendung zu &ouml;ffnen, die eher f&uuml;r Rendering geeignet ist, wie <a rel="nofollow" class="external text" href="http://www.blender.org">blender</a>. Das folgende Bild wurde mit der cycles-Engine von Blender gerendert.
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_47.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_47.jpg" decoding="async" width="1024" height="480"></a></span>
</p><p>F&uuml;r ein schnelles Rendering ist der Raytracing-Arbeitsbereich bereits geeignet, mit dem Vorteil einer sehr einfachen Konfiguration, dank des Vorlagesystems. Dies ist ein Rendering unseres Modells, das innerhalb von FreeCAD mit der Luxrender-Engine und der "internen" Vorlage entstanden ist.
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_48.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_48.jpg" decoding="async" width="1024" height="599"></a></span>
</p><p>Der Raytracing-Arbeitsbereich bietet Ihnen noch eine sehr eingeschr&auml;nkte Kontrolle &uuml;ber die Materialien, aber Beleuchtung und Umgebung sind in Vorlagen definiert, so dass sie umfassend anpassbar sind.
</p><p><span id="2D_drawings"></span>
</p>
<h3><span class="mw-headline" id="2D-Zeichnungen">2D-Zeichnungen</span></h3>
<p>Sicherlich die wichtigste Nutzung von Geb&auml;udedatenmodellierung ist die automatische Erstellung von 2D-Zeichnungen. Das passiert in FreeCAD mit dem <a href="../de/Arch_SectionPlane.html" title="Arch SectionPlane/de">Ebene markieren</a>-Werkzeug. Dieses Werkzeug erlaubt Ihnen, ein Schnittebenen-Objekt in der 3D-Ansicht zu platzieren, die Sie ausrichten k&ouml;nnen, um Pl&auml;ne, Schnitte und Ansichten zu erstellen. Schnitte m&uuml;ssen wissen, welche Objekte zu ber&uuml;cksichtigen sind, so dass Sie nach der Erstellung eines Schnittebenen-Objekts Elemente mit dem <a href="../de/Arch_Add.html" title="Arch Add/de">Komponente hinzuf&uuml;gen</a>-Werkzeug hinzuf&uuml;gen m&uuml;ssen. Sie k&ouml;nnen einzelne Objekte, oder bequemer, eine Gruppe, ein Geschoss oder ein komplettes Geb&auml;ude hinzuf&uuml;gen. Das erlaubt es Ihnen, sp&auml;ter durch hinzuf&uuml;gen oder entfernen von Objekten den Umfang einer bestimmten Schnittebene zu ver&auml;ndern. Jede &Auml;nderung an diesen Objekten wirkt sich auf die von dieser Schnittebene erzeugten Ansichten aus.
</p><p>Die Schnittebene erstellt automatisch Schnitte von den Objekten, die sie schneidet. Mit anderen Worten, anstatt Ansichten anstelle von Schnitten zu erzeugen, m&uuml;ssen Sie nur die Schnittebene au&szlig;erhalb Ihrer Objekte anlegen.
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_49.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_49.jpg" decoding="async" width="1024" height="470"></a></span>
</p><p>Die Schnittebene kann zwei verschiedene Ausgaben erzeugen: <a href="../de/Part_Workbench.html" title="Part Workbench/de">Part-Formen</a> (Shape-Objekte) in der 3D-Ansicht oder <a href="../de/TechDraw_ArchView.html" title="TechDraw ArchView/de">TechDraw Arch-Ansichten</a> auf einem Zeichnungsblatt, das mit dem Arbeitsbereich <a href="../de/TechDraw_Workbench.html" title="TechDraw Workbench/de">TechDraw</a> erstellt wurde. Beide verhalten sich unterschiedlich und haben jeweils eigenen Vorteile.
</p><p><b>Formteilansichten</b>
</p><p>Diese Ausgabe wird bei ausgew&auml;hlter Schnittebene durch den <a href="../de/Draft_Shape2DView.html" title="Draft Shape2DView/de">Draft Form in 2D-Ansicht</a>-Arbeitsbereich erstellt. Sie erzeugen direkt im 3D-Raum eine 2D-Ansicht des Modells, wie im obigen Bild. Der Hauptvorteil hier ist, dass Sie mit dem <a href="../de/Draft_Workbench.html" title="Draft Workbench/de">Draft-Arbeitsbereich</a>-Werkzeug (oder jedem anderen Standard-Werkzeug) auf dieser Ansicht arbeiten k&ouml;nnen, so dass Sie Texte, Bema&szlig;ungen, Symbole, etc. hinzuf&uuml;gen k&ouml;nnen.
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_50.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_50.jpg" decoding="async" width="1024" height="457"></a></span>
</p><p>Auf dem obigen Bild wurden zwei <a href="../de/Draft_Shape2DView.html" title="Draft Shape2DView/de">Draft Form zu 2D-Ansichten</a> f&uuml;r jeden Schnitt erstellt, eine, die alles zeigt, und eine andere, die nur die Schnittlinien zeigt. Dies erlaubt uns, andere Linienbreiten und Schraffuren einzustellen. Dann wurden Bema&szlig;ungen, Texte und Symbole hinzugef&uuml;gt und eine Reihe von DXF-Bl&ouml;cken f&uuml;r die Darstellung von M&ouml;beln importiert. Diese Ansichten k&ouml;nnen dann einfach nach DXF oder DWG exportiert und in Ihrer bevorzugten 2D-CAD-Anwendung ge&ouml;ffnet werden, wie <a rel="nofollow" class="external text" href="http://www.librecad.org">LibreCAD</a> oder <a rel="nofollow" class="external text" href="http://www.3ds.com/products-services/draftsight/overview/">DraftSight</a>, wo Sie weiter daran arbeiten k&ouml;nnen:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_51.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_51.jpg" decoding="async" width="1024" height="541"></a></span>
</p><p>Beachten Sie, dass einige Merkmale noch nicht vom <a href="../de/Draft_DXF.html" title="Draft DXF/de">DXF/DWG-Exporter</a> unterst&uuml;tzt werden, so dass das Ergebnis in Ihrer 2D-Anwendung ein wenig abweichen kann. Beispielsweise musste ich im obigen Bild die Schraffur neu erstellen und die Position einiger Bema&szlig;ungstext korrigieren. Wenn Sie Ihre Objekte in FreeCAD in verschiedenen Gruppen ablegen, dann werden diese in Ihrer 2D-Anwendung zu Ebenen (layers).
</p><p><b>Arch-Ansichten</b>
</p><p>Die andere Art von Ausgaben, die von <a href="../de/Arch_SectionPlane.html" title="Arch SectionPlane/de">Schnittebenen</a> erstellt werden kann sind <a href="../de/TechDraw_ArchView.html" title="TechDraw ArchView/de">TechDraw Arch-Ansichten</a> (ArchView-Objekte). Diese Methode hat im Vergleich zur vorherigen eine wesentliche Einschr&auml;nkung: Es gibt nur eine begrenzte Anzahl von M&ouml;glichkeiten, das Ergebnis zu bearbeiten und zurzeit werden Funktionen wie Bema&szlig;en und Schraffieren nicht nativ unterst&uuml;tzt.
</p><p>Auf der anderen Seite ist das endg&uuml;ltige Ergebnis einfacher zu handhaben und die grafischen M&ouml;glichkeiten des SVG-Formats sind riesig, so dass dies in Zukunft die bevorzugte Methode sein wird. Momentan bekommen Sie allerdings mit der ersten die besseren Ergebnisse.
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_52.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_52.jpg" decoding="async" width="1024" height="631"></a></span>
</p><p>Im obigen Bild ist die Geometrie die direkte Ausgabe der Schnittebene, aber einige andere Draft-Objekte wie Ma&szlig;e und schraffierte Vielecke wurden hinzugef&uuml;gt; eine weitere Ansicht (View-Objekt) mit gleichem Ma&szlig;stab und gleichen Abstandswerten wurde mit dem Werkzeug <a href="../de/TechDraw_DraftView.html" title="TechDraw DraftView/de">TechDraw DraftAnsicht</a> erstellt. Zuk&uuml;nftig werden solchen Operationen direkt auf dem Zeichnungsblatt m&ouml;glich sein, so dass das Modell sauber aufger&auml;umt bleibt.
</p><p><span id="Quantities_extraction"></span>
</p>
<h3><span class="mw-headline" id="Mengenermittlung">Mengenermittlung</span></h3>
<p>Dies ist ebenfalls eine sehr wichtige Aufgabe, die bei Modellen der Geb&auml;udedatenmodellierung auszuf&uuml;hren ist. In FreeCAD ist von Anfang an alles daf&uuml;r vorhanden. Der OpenCasCade-Kernel von FreeCAD k&uuml;mmert sich bereits um die Berechnung von L&auml;ngen, Fl&auml;chen und K&ouml;rpern bei allen Formen, die erstellt werden. Da alle <a href="../de/Arch_Workbench.html" title="Arch Workbench/de">Arch</a>-Objekte "solide" sind, k&ouml;nnen Sie sicher sein, Sie daraus K&ouml;rper erzeugen k&ouml;nnen.
</p><p><b>Tabellen benutzen</b>
</p><p>Zur F&uuml;llung einer Kalkulationstabelle mit Werten aus dem Modell kann das <a href="../de/Arch_Schedule.html" title="Arch Schedule/de">Arch Ablaufplan</a>-Werkzeug benutzt werden.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../File/Arch_schedule_example03.jpg" class="mw-file-description"><img src="../File/Arch_schedule_example03.jpg" decoding="async" width="858" height="555"></a></span>
</p><p><b>Der &Uuml;berpr&uuml;fungsmodus</b>
</p><p>Ein weiterer Weg, Ihr Modell zu &uuml;berpr&uuml;fen und Werte zu ermitteln, ist der <a href="../de/Arch_Survey.html" title="Arch Survey/de">&Uuml;berpr&uuml;fungs</a>-Modus. In diesem Modus k&ouml;nnen Sie auf Punkte, Kanten, Fl&auml;chen klicken oder doppelklicken, um ganze Objekte zu w&auml;hlen, und Sie erhalten H&ouml;he, L&auml;nge, Fl&auml;che oder K&ouml;rperinhalte, angezeigt im Modell, im FreeCAD-Ausgabefenster ausgedruckt und in die Zwischenablage kopiert, so dass Sie einfach die Werte in andere ge&ouml;ffnete Anwendungen &uuml;bernehmen k&ouml;nnen.
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_54.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_54.jpg" decoding="async" width="1024" height="666"></a></span>
</p><p><span id="Conclusion"></span>
</p>
<h2><span class="mw-headline" id="Abschluss">Abschluss</span></h2>
<p>Ich hoffe, dies gibt Ihnen einen guten &Uuml;berblick &uuml;ber die verf&uuml;gbaren Werkzeuge. Sehen Sie sich auch die Dokumentation zum <a href="../de/Arch_Workbench.html" title="Arch Workbench/de">Arch</a>- und <a href="../de/Draft_Workbench.html" title="Draft Workbench/de">Draft</a>-Arbeitsbereich und anderen an (es gibt weitere Werkzeuge, die ich hier nicht erw&auml;hnt habe), und allgemein den Rest der <a href="../de/Main_Page.html" title="Main Page/de">FreeCAD-Dokumentation</a>. Besuchen Sie auch das <a rel="nofollow" class="external text" href="http://forum.freecadweb.org">Forum</a>, denn viele Probleme k&ouml;nnen dort umgehend gel&ouml;st werden und folgen Sie meinem <a rel="nofollow" class="external text" href="http://yorik.uncreated.net/guestblog.php?tag=freecad">Blog</a>, um Neuigkeiten &uuml;ber die Arch-Arbeitsbereich-Entwicklung zu erfahren.
</p><p>Die in diesem Tutorial erzeugten Dateien finden Sie <a rel="nofollow" class="external text" href="http://yorik.uncreated.net/archive/projects/casa_artigas.fcstd">hier</a>.
</p><p><br>
</p>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: #fefefe;"><span typeof="mw:File"><a href="../File/Workbench_BIM.svg" class="mw-file-description"><img src="../File/Workbench_BIM.svg" decoding="async" width="24" height="24"></a></span> <a href="../de/BIM_Workbench.html" title="BIM Workbench/de">BIM</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid #aaaaaa; text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: #fefefe;">
<ul><li><b>2D drafting:</b> <a href="../de/BIM_Sketch.html" title="BIM Sketch/de">Sketch</a>, <a href="../de/Draft_Line.html" title="Draft Line/de">Line</a>, <a href="../de/Draft_Wire.html" title="Draft Wire/de">Polyline</a>, <a href="../de/Draft_Circle.html" title="Draft Circle/de">Circle</a>, <a href="../de/Draft_Arc.html" title="Draft Arc/de">Arc</a>, <a href="../de/Draft_Arc_3Points.html" title="Draft Arc 3Points/de">Arc by 3 points</a>, <a href="../de/Draft_Fillet.html" title="Draft Fillet/de">Fillet</a>, <a href="../de/Draft_Ellipse.html" title="Draft Ellipse/de">Ellipse</a>, <a href="../de/Draft_Polygon.html" title="Draft Polygon/de">Polygon</a>, <a href="../de/Draft_Rectangle.html" title="Draft Rectangle/de">Rectangle</a>, <a href="../de/Draft_BSpline.html" title="Draft BSpline/de">B-spline</a>, <a href="../de/Draft_BezCurve.html" title="Draft BezCurve/de">B&eacute;zier curve</a>, <a href="../de/Draft_CubicBezCurve.html" title="Draft CubicBezCurve/de">Cubic B&eacute;zier curve</a>, <a href="../de/Draft_Point.html" title="Draft Point/de">Point</a></li></ul>
<hr>
<ul><li><b>3D/BIM:</b> <a href="../de/BIM_Project.html" title="BIM Project/de">Project</a>, <a href="../de/Arch_Site.html" title="Arch Site/de">Site</a>, <a href="../de/Arch_Building.html" title="Arch Building/de">Building</a>, <a href="../de/Arch_Floor.html" title="Arch Floor/de">Level</a>, <a href="../de/Arch_Space.html" title="Arch Space/de">Space</a>, <a href="../de/Arch_Wall.html" title="Arch Wall/de">Wall</a>, <a href="../de/Arch_CurtainWall.html" title="Arch CurtainWall/de">Curtain Wall</a>, <a href="../de/BIM_Column.html" title="BIM Column/de">Column</a>, <a href="../de/BIM_Beam.html" title="BIM Beam/de">Beam</a>, <a href="../de/BIM_Slab.html" title="BIM Slab/de">Slab</a>, <a href="../de/BIM_Door.html" title="BIM Door/de">Door</a>, <a href="../de/Arch_Window.html" title="Arch Window/de">Window</a>, <a href="../de/Arch_Pipe.html" title="Arch Pipe/de">Pipe</a>, <a href="../de/Arch_PipeConnector.html" title="Arch PipeConnector/de">Pipe Connector</a>, <a href="../de/Arch_Stairs.html" title="Arch Stairs/de">Stairs</a>, <a href="../de/Arch_Roof.html" title="Arch Roof/de">Roof</a>, <a href="../de/Arch_Panel.html" title="Arch Panel/de">Panel</a>, <a href="../de/Arch_Frame.html" title="Arch Frame/de">Frame</a>, <a href="../de/Arch_Fence.html" title="Arch Fence/de">Fence</a>, <a href="../de/Arch_Truss.html" title="Arch Truss/de">Truss</a>, <a href="../de/Arch_Equipment.html" title="Arch Equipment/de">Equipment</a>
<ul><li><b>Reinforcement tools:</b> <a href="../de/Arch_Rebar.html" title="Arch Rebar/de">Custom Rebar</a>, <a href="../de/Reinforcement_StraightRebar.html" title="Reinforcement StraightRebar/de">Straight Rebar</a>, <a href="../de/Reinforcement_UShapeRebar.html" title="Reinforcement UShapeRebar/de">U-Shape Rebar</a>, <a href="../de/Reinforcement_LShapeRebar.html" title="Reinforcement LShapeRebar/de">L-Shape Rebar</a>, <a href="../de/Reinforcement_StirrupRebar.html" title="Reinforcement StirrupRebar/de">Stirrup</a>, <a href="../de/Reinforcement_BentShapeRebar.html" title="Reinforcement BentShapeRebar/de">Bent-Shape Rebar</a>, <a href="../de/Reinforcement_HelicalRebar.html" title="Reinforcement HelicalRebar/de">Helical Rebar</a>, <a href="../de/Reinforcement_ColumnRebars.html" title="Reinforcement ColumnRebars/de">Column Reinforcement</a>, <a href="../de/Reinforcement_BeamRebars.html" title="Reinforcement BeamRebars/de">Beam Reinforcement</a>, <a href="../de/Reinforcement_SlabRebars.html" title="Reinforcement SlabRebars/de">Slab Reinforcement</a>, <a href="../de/Reinforcement_FootingRebars.html" title="Reinforcement FootingRebars/de">Footing Reinforcement</a></li>
<li><b>Generic 3D tools:</b> <a href="../de/Arch_Profile.html" title="Arch Profile/de">Profile</a>, <a href="../de/BIM_Box.html" title="BIM Box/de">Box</a>, <a href="../de/Part_Builder.html" title="Part Builder/de">Shape builder...</a>, <a href="../de/Draft_Facebinder.html" title="Draft Facebinder/de">Facebinder</a>, <a href="../de/BIM_Library.html" title="BIM Library/de">Objects library</a>, <a href="../de/Arch_Component.html" title="Arch Component/de">Component</a>, <a href="../de/Arch_Reference.html" title="Arch Reference/de">External reference</a></li></ul></li></ul>
<hr>
<ul><li><b>Annotation:</b> <a href="../BIM_Text.html" title="BIM Text">Text</a>, <a href="../de/Draft_ShapeString.html" title="Draft ShapeString/de">Shape from text</a>, <a href="../de/BIM_DimensionAligned.html" title="BIM DimensionAligned/de">Aligned dimension</a>, <a href="../de/BIM_DimensionHorizontal.html" title="BIM DimensionHorizontal/de">Horizontal dimension</a>, <a href="../de/BIM_DimensionVertical.html" title="BIM DimensionVertical/de">Vertical dimension</a>, <a href="../de/BIM_Leader.html" title="BIM Leader/de">Leader</a>, <a href="../de/Draft_Label.html" title="Draft Label/de">Label</a>, <a href="../de/Arch_Axis.html" title="Arch Axis/de">Axis</a>, <a href="../de/Arch_AxisSystem.html" title="Arch AxisSystem/de">Axes System</a>, <a href="../de/Arch_Grid.html" title="Arch Grid/de">Grid</a>, <a href="../de/Arch_SectionPlane.html" title="Arch SectionPlane/de">Section Plane</a>, <a href="../de/Draft_Hatch.html" title="Draft Hatch/de">Hatch</a>, <a href="../de/BIM_TDPage.html" title="BIM TDPage/de">Page</a>, <a href="../de/BIM_TDView.html" title="BIM TDView/de">View</a>, <a href="../de/BIM_Shape2DView.html" title="BIM Shape2DView/de">Shape-based view</a></li></ul>
<hr>
<ul><li><b><a href="../de/Draft_Snap.html" title="Draft Snap/de">Snapping</a>:</b> <a href="../de/Draft_Snap_Lock.html" title="Draft Snap Lock/de">Snap lock</a>, <a href="../de/Draft_Snap_Endpoint.html" title="Draft Snap Endpoint/de">Snap endpoint</a>, <a href="../de/Draft_Snap_Midpoint.html" title="Draft Snap Midpoint/de">Snap midpoint</a>, <a href="../de/Draft_Snap_Center.html" title="Draft Snap Center/de">Snap center</a>, <a href="../de/Draft_Snap_Angle.html" title="Draft Snap Angle/de">Snap angle</a>, <a href="../de/Draft_Snap_Intersection.html" title="Draft Snap Intersection/de">Snap intersection</a>, <a href="../de/Draft_Snap_Perpendicular.html" title="Draft Snap Perpendicular/de">Snap perpendicular</a>, <a href="../de/Draft_Snap_Extension.html" title="Draft Snap Extension/de">Snap extension</a>, <a href="../de/Draft_Snap_Parallel.html" title="Draft Snap Parallel/de">Snap parallel</a>, <a href="../de/Draft_Snap_Special.html" title="Draft Snap Special/de">Snap special</a>, <a href="../de/Draft_Snap_Near.html" title="Draft Snap Near/de">Snap near</a>, <a href="../de/Draft_Snap_Ortho.html" title="Draft Snap Ortho/de">Snap ortho</a>, <a href="../de/Draft_Snap_Grid.html" title="Draft Snap Grid/de">Snap grid</a>, <a href="../de/Draft_Snap_WorkingPlane.html" title="Draft Snap WorkingPlane/de">Snap working plane</a>, <a href="../de/Draft_Snap_Dimensions.html" title="Draft Snap Dimensions/de">Snap dimensions</a>, <a href="../de/Draft_ToggleGrid.html" title="Draft ToggleGrid/de">Toggle grid</a>, <a href="../de/BIM_SetWPTop.html" title="BIM SetWPTop/de">Working Plane Top</a>, <a href="../de/BIM_SetWPFront.html" title="BIM SetWPFront/de">Working Plane Front</a>, <a href="../de/BIM_SetWPSide.html" title="BIM SetWPSide/de">Working Plane Side</a></li></ul>
<hr>
<ul><li><b>Modify:</b> <a href="../de/Draft_Move.html" title="Draft Move/de">Move</a>, <a href="../de/BIM_Copy.html" title="BIM Copy/de">Copy</a>, <a href="../de/Draft_Rotate.html" title="Draft Rotate/de">Rotate</a>, <a href="../de/BIM_Clone.html" title="BIM Clone/de">Clone</a>, <a href="../de/BIM_SimpleCopy.html" class="mw-redirect" title="BIM SimpleCopy/de">Create simple copy</a>, <a href="../de/BIM_Compound.html" class="mw-redirect" title="BIM Compound/de">Make compound</a>, <a href="../de/Draft_Offset.html" title="Draft Offset/de">Offset</a>, <a href="../de/BIM_Offset2D.html" class="mw-redirect" title="BIM Offset2D/de">2D Offset...</a>, <a href="../de/Draft_Trimex.html" title="Draft Trimex/de">Trimex</a>, <a href="../de/Draft_Join.html" title="Draft Join/de">Join</a>, <a href="../de/Draft_Split.html" title="Draft Split/de">Split</a>, <a href="../de/Draft_Scale.html" title="Draft Scale/de">Scale</a>, <a href="../de/Draft_Stretch.html" title="Draft Stretch/de">Stretch</a>, <a href="../de/Draft_Draft2Sketch.html" title="Draft Draft2Sketch/de">Draft to sketch</a>, <a href="../de/Draft_Upgrade.html" title="Draft Upgrade/de">Upgrade</a>, <a href="../de/Draft_Downgrade.html" title="Draft Downgrade/de">Downgrade</a>, <a href="../de/Arch_Add.html" title="Arch Add/de">Add component</a>, <a href="../de/Arch_Remove.html" title="Arch Remove/de">Remove component</a>, <a href="../de/Draft_OrthoArray.html" title="Draft OrthoArray/de">Array</a>, <a href="../de/Draft_PathArray.html" title="Draft PathArray/de">Path array</a>, <a href="../de/Draft_PolarArray.html" title="Draft PolarArray/de">Polar array</a>, <a href="../de/Draft_PointArray.html" title="Draft PointArray/de">Point array</a>, <a href="../de/Arch_CutPlane.html" title="Arch CutPlane/de">Cut with plane</a>, <a href="../de/Draft_Mirror.html" title="Draft Mirror/de">Mirror</a>, <a href="../de/BIM_Extrude.html" class="mw-redirect" title="BIM Extrude/de">Extrude...</a>, <a href="../de/BIM_Cut.html" class="mw-redirect" title="BIM Cut/de">Difference</a>, <a href="../de/BIM_Fuse.html" class="mw-redirect" title="BIM Fuse/de">Union</a>, <a href="../de/BIM_Common.html" class="mw-redirect" title="BIM Common/de">Intersection</a></li></ul>
<hr>
<ul><li><b>Manage:</b> <a href="../de/BIM_Setup.html" title="BIM Setup/de">BIM Setup...</a>, <a href="../de/BIM_Views.html" title="BIM Views/de">Views manager</a>, <a href="../de/BIM_ProjectManager.html" title="BIM ProjectManager/de">Manage project...</a>, <a href="../de/BIM_Windows.html" title="BIM Windows/de">Manage doors and windows...</a>, <a href="../de/BIM_IfcElements.html" title="BIM IfcElements/de">Manage IFC elements...</a>, <a href="../de/BIM_IfcQuantities.html" title="BIM IfcQuantities/de">Manage IFC quantities...</a>, <a href="../de/BIM_IfcProperties.html" title="BIM IfcProperties/de">Manage IFC properties...</a>, <a href="../de/BIM_Classification.html" title="BIM Classification/de">Manage classification...</a>, <a href="../de/BIM_Layers.html" title="BIM Layers/de">Manage layers...</a>, <a href="../de/BIM_Material.html" title="BIM Material/de">Material</a>, <a href="../de/Arch_Schedule.html" title="Arch Schedule/de">Schedule</a>, <a href="../de/BIM_Preflight.html" title="BIM Preflight/de">Preflight checks...</a>, <a href="../de/Draft_AnnotationStyleEditor.html" title="Draft AnnotationStyleEditor/de">Annotation styles...</a></li></ul>
<hr>
<ul><li><b>Utils:</b> <a href="../de/BIM_TogglePanels.html" title="BIM TogglePanels/de">Toggle bottom panels</a>, <a href="../de/BIM_Trash.html" title="BIM Trash/de">Move to Trash</a>, <a href="../de/BIM_WPView.html" title="BIM WPView/de">Working Plane View</a>, <a href="../de/Draft_SelectGroup.html" title="Draft SelectGroup/de">Select group</a>, <a href="../de/Draft_Slope.html" title="Draft Slope/de">Set slope</a>, <a href="../de/Draft_WorkingPlaneProxy.html" title="Draft WorkingPlaneProxy/de">Create working plane proxy</a>, <a href="../de/Draft_AddConstruction.html" title="Draft AddConstruction/de">Add to construction group</a>, <a href="../de/Arch_SplitMesh.html" title="Arch SplitMesh/de">Split Mesh</a>, <a href="../de/Arch_MeshToShape.html" title="Arch MeshToShape/de">Mesh to Shape</a>, <a href="../de/Arch_SelectNonSolidMeshes.html" title="Arch SelectNonSolidMeshes/de">Select non-manifold meshes</a>, <a href="../de/Arch_RemoveShape.html" title="Arch RemoveShape/de">Remove Shape from Arch</a>, <a href="../de/Arch_CloseHoles.html" title="Arch CloseHoles/de">Close Holes</a>, <a href="../de/Arch_MergeWalls.html" title="Arch MergeWalls/de">Merge Walls</a>, <a href="../de/Arch_Check.html" title="Arch Check/de">Check</a>, <a href="../de/Arch_ToggleIfcBrepFlag.html" title="Arch ToggleIfcBrepFlag/de">Toggle IFC Brep flag</a>, <a href="../de/Arch_ToggleSubs.html" title="Arch ToggleSubs/de">Toggle subcomponents</a>, <a href="../de/Arch_Survey.html" title="Arch Survey/de">Survey</a>, <a href="../de/BIM_Diff.html" title="BIM Diff/de">IFC Diff</a>, <a href="../de/BIM_IfcExplorer.html" title="BIM IfcExplorer/de">IFC explorer</a>, <a href="../de/Arch_IfcSpreadsheet.html" title="Arch IfcSpreadsheet/de">Create IFC spreadsheet...</a>, <a href="../index.php?title=BIM_ImagePlane/de&amp;action=edit&amp;redlink=1.html" class="new" title="BIM ImagePlane/de (page does not exist)">Image plane</a>, <a href="../index.php?title=BIM_Unclone/de&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Unclone/de (page does not exist)">Unclone</a>, <a href="../index.php?title=BIM_Rewire/de&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Rewire/de (page does not exist)">Rewire</a>, <a href="../index.php?title=BIM_Glue/de&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Glue/de (page does not exist)">Glue</a>, <a href="../index.php?title=BIM_Reextrude/de&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Reextrude/de (page does not exist)">Reextrude</a>
<ul><li><b>Panel tools:</b> <a href="../de/Arch_Panel.html" title="Arch Panel/de">Panel</a>, <a href="../de/Arch_Panel_Cut.html" title="Arch Panel Cut/de">Panel Cut</a>, <a href="../de/Arch_Panel_Sheet.html" title="Arch Panel Sheet/de">Panel Sheet</a>, <a href="../de/Arch_Nest.html" title="Arch Nest/de">Nest</a></li>
<li><b>Structure tools:</b> <a href="../de/Arch_Structure.html" title="Arch Structure/de">Structure</a>, <a href="../index.php?title=Arch_StructuralSystem/de&amp;action=edit&amp;redlink=1.html" class="new" title="Arch StructuralSystem/de (page does not exist)">Structural System</a>, <a href="../index.php?title=Arch_StructuresFromSelection/de&amp;action=edit&amp;redlink=1.html" class="new" title="Arch StructuresFromSelection/de (page does not exist)">Multiple Structures</a></li>
<li><b>IFC tools:</b> <a href="../index.php?title=IFC_Diff/de&amp;action=edit&amp;redlink=1.html" class="new" title="IFC Diff/de (page does not exist)">IFC Diff...</a>, <a href="../index.php?title=IFC_Expand/de&amp;action=edit&amp;redlink=1.html" class="new" title="IFC Expand/de (page does not exist)">IFC Expand</a>, <a href="../index.php?title=IFC_MakeProject/de&amp;action=edit&amp;redlink=1.html" class="new" title="IFC MakeProject/de (page does not exist)">Make IFC project</a>, <a href="../index.php?title=IFC_UpdateIOS/de&amp;action=edit&amp;redlink=1.html" class="new" title="IFC UpdateIOS/de (page does not exist)">IfcOpenShell update</a></li>
<li><b>Nudge:</b> <a href="../index.php?title=BIM_Nudge_Switch/de&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Nudge Switch/de (page does not exist)">Nudge Switch</a>, <a href="../index.php?title=BIM_Nudge_Up/de&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Nudge Up/de (page does not exist)">Nudge Up</a>, <a href="../index.php?title=BIM_Nudge_Down/de&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Nudge Down/de (page does not exist)">Nudge Down</a>, <a href="../index.php?title=BIM_Nudge_Left/de&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Nudge Left/de (page does not exist)">Nudge Left</a>, <a href="../index.php?title=BIM_Nudge_Right/de&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Nudge Right/de (page does not exist)">Nudge Right</a>, <a href="../index.php?title=BIM_Nudge_RotateLeft/de&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Nudge RotateLeft/de (page does not exist)">Nudge Rotate Left</a>, <a href="../index.php?title=BIM_Nudge_RotateRight/de&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Nudge RotateRight/de (page does not exist)">Nudge Rotate Right</a>, <a href="../index.php?title=BIM_Nudge_Extend/de&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Nudge Extend/de (page does not exist)">Nudge Extend</a>, <a href="../index.php?title=BIM_Nudge_Shrink/de&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Nudge Shrink/de (page does not exist)">Nudge Shrink</a></li></ul></li></ul>
<hr>
<ul><li><b>Additional:</b> <a href="../de/BIM_Preferences.html" title="BIM Preferences/de">Preferences</a>, <a href="../de/Fine-tuning.html" title="Fine-tuning/de">Fine tuning</a>, <a href="../de/Import_Export_Preferences.html" title="Import Export Preferences/de">Import Export Preferences</a>, <a href="../de/Arch_IFC.html" title="Arch IFC/de">IFC</a>, <a href="../de/Arch_DAE.html" title="Arch DAE/de">DAE</a>, <a href="../de/Arch_OBJ.html" title="Arch OBJ/de">OBJ</a>, <a href="../de/Arch_JSON.html" title="Arch JSON/de">JSON</a>, <a href="../de/Arch_3DS.html" title="Arch 3DS/de">3DS</a>, <a href="../de/Arch_SHP.html" title="Arch SHP/de">SHP</a></li></ul></div>
    </div></div>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: #fefefe;"><span typeof="mw:File"><a href="../File/User_hub.png" class="mw-file-description"><img src="../File/User_hub.png" decoding="async" width="24" height="24"></a></span> <a href="../de/User_hub.html" title="User hub/de">Anwenderdokumentation</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid #aaaaaa; text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: #fefefe;">
<ul><li><b><a href="../de/Getting_started.html" title="Getting started/de">Erste Schritte</a></b></li>
<li><b>Installation:</b> <a href="../de/Download.html" title="Download/de">Herunterladen</a>, <a href="../de/Installing_on_Windows.html" title="Installing on Windows/de">Windows</a>, <a href="../de/Installing_on_Linux.html" title="Installing on Linux/de">Linux</a>, <a href="../de/Installing_on_Mac.html" title="Installing on Mac/de">Mac</a>, <a href="../de/Installing_additional_components.html" title="Installing additional components/de">Zus&auml;tzliche Komponenten</a>, <a href="../de/Compile_on_Docker.html" title="Compile on Docker/de">Docker</a>, <a href="../de/AppImage.html" title="AppImage/de">AppImage</a>, <a href="../de/Ubuntu_Snap.html" title="Ubuntu Snap/de">Ubuntu Snap</a></li>
<li><b>Grundlagen:</b> <a href="../de/About_FreeCAD.html" title="About FreeCAD/de">&Uuml;ber FreeCAD</a>, <a href="../de/Interface.html" title="Interface/de">Graphische Oberfl&auml;che</a>, <a href="../de/Mouse_navigation.html" title="Mouse navigation/de">Mausbedienung</a>, <a href="../de/Selection_methods.html" title="Selection methods/de">Auswahlmethoden</a>, <a href="../de/Object_name.html" title="Object name/de">Objektname</a>, <a href="../de/Preferences_Editor.html" title="Preferences Editor/de">Voreinstellungseditor</a>, <a href="../de/Workbenches.html" title="Workbenches/de">Arbeitsbereiche</a>, <a href="../de/Document_structure.html" title="Document structure/de">Dokumentstruktur</a>, <a href="../de/Property.html" title="Property/de">Objekteigenschaften</a>, <a href="../de/Help_FreeCAD.html" title="Help FreeCAD/de">FreeCAD unterst&uuml;tzen</a>, <a href="../de/Donate.html" title="Donate/de">Spenden</a></li></ul>
<hr>
<ul><li><b>Hilfe:</b> <a href="../de/Tutorials.html" title="Tutorials/de">Anleitungen</a>, <a href="../de/Video_tutorials.html" title="Video tutorials/de">Videoanleitungen</a></li>
<li><b><a href="../de/Workbenches.html" title="Workbenches/de">Arbeitsbereiche</a>:</b> <a href="../de/Std_Base.html" title="Std Base/de">Std Base</a>, <a href="../de/Arch_Workbench.html" title="Arch Workbench/de">Arch</a>, <a href="../de/Assembly_Workbench.html" title="Assembly Workbench/de">Assembly</a>, <a href="../de/BIM_Workbench.html" title="BIM Workbench/de">BIM</a>, <a href="../de/CAM_Workbench.html" title="CAM Workbench/de">CAM</a>, <a href="../de/Draft_Workbench.html" title="Draft Workbench/de">Draft</a>, <a href="../de/FEM_Workbench.html" title="FEM Workbench/de">FEM</a>, <a href="../de/Inspection_Workbench.html" title="Inspection Workbench/de">Inspection</a>, <a href="../de/Material_Workbench.html" title="Material Workbench/de">Material</a>, <a href="../de/Mesh_Workbench.html" title="Mesh Workbench/de">Mesh</a>, <a href="../de/OpenSCAD_Workbench.html" title="OpenSCAD Workbench/de">OpenSCAD</a>, <a href="../de/Part_Workbench.html" title="Part Workbench/de">Part</a>, <a href="../de/PartDesign_Workbench.html" title="PartDesign Workbench/de">PartDesign</a>, <a href="../de/Points_Workbench.html" title="Points Workbench/de">Points</a>, <a href="../de/Reverse_Engineering_Workbench.html" title="Reverse Engineering Workbench/de">Reverse Engineering</a>, <a href="../de/Robot_Workbench.html" title="Robot Workbench/de">Robot</a>, <a href="../de/Sketcher_Workbench.html" title="Sketcher Workbench/de">Sketcher</a>, <a href="../de/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/de">Spreadsheet</a>, <a href="../de/Surface_Workbench.html" title="Surface Workbench/de">Surface</a>, <a href="../de/TechDraw_Workbench.html" title="TechDraw Workbench/de">TechDraw</a>, <a href="../de/Testing.html" title="Testing/de">Test Framework</a></li></ul>
<hr>
<ul><li><b><a href="../de/Addon.html" title="Addon/de">Addon</a>:</b> <a href="../de/Std_AddonMgr.html" title="Std AddonMgr/de">Addon-Manager</a>, <a href="../de/External_workbenches.html" title="External workbenches/de">Externe Arbeitsbereiche</a>, <a href="../de/Scripting_and_macros.html" title="Scripting and macros/de">Skripten und Makros</a></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="../de/User_hub.html" title="User hub/de">Anwenderzentrum</a>, <a href="../de/Power_users_hub.html" title="Power users hub/de">Hauptanwenderzentrum</a>, <a href="../de/Developer_hub.html" title="Developer hub/de">Entwicklerzentrum</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20250613120158
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc, no&#8208;toc&#8208;conversion]
CPU time usage: 0.244 seconds
Real time usage: 0.268 seconds
Preprocessor visited node count: 634/1000000
Post&#8208;expand include size: 27703/2097152 bytes
Template argument size: 12531/2097152 bytes
Highest expansion depth: 5/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 2069/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   17.010      1 -total
 42.46%    7.222      1 Template:BIM_Tools_navi/de
 23.09%    3.927      2 Template:Navigation_menu_2
 14.27%    2.427      1 Template:TutorialInfo/de
 14.12%    2.402      1 Template:Userdocnavi/de
  8.71%    1.482      5 Template:Note
  7.39%    1.257      7 Template:KEY
  4.84%    0.824      2 Template:Clear
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:27159-0!canonical and timestamp 20250613120158 and revision id 1591318. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>