<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Books/de</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="de" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Books&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--high" lang="de" dir="ltr">Deutsch</span></li>
<li><a href="../Books.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Books (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../fr/Books.html" class="mw-pt-progress mw-pt-progress--high" title="Livres (77% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/Books.html" class="mw-pt-progress mw-pt-progress--high" title="Libri (77% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Books.html" class="mw-pt-progress mw-pt-progress--high" title="Ksi&#261;&#380;ki o FreeCAD (77% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../ru/Books.html" class="mw-pt-progress mw-pt-progress--low" title="&#1050;&#1085;&#1080;&#1075;&#1080; (4% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li>
<li><a href="../ko/Books.html" class="mw-pt-progress mw-pt-progress--high" title="&#52293; (77% translated)" lang="ko" dir="ltr">&#54620;&#44397;&#50612;</a></li></ul></div>
<p>Auf dieser Seite sind die uns bekannten B&uuml;cher &uuml;ber FreeCAD aufgelistet:
</p>
<meta property="mw:PageProp/toc">
<h2><span id="FreeCAD_Beginner.E2.80.99s_Handbook"></span><span class="mw-headline" id="FreeCAD_Beginner&rsquo;s_Handbook">FreeCAD Beginner&rsquo;s Handbook</span></h2>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>By Aleksander Sadowski, published December 2025, paperback
</p>
</div>
<figure class="mw-default-size" typeof="mw:File/Thumb"><a href="../File/Freecad-beginners-handbook-book-cover.jpg" class="mw-file-description"><img alt="FreeCAD Beginners Handbook cover" src="../File/Freecad-beginners-handbook-book-cover.jpg" decoding="async" width="300" height="431" class="mw-file-element" data-file-width="1000" data-file-height="1436"></a><figcaption></figcaption></figure>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Learn 3D design with FreeCAD through real-world examples and hands-on projects.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Discover the world of 3D design with FreeCAD, the free and open-source CAD software used by engineers, designers, and makers worldwide. This full-color, practical guide takes you step by step through a reliable modeling workflow, showing you how to create real-world products and inventions, and even complete a complex project like designing a Mars Rover from scratch to solidify your knowledge.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<ul><li>Gain the confidence to develop your own inventions, from initial idea to finished, 3D-printable product.</li>
<li>Learn the fundamentals of solid 3D modeling and how to apply them effectively in FreeCAD.</li>
<li>Create individual 3D parts using Part Design and Sketcher, then digitally assemble them to verify their function.</li>
<li>Prepare and export models for 3D printing using slicer software, ensuring your designs are ready for production.</li>
<li>Complete projects that teach real-world applications of 3D design, including practical gadgets and a Mars Rover project to consolidate your skills.</li></ul>
</div>
<p>Am Ende dieses Buches wird man in der Lage sein, die eigenen innovativen Gadgets zu entwerfen, reale technische L&ouml;sungen zu erkunden und selbstbewusst Modelle f&uuml;r den 3D-Druck vorzubereiten. Das enthaltene Mars-Rover-Projekt bietet eine herausfordernde, aber lohnende Gelegenheit, alle erlernten Techniken in einem einzigen, zusammenh&auml;ngenden Entwurf anzuwenden.
</p><p><b><a rel="nofollow" class="external free" href="https://www.amazon.de/FreeCAD-Beginners-Handbook-Aleksander-Sadowski/dp/B0G9HXYYGX">https://www.amazon.de/FreeCAD-Beginners-Handbook-Aleksander-Sadowski/dp/B0G9HXYYGX</a></b>
</p>
<div style="clear:both"></div>
<p><span id="FreeCAD_for_Makers"></span>
</p>
<h2><span class="mw-headline" id="FreeCAD_for_Makers">FreeCAD for Makers</span></h2>
<p>Von Jo Hinchliffe, ver&ouml;ffentlicht September 2022, kostenloses E-Book (englischsprachig)
</p>
<figure class="mw-default-size" typeof="mw:File/Thumb"><a href="../index.php?title=Freecad_book_concretedog.png&amp;filetimestamp=20220921094257&amp;.html" class="mw-file-description"><img src="../File/Freecad_book_concretedog.png" decoding="async" width="300" height="394" class="mw-file-element" data-file-width="500" data-file-height="657"></a><figcaption></figcaption></figure>
<p>FreeCAD ist die Nummer eins unter den kostenlosen 3D-Konstruktionsprogrammen, und dieser PDF-Leitfaden ist der beste Einstieg in die Software. Wir begleiten Sie vom absoluten Anf&auml;nger bis zum fortgeschrittenen Anwender, von den Grundlagen des Zeichnens einer Linie und der Umwandlung in 3D bis hin zum parametrischen Design, dem Importieren von Objekten aus Fotos, dem Entwerfen von Blechteilen und vielem mehr.
</p><p>Da FreeCAD eine freie Software ist, k&ouml;nnen ihre Nutzer sie erweitern, indem sie Erweiterungen f&uuml;r die Software schreiben, die ihren Bed&uuml;rfnissen entsprechen. Diese Add-ons, die als Workbenches bezeichnet werden, decken eine Vielzahl von Anwendungsbereichen ab, darunter PCB-Design, Rohrleitungen, Holzrahmenbau, Architekturdesign ... die Liste der praktischen Anwendungsf&auml;lle l&auml;sst sich endlos fortsetzen. Was auch immer Sie also bauen m&ouml;chten, Sie werden eine FreeCAD-Workbench daf&uuml;r finden.
</p><p><b><a rel="nofollow" class="external free" href="https://hackspace.raspberrypi.com/books/freecad">https://hackspace.raspberrypi.com/books/freecad</a></b>
</p>
<div style="clear:both"></div>
<h2><span class="mw-headline" id="FreeCAD_for_architectural_drawing">FreeCAD for architectural drawing</span></h2>
<p>Von Allan Brito, ver&ouml;ffentlicht im August 2020, E-Book/Taschenbuch (englischsprachig)
</p>
<figure class="mw-default-size" typeof="mw:File/Thumb"><a href="../index.php?title=Freecad_book_allanbrito.png&amp;filetimestamp=20220921094742&amp;.html" class="mw-file-description"><img src="../File/Freecad_book_allanbrito.png" decoding="async" width="300" height="427" class="mw-file-element" data-file-width="427" data-file-height="608"></a><figcaption></figcaption></figure>
<p>M&ouml;chten Sie eine kostenlose Open-Source-Software f&uuml;r Ihre CAD-Projekte nutzen? Lernen Sie FreeCAD kennen und entdecken Sie die unglaubliche Vielfalt an Optionen zum Erstellen von technischen Zeichnungen und 3D-Modellen f&uuml;r Architektur, Ingenieurwesen und vieles mehr.
</p><p>In diesem Buch lernen Sie, wie Sie mit FreeCAD traditionelle technische Zeichnungen f&uuml;r die Architektur erstellen k&ouml;nnen. Als Beispiel f&uuml;r die Projektentwicklung lernen Sie, wie Sie mit FreeCAD einen vollst&auml;ndigen Grundriss zeichnen k&ouml;nnen. Wir werden diesem Grundriss alle traditionellen Elemente einer Architekturzeichnung hinzuf&uuml;gen, wie M&ouml;bel, Ma&szlig;linien, Textanmerkungen und vieles mehr.
</p><p>In den letzten Kapiteln k&ouml;nnen wir diesen Grundriss entwerfen und entweder im DXF-Format oder als PDF exportieren. Sie k&ouml;nnen den Grundriss zum Seitenlayout f&uuml;r den Druck hinzuf&uuml;gen, wobei ein Titelblock aus einer Vorlage in FreeCAD verwendet wird.
</p><p>Sie ben&ouml;tigen keine Vorkenntnisse mit FreeCAD, da wir ganz von vorne beginnen. Von den Grundlagen der Benutzeroberfl&auml;che bis zum Zeichnen eines Grundrisses!
</p><p><b><a rel="nofollow" class="external free" href="https://www.blender3darchitect.com/freecad-for-architectural-drawing/">https://www.blender3darchitect.com/freecad-for-architectural-drawing/</a></b>
</p>
<div style="clear:both"></div>
<h2><span class="mw-headline" id="FreeCAD_for_Inventors">FreeCAD for Inventors</span></h2>
<p>Von Brad Collette, ver&ouml;ffentlicht im September 2018, E-Book/Taschenbuch (englischsprachig)
</p>
<figure class="mw-default-size" typeof="mw:File/Thumb"><a href="../index.php?title=Freecad_book_inventors.jpg&amp;filetimestamp=20220921100311&amp;.html" class="mw-file-description"><img src="../File/Freecad_book_inventors.jpg" decoding="async" width="300" height="455" class="mw-file-element" data-file-width="413" data-file-height="626"></a><figcaption></figcaption></figure>
<p>Dieses Buch f&uuml;hrt Anf&auml;nger und fortgeschrittene Anwender in die am h&auml;ufigsten verwendeten Werkzeuge und Techniken von FreeCAD ein. Teil eins macht neue Anwender mit den Konzepten und der Benutzeroberfl&auml;che von FreeCAD vertraut. Teil zwei vermittelt anhand einer Reihe von Beispielen verschiedene Modellierungstechniken. Teil drei nutzt die Beispiele, um die F&auml;higkeiten von FreeCAD zur Erstellung von technischen Zeichnungen, G-Code f&uuml;r CNC-Maschinen, Raytracing-Bildern und vielem mehr zu veranschaulichen.
</p><p><b><a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?t=30959">https://forum.freecad.org/viewtopic.php?t=30959</a></b>
</p>
<div style="clear:both"></div>
<h2><span class="mw-headline" id="FreeCAD_How-to">FreeCAD How-to</span></h2>
<p>Von Daniel Falck, Brad Collette, ver&ouml;ffentlicht im September 2012, E-Book/Taschenbuch (englischsprachig)
</p>
<figure class="mw-default-size" typeof="mw:File/Thumb"><a href="../index.php?title=Freecad_book_howto.jpg&amp;filetimestamp=20220921095336&amp;.html" class="mw-file-description"><img src="../File/Freecad_book_howto.jpg" decoding="async" width="300" height="370" class="mw-file-element" data-file-width="405" data-file-height="500"></a><figcaption></figcaption></figure>
<p>FreeCAD ist eine universelle Plattform f&uuml;r die CAD-Entwicklung. Sie kann durch verschiedene Workbenches erweitert werden, um unterschiedliche Probleme zu l&ouml;sen. FreeCAD richtet sich direkt an die Ingenieursgemeinschaft und ist eine Open-Source-Designanwendung, die auf Erweiterbarkeit ausgelegt ist. Die leistungsstarke Skriptsprache Python ist tief in die DNA von FreeCAD eingebunden und bietet Anwendern beispiellose M&ouml;glichkeiten zur Automatisierung und Innovation.
</p><p>&bdquo;FreeCAD [How-to]&rdquo; ist eine kompakte, schnelle Einf&uuml;hrung in die wichtigsten Arbeitsbereiche und die Designphilosophie von FreeCAD. Der Leser erh&auml;lt eine praktische Einf&uuml;hrung in verschiedene Modellierungstechniken und lernt, wie Python die Automatisierung von Makros und das Design erm&ouml;glicht.
</p><p>FreeCAD erm&ouml;glicht es Benutzern, auf vielf&auml;ltige Weise zu entwerfen: vom Zeichnen von 2D-Entw&uuml;rfen als Linien und Kreise bis hin zum Kombinieren einfacher Volumenk&ouml;rper zu komplexen 3D-Formen. Objekte k&ouml;nnen sogar durch Code erstellt oder ge&auml;ndert werden, den Sie in Python schreiben. FreeCAD erm&ouml;glicht es Power-Usern sogar, die Anwendung selbst mit neuen Dialogen, Bedienfeldern und Skripten zu erweitern. Dieses Buch zeigt Ihnen nicht nur, wie Sie mit FreeCAD im traditionellen GUI-Modus beginnen k&ouml;nnen, sondern lehrt Sie auch, wie Sie seine leistungsstarke Skriptsprache f&uuml;r mehr Leistung nutzen k&ouml;nnen.
</p><p><b><a rel="nofollow" class="external free" href="https://www.packtpub.com/product/freecad/9781849518864">https://www.packtpub.com/product/freecad/9781849518864</a></b>
</p>
<div style="clear:both"></div>
<!-- 
NewPP limit report
Cached time: 20251227112003
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.039 seconds
Real time usage: 0.077 seconds
Preprocessor visited node count: 47/1000000
Post&#8208;expand include size: 150/2097152 bytes
Template argument size: 0/2097152 bytes
Highest expansion depth: 2/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1348/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    2.536      1 -total
 88.87%    2.254      5 Template:Clear
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:302897-0!canonical and timestamp 20251227112002 and revision id 1721092. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>