<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Developing FreeCAD with GitKraken/de</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="de" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Developing+FreeCAD+with+GitKraken&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--high" lang="de" dir="ltr">Deutsch</span></li>
<li><a href="../Developing_FreeCAD_with_GitKraken.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Developing FreeCAD with GitKraken (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../fr/Developing_FreeCAD_with_GitKraken.html" class="mw-pt-progress mw-pt-progress--complete" title="D&eacute;velopper FreeCAD avec GitKraken (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/Developing_FreeCAD_with_GitKraken.html" class="mw-pt-progress mw-pt-progress--low" title="Sviluppo di FreeCAD con GitKraken (2% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Developing_FreeCAD_with_GitKraken.html" class="mw-pt-progress mw-pt-progress--complete" title="Rozw&oacute;j FreeCAD z GitKraken (100% translated)" lang="pl" dir="ltr">polski</a></li></ul></div>
<p><span id="Foreword"></span>
</p>
<h2><span class="mw-headline" id="Vorwort">Vorwort</span></h2>
<div style="clear:right; margin-bottom: .5em; float: right; padding: .5em 0 .8em 1.4em; background: none;"><meta property="mw:PageProp/toc"></div>
<p>FreeCAD verwendet <a rel="nofollow" class="external text" href="https://git-scm.com/">Git</a> zur Verwaltung des Quellcodes. Dieses Dokument ist eine oberfl&auml;chliche Einf&uuml;hrung in <a rel="nofollow" class="external text" href="https://www.gitkraken.com/">GitKraken</a>, eine grafische Benutzeroberfl&auml;che von Git. GitKraken ist eine propriet&auml;re Software, die f&uuml;r den nicht kommerziellen Gebrauch kostenlos ist; du brauchst GitKraken nicht, um Code f&uuml;r FreeCAD zu entwickeln, aber viele Entwickler m&ouml;gen es und finden es n&uuml;tzlich, ihre Entwicklung zu verwalten. FreeCAD unterst&uuml;tzt GitKraken nicht, aber wir hoffen, dass ein Leitfaden wie dieser den Anwendern zeigt, wie einfach es ist, die Entwicklungsumgebung einzurichten, und ermutigt mehr Menschen, sich zu beteiligen.
</p><p>Weitere Informationen zur allgemeinen Git Nutzung &uuml;ber die Befehlszeile findest Du unter <a href="../Source_code_management.html" title="Source code management">Source code management</a> und im Online Buch <a rel="nofollow" class="external text" href="https://git-scm.com/book/en/v2">Pro Git</a>. Zur Kompilierung von FreeCAD siehe <a href="../de/Compiling.html" title="Compiling/de"> Kompilieren</a>.
</p><p><span id="Introduction"></span>
</p>
<h2><span class="mw-headline" id="Einleitung">Einleitung</span></h2>
<p>Git ist ein leistungsf&auml;higes Revisionskontrollsystem, das h&auml;ufig verwendet wird, um die Entwicklung von Computercode zu verfolgen. Obwohl es sich um ein komplexes System handelt, ben&ouml;tigst Du in der Regel nur einige Hintergrundinformationen &uuml;ber die Funktionsweise und einige wenige Terminalbefehle. Eine grafische Benutzeroberfl&auml;che (GUI) erleichtert die Lernkurve. <a rel="nofollow" class="external text" href="https://www.gitkraken.com/">GitKraken</a> ist ein propriet&auml;res Programm, das f&uuml;r den nicht kommerziellen Gebrauch kostenlos ist und auf dem Ger&uuml;st <a rel="nofollow" class="external text" href="https://electronjs.org">Electron</a> l&auml;uft, d.h. es ist plattform&uuml;bergreifend und kann unter Linux, MacOS und Windows gleicherma&szlig;en verwendet werden.
</p><p><span id="Setting_up_Git_development"></span>
</p>
<h2><span class="mw-headline" id="Einrichten_der_Git_Entwicklung">Einrichten der Git Entwicklung</span></h2>
<p>Es gibt unterschiedliche Wege zum Herunterladen von GitKraken, abh&auml;ngig von Deinem Betriebssystem. In Linux Distributionen kann man es manchmal &uuml;ber den Paketmanager beziehen.
</p>
<ol> 
  <li>GitKraken Herunterladen.</li>
  <li>Gehe in deinem Webbrowser zu: <code><a rel="nofollow" class="external free" href="https://github.com/FreeCAD/FreeCAD">https://github.com/FreeCAD/FreeCAD</a></code>.<br>

<span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Github-Fork-button.png&amp;filetimestamp=20220317005144&amp;.html" class="mw-file-description"><img src="../File/Github-Fork-button.png" decoding="async" width="927" height="177" class="mw-file-element" data-file-width="927" data-file-height="177"></a></span>

  </li>
  <li>Auf die Schaltfl&auml;che <b>Fork</b> klicken. Dadurch wird das Repository <code>FreeCAD/FreeCAD</code> in das eigene Konto geklont. Mit anderen Worten: Die URL f&uuml;r den Zugriff auf den Fork lautet:

<pre>https://github.com/GITHUBUSERNAME/FreeCAD.git
</pre>
  </li><li> &Ouml;ffne GitKraken, gehe zu <b>Datei &rarr; Klone Repo</b>, und gib diese Addresse ein.<br>

<span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=GitKraken-Clone-Repo-dialogue.png&amp;filetimestamp=20170722164112&amp;.html" class="mw-file-description"><img src="../File/GitKraken-Clone-Repo-dialogue.png" decoding="async" width="997" height="287" class="mw-file-element" data-file-width="997" data-file-height="287"></a></span>

  </li>
    <li>GitKraken wird nun dein pers&ouml;nliches Repositorium <code>git klonen</code>.

Bitte den Unterschied zwischen <a rel="nofollow" class="external text" href="https://stackoverflow.com/questions/9257533/what-is-the-difference-between-origin-and-upstream-on-github#9257901">origin vs. upstream</a> Remote-Repository lesen. Im Wesentlichen ist der Fork von FreeCAD das <code>origin</code>-Repository, w&auml;hrend das offizielle FreeCAD-Repository <code>upstream</code> ist. Man muss nun den Upstream entsprechend einstellen.
  </li><li>Die Seitenleiste in Gitkraken suchen. Dort gibt es einen Abschnitt <b>Lokal</b> und einen Abschnitt <b>Remote</b>. <b>Lokal</b> bezieht sich auf die lokalen Branches. <b>Remote</b> bezieht sich auf Remote-Repositorys und deren Branches. F&uuml;gen wir das FreeCAD-Repo als Remote hinzu. Im Abschnitt <b>Remote</b> auf die Schaltfl&auml;che <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">+</span> (wie in der Abbildung unten gezeigt) klicken.<br>

<span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Gitkraken-remote-sidebar.png&amp;filetimestamp=20220317005945&amp;.html" class="mw-file-description"><img src="../File/Gitkraken-remote-sidebar.png" decoding="async" width="669" height="265" class="mw-file-element" data-file-width="669" data-file-height="265"></a></span>

</li>
  <li>Ein Dialogfeld <b>Add Remote</b> wird ge&ouml;ffnet. Auf das Github-Symbol (1) klicken. Im Feld <b>Github-Repo</b> (2) nach <code>FreeCAD/FreeCAD</code> suchen und darauf klicken. Im Feld <b>Name</b> <code>upstream</code> eintippen. Dann auf die Schaltfl&auml;che <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;"> Schaltfl&auml;che hinzuf&uuml;gen</span> klicken.<br>

<span typeof="mw:File"><a href="../index.php?title=Gitkraken-add-remote-dark.png&amp;filetimestamp=20220317011428&amp;.html" class="mw-file-description"><img src="../File/Gitkraken-add-remote-dark.png" decoding="async" width="400" height="308" class="mw-file-element" data-file-width="567" data-file-height="436"></a></span>

  </li>
  <li>Der Dialog wird geschlossen und man gelangt zur&uuml;ck zur Hauptschnittstelle von GitKraken. Diesmal den Abschnitt <b>Lokal</b> in der Seitenleiste suchen und auf den Zweig <code>master</code> doppelklicken, um zu diesem zu wechseln. In der Befehlszeile entspricht dies

<pre>git checkout master
</pre>
  </li>
  <li>Auf das Symbol <b>Push</b> oben rechts in der Benutzeroberfl&auml;che klicken. Dadurch wird der <b>Lokale Master</b> auf dem <b>Remote-Origin-Master</b> &uuml;bertragen.</li>
</ol>
<p><span id="The_GitKraken_interface"></span>
</p>
<h2><span id="Die_GitKraken_Oberfl.C3.A4che"></span><span class="mw-headline" id="Die_GitKraken_Oberfl&auml;che">Die GitKraken Oberfl&auml;che</span></h2>
<p>F&uuml;r weitere Informationen konsultiere GitKraken <a rel="nofollow" class="external text" href="https://support.gitkraken.com/start-here/guide/">Erste Schritte Leitfaden</a>.
</p>
<table class="wikitable">

<caption><i>Lokal</i> bezeichnet den lokalen Rechner
</caption>
<tbody><tr>
<td>Lokaler Master</td>
<td>Die lokale Verzweigung des FreeCAD-Master-Zweigs, gekennzeichnet durch die <b>blaue</b> Linie in der Bildschirmaufnahme.
<p>Der Eintrag ist <b>gr&uuml;n</b> hervorgehoben, was bedeutet, dass der Zweig derzeit aktiv ist  (<code>git checkout</code>).
</p>
</td></tr>
<tr>
<td>Lokaler &lt;branch-name&gt;</td>
<td>Alle anderen Branches auf Ihrem lokalen Rechner. In der  Bildschirmaufnahme sieht man die Branches <code>editor_fixes</code> und <code>editor_fixes_typos</code>
</td></tr></tbody></table>
<table class="wikitable">

<caption><i>Remote</i> indicates a remote repository, for example in GitHub
</caption>
<tbody><tr>
<td>Remote upstream</td>
<td>The official FreeCAD repository <code><a rel="nofollow" class="external free" href="https://github.com/FreeCAD/FreeCAD">https://github.com/FreeCAD/FreeCAD</a></code>, indicated by the <b>green</b> line in the screenshot.
</td></tr>
<tr>
<td>Remote origin</td>
<td>Your personal fork of FreeCAD, <code>https://github.com/YourGitHubUsername/FreeCAD</code>, indicated by the <b>red</b> line in the screenshot.
</td></tr></tbody></table>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=GitKraken-Main-Screen-sm.jpg&amp;filetimestamp=20170723202258&amp;.html" class="mw-file-description"><img src="../File/GitKraken-Main-Screen-sm.jpg" decoding="async" width="879" height="616" class="mw-file-element" data-file-width="879" data-file-height="616"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">GitKraken-Oberfl&auml;che mit drei lokalen Branches, darunter ein lokaler <i>master</i>, sowie den Remote-Repositorys <code>origin</code> und <code>upstream</code>, die jeweils &uuml;ber einen Master- und einen Release-Branch verf&uuml;gen.</p>
<p>In der Abbildung sind die Remote-Zweige <b>Local master</b> und <b>Remote origin master</b> drei Commits hinter dem <b>Remote upstream master</b>, also dem offiziellen FreeCAD-Quellcode. Dies wird durch die Symbole angezeigt, die drei Schritte hinter der Kette liegen, die die Commit-Historie des Master-Zweigs darstellt. Siehe <a class="mw-selflink-fragment" href="#Rebasing">Rebasing</a>, um die verz&ouml;gerten Zweige zu aktualisieren.
</p>
<h2><span class="mw-headline" id="Rebasing">Rebasing</span></h2>
<ul><li>Checkout the <b>Local master</b> branch by double clicking on it (<code>git checkout master</code>)</li>
<li>Move the mouse to the last upstream commit, right click, and choose <b>Rebase master onto upstream/master</b> (<code>git pull upstream master</code>)</li>
<li>Now press the <b>Push</b> button (<code>git push origin master</code>). This pushes from your <b>Local master</b> to the <b>Remote origin master</b>.</li></ul>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=GitKraken-Rebasing.gif&amp;filetimestamp=20170723204244&amp;.html" class="mw-file-description"><img src="../File/GitKraken-Rebasing.gif" decoding="async" width="1280" height="692" class="mw-file-element" data-file-width="1280" data-file-height="692"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Durch das Rebasing eines lokalen Masters wird dieser so aktualisiert, dass er mit dem Inhalt des Upstream-Masters &uuml;bereinstimmt.</p>
<p><span id="Branches"></span>
</p>
<h2><span class="mw-headline" id="Zweige">Zweige</span></h2>
<p>Branches sind eine Funktion, die Git im Vergleich zu anderen Revisionssystemen so leistungsstark macht. Branches sind keine vollst&auml;ndigen Forks, sondern definieren Snapshots, bei denen eine Version des Codes vom Master-Branch abzweigt. Wenn Sie den FreeCAD-Code &auml;ndern m&ouml;chten, erstellen Sie zun&auml;chst einen Branch, nehmen Sie dann die &Auml;nderungen vor und f&uuml;hren Sie anschlie&szlig;end Ihre Commits wieder mit dem Master-Branch zusammen. Mit Git ist es ganz einfach, Branches zu erstellen, zusammenzuf&uuml;hren und zu l&ouml;schen, wenn Sie sie nicht mehr ben&ouml;tigen. Bitte lesen Sie <a rel="nofollow" class="external text" href="https://support.gitkraken.com/working-with-repositories/branching-and-merging">Branching and Merging</a>, um mehr &uuml;ber diesen Prozess in GitKraken zu erfahren.
</p>
<ol><li>Make sure you currently have the master branch active (double click on it, <code>git checkout master</code>). In GitKraken the <b>Local master</b> branch should be highlighted in <b>green</b>.</li>
<li>Click the <b>Branch</b> button to create a new branch and enter its new name (<code>git checkout -b new-name-of-your-branch</code>).</li></ol>
<p><span id="Making_pull_requests"></span>
</p>
<h2><span class="mw-headline" id="Pull_Anfragen_stellen">Pull Anfragen stellen</span></h2>
<p><a rel="nofollow" class="external text" href="https://help.github.com/articles/about-pull-requests/">Pull-Anfragen</a> (PRs) sind erforderlich, um den Code in einem Branch in Ihrem lokalen Repository mit dem Code im <code>upstream</code>-Repository zusammenzuf&uuml;hren. Zusammenfassend l&auml;sst sich sagen, dass man, nachdem man den Branch ge&auml;ndert habt, diesen zum GitHub-Fork (<code>origin</code>, <code>https://github.com/GITHUBUSERNAME/FreeCAD.git</code>) pushen und von dort aus einen Pull-Request an <code>upstream</code> stellen muss. GitKraken erspart einige Klicks, da man Pull-Requests ganz einfach erstellen kann, anstatt die GitHub-Oberfl&auml;che zu verwenden.
</p><p>Steps in GitKraken:
</p>
<ul><li>Find you local branch on the interface and make sure it's active (double click on it).</li>
<li>Right click the branch name and find the option to <b>Push &lt;your-branch-name&gt; and start a pull request</b>.</li></ul>
<dl><dd>GitKraken will open a dialog that asks you to confirm the repository which your branch will use to pull and push. It will then push your local branch to that remote repository.</dd></dl>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Gitkraken-How_to_PR.png&amp;filetimestamp=20180925142311&amp;.html" class="mw-file-description"><img src="../File/Gitkraken-How_to_PR.png" decoding="async" width="610" height="700" class="mw-file-element" data-file-width="610" data-file-height="700"></a></span>
</p>
<ul><li>GitKraken fragt, wie man den Remote-Branch benennen m&ouml;chte. Der Standardname entspricht dem Namen, den der Branch lokal auf dem Computer hat.</li></ul>
<p><span typeof="mw:File"><a href="../index.php?title=Gitkraken-How-to-PR-Prompt-for-Branch-name.png&amp;filetimestamp=20180925142828&amp;.html" class="mw-file-description"><img src="../File/Gitkraken-How-to-PR-Prompt-for-Branch-name.png" decoding="async" width="1200" height="104" class="mw-file-element" data-file-width="1600" data-file-height="139"></a></span>
</p>
<ul><li>GitKraken then opens up another dialog asking the repositories and branches to merge, and the direction (from and to).</li></ul>
<dl><dd>You normally want to merge from the remote <b>origin &lt;your-branch-name&gt;</b> (<code>GITHUBUSERNAME/FreeCAD</code>) to the remote <b>upstream master</b> branch (<code>FreeCAD/FreeCAD</code>). Be sure to enter a good title for the pull request, and write a more descriptive paragraph if your changes are significant. Consult the official documentation of <a rel="nofollow" class="external text" href="https://support.gitkraken.com/working-with-repositories/pull-requests">GitKraken</a> for more information.</dd></dl>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Gitkraken-How-to-PR-Github-Dialog-breakdown.png&amp;filetimestamp=20180925145959&amp;.html" class="mw-file-description"><img src="../File/Gitkraken-How-to-PR-Github-Dialog-breakdown.png" decoding="async" width="778" height="735" class="mw-file-element" data-file-width="778" data-file-height="735"></a></span>
</p><p><span id="Resolving_merge_conflicts"></span>
</p>
<h2><span id="Aufl.C3.B6sen_von_Zusammenf.C3.BChrungskonflikten"></span><span class="mw-headline" id="Aufl&ouml;sen_von_Zusammenf&uuml;hrungskonflikten">Aufl&ouml;sen von Zusammenf&uuml;hrungskonflikten</span></h2>
<p>GitKraken verf&uuml;gt &uuml;ber ein spezielles Werkzeug f&uuml;r Merge-Konflikte, das nur in der GitKraken Pro-Version verf&uuml;gbar ist. Es gibt jedoch Workarounds, um externe Werkzeuge f&uuml;r das Mergen zu verwenden.
</p>
<ul><li><a rel="nofollow" class="external text" href="https://support.gitkraken.com/working-with-repositories/branching-and-merging/">GitKraken-kompatible externe Merge-Tools</a>: Beyond Compare, FileMerge, Kaleidoscope, KDiff, Araxis, P4Merge</li>
<li>Wenn keine der oben genannten Optionen funktioniert, kann man <a rel="nofollow" class="external text" href="https://git-scm.com/book/en/v2/Customizing-Git-Git-Configuration#_external_merge_tools">externe Merge- und Diff-Tools</a> in der Konfigurationsdatei <code>~/.gitconfig</code> im Benutzerverzeichnis angeben.</li></ul>
<h2><span class="mw-headline" id="Squashing_commits">Squashing commits</span></h2>
<p>Als Versionskontrollsystem empfiehlt Git, viele Commits durchzuf&uuml;hren, um die &Auml;nderungen zu verfolgen. Wenn man jedoch zu viele kleine &Auml;nderungen vornimmt, kann die Commit-Historie etwas un&uuml;bersichtlich werden. Squashing bedeutet, mehrere Commits zu einem einzigen Commit zusammenzufassen. Laut dem <a rel="nofollow" class="external text" href="https://support.gitkraken.com/working-with-commits/squash/">GitKraken-Handbuch</a> ist Squashing f&uuml;r Commits verf&uuml;gbar, die die folgenden Anforderungen erf&uuml;llen:
</p>
<ul><li>Man muss mindestens zwei Commits ausw&auml;hlen, um sie zu squashen.</li>
<li>Der j&uuml;ngste Commit, gemessen am Commit-Datum, ist auch der aktuelle HEAD-Commit.</li>
<li>Genealogisch aufeinanderfolgend.</li>
<li>Chronologisch aufeinanderfolgend.</li>
<li>Der &auml;lteste Commit in der Liste hat einen Eltern-Commit.</li></ul>
<p>Wenn alle diese Bedingungen erf&uuml;llt sind, wird die Option <b>Squash</b> angezeigt, wenn man mit der rechten Maustaste auf den Commit-Knoten klickt. Siehe <a rel="nofollow" class="external text" href="https://support.gitkraken.com/img/documentation/working-with-files/commits/squash.gif">Squash.gif</a>
</p><p><span id="Following_other_FreeCAD_repositories"></span>
</p>
<h2><span class="mw-headline" id="Anderen_FreeCAD_Repositorien_folgen">Anderen FreeCAD Repositorien folgen</span></h2>
<p>You can use GitKraken to follow the personal FreeCAD forks of other developers; in this way you can see how they write code and commit changes to their own branches before they submit pull requests to the upstream <code>FreeCAD/FreeCAD</code> repository.
</p>
<ol><li>In the left side panel next to the <b>Remote</b> category, press the <b>+</b> sign.</li>
<li>A dialogue will come up to enter the name of the repository that you want to add. Recommended remotes are from the main FreeCAD developers and known contributors: wmayer, yorikvanhavre, ickby, sliptonic, kkremitzki, etc.</li>
<li>Press <b>Add Remote</b>.</li></ol>
<p>Wenn nun neue Commits vorgenommen oder Branches von den Autoren dieser Repositorys rebasiert werden, wird deren Commit-Verlauf grafisch dargestellt.
<span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Gitkraken-add-remote.gif&amp;filetimestamp=20170810182159&amp;.html" class="mw-file-description"><img src="../File/Gitkraken-add-remote.gif" decoding="async" width="1280" height="692" class="mw-file-element" data-file-width="1280" data-file-height="692"></a></span>
</p><p><span id="Related"></span>
</p>
<h2><span class="mw-headline" id="Verwandtes">Verwandtes</span></h2>
<ul><li><a href="../de/Source_code_management.html" title="Source code management/de">Quellcodeverwaltung</a></li>
<li><a href="../de/Developing_FreeCAD_with_KDevelop.html" title="Developing FreeCAD with KDevelop/de">FreeCAD mit KDevelop entwickeln</a></li></ul>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><span typeof="mw:File"><a href="../index.php?title=User_hub.png&amp;filetimestamp=20190221145008&amp;.html" class="mw-file-description"><img src="../File/User_hub.png" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../de/User_hub.html" title="User hub/de">User documentation</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b><a href="../de/Getting_started.html" title="Getting started/de">Getting started</a></b></li>
<li><b>Installation:</b> <a href="../de/Download.html" title="Download/de">Download</a>, <a href="../de/Installing_on_Windows.html" title="Installing on Windows/de">Windows</a>, <a href="../de/Installing_on_Linux.html" title="Installing on Linux/de">Linux</a>, <a href="../de/Installing_on_Mac.html" title="Installing on Mac/de">Mac</a>, <a href="../de/Installing_additional_components.html" title="Installing additional components/de">Additional components</a>, <a href="../de/Compile_on_Docker.html" title="Compile on Docker/de">Docker</a>, <a href="../de/AppImage.html" title="AppImage/de">AppImage</a>, <a href="../de/Ubuntu_Snap.html" title="Ubuntu Snap/de">Ubuntu Snap</a></li>
<li><b>Basics:</b> <a href="../de/About_FreeCAD.html" title="About FreeCAD/de">About FreeCAD</a>, <a href="../de/Interface.html" title="Interface/de">Interface</a>, <a href="../de/Mouse_navigation.html" title="Mouse navigation/de">Mouse navigation</a>, <a href="../de/Selection_methods.html" title="Selection methods/de">Selection methods</a>, <a href="../de/Object_name.html" title="Object name/de">Object name</a>, <a href="../de/Preferences_Editor.html" title="Preferences Editor/de">Preferences</a>, <a href="../de/Workbenches.html" title="Workbenches/de">Workbenches</a>, <a href="../de/Document_structure.html" title="Document structure/de">Document structure</a>, <a href="../de/Property.html" title="Property/de">Properties</a>, <a href="../de/Help_FreeCAD.html" title="Help FreeCAD/de">Help FreeCAD</a>, <a href="../de/Donate.html" title="Donate/de">Donate</a></li></ul>
<hr>
<ul><li><b>Help:</b> <a href="../de/Tutorials.html" title="Tutorials/de">Tutorials</a>, <a href="../de/Video_tutorials.html" title="Video tutorials/de">Video tutorials</a></li>
<li><b><a href="../de/Workbenches.html" title="Workbenches/de">Workbenches</a>:</b> <a href="../de/Std_Base.html" title="Std Base/de">Std Base</a>, <a href="../de/Assembly_Workbench.html" title="Assembly Workbench/de">Assembly</a>, <a href="../de/BIM_Workbench.html" title="BIM Workbench/de">BIM</a>, <a href="../de/CAM_Workbench.html" title="CAM Workbench/de">CAM</a>, <a href="../de/Draft_Workbench.html" title="Draft Workbench/de">Draft</a>, <a href="../de/FEM_Workbench.html" title="FEM Workbench/de">FEM</a>, <a href="../de/Inspection_Workbench.html" title="Inspection Workbench/de">Inspection</a>, <a href="../de/Material_Workbench.html" title="Material Workbench/de">Material</a>, <a href="../de/Mesh_Workbench.html" title="Mesh Workbench/de">Mesh</a>, <a href="../de/OpenSCAD_Workbench.html" title="OpenSCAD Workbench/de">OpenSCAD</a>, <a href="../de/Part_Workbench.html" title="Part Workbench/de">Part</a>, <a href="../de/PartDesign_Workbench.html" title="PartDesign Workbench/de">PartDesign</a>, <a href="../de/Points_Workbench.html" title="Points Workbench/de">Points</a>, <a href="../de/Reverse_Engineering_Workbench.html" title="Reverse Engineering Workbench/de">Reverse Engineering</a>, <a href="../de/Robot_Workbench.html" title="Robot Workbench/de">Robot</a>, <a href="../de/Sketcher_Workbench.html" title="Sketcher Workbench/de">Sketcher</a>, <a href="../de/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/de">Spreadsheet</a>, <a href="../de/Surface_Workbench.html" title="Surface Workbench/de">Surface</a>, <a href="../de/TechDraw_Workbench.html" title="TechDraw Workbench/de">TechDraw</a>, <a href="../de/Testing.html" title="Testing/de">Test Framework</a></li></ul>
<hr>
<ul><li><b><a href="../de/Addon.html" title="Addon/de">Addons</a>:</b> <a href="../de/Std_AddonMgr.html" title="Std AddonMgr/de">Addon Manager</a>, <a href="../de/External_workbenches.html" title="External workbenches/de">External workbenches</a>, <a href="../de/Scripting_and_macros.html" title="Scripting and macros/de">Scripting and macros</a></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="../de/User_hub.html" title="User hub/de">User hub</a>, <a href="../de/Power_users_hub.html" title="Power users hub/de">Power users hub</a>, <a href="../de/Developer_hub.html" title="Developer hub/de">Developer hub</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20251214094111
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.082 seconds
Real time usage: 0.188 seconds
Preprocessor visited node count: 354/1000000
Post&#8208;expand include size: 9341/2097152 bytes
Template argument size: 2803/2097152 bytes
Highest expansion depth: 6/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1486/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   30.465      1 -total
 24.45%    7.450      1 Template:Userdocnavi
 16.70%    5.087      1 Template:Navigation_menu_2
 15.00%    4.570      2 Template:URL
 14.77%    4.498      2 Template:Caption
  8.77%    2.671     24 Template:Incode
  8.41%    2.563      2 Template:URLn
  8.22%    2.503      1 Template:TOCright
  5.89%    1.793      1 Template:Emphasis
  5.40%    1.644      2 Template:Button
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:172213-0!canonical and timestamp 20251214094111 and revision id 1716141. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>