<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Engine Block Tutorial/de</span></h1><?xml encoding="UTF-8"><div class="mw-parser-output"><div class="mw-pt-languages noprint" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="de" dir="ltr">Deutsch</span></li>
<li><a href="../Engine_Block_Tutorial.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Engine Block Tutorial (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/Engine_Block_Tutorial.html" class="mw-pt-progress mw-pt-progress--low" title="Engine Block Tutorial (33% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/Engine_Block_Tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Tutoriel pour cr&eacute;er un bloc moteur (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/Engine_Block_Tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Tutorial Blocco Motore (100% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Engine_Block_Tutorial.html" class="mw-pt-progress mw-pt-progress--stub" title="Poradnik: Blok silnika (8% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../ro/Engine_Block_Tutorial.html" class="mw-pt-progress mw-pt-progress--low" title="Tutorial Bloc Motor (25% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><a href="../ru/Engine_Block_Tutorial.html" class="mw-pt-progress mw-pt-progress--med" title="&#1052;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1041;&#1083;&#1086;&#1082;&#1072; &#1062;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1086;&#1074; (43% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li></ul></div>
<div style="text-align:center; background:#FDE0A8;margin:1em 7em;padding:0.5em 2em;border:2px solid #FF5706;">
<p>Diese Dokumentation ist noch nicht fertiggestellt. Bitte hilf mit und trage etwas zur Dokumentation bei.
</p><p>Die Seite <a href="../de/GuiCommand_model.html" title="GuiCommand model/de">GuiBefehl Modell</a> erkl&auml;rt, wie Befehle dokumentiert werden sollten. Unter <a href="../Category;UnfinishedDocu.html" title="Category:UnfinishedDocu">Category:UnfinishedDocu</a> findest du weitere unvollst&auml;ndige Seiten wie diese (und unter <a href="../de/Category;UnfinishedDocu.html" title="Category:UnfinishedDocu/de">Category:UnfinishedDocu/de</a> unvollst&auml;ndige &Uuml;bersetzungen). Siehe <a href="../Category;Command_Reference.html" title="Category:Command Reference">Category:Command Reference</a> f&uuml;r s&auml;mtliche Befehle (und <a href="../de/Category;UnfinishedDocu.html" title="Category:UnfinishedDocu/de">Category:UnfinishedDocu/de</a> f&uuml;r vorhandene &Uuml;bersetzungen).
</p><p>Siehe <a href="../de/WikiPages.html" title="WikiPages/de">WikiSeiten</a>, um zu lernen, wie die Wiki-Seiten bearbeitet werden und <a href="../de/Help_FreeCAD.html" title="Help FreeCAD/de">FreeCAD Unterst&uuml;tzen</a>, um andere Wege zu entdecken, wie du einen Beitrag leisten kannst.
</p>
</div> 
<table class="fcinfobox wikitable ct" style="width: 230px; float: right; margin-left: 1em">
<tbody><tr>
<td class="ctTitle" style="font-weight: bold; font-size: 125%;"><span typeof="mw:File"><span><img src="../File/Freecad.svg" decoding="async" width="32" height="32"></span></span> Tutorium
</td></tr>
<tr>
<th class="ctOdd">Thema
</th></tr>
<tr>
<td class="ctEven">Part Arbeitsbereich
</td></tr>
<tr>
<th class="ctOdd">Niveau
</th></tr>
<tr>
<td class="ctEven">Anf&auml;nger
</td></tr>
<tr>
<th class="ctOdd">Zeit zum Abschluss
</th></tr>
<tr>
<td class="ctEven">1 Stunde
</td></tr>
<tr>
<th class="ctOdd">Autoren
</th></tr>
<tr>
<td class="ctEven">Andrewbuck40
</td></tr>
<tr>
<th class="ctOdd">FreeCAD-Version
</th></tr>
<tr>
<td class="ctEven">0.14.3700
</td></tr>
<tr>
<th class="ctOdd">Beispieldateien
</th></tr>
<tr>
<td class="ctEven">
</td></tr>
<tr>
<th class="ctOdd">Siehe auch
</th></tr>
<tr>
<td class="ctEven"><i>None</i>
</td></tr>
<tr>
<td class="ctToc"><br><meta property="mw:PageProp/toc">
</td></tr></tbody></table>
<figure class="mw-halign-center" typeof="mw:File/Thumb"><a href="../index.php?title=Engine_Block_Tutorial_-_Finished_Engine_Block.png&amp;filetimestamp=20110526172237&amp;.html" class="mw-file-description"><img src="../File/Engine_Block_Tutorial_-_Finished_Engine_Block.png" decoding="async" width="600" height="362"></a><figcaption></figcaption></figure>
<p><br>
Dies ist ein einf&uuml;hrendes Tutorium zur Modellierung in FreeCAD.  Der Zweck dieses Tutoriums ist es, dich in die primitiven Datentypen f&uuml;r parametrische Objekte, boolesche Operationen, 2D Zeichnen und den Prozess der Umwandlung von 2D Entw&uuml;rfen in 3D Modelle einzuf&uuml;hren.  Als Arbeitsbeispiel werden wir den einfachen Motorblock und das Kurbelgeh&auml;use modellieren, wie oben zu sehen.
</p>
<h2><span class="mw-headline" id="Erste_Schritte">Erste Schritte</span></h2>
<p>&Ouml;ffne zun&auml;chst FreeCAD, gehe zu <b>Datei &rarr; Neu</b>, um ein neues Dokument zu erstellen, und dann <b>Datei &rarr; Speichern</b>, um es irgendwo auf Ihrem Computer zu speichern, ich habe mein Projekt <b>"Engine"</b> genannt.  Du wirst feststellen, dass nach dem Speichern des Projekts in der <i>Baumansicht</i> auf der linken Seite des Bildschirms der Name des Projekts angezeigt wird, an dem du gerade arbeitest.  Du kannst mehr als ein Projekt gleichzeitig ge&ouml;ffnet haben, und jedes Projekt wird als Basis eines Baumes in der Baumansicht angezeigt.
</p>
<h2><span id="Ausr.C3.A4umen_des_Blocks"></span><span class="mw-headline" id="Ausr&auml;umen_des_Blocks">Ausr&auml;umen des Blocks</span></h2>
<p>Beginnen wir nun mit der Arbeit am eigentlichen Modell.  Wir beginnen mit dem Hinzuf&uuml;gen eines Kastens f&uuml;r den Gesamtumriss des Motorblocks.  Dazu m&uuml;ssen wir dem Modell ein <i>Teil</i> hinzuf&uuml;gen, gehe zu <b>Ansicht &rarr; Arbeitsbereich &rarr; Part</b> und w&auml;hle den <a href="../de/Part_Workbench.html" title="Part Workbench/de">Part Arbeitsbereich</a>.  Nachdem du den Arbeitsbereich ausgew&auml;hlt hast, wirst du feststellen, dass du oben auf der Werkzeugleiste einen anderen Satz von Schaltfl&auml;chen erh&auml;ltst. Bl&auml;ttere durch einige der anderen Arbeitsbereiche, um sich mit dem Arbeitsbereichsystem vertraut zu machen, und kehre dann zum Part Arbeitsbereich zur&uuml;ck.
</p>
<h3><span class="mw-headline" id="Der_Rohling">Der Rohling</span></h3>
<p>Im Arbeitsbereich <i>Part</i> sind mehrere Werkzeuge f&uuml;r primitive Objekte wie Quader, Kugeln, Kegel, usw. zu sehen. Klicken Sie auf den W&uuml;rfel (<span typeof="mw:File"><a href="../index.php?title=Part_Box.svg&amp;filetimestamp=20240710103459&amp;.html" class="mw-file-description"><img src="../File/Part_Box.svg" decoding="async" width="16" height="16"></a></span>), um einen W&uuml;rfel in das Modell einzuf&uuml;gen. Jedes der primitiven Objekte hat mehrere Standardeinstellungen, die beim Einf&uuml;gen festgelegt werden. Wenn Sie wollen, k&ouml;nnen Sie die verschiedenen Primitive einmal durchprobieren, um jedes einmal gesehen zu haben. Mit der Entf-Taste k&ouml;nnen die ausgew&auml;hlten Objekte wieder gel&ouml;scht werden. Die Auswahl des Objekts ist dabei auf zwei verschiedene Arten m&ouml;glich: Entweder durch Anklicken des Objekts in der 3D-Ansicht oder durch einen Klick auf den passenden Eintrag im Modellbaum. Bei gleichzeitig gehaltener <span style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.4em; padding: 0px 10px 1px 10px; font-weight:normal;">Strg</span>-Taste lassen sich auch mehrere Objekte nacheinander ausw&auml;hlen. Innerhalb der 3D-Ansicht l&auml;sst dich mit dem Mausrad rein- und rauszoomen. Mit der mittleren Mausaste l&auml;sst dich die Ansicht verschieben und wenn neben der mittleren Maustaste auch noch die rechte Maustaste gehalten wird, wird die Ansicht gedreht. Mit den Tasten 0-6 des Nummernpads kann zwischen verschiedenen voreingestellten Ansichten gewechselt werden (z.B. axometrisch, von oben, usw.). Investieren Sie ein paar Minuten, um sich mit der Navigation in 3D vertraut zu machen.
</p>
<dl><dd><i>Weiterf&uuml;hrende Literatur: <a href="../de/Mouse_navigation.html" title="Mouse navigation/de">Mausnavigation</a></i></dd></dl>
<p>Sobald du deinen W&uuml;rfel hast und mit der Funktionsweise der Maus vertraut bist, beginnen wir mit der Einrichtung der Abmessungen des CAD Modells.  W&auml;hle den <i>W&uuml;rfel</i>, durch daraufklicken in der Baumansicht, und klicke dann auf den <i>Datenreiter' der </i>Eigenschaftsansicht<i>, die sich unter der Baumansicht befindet (gehe zu <b>Ansicht &rarr; Paneele &rarr; Combo Ansicht</b>, wenn du diese geschlossen hast).  Im "Datenreiter" kannst du die Eigenschaften des in der Strukturansicht ausgew&auml;hlten Objekts &auml;ndern.  Je nachdem, welche Art von Objekt du ausw&auml;hlst, gibt es verschiedene Parameter, die du im "Datenreiter" einstellen kannst.  F&uuml;r einen Kasten ben&ouml;tigen wir 3 Vektoren, einen f&uuml;r seine Position im 3D Raum, einen weiteren f&uuml;r seine Orientierung und einen dritten, um die Abmessungen des Kastens festzulegen.  F&uuml;r eine Kugel k&ouml;nntest du den Mittelpunkt und den Radius angeben; Kegel haben einen Radius, eine H&ouml;he und eine Position und so weiter.  Wir bauen einen kleinen 2-Zylinder Motorblock, also stelle die Gr&ouml;&szlig;e und die Position des Kastens auf die folgenden Werte ein (stelle sicher, dass du die XYZ unter </i>Position<i> einstellst, die unter </i>Achse<i> stellen die Rotationsachse ein, und die Standardwerte sind das, was wir wollen):</i>
</p>
<dl><dd><table class="wikitable" border="1">

<tbody><tr>
<td>X:  0.0 mm</td>
<td>L&auml;nge: 140.0 mm
</td></tr>
<tr>
<td>Y:  -40.0 mm</td>
<td>Breite: 80.0 mm
</td></tr>
<tr>
<td>Z:  0.0 mm</td>
<td>H&ouml;he: 110.0 mm
</td></tr>
</tbody></table></dd></dl>
<p>Jetzt, wo du deinen Motorblock richtig dimensioniert hast, sollten wir ihm einen aussagekr&auml;ftigeren Namen geben.  W&auml;hle ihn in der Baumansicht aus und klicke entweder mit der rechten Maustaste, um ihn umzubenennen, oder dr&uuml;cke die Taste <span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px;">F2</span> auf deiner Tastatur. Benenne dieses Teil <b>Billet</b> (engl.: Rohling).
</p>
<h3><span class="mw-headline" id="Der_erste_Zylinder">Der erste Zylinder</span></h3>
<p>Als n&auml;chstes werden wir den ersten Zylinder durch den gesamten Motorblock herausschneiden.  Dazu f&uuml;gen wir dem Modell einen Zylinder in der Gr&ouml;&szlig;e hinzu, die wir aufbohren wollen, und f&uuml;hren dann eine boolesche Operation durch, um das Material vom Block zu "subtrahieren".  Klicke auf die Schaltfl&auml;che Zylinder hinzuf&uuml;gen (<span typeof="mw:File"><a href="../index.php?title=Part_Cylinder.svg&amp;filetimestamp=20240712190137&amp;.html" class="mw-file-description"><img src="../File/Part_Cylinder.svg" decoding="async" width="16" height="16"></a></span>), um einen neuen Zylinder zu erstellen, w&auml;hle ihn dann in der Baumansicht aus und lege seine Eigenschaften wie folgt fest:
</p>
<dl><dd><table class="wikitable" border="1">

<tbody><tr>
<td>X:  40.0 mm</td>
<td>H&ouml;he: 110.0 mm
</td></tr>
<tr>
<td>Y:  0.0 mm</td>
<td>Radius: 25.0 mm
</td></tr>
<tr>
<td>Z:  0.0 mm</td>
<td>
</td></tr>
</tbody></table></dd></dl>
<p>Sobald die Ma&szlig;e richtig eingegeben wurden, sollten die beiden Endfl&auml;chen des Zylinders auf der Ober- und Unterseite des Blocks sichtbar sein. Benennen Sie das Objekt <b>Cylinder 1</b>.
</p>
<h3><span class="mw-headline" id="Der_zweite_Zylinder">Der zweite Zylinder</span></h3>
<p>Der zweite Zylinder k&ouml;nnte auf demselben Wege erstellt werden wie der erste, es ist jedoch einfacher, den ersten zu Kopieren, da sich beide nur in der X-Koordinate unterscheiden. Um den Zylinder zu kopieren, muss er zun&auml;chst im Modellbaum ausgew&auml;hlt werden und anschlie&szlig;end <b>Bearbeiten &rarr; Auswahl duplizieren</b> angeklickt werden. Im Modellbaum sollte nun ein zweiter Zylinder erscheinen, der in <b>Cylinder 2</b> umbenannt wird. In der 3D-Ansicht ist er noch nicht zu sehen, weil er vom ersten Zylinder &uuml;berdeckt wird. W&auml;hlen Sie nun den zweiten Zylinder und &auml;nder Sie seine X-Koordinate in 100 mm. Der Zylinder sollte sich dabei automatisch in der 3D-Ansicht bewegen. Um die beiden Zylinder sichtbar zu machen, kann der Block durch Auswahl und anschlie&szlig;endes Dr&uuml;cken der Leertaste ver&uuml;bergehend unsichtbar gemacht werden (versteckte Objekte werden im Modellbaum in der Farbe Grau angezeigt).
</p><p><span id="Boring_out_the_Cylinders"></span>
</p>
<h3><span class="mw-headline" id="Ausbohren_der_Zylinder">Ausbohren der Zylinder</span></h3>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=Engine_Block_Tutorial_-_Bored_Block.png&amp;filetimestamp=20110526171823&amp;.html" class="mw-file-description"><img src="../File/Engine_Block_Tutorial_-_Bored_Block.png" decoding="async" width="300" height="181"></a><figcaption></figcaption></figure>
<p>Nun, da beide Zylinder an ihrem Platz sind, wollen wir sie benutzen, um den Block auf die entsprechenden Ma&szlig;e aufzubohren.  Dazu werden wir <i>boolesche Operationen</i> auf unsere 3 Grundk&ouml;rper anwenden.  Wir beginnen damit, dass wir aus den beiden Zylindern eine Vereinigung machen, so dass wir sie als Gruppe vom Block subtrahieren k&ouml;nnen.  W&auml;hle <b>Zylinder 1</b> in der Baumansicht und dann <i><span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px;">STRG</span>+Linksklick</i>, um auch <b>Zylinder 2</b> zu w&auml;hlen.  Dr&uuml;cke nun die Schaltfl&auml;che Vereinigen (<span typeof="mw:File"><a href="../index.php?title=Part_Fuse.svg&amp;filetimestamp=20240705092218&amp;.html" class="mw-file-description"><img src="../File/Part_Fuse.svg" decoding="async" width="16" height="16"></a></span>) , um die Objekte miteinander zu verschmelzen.  Du wirst feststellen, dass es in der Baumansicht jetzt ein neues Objekt mit dem Namen <i>Fusion</i> gibt.  Wenn du auf den Ausklapppfeil neben <i>Fusion</i> klickst, siehst du die beiden Zylinder, aber sie werden grau dargestellt.  Statt "Fusion" benennen wir das Objekt in "Zylinder" um, damit es sp&auml;ter leichter zu finden ist.  Jetzt bohren wir den Motorblock auf.  W&auml;hle den <b>Rohling</b> und <i>dann</i> w&auml;hle die <b>Zylinder</b> und dr&uuml;cke die Schaltfl&auml;che Ausschneiden (<span typeof="mw:File"><a href="../index.php?title=Part_Cut.svg&amp;filetimestamp=20240705092150&amp;.html" class="mw-file-description"><img src="../File/Part_Cut.svg" decoding="async" width="16" height="16"></a></span>).  Die beiden ausgew&auml;hlten Objekte werden wieder wie bei der Vereinigungsoperation kombiniert, und das einzelne resultierende Objekt erh&auml;lt den Namen <i>Cut</i> (den du in <b>Gebohrter Block</b> umbenennen solltest).  Dr&uuml;cke die Taste <i>2</i> auf dem Ziffernblock, und du solltest jetzt in der Lage sein, geradewegs durch die Zylinder nach unten auf die andere Seite des Motorblocks zu schauen, dann <i>Mittelklick+Linksklick+Ziehen</i>, um deinen Motorblock zu betrachten.  Auf der rechten Seite siehst du, wie das fertige Produkt aussehen sollte. Beachte, dass ich die Baumansicht auf der linken Seite erweitert habe, um die einzelnen Grundk&ouml;rper anzuzeigen, und dass ich <b>Zylinder 2</b> zur Untersuchung im  <i>Daten</i> reiter der <i>Eigenschaftsansicht</i> ausgew&auml;hlt habe.
</p>
<h3><span class="mw-headline" id="Der_wichtigste_Vorteil_des_parametrischen_Modellierens">Der wichtigste Vorteil des parametrischen Modellierens</span></h3>
<p>Nun da die Bohrungen des Blocks fertig sind, nehmen wir uns einen Moment, um einen wichtigen Vorteil des parametrischen Modellierens zu sehen. Nehmen wir dazu an, wir w&uuml;rden w&auml;hrend der Entwicklung des Produkts irgendwann zu dem Schluss kommen, dass die Zylinder etwas vergr&ouml;&szlig;ert werden m&uuml;ssen. Weil die Vereinigung der Zylinder und das Ausschneiden selbiger als Gruppierung im Modellbaum angezeigt werden, k&ouml;nnen wir die Zylindergr&ouml;&szlig;e auch im Nachhinein einfach variieren, wobei FreeCAD das Vereinigen und das Ausschneiden der Zylinder und letzten Endes das 3D-Modell automatisch an die &Auml;nderung anpasst. Probieren Sie dies aus, indem Sie den Radius und die Position der Zylinder variieren und dabei die &Auml;nderungen des 3D-Modells beachten. Am Ende sollten die urspr&uuml;nglichen Werte jedoch wiederhergestellt werden.
</p><p><span id="The_Crankcase"></span>
</p>
<h2><span id="Das_Kurbelgeh.C3.A4use"></span><span class="mw-headline" id="Das_Kurbelgeh&auml;use">Das Kurbelgeh&auml;use</span></h2>
<p><span id="Billet_and_Bearing_Caps"></span>
</p>
<h3><span class="mw-headline" id="Rohling_und_Lagerdeckel">Rohling und Lagerdeckel</span></h3>
<p>In diesem Abschnitt widmen wir uns nun dem Kurbelgeh&auml;use unterhalb des Motorblocks. F&uuml;gen Sie einen neuen W&uuml;rfel ein, benennen Sie ihn um in <b>Kurbelgeh&auml;use Rohling</b> und geben Sie ihm die folgenden Eigenschaften:
</p>
<dl><dd><table class="wikitable" border="1">

<tbody><tr>
<td>X:  0.0 mm</td>
<td>L&auml;nge: 140.0 mm
</td></tr>
<tr>
<td>Y:  -50.0 mm</td>
<td>Breite: 100.0 mm
</td></tr>
<tr>
<td>Z:  -85.0 mm</td>
<td>H&ouml;he: 85.0 mm
</td></tr>
</tbody></table></dd></dl>
<p>Um das Kurbelgeh&auml;use von dem anderen zu unterscheiden, geben wir einem von ihnen eine andere Farbe.  Du kannst die Farbe &auml;ndern, indem du in der Baumansicht mit der rechten Maustaste auf das zu &auml;ndernde Objekt klickst.  Du kannst selbst eine Farbe zuweisen oder dem Objekt eine zuf&auml;llige Farbe geben (w&auml;hle  wieder zuf&auml;llig, wenn dir die Farbe nicht gef&auml;llt).
</p><p>F&uuml;ge einen weiteren Kasten mit der Bezeichnung <b>Lageraussparung</b> hinzu, gib ihm die folgenden Eigenschaften und schneide dann den <b>Lageraussparung</b> vom <b>Kurbelgeh&auml;userohling</b> weg (d.h. w&auml;hle zuerst den Rohling aus):
</p>
<dl><dd><table class="wikitable" border="1">

<tbody><tr>
<td>X:  0.0 mm</td>
<td>L&auml;nge: 140.0 mm
</td></tr>
<tr>
<td>Y:  -40.0 mm</td>
<td>Breite: 80.0 mm
</td></tr>
<tr>
<td>Z:  -85.0 mm</td>
<td>H&ouml;he: 30.0 mm
</td></tr>
</tbody></table></dd></dl>
<p>Benennen Sie das resultierende <i>Cut</i> Objekt um in <b>Carved crankcase</b>.
</p>
<h3><span class="mw-headline" id="Herausarbeiten_der_Lager">Herausarbeiten der Lager</span></h3>
<p>Als n&auml;chstes werden wir einen halbkreisf&ouml;rmigen Platz f&uuml;r den Sitz der Kurbelwelle und einen Freiraum im Geh&auml;use f&uuml;r die Drehung der Welle erzeugen. Wir beginnen mit einem Zylinder, wobei die Orientierung des Zylinders diesmal horizontal sein soll.  Das hei&szlig;t wir m&uuml;ssen herausfinden, wie der Zylinder entsprechend gedreht und passend zum Motorblock ausgerichtet werden kann. Ein Blick auf das Koordinatenkreuz in der unteren rechten Ecke der 3D Ansicht f&uuml;hrt zu der Erkenntnis, dass der Zylinder in Richtung der x Achse zeigen muss. Der Zylinder muss also gegen&uuml;ber seiner Standardorientierung um 90&deg; um die y Achse gedreht werden. Erstelle einen Zylinder, nenne ihn <b>Crankshaft carve</b> und gib ihm die folgenden Eigenschaften (wichtig: anders als bisher, wird die Orientierung diesmal auch ge&auml;ndert!):
</p>
<dl><dd><table class="wikitable" border="1">

<tbody><tr>
<td>Achse X:  0.0 mm</td>
<td>Winkel: 90.0 Grad
</td></tr>
<tr>
<td>Achse Y:  1.0 mm</td>
<td>
</td></tr>
<tr>
<td>Achse Z:  0.0 mm</td>
<td>
</td></tr>
<tr>
<td>Position X:  0.0 mm</td>
<td>H&ouml;he: 140.0 mm
</td></tr>
<tr>
<td>Position Y:  0.0 mm</td>
<td>Radius: 20.0 mm
</td></tr>
<tr>
<td>Position Z:  -55.0 mm</td>
<td>
</td></tr>
</tbody></table></dd></dl>
<p>Schneide das neue Objekt aus dem vorhandenen Geh&auml;use <b>Carved crankcase</b> aus und nenne das sich ergebende Objekt <b>Crankcase with journals</b>.
</p><p><span id="Finishing_out_the_Crankcase"></span>
</p>
<h3><span id="Fertigstellen_des_Kurbelgeh.C3.A4uses"></span><span class="mw-headline" id="Fertigstellen_des_Kurbelgeh&auml;uses">Fertigstellen des Kurbelgeh&auml;uses</span></h3>
<p>Zuletzt werden wir 2 Endk&auml;sten ausschneiden, so dass die Kolbenstangen vom Kurbelgeh&auml;use bis in den Motorblock reichen k&ouml;nnen.  Mache zwei Objekte mit den Namen <b>Box carve 1</b> und <b>Box carve 2</b> mit den folgenden Eigenschaften;
du kannst auch <b>Box carve 1'<i> duplizieren und einfach die X Koordinate &auml;ndern, um den zweiten Carver zu erhalten. Vereinige sie zu einem Objekt namens </i></b><i>Box carvers<b> und schneide dieses Objekt vom </b>Kurbelgeh&auml;use mit Zapfen</i> ab und nenne das Endergebnis <b>Kurbelgeh&auml;use</b>.  Denke daran, dass du den <b>Gebohrten Block</b> ausblenden kannst, indem du ihn markierst und die Leertaste dr&uuml;ckst, damit du sehen kannst, was du tust.
</p>
<dl><dd><table class="wikitable" border="1">

<tbody><tr>
<td>X:  15.0 mm</td>
<td>L&auml;nge: 50.0 mm
</td></tr>
<tr>
<td>Y:  -25.0 mm</td>
<td>Breite: 50.0 mm
</td></tr>
<tr>
<td>Z:  -55.0 mm</td>
<td>H&ouml;he: 55.0 mm
</td></tr>
</tbody></table></dd></dl>
<dl><dd><table class="wikitable" border="1">

<tbody><tr>
<td>X:  75.0 mm</td>
<td>L&auml;nge: 50.0 mm
</td></tr>
<tr>
<td>Y:  -25.0 mm</td>
<td>Breite: 50.0 mm
</td></tr>
<tr>
<td>Z:  -55.0 mm</td>
<td>H&ouml;he: 55.0 mm
</td></tr>
</tbody></table></dd></dl>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=Engine_Block_Tutorial_-_Crankcase.png&amp;filetimestamp=20110526171922&amp;.html" class="mw-file-description"><img src="../File/Engine_Block_Tutorial_-_Crankcase.png" decoding="async" width="300" height="181"></a><figcaption></figcaption></figure>
<p>Auf der rechten Seite ist im Bild zu sehen, wie das Endergebnis nun aussehen sollte. Der Modellbaum wurde zur besseren &Uuml;bersicht der Bool'schen Operationen vollst&auml;ndig aufgeklappt. Die einzelnen Parameter der daf&uuml;r verwendeten Primitive k&ouml;nnen nach wie vor ge&auml;ndert werden, wobei das Gesamtmodell automatisch angepasst wird. Wir k&ouml;nnten das Geh&auml;use nun genauer ausarbeiten, aber dies soll f&uuml;rs Erste reichen. Als n&auml;chstes werden wir mittels 2D Zeichnungen die Kopfbolzen konstruieren und das Gewicht des Motorblocks reduzieren, indem wir unn&ouml;tige Bereiche des Rohlings entfernen.
</p>
<h2><span class="mw-headline" id="2D_Entwurf_der_Zylinderkopfdichtung">2D Entwurf der Zylinderkopfdichtung</span></h2>
<p>F&uuml;r die Kopfbolzen und die Form des Motorblocks werden wir wiederum Bool'sche Operationen nutzen, um Material an den richtigen Stellen zu entfernen. Wenn wir dar&uuml;ber nachdenken, so kommen wir zu dem Schluss, dass alle Kopfbolzen identisch aussehen und sich nur im Ort unterscheiden. Daraus folgt, dass wir die Form des Kopfbolzens nur einmal auf dem Motorblock zeichnen m&uuml;ssen und ihn als Muster wiederverwenden k&ouml;nnen.
</p>
<h3><span class="mw-headline" id="Eingabe_des_2D_Zeichenmodus">Eingabe des 2D Zeichenmodus</span></h3>
<p>Zuerst m&uuml;ssen wir zum 2D Zeichnungs Arbeitsbereich wechseln. Um dies vom Teilemodus aus zu tun, kannst du <i>2D Zeichnung</i> aus der Ausklappbox oben ausw&auml;hlen, in der derzeit <i>Part</i> steht.  Wenn Du die Ausklappbox nicht finden kannst (nicht alle Arbeitsbereiche zeigen die Ausklappbox an), kannst du auch einen Arbeitsbereich aus dem Men&uuml;eintrag <b>Ansicht &rarr; Arbeitsbereich</b> ausw&auml;hlen.  Auch wenn wir 2D Zeichnungen anfertigen, werden wir sie im 3D Fenster zeichnen, indem wir FreeCAD mitteilen, in welche Ebene wir die Zeichnungen projizieren wollen.  Nachdem du den 2D Zeichnungs Arbeitsbereich direkt &uuml;ber der rechten oberen Ecke der 3D Ansicht ausgew&auml;hlt hast, klicke  auf die Schaltfl&auml;che ganz links, die eine der folgenden Angaben enth&auml;lt: {keine, oben, vorne, gr&ouml;&szlig;e oder d(..., ..., ..., ...)}.  Sobald du darauf klickst, erscheint auf der linken Seite der Leiste ein Textfeld, in das du einen Ebenenversatz eingeben kannst, sowie 5 Schaltfl&auml;chen: XY, XZ, YZ, Ansicht und Keine.  Die ersten drei sind die Standardansichten von oben, von vorne und von der Seite, der Eintrag <i>Ansicht</i> verwendet die Ebene senkrecht zur Blickrichtung der Kamera (die Ansichtsebene der Kamera), und der letzte projiziert nicht in eine Ebene und erm&ouml;glicht dir die vollst&auml;ndige Definition der XYZ Koordinaten f&uuml;r jeden Punkt, den du zeichnest.  Wir wollen einen Ebenenversatz von 110 einstellen (gib ihn ein und dr&uuml;cke die Eingabetaste) und dann auf die Schaltfl&auml;che XY klicken, um die Zeichnung auf die XY Ebene zu projizieren, die sich 110 mm oberhalb der Z Achse befindet, die der Oberseite des Motorblocks entspricht.  Nachdem wir FreeCAD mitgeteilt haben, welche Ebene eingezeichnet werden soll, k&ouml;nnen wir nun mit der Konstruktion der Kopfdichtung beginnen.
</p><p>Als Letztes muss die 3D Ansicht eingerichtet werden.  Obwohl alle von uns angefertigten Zeichnungen in unsere definierte 2D Ebene projiziert werden, k&ouml;nnen wir die Ebene, auf der wir zeichnen, aus jedem beliebigen Winkel betrachten (einschlie&szlig;lich der anderen Seite der Ebene, so dass wir "r&uuml;ckw&auml;rts" zeichnen). Da wir gesagt haben, dass die Ebene diejenige ist, die koplanar zur Oberseite des Motorblocks verl&auml;uft, sollten wir die 3D Ansicht wahrscheinlich in diese Richtung oder zumindest grob in diese Richtung schauen lassen.  Dr&uuml;cke die Taste 2 auf dem Ziffernblock, um die Draufsicht zu betrachten (beachte, dass auf dem Ziffernblock benachbarte Tasten entgegengesetzte Ansichten sind, so dass 1 und 4 von vorne-hinten, 2 und 5 von oben-unten und 3 und 6 von rechts-links sind).  Wenn du den Motor von oben nach unten betrachtest, kannst du ihn durch Ziehen mit der mittleren Maustaste zentrieren, um die Ansicht zu verschieben.  Im 2D Zeichenmodus schlie&szlig;lich k&ouml;nnen wir Teile der Zeichnung an den Ecken des Motorblocks, der Mitte der Zylinder usw. fangen lassen. Damit dies am besten funktioniert, sollten wir das Kurbelgeh&auml;use ausblenden, damit die Zeichnungen nur an dem Teil fangen, an dem wir gerade arbeiten (dr&uuml;cke die Leertaste, um das ausgew&auml;hlte Objekt ein-/auszublenden).
</p>
<h3><span class="mw-headline" id="Auslegen_der_Kopfbolzen">Auslegen der Kopfbolzen</span></h3>
<p>Nun, da die richtige Ebenenprojektion und Ansicht eingerichtet ist, f&uuml;gen wir 2D Zeichnungselemente auf die gleiche Weise hinzu, wie wir Grundelemente hinzugef&uuml;gt haben.  Klicke auf die <i>Kreis hinzuf&uuml;gen</i> Schaltfl&auml;che (<span typeof="mw:File"><a href="../index.php?title=Draft_Circle.svg&amp;filetimestamp=20210319101000&amp;.html" class="mw-file-description"><img src="../File/Draft_Circle.svg" decoding="async" width="16" height="16"></a></span>) und bewege die Maus in der 3D Ansicht.  Du musst FreeCAD dann die XY Position f&uuml;r den Mittelpunkt des Kreises und den Radius mitteilen. F&uuml;r diese beiden Messungen kannst du sie entweder mit der Maus eingeben (indem du den Anweisungen in der Statusleiste unten links folgst), oder du kannst die Werte in die Texteingabefelder eingeben, die oberhalb der Baumansicht erscheinen.  Fahre fort und f&uuml;ge ein paar zuf&auml;llige Kreise oben auf dem Motor hinzu, sowie ein paar nicht auf dem Motor, d.h. gerade drau&szlig;en in dem leeren Raum, der deine Ansicht des Motors umgibt.  Nachdem du dies getan hast, drehe die Kamera um die Oberseite des Motorblocks und schaue dir die von dir gezeichneten Kreise an. Achte darauf, wie "flach" sie in der Ebene sind, in die wir sie projiziert haben, und diese Ebene stimmt mit der Oberseite des Motorblocks &uuml;berein; dies wird wichtig sein, wenn wir die Zeichnung extrudieren, um den Motor zu formen.  Nun, da du siehst, wie man 2D Elemente hinzuf&uuml;gt, kannst du die Testkreise, die du hinzugef&uuml;gt hast, l&ouml;schen, und wir beginnen mit der Eingabe des eigentlichen Kopf Layouts.  Beachte, dass, wenn dein Kreis innerhalb des Motorblocks verschwindet, deine Zeichnungsprojektionsebene nicht richtig auf den XY Modus eingestellt ist, mit einem Versatz von 110 mm.
</p><p>Entwurfselemente mit der Maus hinzuzuf&uuml;gen ist schnell und einfach, aber nicht sehr pr&auml;zise. F&uuml;r den eigentlichen Entwurf werden wir die Maus deshalb nur f&uuml;r eine grobe Einsch&auml;tzung der richtigen Koordinaten nutzen und die tats&auml;chlichen Koordinaten in die Textfelder eintragen. Stellen Sie die Ansicht von oben wieder her, klicken Sie auf das Kreiswerkzeug und bewegen Sie die Maus in der oberen linken Ecke des Motorblocks. Es scheint, als w&auml;re X=10, Y=30 ein guter Mittelpunkt f&uuml;r den Kreis. (Wichtig: Die z-Koordinate sollte dabei unver&auml;ndert bleiben. Ist sie es nicht, so ist beim Festlegen der Skizzierebene ein Fehler aufgetreten. Die Ebene sollte nochmals neu festgelegt werden).
</p><p>Nun da Sie wissen, wie man die Koordinaten der Zeichenelemente einfach ermittelt, k&ouml;nnen Sie ohne Probleme ein Bolzenmuster oder andere zweidimensionale Entw&uuml;rfe erstellen. F&uuml;r unseren drei Kopfbolzen werden wir die in der nachfolgenden Tabelle gezeigten Koordinaten verwenden. Beachten Sie, dass beim Eingeben der Werte in die Textfelder mit der Eingabetaste zum n&auml;chsten Textfeld gewechselt werden kann. Die Maus sollte dabei nicht bewegt werden, da sonst die Koordinaten &uuml;berschrieben werden. Beim Zeichnen der Kreise sollte zudem die Option <i>Gef&uuml;llt</i> aktiviert sein. Falls es mit der z-Koordinate der Kreise Probleme geben sollte, so hilft es unter Umst&auml;nden, die Zeichenebene auf der H&ouml;he Z=0 zu erstellen und f&uuml;r die Kreise manuell eine H&ouml;he von 110 mm einzugeben.
</p>
<dl><dd><table class="wikitable" border="1">

<tbody><tr>
<td>X1:  10</td>
<td>Y1:  25</td>
<td>Radius: 2.5 mm
</td></tr>
<tr>
<td>X2:  70</td>
<td>Y2:  25</td>
<td>Radius: 2.5 mm
</td></tr>
<tr>
<td>X3:  130</td>
<td>Y3:  25</td>
<td>Radius: 2.5 mm
</td></tr></tbody></table></dd></dl>
<p>Nennen Sie die drei Kreise <b>Bolt 1</b> bis <b>Bolt 3</b>.
</p>
<h3><span class="mw-headline" id="Die_andere_Seite_des_Blocks">Die andere Seite des Blocks</span></h3>
<p>Nun da die ersten drei Bolzen auf der einen Seite des Motorblocks platziert sind, ben&ouml;tigen wir noch drei weitere auf der anderen Seite. Dabei gibt es drei M&ouml;glichkeiten:
</p>
<ul><li>Wir k&ouml;nnten weitere Kreise wie zuvor einf&uuml;gen und bei der Y-Koordinate den negativen Wert von vorhin verwenden.</li>
<li>Wir k&ouml;nnten die drei vorhanderen Kreise selektieren, dann &uuml;ber <b>Bearbeiten &rarr; Auswahl duplizieren</b> kopieren und die Y-Koordinaten von Hand &auml;ndern.</li>
<li>Wir k&ouml;nnen das Werkzeug <i>Spiegelung</i> <span typeof="mw:File"><a href="../index.php?title=Part_Mirror.png&amp;filetimestamp=20170322214027&amp;.html" class="mw-file-description"><img src="../File/Part_Mirror.png" decoding="async" width="16" height="16"></a></span> des Arbeitsbereichs <a href="../de/Part_Workbench.html" title="Part Workbench/de">Part</a> verwenden.</li></ul>
<p>Da du den ersten und zweiten Weg bereits kennen solltest, werden wir f&uuml;r dieses Beispielmodell den dritten Weg w&auml;hlen.  Jede der drei Methoden hat ihre eigenen Vor- und Nachteile, aber eine gute Bedienungsregel ist, dass einfache Modelle (wie dieses) wahrscheinlich die erste oder zweite Methode verwenden sollten, w&auml;hrend Modelle mit viel Duplikation und/oder Duplikation sehr komplizierter Formen/Objekte wahrscheinlich die dritte Methode verwenden sollten.
</p><p>Auch wenn es also ein bisschen &uuml;bertrieben ist, werden wir diese Bolzen zur Demonstration spiegeln.  Wechsle zur&uuml;ck zum Part Arbeitsbereich (beachte, dass du jederzeit zum <i>Vollst&auml;ndigen</i> Arbeitsbereich wechseln kannst, um alle Werkzeuge auf einmal zu sehen, wenn du lieber nicht hin- und herwechseln m&ouml;chtest (veraltet seit v0.17)), indem du zu <b>Ansicht &rarr; Arbeitsbereich</b> gehst.  Markiere die drei Schraubenkreise in der Baumansicht und dr&uuml;cke dann die Schaltfl&auml;che Spiegeln (<span typeof="mw:File"><a href="../index.php?title=Part_Mirror.svg&amp;filetimestamp=20240712184557&amp;.html" class="mw-file-description"><img src="../File/Part_Mirror.svg" decoding="async" width="16" height="16"></a></span>). Sobald du die Schaltfl&auml;che Spiegeln gedr&uuml;ckt hast, solltest du bemerken, dass eine neue Anzeige namens <i>Comboansicht</i> im Fensterbereich unterhalb der Strukturansicht erscheint.  Viele der Werkzeuge ben&ouml;tigen zus&auml;tzliche Eingaben, bevor sie ausgef&uuml;hrt werden k&ouml;nnen, und in der Comboansicht  kannst du diese Parameter eingeben.  Du kannst die Kombinationsansicht vergr&ouml;&szlig;ern, indem du die Trennlinie, die sie von der Eigenschaftsansicht trennt, nach oben oder unten ziehst.  W&auml;hle <b>Bolzen 1</b> aus der Liste in der Kombinationsansicht, setzen die <i>Spiegelebene</i> auf XZ und dr&uuml;cke dann auf OK (mache dasselbe f&uuml;r Bolzen 2 und 3).
</p><p>An dieser Stelle sollten Sie einen einfachen Motorblock mit ausgebohrten Zylindern und Markierungen der Kopfbolzen haben.
</p>
<h3><span id="Ausschneiden_des_.C3.BCbersch.C3.BCssigen_Rohlingmaterials"></span><span class="mw-headline" id="Ausschneiden_des_&uuml;bersch&uuml;ssigen_Rohlingmaterials">Ausschneiden des &uuml;bersch&uuml;ssigen Rohlingmaterials</span></h3>
<p>Nun da die L&ouml;cher f&uuml;r die Kopfbolzen markiert sind, k&ouml;nnen wir den &auml;u&szlig;eren Rohling des Motorblocks in eine passendere Form schneiden. Dies macht den Motor leichter, erm&ouml;glicht eine bessere K&uuml;hlung und verringert den Stahlverbrauch zum Herstellen des Motors. Ebenso wie bei den Kopfbolzen werden wir zun&auml;chst eine zweidimensionale Skizze der erw&uuml;nschten Form des Blocks erstellen. Die daf&uuml;r notwendige Spline-Kurve k&ouml;nnten wir mit der Maus zeichnen oder alternativ wieder eine Hybridmethode verwenden, bei der die Maus nur f&uuml;r das Absch&auml;tzen der richtigen Koordinaten verwendet wird und die endg&uuml;ltigen Koordinaten &uuml;ber die Textfelder eingegeben werden. Eine interessantere Vorgehensweise ist es, den so genannten <i>Konstruktionsmodus</i> des Arbeitsbereichs <i>Draft</i> zu nutzen, um einige Orientierungshilfen einzuzeichnen, an denen anschlie&szlig;end die fertige Spline-Kurve einrasten kann.
</p><p>Als Anhaltspunkt werden wir zwei regelm&auml;&szlig;ige Polygone f&uuml;r jeden Zylinder zeichnen, wobei die Polygone konzentrisch mit dem Zylinder sind.  Wechsle zun&auml;chst in die Draufsicht des Motorblocks, blende das Kurbelgeh&auml;use aus, wechsle zur&uuml;ck zur 2D Entwurf Arbeitsbereich, w&auml;hle die auf 110 mm versetzte Bezugsebene und den XY Ebenenmodus (oder den Modus <i>Keine</i>, wenn du dies bevorzugen) und klicke auf die Schaltfl&auml;che <i>Konstruktionsmodus</i> in der Befehlsleiste (die Schaltfl&auml;che f&uuml;r den Konstruktionsmodus sieht aus wie eine Kelle und befindet sich direkt &uuml;ber der oberen rechten Ecke der 3D Ansicht).  Der Konstruktionsmodus funktioniert genau wie der normale Modus, mit der Ausnahme, dass alle 2D Zeichnungsobjekte, die im Konstruktionsmodus erstellt werden, in einer anderen Farbe gezeichnet und automatisch in eine separate Gruppe in der Baumansicht gesetzt werden. Dies erm&ouml;glicht es dir, deine Hilfszeichnungen auszublenden und nur die wirklichen Dinge wie Schraubenlochmarkierungen zur&uuml;ckzulassen, indem du die Konstruktionsgruppe ausblendest, oder alle Hilfsobjekte zu l&ouml;schen, indem du einfach die Gruppe l&ouml;schst.
</p>
<dl><dd><i>Weiterf&uuml;hrend: <a href="../de/Draft_ToggleConstructionMode.html" title="Draft ToggleConstructionMode/de"> Konstruktionsmodus</a></i></dd></dl>
<p>Nun, da deine Zeichenebene korrekt eingerichtet ist und du dich im Konstruktionsmodus befindest, klicke auf die Schaltfl&auml;che <i>Regelm&auml;&szlig;iges Polygon</i> (<span typeof="mw:File"><a href="../index.php?title=Draft_Polygon.svg&amp;filetimestamp=20210319102534&amp;.html" class="mw-file-description"><img src="../File/Draft_Polygon.svg" decoding="async" width="16" height="16"></a></span>) und bewege die Maus bei gedr&uuml;ckter STRG Taste entlang der Kante des linken Zylinders.  Du solltest sehen, dass ein kleiner schwarzer Punkt entweder am Rand des Zylinders oder in der Mitte des Zylinders gefangen wird, je nachdem, wo sich die Maus auf dem Umfang befindet.  Bewege den Mauszeiger so, dass der schwarze Punkt in der Mitte des Zylinders gefangen ist, und klicke mit der linken Maustaste.  Dadurch wird der Mittelpunkt des Polygons in die Mitte des Zylinders gesetzt, das Programm fragt uns nach der Anzahl der Kanten des Polygons und dem Radius, in den es eingeschrieben ist.  Ein wenig mit der Maus zu untersuchen, sieht so aus, als w&auml;re ein Radius von 30 gut (also gib das ein) und gib  14 f&uuml;r die Anzahl der Seiten ein, aber lasse diesmal das K&auml;stchen <i>Gef&uuml;llt</i> unmarkiert.  Wenn du den Fang nicht auf die Mitte des Zylinders fangen lassen kannst (ich hatte Probleme mit meinem), kannst du die Koordinaten immer manuell eingeben (X=40, Y=0, Z=110).  F&uuml;ge ein zweites Polygon hinzu, ebenfalls zentriert auf dem linken Zylinder, aber dieses sollte 22 Seiten und einen Radius von 45 mm haben.  F&uuml;ge schlie&szlig;lich die gleichen zwei Polygone &uuml;ber dem rechten Zylinder hinzu (zentriert bei X=100, Y=0, Z=110).  Wenn du fertig bist, solltest du zwei "Achterfiguren" haben, die die Zylinder und Kopfschrauben umgeben.  (Beachte, dass das Programm derzeit nicht wirklich nach der Anzahl der Kanten fragt, so dass du nur den Mittelpunkt und den Radius festlegst und dann die Anzahl der Fl&auml;chen in der Eigenschaftsansicht &auml;ndern musst).
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=Engine_Block_Tutorial_-_Spline.png&amp;filetimestamp=20110526172017&amp;.html" class="mw-file-description"><img src="../File/Engine_Block_Tutorial_-_Spline.png" decoding="async" width="300" height="181"></a><figcaption></figcaption></figure>
<p>Nun, da wir unsere F&uuml;hrungspolygone an Ort und Stelle haben, sind wir bereit, die Spline Kurve einzuzeichnen, die die Au&szlig;enform des Motorblocks definiert.  Da diese Kurve Teil des endg&uuml;ltigen Objekts sein wird, kannst du den Konstruktionsmodus ausschalten, indem du auf die gleiche Schaltfl&auml;che klickst, die du zum Einschalten gedr&uuml;ckt hast.  Klicke nun auf die <i>BSpline hinzuf&uuml;gen</i> Schaltfl&auml;che (<span typeof="mw:File"><a href="../index.php?title=Draft_BSpline.svg&amp;filetimestamp=20210319100925&amp;.html" class="mw-file-description"><img src="../File/Draft_BSpline.svg" decoding="async" width="16" height="16"></a></span>) und beginne mit dem Zeichnen der BSpline durch <i>STRG+Linksklick</i> an jeder Stelle, an der du einen Kontrollpunkt f&uuml;r die Spline-Kurve hinzuf&uuml;gen m&ouml;chtest.  Du m&ouml;chtest, dass dein erster Kontrollpunkt am &auml;u&szlig;ersten linken Punkt des inneren F&uuml;hrungspolygons f&uuml;r den linken Zylinder liegt.  Fahre fort, Kontrollpunkte entlang der gesamten Spline Kurve hinzuzuf&uuml;gen, bis du auf den letzten Punkt <i>vor</i> klickst, den du zu zeichnen begonnen hast, und klicke dann auf die Schaltfl&auml;che <i>Schlie&szlig;en</i> oben an der Stelle, an der du die Position und den Radius f&uuml;r die 2D Kreise eingegeben hast, die wir f&uuml;r die Kopfschrauben gezeichnet haben.  Wenn du auf diese "Schlie&szlig;en" Schaltfl&auml;che klickst, ist das Zeichnen der Kontrollpunkte f&uuml;r die Spline Kurve beendet und die Enden werden zu einer geschlossenen Schleife verbunden.  Es ist sehr wichtig, dass du solche Schleifen richtig schlie&szlig;t, wenn du vorhast, sie in feste Objekte zu extrudieren, wie wir es bei diesem Objekt tun werden.  Bei offenen Spline Kurven kannst du einfach auf die Schaltfl&auml;che "Fertigstellen" anstelle der Schaltfl&auml;che "Schlie&szlig;en" klicken, wenn du mit dem Zeichnen fertig bist.  Auf der rechten Seite siehst du, wie die fertige Spline Kurve aussehen sollte, kurz bevor du die "Schlie&szlig;en" Schaltfl&auml;che dr&uuml;ckst (ich habe alle Liniensegmente bis auf das letzte gezeichnet, und mein Mauszeiger ist gerade dabei, auf die "Schlie&szlig;en" Schaltfl&auml;che zu klicken, um die Spline Kurve zu beenden).  Beachte auch, dass ich das K&auml;stchen <i>Gef&uuml;llt</i> angekreuzt habe, damit die resultierende Spline Kurve eine feste Platte und nicht nur einen leeren Ring bildet; dies muss getan werden, um sie in eine feste Form zu extrudieren, die an den Enden gekappt wurde.
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=Engine_Block_Tutorial_-_Spline_Edit_Mode.png&amp;filetimestamp=20110526172139&amp;.html" class="mw-file-description"><img src="../File/Engine_Block_Tutorial_-_Spline_Edit_Mode.png" decoding="async" width="300" height="181"></a><figcaption></figcaption></figure>
<p>Die Kontrollpunkte sind in diesem Bild nicht zu sehen, daher habe ich ein zweites Bildschirmfoto hinzugef&uuml;gt, der den fertigen Spline im Bearbeitungsmodus zeigt (klicke auf die Schaltfl&auml;che <i>Bearbeitungsmodus</i>, um die Bearbeitung f&uuml;r das ausgew&auml;hlte Objekt ein- oder auszuschalten, schalte es aus, wenn du mit der Bearbeitung fertig bist, oder &uuml;berspringe diesen Schritt einfach, wenn du mit deiner Motorblockform zufrieden bist).  Beachte auch, dass sich am &auml;u&szlig;ersten linken Rand der Spline Kurve eine Diskontinuit&auml;t befindet, auch wenn sie ordnungsgem&auml;&szlig; geschlossen ist. Dies ist ein Fehler im Programmverhalten und wird derzeit behoben, so dass deine Spline Kurve etwas anders aussehen kann, wenn du eine neuere Version der Software verwendest, als die derzeit verf&uuml;gbar ist.
</p><p><span id="Extruding_the_2D_Head_Design_into_our_3D_Model_to_Finish_the_Design"></span>
</p>
<h3><span id="Extrudieren_der_2D_Kopfkonstruktion_in_unser_3D_Modell.2C_um_die_Konstruktion_abzuschlie.C3.9Fen"></span><span class="mw-headline" id="Extrudieren_der_2D_Kopfkonstruktion_in_unser_3D_Modell,_um_die_Konstruktion_abzuschlie&szlig;en">Extrudieren der 2D Kopfkonstruktion in unser 3D Modell, um die Konstruktion abzuschlie&szlig;en</span></h3>
<p>Nun n&auml;hern wir uns der endg&uuml;ltigen Konstruktion des Motors.  Kehre zum Part Arbeitsbereich zur&uuml;ck und klicke auf die  <i>Skizze extrudieren</i> Schaltfl&auml;che (<span typeof="mw:File"><a href="../index.php?title=Part_Extrude.svg&amp;filetimestamp=20240705092108&amp;.html" class="mw-file-description"><img src="../File/Part_Extrude.svg" decoding="async" width="16" height="16"></a></span>).   W&auml;hle in dem sich &ouml;ffnenden Combofeld mit "STRG+Linksklick" die 6 Kopfschrauben und die Spline Kurve f&uuml;r die Extrusion aus.  Die Standardrichtung ist die positive Z Achse. Wir m&ouml;chten, dass die negative Z Achse das Kopfdesign "nach unten" und in den Motorblock extrudiert, also stelle die Richtung auf X=0, Y=0 und Z=-1 ein und gib dann 110 f&uuml;r die L&auml;nge (die H&ouml;he des Motorblocks) ein.  Nachdem du alle eingegebenen Werte erh&auml;lst und auf OK geklickt hast, werden die Kreise f&uuml;r die Bolzen nach unten bis f&uuml;r die Zylinder extrudiert, und die Keilnut wird nach unten extrudiert, um eine Art Zylinder mit "geriffelten" Kanten zu erzeugen.  Markiere und verberge den <b>Bohrungsblock</b>, so dass du den extrudierten Spline sehen kannst, und verberge dann dieses Objekt, so dass du die Zylinder mit 6 Kopfschrauben sehen kannst.  Du siehst, dass sehr anspruchsvolle 3D Formen hergestellt werden k&ouml;nnen, indem man mit einer 2D Zeichnung beginnt und Teile davon nach unten extrudiert.  Wir k&ouml;nnten sogar verschiedene Teile der Zeichnung in unterschiedlichem Umfang extrudieren, um z.B. Bohrungen in Bolzenl&ouml;chern vorzunehmen, die nur teilweise durch den Block gehen, aber separate Wasserm&auml;ntel schneiden, die ganz durchgehen.  Zu diesem Zeitpunkt werden alle deine extrudierten Objekte einfach "Extrudieren001..." genannt, so dass du sie durchgehst und jedes von ihnen benennst, damit du sie im n&auml;chsten Abschnitt identifizieren kannst (ich werde meine <i>Kopfschraubenbohrung 1</i> bis <i>6</i> benennen und den Spline <b>Extrudierter Spline</b> benennen, ich schlage vor, dieselben Namen auch in deinem Modell zu verwenden).  Nun, da du deine extrudierten Formen hast, sind es nur noch ein paar boolesche Operationen, um das endg&uuml;ltige Blockdesign zu erzeugen.  Gehe durch und zeige die Hauptkomponenten (den <i>Bohrungsblock</i> und das <i>Kurbelgeh&auml;use</i>) und alle deine neu erstellten extrudierten Objekte.
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=Engine_Block_Tutorial_-_Finished_Engine_Block.png&amp;filetimestamp=20110526172237&amp;.html" class="mw-file-description"><img src="../File/Engine_Block_Tutorial_-_Finished_Engine_Block.png" decoding="async" width="300" height="181"></a><figcaption></figcaption></figure>
<p>Jetzt, wo wir 3D Objekte f&uuml;r die Bohrungs&ouml;ffnungen und die &auml;u&szlig;ere Form haben, k&ouml;nnen wir das Ganze mit ein paar booleschen Operationen zusammenf&uuml;gen.  W&auml;hle deine 6 extrudierten Kopfbolzen in der Baumansicht aus und verbinde sie zu einem Verbund (benenne das resultierende Objekt <b>Kopfbolzenbohrungs&ouml;ffnungen</b>).  W&auml;hle dann den "Bohrblock" und die "Kopfbolzenbohrungs&ouml;ffnungen" in dieser Reihenfolge aus und f&uuml;hre einen Schnitt durch (wie beim Ausbohren der Zylinder), nenne das resultierende "Schnitt"-Objekt "Block mit Kopfbolzen".  W&auml;hle schlie&szlig;lich den <i>Block mit Kopfbolzen</i> und den <b>Extrudierten Spline<i> und dr&uuml;cke die  </i>Schnitt herstellen<i> Schaltfl&auml;che (<span typeof="mw:File"><a href="../index.php?title=Part_Common.svg&amp;filetimestamp=20240705092244&amp;.html" class="mw-file-description"><img src="../File/Part_Common.svg" decoding="async" width="16" height="16"></a></span>), und benenne das resultierende Objekt </i></b><i>Motorblock</i>.
</p><p>Dein endg&uuml;ltiges Objekt sollte wie auf dem Bild rechts aussehen.
</p>
<div style="clear:both"></div>
<!-- 
NewPP limit report
Cached time: 20250621230543
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc, no&#8208;toc&#8208;conversion]
CPU time usage: 0.123 seconds
Real time usage: 0.240 seconds
Preprocessor visited node count: 183/1000000
Post&#8208;expand include size: 2762/2097152 bytes
Template argument size: 291/2097152 bytes
Highest expansion depth: 3/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1543/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   22.323      1 -total
 22.69%    5.065      1 Template:UnfinishedDocu/de
 19.62%    4.380      1 Template:TutorialInfo/de
 17.63%    3.936      2 Template:KEY
 11.39%    2.543      1 Template:Button
 11.07%    2.471      8 Template:MenuCommand
  7.94%    1.773      1 Template:Clear
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:63313-0!canonical and timestamp 20250621230542 and revision id 1594836. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>