<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">FEM Geometry Preparation and Meshing/de</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="de" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-FEM+Geometry+Preparation+and+Meshing&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--high" lang="de" dir="ltr">Deutsch</span></li>
<li><a href="../FEM_Geometry_Preparation_and_Meshing.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="FEM Geometry Preparation and Meshing (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../fr/FEM_Geometry_Preparation_and_Meshing.html" class="mw-pt-progress mw-pt-progress--complete" title="FEM Pr&eacute;paration de la g&eacute;om&eacute;trie et maillage (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../pl/FEM_Geometry_Preparation_and_Meshing.html" class="mw-pt-progress mw-pt-progress--complete" title="MES: Przygotowanie geometrii i tworzenie siatki (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../ru/FEM_Geometry_Preparation_and_Meshing.html" class="mw-pt-progress mw-pt-progress--high" title="&#1052;&#1050;&#1069; &#1055;&#1086;&#1076;&#1075;&#1086;&#1090;&#1086;&#1074;&#1082;&#1072; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080; &#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1089;&#1077;&#1090;&#1082;&#1080; (99% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li></ul></div>
<table class="fcinfobox wikitable ct" style="width: 230px; float: right; margin-left: 1em">
<tbody><tr>
<td class="ctTitle" style="font-weight: bold; font-size: 125%;"><span typeof="mw:File"><span><img src="../File/Freecad.svg" decoding="async" width="32" height="32" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span> Anleitung
</td></tr>
<tr>
<th class="ctOdd">Thema
</th></tr>
<tr>
<td class="ctEven">Finite-Elemente-Analyse
</td></tr>
<tr>
<th class="ctOdd">Niveau
</th></tr>
<tr>
<td class="ctEven">Anf&auml;nger
</td></tr>
<tr>
<th class="ctOdd">Bearbeitungszeit
</th></tr>
<tr>
<td class="ctEven">N/A
</td></tr>
<tr>
<th class="ctOdd">Autoren
</th></tr>
<tr>
<td class="ctEven"><a rel="nofollow" class="external text" href="https://www.freecad.org/wiki/index.php?title=User:NewJoker">NewJoker</a>
</td></tr>
<tr>
<th class="ctOdd">FreeCAD-Version
</th></tr>
<tr>
<td class="ctEven">1.0 oder neuer
</td></tr>
<tr>
<th class="ctOdd">Beispieldateien
</th></tr>
<tr>
<td class="ctEven"><i>None</i>
</td></tr>
<tr>
<th class="ctOdd">Siehe auch
</th></tr>
<tr>
<td class="ctEven"><a href="../de/FEM_Workbench.html" title="FEM Workbench/de">Arbeitsbereich FEM</a>
</td></tr>
<tr>
<td class="ctToc"><br><meta property="mw:PageProp/toc">
</td></tr></tbody></table>
<p><span id="Background"></span>
</p>
<h2><span class="mw-headline" id="Hintergrund">Hintergrund</span></h2>
<p>Die Vorbereitung der Geometrie und die Vernetzung sind entscheidende Bestandteile der Vorverarbeitung von Simulationen mit der Finite-Elemente-Methode (FEM). W&auml;hrend leicht zug&auml;ngliche Simulationssoftware, die mit einer CAD-Umgebung (wie z. B. der <a href="../de/FEM_Workbench.html" title="FEM Workbench/de">Arbeitsbereich FEM</a> in FreeCAD) verbunden ist, ist es verlockend, neue Konstruktionen sofort zu analysieren, aber man darf nicht vergessen, dass FEM eine fortgeschrittene Methode ist, die eine sorgf&auml;ltig vorbereitete Geometrie und ein sorgf&auml;ltig vorbereitetes Netz erfordert, um vern&uuml;nftige, genaue Ergebnisse zu liefern. Die alte Regel  <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Garbage_in,_garbage_out"><i>garbage in, garbage out</i></a> ist hier besonders wichtig. Es gibt noch weitere wichtige Einstellungen, von denen die Genauigkeit der FEM stark abh&auml;ngt (z. B. Materialeigenschaften und Randbedingungen), aber die ersten Schritte und einige der h&auml;ufigsten Fehlerquellen sind die Geometrievorbereitung und die Vernetzung, die auf dieser Seite behandelt werden.
</p><p><span id="Types_of_geometry_used_for_FEM_in_FreeCAD"></span>
</p>
<h2><span id="Geometriearten_zur_Verwendung_f.C3.BCr_FEM_in_FreeCAD"></span><span class="mw-headline" id="Geometriearten_zur_Verwendung_f&uuml;r_FEM_in_FreeCAD">Geometriearten zur Verwendung f&uuml;r FEM in FreeCAD</span></h2>
<ul><li>Linien (Kanten) - f&uuml;r Analysen mit Balkenelementen verwendet</li>
<li>Fl&auml;chen - verwendet f&uuml;r Analysen mit H&uuml;llen- und 2D-Elementen (ebene Spannung/Dehnung und achsensymmetrisch)</li>
<li>Festk&ouml;rper - f&uuml;r Analysen mit festen Elementen verwendet</li></ul>
<p><span id="Choice_of_the_type_of_geometry"></span>
</p>
<h2><span class="mw-headline" id="Auswahl_der_Geometrieart">Auswahl der Geometrieart</span></h2>
<p>W&auml;hrend die meisten Konstruktionen aus Volumenk&ouml;rpern bestehen, wird f&uuml;r die FEM h&auml;ufig dringend empfohlen, Linienz&uuml;ge oder Fl&auml;chen zu verwenden, wenn die Struktur dies zul&auml;sst:
</p>
<ul><li>Wenn ein Bauteil schlank (lang und d&uuml;nn) und tr&auml;gerartig ist und einen regelm&auml;&szlig;igen Querschnitt eines der derzeit unterst&uuml;tzten Tr&auml;gerquerschnittstypen (rechteckig, kreisf&ouml;rmig oder rohrf&ouml;rmig) aufweist, sollte es mit Tr&auml;gerelementen analysiert werden (es sei denn, es gibt bestimmte Formen der Belastung, Reaktion oder unvermeidbare geometrische Details, die diese Annahme ung&uuml;ltig machen). Grunds&auml;tzlich sollte man eine Mittellinie zeichnen (einige Tipps, wie man diese aus einer vorhandenen Volumengeometrie extrahieren kann, findet man in <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=81589">diesem Forumbeitrag</a> &ndash; kurz gesagt, verwendet man <a href="../de/Draft_Wire.html" title="Draft Wire/de">Draft Linienzug</a> oder <a href="../de/Draft_BSpline.html" title="Draft BSpline/de">Draft BSpline</a> mit den richtigen <a href="../de/Draft_Workbench.html#Draft-Widget_Einrasten" title="Draft Workbench/de">Einrasten</a> und <a href="../de/Draft_Line.html" title="Draft Line/de">Linien</a> als St&uuml;tzen) und wendet man <a href="../de/FEM_ElementGeometry1D.html" title="FEM ElementGeometry1D/de">Tr&auml;gerschnitte</a> mit optionaler <a href="../de/FEM_ElementRotation1D.html" title="FEM ElementRotation1D/de">Drehung</a> an. Es gibt keine einheitliche Regel, wann Tr&auml;gerelemente verwendet werden k&ouml;nnen, aber es wird oft empfohlen, dass die Querschnittsabmessungen &lt; 1/10 der L&auml;nge des Teils betragen sollten, damit die Tr&auml;gerannahme g&uuml;ltig ist.</li></ul>
<p><span typeof="mw:File"><a href="../index.php?title=FEM_beam_model.JPG&amp;filetimestamp=20231228195452&amp;.html" class="mw-file-description"><img src="../File/FEM_beam_model.JPG" decoding="async" width="600" height="233" class="mw-file-element" data-file-width="1104" data-file-height="429"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Schlankes Bauteil, das zur Analyse von Stabelementen geeignet ist - Mittellinie hervorgehoben</p>
<ul><li>Wenn ein Bauteil d&uuml;nnwandig ist (z. B. Blechteile), sollte es mit Schalenelementen analysiert werden (es sei denn, es werden genaue Kontakt-Ergebnisse ben&ouml;tigt oder es treten Einschr&auml;nkungen der Schalenelemente auf). Dies ist sehr wichtig und wird oft &uuml;bersehen. Um eine angemessene Genauigkeit der Ergebnisse zu erzielen (insbesondere bei Biegungen), ben&ouml;tigt man einige Elemente (mindestens 3-5) in Dickenrichtung. Bei d&uuml;nnwandigen Teilen f&uuml;hrt dies in der Regel zu gro&szlig;en Netzen (insbesondere bei Verwendung von Tetraedern, da in FreeCAD keine Hexaederelemente erzeugt werden k&ouml;nnen) und hohem Rechenaufwand &ndash; hohe Anforderungen an die Rechenleistung und lange L&ouml;sungszeiten. Um eine f&uuml;r die Analyse mit Schalenelementen geeignete Geometrie zu erhalten, sollte man eine Mittelebene des Teils zeichnen (einige Tipps, wie man diese aus einer vorhandenen Volumengeometrie extrahieren kann, finden Sie in <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=67505">diesem Forum-Thread</a>, <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=71821">diesem</a> und <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=81834">diesem</a> - Kurz gesagt: Wendet man <a href="../de/PartDesign_SubShapeBinder.html" title="PartDesign SubShapeBinder/de">PartDesign Teilformbinder</a> oder <a href="../de/Draft_Facebinder.html" title="Draft Facebinder/de">Draft Fl&auml;chenbinder</a> an, dann <a href="../de/Part_Offset.html" title="Part Offset/de">Part Versatz</a> und verwendet schlie&szlig;lich Teilformbinder und <a href="../de/Part_Extrude.html" title="Part Extrude/de">Extrudieren</a>, um die Kanten der Mitteloberfl&auml;chen zu verl&auml;ngern und so die L&uuml;cken zwischen ihnen zu schlie&szlig;en) und die richtige <a href="../de/FEM_ElementGeometry2D.html" title="FEM ElementGeometry2D/de">Dicke</a> anwenden. Auch hier gibt es keine allgemeing&uuml;ltige Regel, aber es wird in der Regel empfohlen, dass die Dicke &lt; 1/10 einer typischen globalen Abmessung (L&auml;nge/Breite) betragen sollte, damit die Schalenannahme g&uuml;ltig ist.</li></ul>
<p><span typeof="mw:File"><a href="../index.php?title=FEM_shell_model.JPG&amp;filetimestamp=20231228195539&amp;.html" class="mw-file-description"><img src="../File/FEM_shell_model.JPG" decoding="async" width="600" height="282" class="mw-file-element" data-file-width="1444" data-file-height="678"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">D&uuml;nnwandiges Bauteil, das zur Analyse von Schalenelementen geeignet ist - Mittelfl&auml;che hervorgehoben</p>
<ul><li>In einigen F&auml;llen sind auch 2D-Analysen m&ouml;glich, die durch Setzen der Eigenschaft <span style="font-size:60%; padding-right:0.8em;">Daten-Eigenschaft</span><b>Model Space</b> des <a href="../de/FEM_SolverCalculixCcxtools.html" title="FEM SolverCalculixCcxtools/de">CalculiX-Solvers</a> aktiviert werden k&ouml;nnen:
<ul><li>plane stress - F&uuml;r d&uuml;nne Teile, die zu ebenen Fl&auml;chen vereinfacht werden k&ouml;nnen, die das Profil f&uuml;r die Extrusion darstellen (die Dicke wird auf die gleiche Weise wie f&uuml;r Schalen definiert), werden nur in der Ebene belastet und verformt und weisen in Richtung au&szlig;erhalb der Ebene keine Spannung auf. Es stehen nur zwei Freiheitsgrade zur Verf&uuml;gung &ndash; X- und Y-Translation. In diesem Fall m&uuml;ssen die Fl&auml;chen auf der XY-Ebene liegen. Dieser Ansatz ist recht verbreitet. Beispielsweise kann eine d&uuml;nne Platte, die einer Zugspannung ausgesetzt ist, auf diese Weise analysiert werden.</li>
<li>plane strain - Bei dicken Teilen, die zu ebenen Fl&auml;chen vereinfacht werden k&ouml;nnen, die das Profil f&uuml;r die Extrusion darstellen (die Dicke wird auf die gleiche Weise wie bei Schalen definiert), werden sie nur in der Ebene belastet und verformt und weisen in den Richtungen au&szlig;erhalb der Ebene keine Dehnung auf. Es stehen nur zwei Freiheitsgrade zur Verf&uuml;gung &ndash; X- und Y-Translation. In diesem Fall m&uuml;ssen die Fl&auml;chen auf der XY-Ebene liegen. Dieser Ansatz ist nicht sehr verbreitet. Beispielsweise kann eine lange Dammwand, Mauer oder Rohrleitung, die &uuml;ber ihre gesamte L&auml;nge einem gleichm&auml;&szlig;igen Druck ausgesetzt ist, auf diese Weise analysiert werden.</li>
<li>axisymmetric - F&uuml;r Teile, die sich auf ebene Fl&auml;chen vereinfachen lassen, die das Rotationsprofil darstellen (die Dicke ist hier irrelevant) und die gleichm&auml;&szlig;ig &uuml;ber den gesamten Umfang belastet werden. Es stehen nur zwei Freiheitsgrade zur Verf&uuml;gung &ndash; radiale und axiale Verschiebung. Die Fl&auml;chen m&uuml;ssen auf der XY-Ebene rechts von der Y-Achse liegen. Dieser Ansatz ist sehr verbreitet. Beispielsweise k&ouml;nnen einige Druckbeh&auml;lter, Gummilager, Buchsen, Dichtungen, Flansche und sogar Schraubverbindungen (wobei das Gewinde als achsensymmetrisch behandelt wird) auf diese Weise analysiert werden.</li></ul></li></ul>
<p>Man sollte bedenken, dass die in CalculiX verwendeten Balken-, Schalen-, ebenen Spannungs-/Dehnungs- und achsensymmetrischen Elemente keine echten Elemente dieser Art sind (sie verwenden nicht die aus der Literatur und anderer Software bekannten klassischen Elementformulierungen) &ndash; sie werden intern zu Volumenk&ouml;rpern erweitert. Dennoch wird ihre Verwendung in den oben genannten F&auml;llen empfohlen.
</p><p><span id="Geometry_validity"></span>
</p>
<h2><span id="G.C3.BCltigkeit_der_Geometrie"></span><span class="mw-headline" id="G&uuml;ltigkeit_der_Geometrie">G&uuml;ltigkeit der Geometrie</span></h2>
<p>Die f&uuml;r die FEM verwendete Geometrie muss g&uuml;ltig sein. Vor allem darf es keine Schnittpunkte geben. Dies ist ein h&auml;ufiges Problem, das oft auftritt, wenn Baugruppen ohne ordnungsgem&auml;&szlig;e Beschr&auml;nkungen zwischen den Teilen modelliert werden. Das Werkzeug <a href="../de/Part_SectionCut.html" title="Part SectionCut/de">Part Schnittansicht</a> kann dabei helfen, solche Interferenzen zwischen Teilen zu finden. Nat&uuml;rlich kann <a href="../de/Part_Fuse.html" title="Part Fuse/de">Part Vereinigung</a> helfen, diese zu beheben, wenn sie beabsichtigt sind. Andere Probleme mit der Geometrie (wie nicht-mannigfaltige Geometrien, redundante Kanten oder Fl&auml;chen usw.) m&uuml;ssen ebenfalls behoben werden, bevor mit der Vernetzung fortgefahren werden kann. Das Werkzeug <a href="../de/Part_CheckGeometry.html" title="Part CheckGeometry/de">Part GeometriePr&uuml;fen</a> kann dabei hilfreich sein, aber auch visuelle &Uuml;berpr&uuml;fungen sind wichtig. Bei der Vorbereitung einer Simulation mit Volumenelementen und bei Zweifeln, ob das Teil wirklich volumin&ouml;s oder nur eine geschlossene Schale ist, k&ouml;nnen die oben genannten Werkzeuge (Part Schnittansicht und die Registerkarte &bdquo;Form-Inhalt&ldquo; der Ausgabe des Werkzeugs Part GeometriePr&uuml;fen) Klarheit schaffen.
</p><p><span id="Surface_normals"></span>
</p>
<h2><span id="Oberfl.C3.A4chennormalen"></span><span class="mw-headline" id="Oberfl&auml;chennormalen">Oberfl&auml;chennormalen</span></h2>
<p>Bei Oberfl&auml;chengeometrien, die f&uuml;r Analysen mit Schalen- und 2D-Elementen verwendet werden, k&ouml;nnen die Normalenrichtungen der Oberfl&auml;chen von Bedeutung sein. Sie dienen zur Unterscheidung zwischen der positiven und negativen Seite eines Oberfl&auml;chen-Finite-Elemente-Netzes und beeinflussen Analysefunktionen wie Druckbelastungen und Kontakt. Dar&uuml;ber hinaus erfordern 2D-Analysen (ebene Spannung/Dehnung und achsensymmetrisch) mit CalculiX, dass die Normalen in die positive Z-Richtung zeigen. Sind sie invertiert, treten negative Jacobi-Fehler auf.
</p><p>Um die Normalen zu &uuml;berpr&uuml;fen, verwende einen der folgenden Ans&auml;tze:
</p>
<ul><li>Hintergrundbeleuchtung in den  <a href="../de/Preferences_Editor.html" title="Preferences Editor/de">Voreinstellungen</a> aktivieren und die Eigenschaft <span style="font-size:60%; padding-right:0.8em;">Ansicht</span><b>Beleuchtung</b> des Fl&auml;chen-Objekts auf &sbquo;&lsquo;Eine Seite<i> - Die negative Normalenrichtung erscheint dunkler,</i></li>
<li>nutze das <a href="../Macro_Normal_Vector.html" title="Macro Normal Vector">Makro Normal Vector</a>,</li>
<li>vernetze die Oberfl&auml;chenform in FEM - das Netz wird nur auf der positiven Normalen-Seite eingef&auml;rbt.</li></ul>
<p>Um die Normalen umzukehren, verwende das <a href="../de/Part_ReverseShape.html" title="Part ReverseShape/de">Part FormUmkehren</a>-Werkzeug.
</p><p><span id="Using_surface_meshes_for_FEM"></span>
</p>
<h2><span id="Verwendung_von_Surface-Oberfl.C3.A4chennetzen_f.C3.BCr_FEM"></span><span class="mw-headline" id="Verwendung_von_Surface-Oberfl&auml;chennetzen_f&uuml;r_FEM">Verwendung von Surface-Oberfl&auml;chennetzen f&uuml;r FEM</span></h2>
<p><a href="../de/Mesh_MeshObject.html" title="Mesh MeshObject/de">Polygonnetz-Objekte</a>, in der Regel aus STL-, OBJ- und &auml;hnlichen Dateien importiert oder im <a href="../de/Mesh_Workbench.html" title="Mesh Workbench/de">Arbeitsbereich Mesh</a> erstellt, k&ouml;nnen nicht direkt f&uuml;r FEM genutzt werden. Es ist notwendig, zuerst eine <a href="../de/Part_ShapeFromMesh.html" title="Part ShapeFromMesh/de">Form aus einem Netz</a> zu erzeugen. Anschlie&szlig;end kann diese Form im Arbeitsbereich FEM vernetzt werden, um ein Oberfl&auml;chen-Finite-Elemente-Netz (H&uuml;lle/2D) zu erstellen. Wenn ein Festk&ouml;rper-Finite-Elemente-Netz (3D) ben&ouml;tigt wird, muss nach der Formgenerierung Folgendes durchgef&uuml;hrt werden: <a href="../de/Part_MakeSolid.html" title="Part MakeSolid/de">Festk&ouml;rper erstellen</a>.
</p><p>Das gr&ouml;&szlig;te Problem bei Formen, die aus Oberfl&auml;chennetzen erstellt werden, besteht darin, dass alle ihre Dreiecke zu Fl&auml;chen der erzeugten Form werden. In der FEM macht dies die Zuweisung von Analysefunktionen (wie Lasten und Randbedingungen) besonders problematisch. Bei ebenen Fl&auml;chen k&ouml;nnen durch eine Verfeinerung nach der Konvertierung in einen Volumenk&ouml;rper die &uuml;berfl&uuml;ssigen Dreiecksfl&auml;chen entfernt werden. In der Praxis bleiben jedoch die meisten Fl&auml;chen erhalten, weshalb Oberfl&auml;chennetze f&uuml;r die Verwendung in der FEM nicht empfohlen werden. Stattdessen sollten CAD-Geometrien (die in FreeCAD erstellt oder aus STEP/IGES-Dateien importiert wurden) verwendet werden. Manchmal kann es sogar sinnvoll sein, die Geometrie auf der Grundlage des Oberfl&auml;chennetzes neu zu erstellen.
</p><p><span id="Geometry_simplification"></span>
</p>
<h2><span class="mw-headline" id="Geometrie_vereinfachen">Geometrie vereinfachen</span></h2>
<p><span id="Defeaturing"></span>
</p>
<h3><span class="mw-headline" id="Entfunktionalisierung">Entfunktionalisierung</span></h3>
<p>Mit CAD-Software erstellte Entw&uuml;rfe sind in der Regel zu detailliert, um f&uuml;r FEM-Simulationen geeignet zu sein. In vielen F&auml;llen m&uuml;ssen sie zun&auml;chst vereinfacht werden. Dieser Schritt wird oft &uuml;bersehen, ist jedoch sehr wichtig, da es schwierig sein kann, ein gutes Netz zu erhalten, wenn das Teil zu detailliert ist, und selbst wenn ein solches Netz schlie&szlig;lich erhalten wird, kann es sehr dicht sein, was zu unangemessenen L&ouml;sungszeiten f&uuml;hrt. Daher sollte man sich immer das Design ansehen und versuchen, es so weit wie m&ouml;glich zu vereinfachen, wobei nur diejenigen geometrischen Merkmale &uuml;brig bleiben sollten, die einen signifikanten Einfluss auf die Ergebnisse (Festigkeit/Steifigkeit) haben und daher nicht ignoriert werden k&ouml;nnen. Die folgenden Merkmale werden in der Regel weggelassen:
</p>
<ul><li>kleine Verrundungen und Fasen,</li>
<li>kleine L&ouml;cher,</li>
<li>andere kleine Details,</li>
<li>Schwei&szlig;n&auml;hte,</li>
<li>Schrauben, Gewinde,</li>
<li>dekorative Elemente (Logos, Gravuren).</li></ul>
<p>Das Werkzeug <a href="../de/Part_Defeaturing.html" title="Part Defeaturing/de">Part FormelementEntfernen</a> und der externe <a href="../de/Defeaturing_Workbench.html" title="Defeaturing Workbench/de">Arbeitsbereich Defeaturing</a> k&ouml;nnen bei der Vereinfachung von Teilen f&uuml;r Simulationen hilfreich sein.
</p><p><span typeof="mw:File"><a href="../index.php?title=FEM_bracket_original.PNG&amp;filetimestamp=20240105151839&amp;.html" class="mw-file-description"><img src="../File/FEM_bracket_original.PNG" decoding="async" width="400" height="471" class="mw-file-element" data-file-width="600" data-file-height="706"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Ursprungsgeometrie eines Halters</p>
<p><span typeof="mw:File"><a href="../index.php?title=FEM_bracket_simplified.PNG&amp;filetimestamp=20240105151930&amp;.html" class="mw-file-description"><img src="../File/FEM_bracket_simplified.PNG" decoding="async" width="400" height="466" class="mw-file-element" data-file-width="609" data-file-height="710"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Die nur mit dem Werkzeug Part FormelementEntfernen vereinfachte Geometrie des Halters</p>
<p><span id="Replacing_parts_with_boundary_conditions"></span>
</p>
<h3><span class="mw-headline" id="Ersetzen_von_Teilen_mit_Randbedingungen">Ersetzen von Teilen mit Randbedingungen</span></h3>
<p>Bei Baugruppen (mehr dazu in einem der n&auml;chsten Abschnitte) k&ouml;nnen oft einige Teile aus Simulationen ausgeschlossen und durch Randbedingungen ersetzt werden, wenn sie an analysierte Teile angebracht waren. Ein solcher Ansatz ist g&uuml;ltig, wenn die ausgeschlossenen Teile deutlich steifer sind (im Sinne der strukturellen Steifigkeit, also unter Ber&uuml;cksichtigung nicht nur der Elastizit&auml;t des Materials, sondern auch der Geometrie des Teils) als die analysierten Teile, mit denen sie verbunden waren. Das liegt daran, dass feste Randbedingungen Steifigkeit einf&uuml;hren (als ob das analysierte Teil mit einem unendlich steifen Bauteil verbunden w&auml;re) und flexible St&uuml;tzen wie Federelemente in der FEM-Workbench von FreeCAD bei Verwendung von CalculiX nicht verf&uuml;gbar sind (Elmer hat <a href="../de/FEM_ConstraintSpring.html" title="FEM ConstraintSpring/de">FEM RandbedingungFeder</a>).
</p><p><span id="Utilizing_planar_symmetry"></span>
</p>
<h3><span class="mw-headline" id="Ausnutzung_ebener_Symmetrie">Ausnutzung ebener Symmetrie</span></h3>
<p>Die Vereinfachung der Geometrie f&uuml;r die FEM kann auch bedeuten, dass sie in einer der Symmetrieebenen geschnitten wird, um die Annahme der planaren Symmetrie in der Analyse zu nutzen. Diese Annahme ist nur dann g&uuml;ltig, wenn alle folgenden Aspekte des Modells in einer bestimmten Ebene Symmetrie aufweisen:
</p>
<ul><li>Geometrie,</li>
<li>Lasten,</li>
<li>Randbedingungen,</li>
<li>Reaktion (bei Frequenz-/Knickanalysen unter Verwendung von Symmetrie ist Vorsicht geboten &ndash; antisymmetrische Modenformen werden nicht erhalten).</li></ul>
<p>Die Verwendung von Symmetrie (1/2, 1/4 oder 1/8 des Modells) wird nach M&ouml;glichkeit empfohlen, da dadurch der Rechenaufwand f&uuml;r die Analyse erheblich reduziert werden kann. Ein weiterer Vorteil besteht darin, dass dadurch einige starre K&ouml;rperbewegungen eliminiert werden, was die Begrenzung des Teils erleichtert. Eine Symmetrie-Randbedingung sollte auf die Fl&auml;chen angewendet werden, die zur Ebene des Schnitts geh&ouml;ren:
</p>
<ul><li>Die Translation in Richtung senkrecht zur Symmetrieebene sollte f&uuml;r Volumenk&ouml;rperteile blockiert werden.</li>
<li>Die Translation in Richtung senkrecht zur Symmetrieebene und Drehungen, die nicht um die Achse senkrecht zur Symmetrieebene erfolgen, sollten f&uuml;r Schalen- und Balkenbauteile blockiert werden.</li></ul>
<p>Die aufgebrachte Kraft sollte entsprechend reduziert werden, wenn die Symmetrieebene den Bereich schneidet, auf den die Kraft wirkt (irrelevant bei Druckbelastung).
</p><p><span typeof="mw:File"><a href="../index.php?title=FEM_symmetric_vessel.JPG&amp;filetimestamp=20231228201421&amp;.html" class="mw-file-description"><img src="../File/FEM_symmetric_vessel.JPG" decoding="async" width="400" height="447" class="mw-file-element" data-file-width="641" data-file-height="717"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Modell von 1/8 eines zylindrischen Druckbeh&auml;lters mit Randbedingungen Symmetrie und Innendruckbelastung</p>
<p><span id="Utilizing_cyclic_symmetry"></span>
</p>
<h3><span class="mw-headline" id="Ausnutzung_zyklischer_Symmetrie">Ausnutzung zyklischer Symmetrie</span></h3>
<p>Eine weitere, weniger verbreitete Art der Symmetrie, die in FreeCAD FEM verf&uuml;gbar ist, ist die zyklische Symmetrie. Sie kann mit der <a href="../de/FEM_ConstraintTie.html#Cyclic_symmetry" title="FEM ConstraintTie/de">Verbindungsbeschr&auml;nkung</a> definiert werden und erm&ouml;glicht es, nur einen einzigen repr&auml;sentativen Sektor einer Struktur zu analysieren, die aus solchen kreisf&ouml;rmigen Mustern um eine Achse besteht. Dabei wird davon ausgegangen, dass auch die Randbedingungen und Lasten diese Form der Symmetrie aufweisen. Es k&ouml;nnen tangentiale Lasten aufgebracht und somit Torsionen simuliert werden. Allerdings wird bei zyklischer Symmetrie &uuml;blicherweise die <a href="../de/FEM_ConstraintCentrif.html" title="FEM ConstraintCentrif/de">Zentrifugalkraft</a> verwendet. Dieser Ansatz kann z. B. f&uuml;r Rotoren, Wellen, Turbinen, Ventilatoren und Schwungr&auml;der verwendet werden.
</p><p><span id="Geometry_partitioning"></span>
</p>
<h2><span class="mw-headline" id="Unterteilen_von_Geometrie">Unterteilen von Geometrie</span></h2>
<p><span id="Partitioning_basics"></span>
</p>
<h3><span class="mw-headline" id="Grundlagen_der_Unterteilung">Grundlagen der Unterteilung</span></h3>
<p>Die sogenannte Partitionierung ist eine Aufteilung der Geometrie in kleinere Segmente. In anderer Software wird sie h&auml;ufig f&uuml;r die Hex-Vernetzung verwendet, aber in FreeCAD kann sie auch aus anderen Gr&uuml;nden n&uuml;tzlich sein:
</p>
<ul><li>Erstellen von Unterbereichen f&uuml;r die Zuweisung von Analysefunktionen,</li>
<li>Aufteilen von Teilen in Abschnitte aus unterschiedlichen Materialien,</li>
<li>Erstellen von Bereichen f&uuml;r die <a href="../de/FEM_MeshRegion.html" title="FEM MeshRegion/de">Mesh Netzbereich</a>,</li>
<li>Steuern des Vernetzungsalgorithmus, indem er gezwungen wird, zus&auml;tzlichen Kanten zu folgen (besonders n&uuml;tzlich zur Steuerung des <a href="../de/FEM_MeshGmshFromShape.html#Mesh_Growth" title="FEM MeshGmshFromShape/de">Netz-Wachstum</a>).</li></ul>
<p><span id="Partitioning_faces_of_solids_with_sketches"></span>
</p>
<h3><span id="Unterteilen_von_Fl.C3.A4chen_von_Volumenk.C3.B6rpern_mit_Skizzen"></span><span class="mw-headline" id="Unterteilen_von_Fl&auml;chen_von_Volumenk&ouml;rpern_mit_Skizzen">Unterteilen von Fl&auml;chen von Volumenk&ouml;rpern mit Skizzen</span></h3>
<p>Die Hauptanwendung der Partitionierung ist, wenn eine Last (oder eine Randbedingung) nur auf einen ausgew&auml;hlten Bereich der Oberfl&auml;che des Teils angewendet werden soll. Der einfachste Weg, dies f&uuml;r Volumenteile zu erreichen, besteht darin, eine Skizze mit einer geeigneten Kontur auf dieser Fl&auml;che zu erstellen und das Werkzeug <a href="../de/Part_BooleanFragments.html" title="Part BooleanFragments/de">Part BoolescheBestandteile</a> zu verwenden, um die Fl&auml;che mit der Skizze zu teilen.
</p><p><span typeof="mw:File"><a href="../index.php?title=FEM_partition.JPG&amp;filetimestamp=20231228200133&amp;.html" class="mw-file-description"><img src="../File/FEM_partition.JPG" decoding="async" width="400" height="404" class="mw-file-element" data-file-width="634" data-file-height="641"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Bauteil mit Teilfl&auml;che zum Aufbringen einer Last oder Anwenden einer Randbedingung</p>
<p><span id="Partitioning_volumes_of_solids_with_datum_planes"></span>
</p>
<h3><span id="Unterteilen_von_Festk.C3.B6rpervolumina_mit_Bezugsebenen"></span><span class="mw-headline" id="Unterteilen_von_Festk&ouml;rpervolumina_mit_Bezugsebenen">Unterteilen von Festk&ouml;rpervolumina mit Bezugsebenen</span></h3>
<p>Ein weiterer Grund f&uuml;r die Partitionierung ist, wenn mehrere Materialien auf ein einzelnes Teil aufgebracht werden m&uuml;ssen (ohne mehrere miteinander verbundene Teile verwenden zu m&uuml;ssen). In diesem Fall kann die Partitionierung mithilfe einer <a href="../de/PartDesign_Plane.html" title="PartDesign Plane/de">Bezugsebene</a> und dem Werkzeug <a href="../de/Part_BooleanFragments.html" title="Part BooleanFragments/de">Boolesche Bestandteile</a> im Modus &bdquo;Compsolid&rdquo; durchgef&uuml;hrt werden.
</p><p><span id="Partitioning_surface_geometries_with_sketches"></span>
</p>
<h3><span id="Oberfl.C3.A4chengeometrien_mit_Skizzen_unterteilen"></span><span class="mw-headline" id="Oberfl&auml;chengeometrien_mit_Skizzen_unterteilen">Oberfl&auml;chengeometrien mit Skizzen unterteilen</span></h3>
<p>Bei Oberfl&auml;chengeometrien (Schalen) l&auml;sst sich eine skizzenbasierte Partition am einfachsten mit dem Werkzeug <a href="../de/Part_BooleanFragments.html" title="Part BooleanFragments/de"> Boolesche Bestandteile</a> erstellen (wie bei den Partitionen auf den Fl&auml;chen von Volumenk&ouml;rpern). Wie jedoch <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=96029#p820241">hier</a> erl&auml;utert, funktioniert dies m&ouml;glicherweise nicht ordnungsgem&auml;&szlig;, wenn die Erstellung von Netzgruppen in den <a href="../de/FEM_Preferences.html#General" title="FEM Preferences/de">FEM-Einstellungen</a> aktiviert ist. In diesem Fall sollte der folgende Ansatz verwendet werden:
</p>
<ol><li>Eine Fl&auml;che f&uuml;r eine Seite, z. B. mit dem Werkzeug <a href="../de/Part_MakeFace.html" title="Part MakeFace/de">Part Fl&auml;cheErstellen</a> (z. B. eine quadratische Platte mit einem kreisf&ouml;rmigen Loch) erstellen.</li>
<li>Erstellen Sie auf die gleiche Weise eine Fl&auml;che f&uuml;r die andere Seite (z. B. eine kreisf&ouml;rmige Fl&auml;che, die das Loch in der quadratischen Platte ausf&uuml;llt).</li>
<li>Das Werkzeug <a href="../de/Part_Builder.html" title="Part Builder/de">Part Formgenerator</a> mit dem Modus <i>Shell from faces</i> (H&uuml;lle aus Fl&auml;chen) und deaktiviertem Kontrollk&auml;stchen <i>Refine shape</i> (Form verfeinern) auf die zuvor erstellten Fl&auml;chen anwenden.</li></ol>
<p><span typeof="mw:File"><a href="../index.php?title=FEM_shell_partition.JPG&amp;filetimestamp=20250701143021&amp;.html" class="mw-file-description"><img src="../File/FEM_shell_partition.JPG" decoding="async" width="400" height="249" class="mw-file-element" data-file-width="845" data-file-height="526"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Quadratische Platte mit kreisf&ouml;rmiger Unterteilung</p>
<p><span id="Partitioning_faces_of_solids_with_datum_planes"></span>
</p>
<h3><span id="Unterteilen_von_Fl.C3.A4chen_von_Volumenk.C3.B6rpern_mit_Bezugsebenen"></span><span class="mw-headline" id="Unterteilen_von_Fl&auml;chen_von_Volumenk&ouml;rpern_mit_Bezugsebenen">Unterteilen von Fl&auml;chen von Volumenk&ouml;rpern mit Bezugsebenen</span></h3>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Partitioning only the selected faces of a solid using datum planes instead of sketches without splitting the whole volume is also tricky. One possible approach is to:
</p>
<ol><li><a href="../Draft_Downgrade.html" title="Draft Downgrade">Downgrade</a> the body to faces.</li>
<li>Select that one face and datum plane and use the <a href="../Part_SliceApart.html" title="Part SliceApart">Slice apart</a> tool.</li>
<li>Delete the Exploded Slice container without deleting its contents.</li>
<li>Select all faces and slices and <a href="../Draft_Upgrade.html" title="Draft Upgrade">Upgrade</a> them to Shell.</li>
<li><a href="../Draft_Upgrade.html" title="Draft Upgrade">Upgrade</a> the Shell to Solid or use the <a href="../Part_MakeSolid.html" title="Part MakeSolid">Convert to solid</a> tool.</li></ol>
<p>Another way is to:
</p>
<ol><li>Create a <a href="../PartDesign_SubShapeBinder.html" title="PartDesign SubShapeBinder">subshapebinder</a> of the face to be partitioned.</li>
<li>Split the subshapebinder with the datum plane using the <a href="../Part_SliceApart.html" title="Part SliceApart">Slice apart</a> tool.</li>
<li>Create a new <a href="../PartDesign_Body.html" title="PartDesign Body">Body</a> (to avoid cyclic dependency).</li>
<li>Create a new subshapebinder from the edges obtained from the intersection of the previous subshapebinder and datum plane.</li>
<li>Select the original Body and the new subshapebinder and use the <a href="../Part_BooleanFragments.html" title="Part BooleanFragments">Boolean fragments</a> tool.</li></ol>
<p>Other ideas can be found in <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=98528">this forum thread</a> but they are more case-specific.
</p>
</div>
<p><span typeof="mw:File"><a href="../index.php?title=FEM_split_face_solid.JPG&amp;filetimestamp=20250723164225&amp;.html" class="mw-file-description"><img src="../File/FEM_split_face_solid.JPG" decoding="async" width="400" height="345" class="mw-file-element" data-file-width="598" data-file-height="516"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Zylindrische Fl&auml;che einer Bohrung, die durch eine Ebene unterteilt ist, um eine 180&deg;-Belastung durch einen Stift auszu&uuml;ben</p>
<p><span id="Assembly_geometries"></span>
</p>
<h2><span class="mw-headline" id="Geometrie_aus_Baugruppen">Geometrie aus Baugruppen</span></h2>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>One of the current major limitations of the FEM workbench is that multiple meshes are not supported. In practice, this means that one cannot mesh each part of the assembly individually and then connect the parts with proper constraints for the analysis. Instead, it's necessary to create a single object containing all the parts of the assembly and mesh it. There are several different options here, all relying on <a href="../Part_Workbench.html#Boolean_toolbar" title="Part Workbench">Part boolean tools</a>. The choice depends on the desired effect - whether the individual parts/volumes and their boundaries should be selectable (e.g. for material assignments or definitions of boundary conditions acting on internal faces) or not:
</p>
<ul><li><a href="../Part_Fuse.html" title="Part Fuse">Part Fuse</a> - merges the parts, making it impossible to select them individually e.g. for material definitions,</li>
<li><a href="../Part_Compound.html" title="Part Compound">Part Compound</a> - creates a compound object, making it possible to select individual parts,</li>
<li><a href="../Part_JoinConnect.html" title="Part JoinConnect">Part JoinConnect</a> - works like Part Fuse, merges the parts, making it impossible to select them individually,</li>
<li><a href="../Part_BooleanFragments.html" title="Part BooleanFragments">Part BooleanFragments</a> - works like Part Compound, making it possible to select individual parts.</li></ul>
<p>It's important to mention that if the parts are exactly touching, a continuous mesh will be created on the boolean object and no constraints will be needed for the simulation (unless Part Compound is used and nodes aren't coincident or <a href="../FEM_MeshGmshFromShape.html#Properties" title="FEM MeshGmshFromShape">Gmsh's <i>Coherence Mesh</i> property</a> is set to <code>false</code>). If there's even a small gap (or an intersection within a Part Compound) between the parts, the mesh won't be continuous and constraints like <a href="../FEM_ConstraintTie.html" title="FEM ConstraintTie">tie</a> or <a href="../FEM_ConstraintContact.html" title="FEM ConstraintContact">contact</a> will be needed. Running a frequency analysis is a good way to reveal if the mesh is continuous or not - if the parts are not connected, the first mode shapes with deformation visualized using <a href="../FEM_PostFilterWarp.html" title="FEM PostFilterWarp">Warp filter</a> will show separation - the parts will "fly away".
</p>
</div>
<p><span typeof="mw:File"><a href="../index.php?title=FEM_modal_separation.JPG&amp;filetimestamp=20231228205154&amp;.html" class="mw-file-description"><img src="../File/FEM_modal_separation.JPG" decoding="async" width="400" height="484" class="mw-file-element" data-file-width="597" data-file-height="722"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Die erste Modusform einer Frequenzanalyse, visualisiert mit dem Warp-Filter &ndash; zwei W&uuml;rfel mit einem kleinen Anfangsabstand wurden analysiert.</p>
<p>Es wird oft empfohlen, boolesche Fragmente im Compsolid-Modus zu verwenden und dann einen <a href="../de/Part_CompoundFilter.html" title="Part CompoundFilter/de">Verbundfilter</a> darauf anzuwenden, insbesondere bei der Analyse von Baugruppen aus mehreren Materialien und von Volumenk&ouml;rpern, die ohne Ausschnitte in andere Volumenk&ouml;rper eingebettet sind (wie im Tutorium <a href="../de/FEM_Shear_of_a_Composite_Block.html" title="FEM Shear of a Composite Block/de">FEM Scherung eines Verbundwerkstoffblocks</a>). Wie auf der Registerkarte <i>Shape Content</i> des Werkzeugs <a href="../de/Part_CheckGeometry.html" title="Part CheckGeometry/de">Geometrie &uuml;berpr&uuml;fen</a> zu sehen ist (es ist wichtig, dieses Werkzeug in solchen F&auml;llen im Zweifelsfall zu verwenden), entfernt der Verbundfilter den Verbund und l&auml;sst nur den Compsolid &uuml;brig, der aus mehreren Volumenk&ouml;rpern besteht, die durch ihre Fl&auml;chen miteinander verbunden sind. Dieser Ansatz wird empfohlen, da ein Verbund lediglich ein Container mit topologisch nicht verbundenen Formen ist und alle Arten von Formen enthalten kann, sodass der Mesher ihn m&ouml;glicherweise nicht richtig verwenden kann (nur die Volumenk&ouml;rper nach Wunsch des Benutzers vernetzen). Operationen wie boolesche Fragmente erzeugen immer Verb&uuml;nde, und der Verbundfilter wird verwendet, um die relevante Form aus dem Verbund zu extrahieren.
</p><p>Behelfsl&ouml;sungen f&uuml;r Fehler wie:
</p>
<div class="mw-highlight mw-highlight-lang-text mw-content-ltr" dir="ltr"><pre><span></span>ERROR: femelement_table&nbsp;!= count_femelements
Error in get_femelement_sets -- &gt; femelements_count_ok() failed!
</pre></div>
<p>und:
</p>
<div class="mw-highlight mw-highlight-lang-text mw-content-ltr" dir="ltr"><pre><span></span>*ERROR in calinput: no material was assigned
to element &hellip;
</pre></div>
<p>inklusive:
</p>
<ul><li>Das letzte Material ohne zugewiesenen Festk&ouml;rper belassen (es wird automatisch allen Festk&ouml;rpern zugewiesen, die nicht in anderen Materialdefinitionen referenziert sind).</li>
<li>Netgen anstelle von Gmsh zum Erstellen des Netzes verwenden.</li>
<li>Die Teile etwas voneinander trennen und Verbindungsbeschr&auml;nkungen anwenden, um sie in der Simulation zu verbinden.</li></ul>
<p>Solche Fehler werden durch fehlende oder sich &uuml;berschneidende Materialdefinitionen in einigen Elementen verursacht. <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=97120&amp;start=50#p829295">Dieser Forumsbeitrag</a> enth&auml;lt Referenzen, die dies anschaulich veranschaulichen, und der gesamte Faden kann auch bei &auml;hnlichen Problemen hilfreich sein.
</p><p><span id="Selection_of_interior_entities"></span>
</p>
<h3><span class="mw-headline" id="Auswahl_von_Innenraumobjekten">Auswahl von Innenraumobjekten</span></h3>
<p>Die Auswahl interner Bereiche (z. B. Fl&auml;chen/Volumen) kann schwierig sein. Dies kann f&uuml;r die Anwendung verschiedener Materialien, K&ouml;rperlasten oder Randbedingungen (insbesondere bei thermischen und elektromagnetischen Analysen) erforderlich sein. Es gibt mehrere M&ouml;glichkeiten:
</p>
<ul><li>Die <a href="../de/Std_ToggleClipPlane.html" title="Std ToggleClipPlane/de">Schnittebene</a> f&uuml;r die Dauer der Auswahl aktivieren und interne Fl&auml;chen ausw&auml;hlen.</li>
<li>Das boolesche Objekt ausblenden, nur eines der Teile anzeigen, auf die es angewendet wurde, und es ausw&auml;hlen.</li>
<li><a href="../de/Std_ToggleTransparency.html" title="Std ToggleTransparency/de">Transparenz aktivieren</a> und die Verwendung der <a href="../de/Selection_View.html" title="Selection View/de">Auswahlansicht</a> mit aktivierter Option <i>Ausgew&auml;hlte Objektliste</i>, wie <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=96984#p826693">hier</a> beschrieben,</li>
<li>ein anderes, externes Objekt ausw&auml;hlen und die Eigenschaft <i>Referenzen</i> auf der Registerkarte <i>Daten</i> eines bestimmten Analyseelements bearbeiten (erfordert die manuelle Angabe der Nummer des geometrischen Objekts).</li></ul>
<p><span id="Meshing_basics"></span>
</p>
<h2><span class="mw-headline" id="Grundlagen_der_Vernetzung">Grundlagen der Vernetzung</span></h2>
<p><span id="Choosing_element_size"></span>
</p>
<h3><span id="Auswahl_der_Elementgr.C3.B6.C3.9Fe"></span><span class="mw-headline" id="Auswahl_der_Elementgr&ouml;&szlig;e">Auswahl der Elementgr&ouml;&szlig;e</span></h3>
<p>Ein zu grobes Netz ist eine der h&auml;ufigsten Ursachen f&uuml;r Ungenauigkeiten und andere Probleme bei der FEM. Oft liegt dies teilweise an den Einstellungen des automatischen Netzgenerators &ndash; dieser erzeugt in der Regel sehr grobe, ungeeignete Netze, wenn die Elementgr&ouml;&szlig;e nicht manuell festgelegt, sondern auf einem Standardwert belassen wird. Man sollte immer die ungef&auml;hren Abmessungen des Teils kennen, insbesondere die Gr&ouml;&szlig;e des kleinsten relevanten Merkmals (das Werkzeug <a href="../de/Std_Measure.html" title="Std Measure/de">Std Messen</a> kann dazu verwendet werden), und auf dieser Grundlage die richtige maximale Elementgr&ouml;&szlig;e festlegen. Es gibt auch eine Einstellung f&uuml;r die minimale Elementgr&ouml;&szlig;e, die die Erstellung zu kleiner Elemente um kleine geometrische Merkmale herum verhindern kann, was zu unn&ouml;tig dichten Netzen f&uuml;hren kann (und manchmal sogar zum Absturz oder Einfrieren von FreeCAD beim Versuch, solche Netze zu generieren). Im Allgemeinen ist es besser, mit einem gr&ouml;beren Netz zu beginnen (dessen Erstellung weniger Zeit in Anspruch nimmt), sich anzusehen, wie es aussieht (hierf&uuml;r ist etwas Erfahrung erforderlich), und es bei Bedarf zu verfeinern. Oft ist es sinnvoll, ein dichtes Netz nur um die Bereiche von Interesse (Stellen mit gro&szlig;en Spannungsgradienten/Konzentrationen &ndash; Kerben) herum zu verwenden und relativ grobe Netze au&szlig;erhalb dieser Bereiche. Auf diese Weise kann die Anzahl der Elemente erheblich reduziert werden, was zu k&uuml;rzeren L&ouml;sungszeiten f&uuml;hrt. Die lokale Netzverfeinerung wird mit <a href="../de/FEM_MeshRegion.html" title="FEM MeshRegion/de">FEM NetzBereich</a> definiert.
</p><p><span typeof="mw:File"><a href="../index.php?title=FEM_default_mesh.PNG&amp;filetimestamp=20231228215838&amp;.html" class="mw-file-description"><img src="../File/FEM_default_mesh.PNG" decoding="async" width="400" height="238" class="mw-file-element" data-file-width="829" data-file-height="493"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Standardwerte, zu grobes Netz</p>
<p><span typeof="mw:File"><a href="../index.php?title=FEM_globally_refined_mesh.PNG&amp;filetimestamp=20231228220052&amp;.html" class="mw-file-description"><img src="../File/FEM_globally_refined_mesh.PNG" decoding="async" width="400" height="239" class="mw-file-element" data-file-width="826" data-file-height="493"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Global verfeinertes Netz</p>
<p><span typeof="mw:File"><a href="../index.php?title=FEM_locally_refined_mesh.PNG&amp;filetimestamp=20231228220149&amp;.html" class="mw-file-description"><img src="../File/FEM_locally_refined_mesh.PNG" decoding="async" width="400" height="239" class="mw-file-element" data-file-width="838" data-file-height="501"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Lokal verfeinertes Netz</p>
<p><span id="Choosing_element_type"></span>
</p>
<h3><span class="mw-headline" id="Auswahl_des_Elementtyps">Auswahl des Elementtyps</span></h3>
<p>Die Wahl des Elementtyps ist nicht einfach und h&auml;ngt von vielen Faktoren ab, aber die allgemeine Regel lautet, dass hexaedrische und quadrilaterale Elemente gegen&uuml;ber tetraedrischen und dreieckigen Elementen vorzuziehen sind. Komplexe Geometrien k&ouml;nnen jedoch nicht mit hexaedrischen Elementen vernetzt werden, und FreeCAD kann diese nicht ordnungsgem&auml;&szlig; generieren (nur unter Verwendung des Unterteilungsalgorithmus des Gmsh-Mesher, dessen Ergebnisse jedoch nicht den Erwartungen an ein hexagonales Netz entsprechen). Quad- oder quad-dominierte Netze k&ouml;nnen normalerweise auf Oberfl&auml;chen generiert werden &ndash; siehe <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=20351">dieser Forenthread</a>). Hexaedrische Elemente k&ouml;nnen aus externen Netzgeneratoren importiert werden, wie z. B. <a rel="nofollow" class="external text" href="https://gmsh.info">Gmsh</a> und im Arbeitsbereich FEM verwendet, wie in <a rel="nofollow" class="external text" href="https://www.youtube.com/watch?v=vylt24G7qj4&amp;t=932s">diesem Video</a> gezeigt.
</p><p><span id="Choosing_element_order"></span>
</p>
<h3><span class="mw-headline" id="Auswahl_der_Elementreihenfolge">Auswahl der Elementreihenfolge</span></h3>
<p>Die Wahl der Elementordnung (erste oder zweite Ordnung) h&auml;ngt von den Analysebedingungen ab, in den meisten F&auml;llen werden jedoch Elemente zweiter Ordnung bevorzugt. Dies gilt insbesondere f&uuml;r dreieckige und tetraedrische Elemente &ndash; ihre linearen Versionen erster Ordnung werden normalerweise nicht f&uuml;r den regul&auml;ren Gebrauch empfohlen und sollten nur als F&uuml;llelemente in Bereichen von geringer Bedeutung verwendet werden. Da FreeCAD jedoch keine hexaedrischen Elemente korrekt generieren kann, k&ouml;nnen in einigen F&auml;llen lineare Tetraeder verwendet werden, wenn die Netze dicht genug sind. Insbesondere bei der Durchf&uuml;hrung von Analysen mit <a href="../de/FEM_ConstraintContact.html" title="FEM ConstraintContact/de">Kontakt-Randbedingungen</a>.
</p><p><span id="Negative_Jacobians"></span>
</p>
<h2><span class="mw-headline" id="Negative_Jacobi-Matrizen">Negative Jacobi-Matrizen</span></h2>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>If the above rules are followed (especially regarding geometry validity, defeaturing and element size selection), the mesh should be generated correctly. However, in some cases, the geometry can't be simplified too much, or the modeling procedure is appropriate but leads to small edges and faces anyway. Then meshing with second-order elements may fail due to negative Jacobians. The reason is that meshers have to follow the CAD model and put the mid-side nodes of second-order elements on the geometry. With more complex shapes, it may lead to elements being stretched so much that they become inverted. Jacobian is one of the most common mesh quality measures. It represents the element's deviation from the ideal shape. It becomes negative when the element turns inside out (becomes inverted) either due to large deformation during the analysis (not considered here) or because of the aforementioned meshing issues. Negative Jacobians in FreeCAD FEM might be reported by Gmsh or by CalculiX. Their locations in the mesh are highlighted when CalculiX analyses are submitted using the <a href="../FEM_SolverRun.html" title="FEM SolverRun">Run solver calculations</a> button. The following tips can help eliminate them:
</p>
<ul><li>set the <i>Second Order Linear</i> property of the <a href="../FEM_MeshGmshFromShape.html" title="FEM MeshGmshFromShape">FEMMeshGmsh</a> object to <i>true</i> - this results in the mid-side nodes of second-order elements being just added in the middle of straight (initially) first-order element edges, without snapping them to the geometry and resolves the issue in most cases,</li>
<li>use Netgen instead of Gmsh - Netgen is known to be less prone to negative Jacobian issues but also doesn't report them so the user may find out only when submitting the analysis,</li>
<li>further reduce the element size,</li>
<li>export the geometry, try meshing it in Gmsh or Netgen (NGSolve) GUI or other standalone mesher (like Salome_Meca) - those tools have additional features that can help get rid of negative Jacobians (for example, Gmsh has so-called "High-order tools"),</li>
<li>use first-order elements - should be done only as a last resort since first-order tetrahedrons are known for their inaccuracy.</li></ul>
</div>
<p>Unabh&auml;ngig von diesen Tipps ist es wichtig, noch einmal zu betonen, dass negative Jacobimatrizen in der Regel auf unordentliche Modellierungsans&auml;tze und mangelnde Vorbereitung der Geometrie f&uuml;r die Analyse zur&uuml;ckzuf&uuml;hren sind (besonders h&auml;ufig bei STEP-Modellen, die von verschiedenen Webseiten heruntergeladen wurden). Selbst wenn in solchen F&auml;llen letztendlich ein Netz generiert wird, sind die Ergebnisse wahrscheinlich von schlechter Qualit&auml;t (denke an die im ersten Absatz erw&auml;hnte GIGO-Regel). Daher sollte die Bereinigung und Vorbereitung der Geometrie f&uuml;r die FEM immer Vorrang haben.
</p><p><span id="Mesh_convergence_studies"></span>
</p>
<h2><span class="mw-headline" id="Studien_zur_Netzkonvergenz">Studien zur Netzkonvergenz</span></h2>
<p>Bei allen anspruchsvollen Projekten, die genaue Ergebnisse erfordern, werden Studien zur Netzkonvergenz empfohlen. Der Grund daf&uuml;r ist, dass sich die Ergebnisse stark ver&auml;ndern k&ouml;nnen und sich den korrekten Werten ann&auml;hern, wenn das Netz verfeinert wird. Es sollte folgender Ansatz verwendet werden:
</p>
<ol><li>Nachdem man die ersten Ergebnisse erhalten und notiert hat (in der Regel die maximale von-Mises-Spannung, die von-Mises-Spannung an einer bestimmten Stelle und die maximale Verschiebung), verfeinert man das Netz (global oder besser lokal &ndash; mit <a href="../de/FEM_MeshRegion.html" title="FEM MeshRegion/de">FEM NetzBereich</a>) und f&uuml;hrt die Simulation erneut durch.</li>
<li>Die Ergebnisse &uuml;berpr&uuml;fen und die neuen Werte notieren. Wenn diese erheblich von den urspr&uuml;nglichen Ergebnissen abweichen, das Netz weiter verfeinern und die Analyse erneut durchf&uuml;hren.</li>
<li>Wiederholen Sie den Vorgang, wenn sich die Ergebnisse mit der Verfeinerung des Gitters noch immer erheblich &auml;ndern (in der Regel zunehmen).</li></ol>
<p>In der Regel ist es hilfreich, ein Diagramm mit einem bestimmten Ergebnis im Vergleich zur Gitterdichte zu erstellen. Auf diese Weise l&auml;sst sich leichter erkennen, wann die Ergebnisse zu konvergieren beginnen. Die akzeptable Abweichung der Ergebnisse zwischen zwei Durchl&auml;ufen liegt in der Regel bei einigen Prozent (z. B. unter 5&nbsp;%).
</p><p>In einigen F&auml;llen kann es vorkommen, dass die maximale Spannung unabh&auml;ngig von der Dichte des Netzes unbegrenzt ansteigt. Ein solcher nicht physikalischer Effekt wird als Spannungssingularit&auml;t bezeichnet. Er kann aus folgenden Gr&uuml;nden auftreten:
</p>
<ul><li>konzentrierte Kr&auml;fte, die auf Volumen- und Schalenmodelle ausge&uuml;bt werden,</li>
<li>Randbedingungen, die auf Punkte (einzelne Knoten) angewendet werden,</li>
<li>scharfe Ecken,</li>
<li>Kontakt an einer Ecke.</li></ul>
<p>Typische M&ouml;glichkeiten zum Umgang mit Spannungssingularit&auml;ten sind:
</p>
<ul><li>Aufbringen von Lasten und Randbedingungen auf kleine Fl&auml;chen statt auf Punkte &ndash; siehe Abschnitt &uuml;ber Partitionierung oben,</li>
<li>Hinzuf&uuml;gen kleiner Verrundungen an scharfen Ecken (eine Ausnahme von der Regel, kleine Verrundungen bei der Vereinfachung der Geometrie f&uuml;r FEM wegzulassen),</li>
<li>Einbeziehung der Plastizit&auml;t in das Materialverhalten, um eine Spannungsumverteilung zu erm&ouml;glichen und die Spannungen auf Werte zu begrenzen, die durch die Plastizit&auml;tsdefinition zugelassen sind, unter Beachtung des richtigen Flie&szlig;grades (plastische Verformung),</li>
<li>Ignorieren von Singularit&auml;ten und, wenn m&ouml;glich, Ablesen der Spannungen au&szlig;erhalb dieser Singularit&auml;ten (basierend auf dem St.-Venant-Prinzip).</li></ul>
<p><span typeof="mw:File"><a href="../index.php?title=FEM_mesh_convergence.PNG&amp;filetimestamp=20240105102927&amp;.html" class="mw-file-description"><img src="../File/FEM_mesh_convergence.PNG" decoding="async" width="400" height="332" class="mw-file-element" data-file-width="850" data-file-height="706"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Typische Konvergenzdiagramme f&uuml;r Gitter:<br>
- Die Verschiebung (<b>gr&uuml;ne Kurve</b>) konvergiert schnell,<br>
- Die maximale Spannung an einer Kerbe wie einem Loch (<b>blaue Kurve</b>) erfordert mehr Iterationen der Netzverfeinerung, um zu konvergieren.<br>
- Die maximale Spannung an einer scharfen Ecke mit einer festen Randbedingung (<b>rote Kurve</b>) konvergiert &uuml;berhaupt nicht. Es tritt eine Spannungssingularit&auml;t auf, sodass eine kleine Verrundung hinzugef&uuml;gt und die Verbindung realistischer und flexibler modelliert werden m&uuml;sste, um dieses Verhalten zu vermeiden.<br></p>
<p><br>
</p>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><span typeof="mw:File"><a href="../index.php?title=Workbench_FEM.svg&amp;filetimestamp=20240405093343&amp;.html" class="mw-file-description"><img src="../File/Workbench_FEM.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../de/FEM_Workbench.html" title="FEM Workbench/de">FEM</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><a href="../de/FEM_Analysis.html" title="FEM Analysis/de">New Analysis</a></li></ul>
<ul><li><b>Materials:</b> <a href="../de/FEM_MaterialSolid.html" title="FEM MaterialSolid/de">Solid Material</a>, <a href="../de/FEM_MaterialFluid.html" title="FEM MaterialFluid/de">Fluid Material</a>, <a href="../de/FEM_MaterialMechanicalNonlinear.html" title="FEM MaterialMechanicalNonlinear/de">Non-Linear Mechanical Material</a>, <a href="../de/FEM_MaterialReinforced.html" title="FEM MaterialReinforced/de">Reinforced Material (Concrete)</a>; <a href="../de/FEM_MaterialEditor.html" title="FEM MaterialEditor/de">Material Editor</a></li></ul>
<ul><li><b>Element Geometry:</b> <a href="../de/FEM_ElementGeometry1D.html" title="FEM ElementGeometry1D/de">Beam Cross Section</a>, <a href="../de/FEM_ElementRotation1D.html" title="FEM ElementRotation1D/de">Beam Rotation</a>, <a href="../de/FEM_ElementGeometry2D.html" title="FEM ElementGeometry2D/de">Shell Plate Thickness</a>, <a href="../de/FEM_ElementFluid1D.html" title="FEM ElementFluid1D/de">Fluid Section for 1D Flow</a></li></ul>
<hr>
<ul><li><b>Electromagnetic Boundary Conditions:</b> <a href="../de/FEM_ConstraintElectrostaticPotential.html" title="FEM ConstraintElectrostaticPotential/de">Electrostatic Potential Boundary Condition</a>, <a href="../de/FEM_ConstraintCurrentDensity.html" title="FEM ConstraintCurrentDensity/de">Current Density Boundary Condition</a>, <a href="../de/FEM_ConstraintMagnetization.html" title="FEM ConstraintMagnetization/de">Magnetization Boundary Condition</a>, <a href="../de/FEM_ElectricChargeDensity.html" title="FEM ElectricChargeDensity/de">Electric Charge Density</a></li></ul>
<ul><li><b>Fluid Boundary Conditions:</b> <a href="../de/FEM_ConstraintInitialFlowVelocity.html" title="FEM ConstraintInitialFlowVelocity/de">Initial Flow Velocity Condition</a>, <a href="../de/FEM_ConstraintInitialPressure.html" title="FEM ConstraintInitialPressure/de">Initial Pressure Condition</a>, <a href="../de/FEM_ConstraintFlowVelocity.html" title="FEM ConstraintFlowVelocity/de">Flow Velocity Boundary Condition</a></li></ul>
<ul><li><b>Geometrical Analysis Features:</b> <a href="../de/FEM_ConstraintPlaneRotation.html" title="FEM ConstraintPlaneRotation/de">Plane Multi-Point Constraint</a>, <a href="../de/FEM_ConstraintSectionPrint.html" title="FEM ConstraintSectionPrint/de">Section Print Feature</a>, <a href="../de/FEM_ConstraintTransform.html" title="FEM ConstraintTransform/de">Local Coordinate System</a></li></ul>
<ul><li><b>Mechanical Boundary Conditions and Loads:</b> <a href="../de/FEM_ConstraintFixed.html" title="FEM ConstraintFixed/de">Fixed Boundary Condition</a>, <a href="../de/FEM_ConstraintRigidBody.html" title="FEM ConstraintRigidBody/de">Rigid Body Constraint</a>, <a href="../de/FEM_ConstraintDisplacement.html" title="FEM ConstraintDisplacement/de">Displacement Boundary Condition</a>, <a href="../de/FEM_ConstraintContact.html" title="FEM ConstraintContact/de">Contact Constraint</a>, <a href="../de/FEM_ConstraintTie.html" title="FEM ConstraintTie/de">Tie Constraint</a>, <a href="../de/FEM_ConstraintSpring.html" title="FEM ConstraintSpring/de">Spring Boundary Condition</a>, <a href="../de/FEM_ConstraintForce.html" title="FEM ConstraintForce/de">Force Load</a>, <a href="../de/FEM_ConstraintPressure.html" title="FEM ConstraintPressure/de">Pressure Load</a>, <a href="../de/FEM_ConstraintCentrif.html" title="FEM ConstraintCentrif/de">Centrifugal Load</a>, <a href="../de/FEM_ConstraintSelfWeight.html" title="FEM ConstraintSelfWeight/de">Gravity Load</a></li></ul>
<ul><li><b>Thermal Boundary Conditions and Loads:</b> <a href="../de/FEM_ConstraintInitialTemperature.html" title="FEM ConstraintInitialTemperature/de">Initial Temperature</a>, <a href="../de/FEM_ConstraintHeatflux.html" title="FEM ConstraintHeatflux/de">Heat Flux Load</a>, <a href="../de/FEM_ConstraintTemperature.html" title="FEM ConstraintTemperature/de">Temperature Boundary Condition</a>, <a href="../de/FEM_ConstraintBodyHeatSource.html" title="FEM ConstraintBodyHeatSource/de">Body Heat Source</a></li></ul>
<ul><li><b>Overwrite Constants:</b> <a href="../de/FEM_ConstantVacuumPermittivity.html" title="FEM ConstantVacuumPermittivity/de">Constant Vacuum Permittivity</a></li></ul>
<hr>
<ul><li><b>Mesh:</b> <a href="../de/FEM_MeshNetgenFromShape.html" title="FEM MeshNetgenFromShape/de">Mesh From Shape by Netgen</a>, <a href="../de/FEM_MeshGmshFromShape.html" title="FEM MeshGmshFromShape/de">Mesh From Shape by Gmsh</a>, <a href="../de/FEM_MeshBoundaryLayer.html" title="FEM MeshBoundaryLayer/de">Mesh Boundary Layer</a>, <a href="../de/FEM_MeshRegion.html" title="FEM MeshRegion/de">Mesh Refinement</a>, <a href="../de/FEM_MeshGroup.html" title="FEM MeshGroup/de">Mesh Group</a>, <a href="../de/FEM_CreateElementsSet.html" title="FEM CreateElementsSet/de">Erase Elements</a>, <a href="../de/FEM_FemMesh2Mesh.html" title="FEM FemMesh2Mesh/de">FEM Mesh to Mesh</a></li></ul>
<ul><li><b>Solve:</b> <a href="../de/FEM_SolverCalculixCcxtools.html" title="FEM SolverCalculixCcxtools/de">Solver CalculiX</a>, <a href="../de/FEM_SolverElmer.html" title="FEM SolverElmer/de">Solver Elmer</a>, <a href="../de/FEM_SolverMystran.html" title="FEM SolverMystran/de">Solver Mystran</a>, <a href="../de/FEM_SolverZ88.html" title="FEM SolverZ88/de">Solver Z88</a>; <b>Mechanical Equations:</b> <a href="../de/FEM_EquationElasticity.html" title="FEM EquationElasticity/de">Elasticity Equation</a>, <a href="../de/FEM_EquationDeformation.html" title="FEM EquationDeformation/de">Deformation Equation</a>;  <b>Electromagnetic Equations:</b> <a href="../de/FEM_EquationElectrostatic.html" title="FEM EquationElectrostatic/de">Electrostatic Equation</a>, <a href="../de/FEM_EquationElectricforce.html" title="FEM EquationElectricforce/de">Electricforce Equation</a>, <a href="../de/FEM_EquationMagnetodynamic.html" title="FEM EquationMagnetodynamic/de">Magnetodynamic Equation</a>, <a href="../de/FEM_EquationMagnetodynamic2D.html" title="FEM EquationMagnetodynamic2D/de">Magnetodynamic 2D Equation</a>, <a href="../de/FEM_EquationStaticCurrent.html" title="FEM EquationStaticCurrent/de">Static Current Equation</a>; <a href="../de/FEM_EquationFlow.html" title="FEM EquationFlow/de">Flow Equation</a>, <a href="../de/FEM_EquationFlux.html" title="FEM EquationFlux/de">Flux Equation</a>, <a href="../de/FEM_EquationHeat.html" title="FEM EquationHeat/de">Heat Equation</a>, <a href="../de/FEM_SolverControl.html" title="FEM SolverControl/de">Solver Job Control</a>, <a href="../de/FEM_SolverRun.html" title="FEM SolverRun/de">Run Solver</a></li></ul>
<ul><li><b>Results:</b> <a href="../de/FEM_ResultsPurge.html" title="FEM ResultsPurge/de">Purge Results</a>, <a href="../de/FEM_ResultShow.html" title="FEM ResultShow/de">Show Result</a>, <a href="../de/FEM_PostApplyChanges.html" title="FEM PostApplyChanges/de">Apply Changes to Pipeline</a>, <a href="../de/FEM_PostPipelineFromResult.html" title="FEM PostPipelineFromResult/de">Post Pipeline From Result</a>, <a href="../de/FEM_PostBranchFilter.html" title="FEM PostBranchFilter/de">Pipeline Branch</a>, <a href="../de/FEM_PostFilterWarp.html" title="FEM PostFilterWarp/de">Warp Filter</a>, <a href="../de/FEM_PostFilterClipScalar.html" title="FEM PostFilterClipScalar/de">Scalar Clip Filter</a>, <a href="../de/FEM_PostFilterCutFunction.html" title="FEM PostFilterCutFunction/de">Function Cut Filter</a>, <a href="../de/FEM_PostFilterClipRegion.html" title="FEM PostFilterClipRegion/de">Region Clip Filter</a>, <a href="../de/FEM_PostFilterContours.html" title="FEM PostFilterContours/de">Contours Filter</a>, <a href="../de/FEM_PostFilterGlyph.html" title="FEM PostFilterGlyph/de">Glyph Filter</a>, <a href="../de/FEM_PostFilterDataAlongLine.html" title="FEM PostFilterDataAlongLine/de">Line Clip Filter</a>, <a href="../de/FEM_PostFilterLinearizedStresses.html" title="FEM PostFilterLinearizedStresses/de">Stress Linearization Plot</a>, <a href="../de/FEM_PostFilterDataAtPoint.html" title="FEM PostFilterDataAtPoint/de">Data at Point Clip Filter</a>, <a href="../de/FEM_PostFilterCalculator.html" title="FEM PostFilterCalculator/de">Calculator Filter</a>; <b>Filter Functions:</b> <a href="../de/FEM_PostCreateFunctionPlane.html" title="FEM PostCreateFunctionPlane/de">Plane</a>, <a href="../de/FEM_PostCreateFunctionSphere.html" title="FEM PostCreateFunctionSphere/de">Sphere</a>, <a href="../de/FEM_PostCreateFunctionCylinder.html" title="FEM PostCreateFunctionCylinder/de">Cylinder</a>, <a href="../de/FEM_PostCreateFunctionBox.html" title="FEM PostCreateFunctionBox/de">Box</a>; <b>Data Visualizations:</b> <a href="../de/FEM_PostLineplot.html" title="FEM PostLineplot/de">Create Lineplot</a>, <a href="../de/FEM_PostHistogram.html" title="FEM PostHistogram/de">Create Histogram</a>, <a href="../de/FEM_PostSpreadsheet.html" title="FEM PostSpreadsheet/de">Create Table</a></li></ul>
<ul><li><b>Utilities:</b> <a href="../de/FEM_ClippingPlaneAdd.html" title="FEM ClippingPlaneAdd/de">Clipping Plane on Face</a>, <a href="../de/FEM_ClippingPlaneRemoveAll.html" title="FEM ClippingPlaneRemoveAll/de">Remove All Clipping Planes</a>, <a href="../de/FEM_Examples.html" title="FEM Examples/de">FEM Examples</a>; <a href="../de/FEM_MeshClear.html" title="FEM MeshClear/de">Clear FEM Mesh</a>, <a href="../de/FEM_MeshDisplayInfo.html" title="FEM MeshDisplayInfo/de">Display Mesh Info</a></li></ul>
<hr>
<ul><li><b>Additional:</b> <a href="../de/FEM_Preferences.html" title="FEM Preferences/de">Preferences</a>; <a href="../de/FEM_Install.html" title="FEM Install/de">FEM Install</a>, <a href="../de/FEM_Mesh.html" title="FEM Mesh/de">FEM Mesh</a>, <a href="../de/FEM_Solver.html" title="FEM Solver/de">FEM Solver</a>, <a href="../de/FEM_CalculiX.html" title="FEM CalculiX/de">FEM CalculiX</a>, <a href="../de/FEM_Concrete.html" title="FEM Concrete/de">FEM Concrete</a>; <a href="../de/FEM_Element_Types.html" title="FEM Element Types/de">FEM Element Types</a></li></ul></div>
    </div></div>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><span typeof="mw:File"><a href="../index.php?title=User_hub.png&amp;filetimestamp=20190221145008&amp;.html" class="mw-file-description"><img src="../File/User_hub.png" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../de/User_hub.html" title="User hub/de">Anwenderdokumentation</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b><a href="../de/Getting_started.html" title="Getting started/de">Erste Schritte</a></b></li>
<li><b>Installation:</b> <a href="../de/Download.html" title="Download/de">Herunterladen</a>, <a href="../de/Installing_on_Windows.html" title="Installing on Windows/de">Windows</a>, <a href="../de/Installing_on_Linux.html" title="Installing on Linux/de">Linux</a>, <a href="../de/Installing_on_Mac.html" title="Installing on Mac/de">Mac</a>, <a href="../de/Installing_additional_components.html" title="Installing additional components/de">Zus&auml;tzliche Komponenten</a>, <a href="../de/Compile_on_Docker.html" title="Compile on Docker/de">Docker</a>, <a href="../de/AppImage.html" title="AppImage/de">AppImage</a>, <a href="../de/Ubuntu_Snap.html" title="Ubuntu Snap/de">Ubuntu Snap</a></li>
<li><b>Grundlagen:</b> <a href="../de/About_FreeCAD.html" title="About FreeCAD/de">&Uuml;ber FreeCAD</a>, <a href="../de/Interface.html" title="Interface/de">Graphische Oberfl&auml;che</a>, <a href="../de/Mouse_navigation.html" title="Mouse navigation/de">Mausbedienung</a>, <a href="../de/Selection_methods.html" title="Selection methods/de">Auswahlmethoden</a>, <a href="../de/Object_name.html" title="Object name/de">Objektname</a>, <a href="../de/Preferences_Editor.html" title="Preferences Editor/de">Voreinstellungseditor</a>, <a href="../de/Workbenches.html" title="Workbenches/de">Arbeitsbereiche</a>, <a href="../de/Document_structure.html" title="Document structure/de">Dokumentstruktur</a>, <a href="../de/Property.html" title="Property/de">Objekteigenschaften</a>, <a href="../de/Help_FreeCAD.html" title="Help FreeCAD/de">FreeCAD unterst&uuml;tzen</a>, <a href="../de/Donate.html" title="Donate/de">Spenden</a></li></ul>
<hr>
<ul><li><b>Hilfe:</b> <a href="../de/Tutorials.html" title="Tutorials/de">Anleitungen</a>, <a href="../de/Video_tutorials.html" title="Video tutorials/de">Videoanleitungen</a></li>
<li><b><a href="../de/Workbenches.html" title="Workbenches/de">Arbeitsbereiche</a>:</b> <a href="../de/Std_Base.html" title="Std Base/de">Std Base</a>, <a href="../de/Arch_Workbench.html" title="Arch Workbench/de">Arch</a>, <a href="../de/Assembly_Workbench.html" title="Assembly Workbench/de">Assembly</a>, <a href="../de/BIM_Workbench.html" title="BIM Workbench/de">BIM</a>, <a href="../de/CAM_Workbench.html" title="CAM Workbench/de">CAM</a>, <a href="../de/Draft_Workbench.html" title="Draft Workbench/de">Draft</a>, <a href="../de/FEM_Workbench.html" title="FEM Workbench/de">FEM</a>, <a href="../de/Inspection_Workbench.html" title="Inspection Workbench/de">Inspection</a>, <a href="../de/Material_Workbench.html" title="Material Workbench/de">Material</a>, <a href="../de/Mesh_Workbench.html" title="Mesh Workbench/de">Mesh</a>, <a href="../de/OpenSCAD_Workbench.html" title="OpenSCAD Workbench/de">OpenSCAD</a>, <a href="../de/Part_Workbench.html" title="Part Workbench/de">Part</a>, <a href="../de/PartDesign_Workbench.html" title="PartDesign Workbench/de">PartDesign</a>, <a href="../de/Points_Workbench.html" title="Points Workbench/de">Points</a>, <a href="../de/Reverse_Engineering_Workbench.html" title="Reverse Engineering Workbench/de">Reverse Engineering</a>, <a href="../de/Robot_Workbench.html" title="Robot Workbench/de">Robot</a>, <a href="../de/Sketcher_Workbench.html" title="Sketcher Workbench/de">Sketcher</a>, <a href="../de/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/de">Spreadsheet</a>, <a href="../de/Surface_Workbench.html" title="Surface Workbench/de">Surface</a>, <a href="../de/TechDraw_Workbench.html" title="TechDraw Workbench/de">TechDraw</a>, <a href="../de/Testing.html" title="Testing/de">Test Framework</a></li></ul>
<hr>
<ul><li><b><a href="../de/Addon.html" title="Addon/de">Addon</a>:</b> <a href="../de/Std_AddonMgr.html" title="Std AddonMgr/de">Addon-Manager</a>, <a href="../de/External_workbenches.html" title="External workbenches/de">Externe Arbeitsbereiche</a>, <a href="../de/Scripting_and_macros.html" title="Scripting and macros/de">Skripten und Makros</a></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="../de/User_hub.html" title="User hub/de">Anwenderzentrum</a>, <a href="../de/Power_users_hub.html" title="Power users hub/de">Hauptanwenderzentrum</a>, <a href="../de/Developer_hub.html" title="Developer hub/de">Entwicklerzentrum</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20251223103543
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.101 seconds
Real time usage: 0.133 seconds
Preprocessor visited node count: 552/1000000
Post&#8208;expand include size: 30374/2097152 bytes
Template argument size: 9017/2097152 bytes
Highest expansion depth: 8/100
Expensive parser function count: 2/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1885/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   24.846      1 -total
 31.53%    7.834      1 Template:FEM_Tools_navi/de
 13.33%    3.312      2 Template:Navigation_menu_2
 11.59%    2.880      1 Template:Userdocnavi/de
 10.94%    2.718      1 Template:PropertyData/de
 10.57%    2.626      1 Template:TutorialInfo/de
 10.51%    2.611      2 Template:Code
  8.24%    2.048     13 Template:Caption
  6.14%    1.525      1 Template:PropertyView
  6.11%    1.519      2 Template:Variable
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:336311-0!canonical and timestamp 20251223103543 and revision id 1719617. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>