<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">FreeCAD-Ship s60 tutorial (II)/de</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="de" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-FreeCAD-Ship+s60+tutorial+%28II%29&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="de" dir="ltr">Deutsch</span></li>
<li><a href="../FreeCAD-Ship_s60_tutorial_(II).html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="FreeCAD-Ship s60 tutorial (II) (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/FreeCAD-Ship_s60_tutorial_(II).html" class="mw-pt-progress mw-pt-progress--high" title="FreeCAD-Ship s60 tutorial (II) (80% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/FreeCAD-Ship_s60_tutorial_(II).html" class="mw-pt-progress mw-pt-progress--complete" title="Tutoriel de construction navale S60 (II) (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/FreeCAD-Ship_s60_tutorial_(II).html" class="mw-pt-progress mw-pt-progress--med" title="FreeCAD-Ship s60 tutorial (II) (56% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/FreeCAD-Ship_s60_tutorial_(II).html" class="mw-pt-progress mw-pt-progress--low" title="Poradnik FreeCAD II: statek seria 60 (2% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../ro/FreeCAD-Ship_s60_tutorial_(II).html" class="mw-pt-progress mw-pt-progress--med" title="tutorial FreeCAD-Ship s60 (II) (62% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><a href="../ru/FreeCAD-Ship_s60_tutorial_(II).html" class="mw-pt-progress mw-pt-progress--low" title="FreeCAD-Ship s60 &#1091;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082; (II) (9% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li></ul></div>
<table class="fcinfobox wikitable ct" style="width: 230px; float: right; margin-left: 1em">
<tbody><tr>
<td class="ctTitle" style="font-weight: bold; font-size: 125%;"><span typeof="mw:File"><span><img src="../File/Freecad.svg" decoding="async" width="32" height="32" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span> Anleitung
</td></tr>
<tr>
<th class="ctOdd">Thema
</th></tr>
<tr>
<td class="ctEven">Schiff Arbeitsbereich
</td></tr>
<tr>
<th class="ctOdd">Niveau
</th></tr>
<tr>
<td class="ctEven">Anf&auml;nger
</td></tr>
<tr>
<th class="ctOdd">Bearbeitungszeit
</th></tr>
<tr>
<td class="ctEven">
</td></tr>
<tr>
<th class="ctOdd">Autoren
</th></tr>
<tr>
<td class="ctEven">
</td></tr>
<tr>
<th class="ctOdd">FreeCAD-Version
</th></tr>
<tr>
<td class="ctEven">
</td></tr>
<tr>
<th class="ctOdd">Beispieldateien
</th></tr>
<tr>
<td class="ctEven">
</td></tr>
<tr>
<th class="ctOdd">Siehe auch
</th></tr>
<tr>
<td class="ctEven"><i>None</i>
</td></tr>
<tr>
<td class="ctToc"><br><meta property="mw:PageProp/toc">
</td></tr></tbody></table>
<p><span id="Overview"></span>
</p>
<h2><span id=".C3.9Cberblick"></span><span class="mw-headline" id="&Uuml;berblick">&Uuml;berblick</span></h2>
<p>Bevor du mit diesem Tutorial beginnst, stelle bitte sicher, dass du bereits <a href="../de/FreeCAD-Ship_s60_tutorial.html" title="FreeCAD-Ship s60 tutorial/de">der erste Teil</a> durchgef&uuml;hrt hast.
</p><p>Erfahre mehr &uuml;ber den Schiff Arbeitsbereich auf ihrer speziellen Wiki Seite: <a href="../de/Ship_Workbench.html" title="Ship Workbench/de">Schiffs Arbeitsbereich</a>
</p>
<h2><span id="Einf.C3.BChrung"></span><span class="mw-headline" id="Einf&uuml;hrung">Einf&uuml;hrung</span></h2>
<p>In diesem Tutorium werden wir mit Gewichten und Tanks arbeiten, um die GZ Kurve, den wichtigsten hydrostatischen Stabilit&auml;tsparameter, zu berechnen. GZ ist das statische Moment, das erzeugt wird, wenn das Schiff einen Rollwinkel einnimmt, da der GZ Arm positiv ist, das Schiff ein positives Moment hat und versuchen wird, die aufrechte Position wiederherzustellen, aber wenn GZ negative Zahlen annimmt, hat das Schiff keine Stabilit&auml;t mehr und erreicht eine kritische Situation.
</p><p>Die IMO (Internationale Seeschifffahrtsorganisation) legte folgende Kriterien fest:
</p>
<ul><li><i>GM</i> &gt;= 0.15 m. GM" (metazentrische H&ouml;he) ist die Anfangstangente der "GZ" Kurve.</li>
<li>Der maximale <i>GZ</i> Wert muss &uuml;ber 30 Grad des Rollwinkels liegen.</li>
<li>Bei einem Rollwinkel von 30 Grad muss der <i>GZ</i> Wert mindestens 0,2 m betragen.</li>
<li>Der beteiligte Bereich der "GZ" Kurve bis zu einem Rollwinkel von 40 Grad muss mindestens 0,090 m - rad betragen.</li>
<li>Der beteiligte Bereich der "GZ" Kurve bis zu einem Rollwinkel von 30 Grad muss mindestens 0.055 m &middot; rad betragen.</li>
<li>Der beteiligte Bereich der "GZ" Kurve von 30 bis 40 Grad Rollwinkel muss mindestens 0.030 m &middot; rad  betragen.</li></ul>
<p>In diesem Tutorium werden wir Gewichte und Tanks f&uuml;r unser Schiff der Serie 60 in einer simulierten Situation einstellen.
</p>
<h2><span class="mw-headline" id="Schiffsgewichte">Schiffsgewichte</span></h2>
<p>Um die GZ Kurve berechnen zu k&ouml;nnen, m&uuml;ssen wir die Schiffsgewichte und ihre Position bei jedem Rollwinkel kennen, daher werden die Gewichte in zwei Kategorien eingeteilt:
</p>
<ul><li>Feste Gewichte, die vollst&auml;ndig mit den Schiffsbewegungen verkn&uuml;pft sind.</li>
<li>Tanks, bei denen sich die Form der Fl&uuml;ssigkeit mit dem Winkel &auml;ndert, so dass der Schwerpunkt an jeder Position berechnet werden muss.</li></ul>
<p>Der Schiff Arbeitsbereich bietet zwei verschiedene Werkzeuge zur Erzeugung jeder Instanz.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=FreeCAD-Ship-WeightIco.png&amp;filetimestamp=20170324171353&amp;.html" class="mw-file-description" title="Gewichtsfestlegungswerkzeug Symbol."><img alt="Gewichtsfestlegungswerkzeug Symbol." src="../File/FreeCAD-Ship-WeightIco.png" decoding="async" width="64" height="64" class="mw-file-element" data-file-width="64" data-file-height="64"></a><figcaption>Gewichtsfestlegungswerkzeug Symbol.</figcaption></figure>
<center><span style="font-variant:small-caps">Gewichtsfestlegungswerkzeug Symbol.</span></center>
<p>Das Werkzeug zur Definition von Gewichten kann zur Festlegung der ersten Kategorie von Gewichten verwendet werden. Wenn du das Werkzeug zum ersten Mal startest (mit ausgew&auml;hlter Schiffsinstanz), initialisiert der Schiffs Arbeitsbereich die Schiffsgewichte mit Schiffsleichtgewicht (gleich der Schiffsverdr&auml;ngung), das auf der X Koordinate des Schiffsgeometrieschwerpunkts und auf H&ouml;he des Konstruktionsentwurfs liegt. Normalerweise gibt es mindestens 2 relevante Gewichte:
</p>
<ul><li>Struktur.</li>
<li>Hauptmaschine (oder mehrere davon).</li></ul>
<p>Also werden wir es &auml;ndern. Mit einem Doppelklick auf jede Zelle k&ouml;nnen wir den Wert bearbeiten und Gewichte einstellen:
</p>
<ul><li>Struktur, 15000 kg, (-0.1, 0, 1.25) m</li>
<li>Steuerbordmotor, 5000 kg, (-6,5, -0,65, 0,5) m</li>
<li>Backbordmotor, 5000 kg, (-6,5, 0,65, 0,5) m</li>
<li>Notfall Motor, 2500 kg, (0,2, 0, 2,5) m</li></ul>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=FreeCAD-Ship-S60WeightsPreview.png&amp;filetimestamp=20120727094515&amp;.html" class="mw-file-description" title="Gewichtsdefinition 3D Vorschau."><img alt="Gewichtsdefinition 3D Vorschau." src="../File/FreeCAD-Ship-S60WeightsPreview.png" decoding="async" width="834" height="337" class="mw-file-element" data-file-width="834" data-file-height="337"></a><figcaption>Gewichtsdefinition 3D Vorschau.</figcaption></figure>
<center><span style="font-variant:small-caps">Gewichtsdefinition 3D Vorschau.</span></center>
<p>Die Position der Gewichte wird in der <a href="../de/3D_View.html" title="3D View/de">3D Ansicht</a> angezeigt. Hinweis: Die Anmerkungen werden entfernt, wenn das Werkzeug geschlossen wird. Wenn du <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">Accept</span> dr&uuml;ckst, werden die Gewichte in deiner Schiffsinstanz gespeichert.
</p>
<h2><span class="mw-headline" id="Tanks">Tanks</span></h2>
<p>Die Tanks m&uuml;ssen &uuml;ber der Festk&ouml;rpergeometrie als Schiffsinstanz erstellt werden, daher besteht der erste Schritt darin, zwei Bugtanks (einen pro Schiffsseite) Festk&ouml;rpergeometrien zu erstellen, die wir in Betracht ziehen werden (normalerweise haben Schiffe viele Tanks f&uuml;r Kraftstoff, S&uuml;&szlig;wasser, Salzwasser, Ladung usw.).
</p>
<h3><span class="mw-headline" id="Geometrieerzeugung">Geometrieerzeugung</span></h3>
<p>Um Tanks zu generieren, laden wir <a href="../de/Part_Workbench.html" title="Part Workbench/de">Part Modul</a>, und erzeugen ein Kasten Volumenmodell.
</p><p>Wir m&uuml;ssen den Kasten bearbeiten, also markieren wir ihn im <b>Attribute und Markierungen</b> Baum und wechseln von der Ansicht zum Datenreiter. Erweitere Platzierung, und in ihnen Position, und setze <i>x</i> auf 1,5, und z auf -1. Wir wollen auch die Kastenl&auml;nge &auml;ndern, indem wir sie f&uuml;r 5.0 &auml;ndern (beachte, dass die Einheiten in mm angegeben werden k&ouml;nnen, k&uuml;mmere dich nicht darum).
</p><p>Die Tankgeometrie wird gemeinsamer Bestandteil der erstellten Kasten- und Schiffsgeometrie sein, so dass wir die <b>Schiff</b> Instanz ausblenden und die <b>s60_IowaUniversity</b> Geometrie anzeigen k&ouml;nnen. Wenn wir Kasten und <b>s60_IowaUniversity</b> ausw&auml;hlen, k&ouml;nnen wir die Gemeinsame Arbeitsgang Erzeugung verwenden, die unsere Steuerbordtankgeometrie erzeugt.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=FreeCAD-Ship-S60TankGeometry.png&amp;filetimestamp=20120622115712&amp;.html" class="mw-file-description" title="Generierte Tankgeometrie."><img alt="Generierte Tankgeometrie." src="../File/FreeCAD-Ship-S60TankGeometry.png" decoding="async" width="834" height="337" class="mw-file-element" data-file-width="834" data-file-height="337"></a><figcaption>Generierte Tankgeometrie.</figcaption></figure>
<center><span style="font-variant:small-caps">Generierte Tankgeometrie.</span></center>
<p>Wir k&ouml;nnen den Tank auf der Backbordseite ausf&uuml;hren, indem wir unsere Steuerbordgeometrie ausw&auml;hlen und das Spiegelwerkzeug ausf&uuml;hren und XZ als Spiegelebene w&auml;hlen.
</p><p>Um die Geometrie in eine gew&ouml;hnliche feste Form unserer Tanks umzuwandeln und unsere <b>s60_IowaUniversity</b> Geometrie wiederherzustellen, k&ouml;nnen wir <a href="../de/Draft_Workbench.html" title="Draft Workbench/de">Entwurf Modul</a> laden und mit gew&auml;hlter Steuerbord Tankgeometrie die H&ouml;herstufung ausf&uuml;hren und mit der Backbordseite der Tankgeometrie wiederholen. Wir k&ouml;nnen Geometrien umbenennen als:
</p>
<ul><li>SteuerbordTankGeom</li>
<li>BackbordTankGeom</li></ul>
<p>Wir k&ouml;nnen erstellte K&auml;sten, die wir nicht mehr ben&ouml;tigen, l&ouml;schen. 
</p>
<h3><span class="mw-headline" id="Generierung_von_Tankinstanzen">Generierung von Tankinstanzen</span></h3>
<p>Wenn du <a href="../de/Ship_Workbench.html" title="Ship Workbench/de">FreeCAD Schiffsmodul</a> ein anderes Mal neu l&auml;dst, k&ouml;nnen wir ein Werkzeug zum Generieren von Tankinstanzen finden.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=FreeCAD-Ship-TankIco.png&amp;filetimestamp=20170324171419&amp;.html" class="mw-file-description" title="Tankinstanzenerzeugungswerkzeug Symbol."><img alt="Tankinstanzenerzeugungswerkzeug Symbol." src="../File/FreeCAD-Ship-TankIco.png" decoding="async" width="64" height="64" class="mw-file-element" data-file-width="64" data-file-height="64"></a><figcaption>Tankinstanzenerzeugungswerkzeug Symbol.</figcaption></figure>
<center><span style="font-variant:small-caps">Tankinstanzenerzeugungswerkzeug Symbol.</span></center>
<p>Jetzt k&ouml;nnen wir <b>SteuerbordTankGeom</b> ausw&auml;hlen und das Werkzeug zur Erzeugung von Tankinstanzen ausf&uuml;hren, wobei einige Daten bereitgestellt werden m&uuml;ssen. Wir werden 40% des F&uuml;llstands und 925 kg/m<math class="mwe-math-element" xmlns="http://www.w3.org/1998/Math/MathML"><mrow data-mjx-texclass="ORD"><mstyle displaystyle="true" scriptlevel="0"><msup><mrow data-mjx-texclass="ORD"><mi mathvariant="normal">m</mi></mrow><mrow data-mjx-texclass="ORD"><mn>3</mn></mrow></msup></mstyle></mrow></math> (Kraftstoffansatz) einstellen. Wenn <b>Annehmen</b> angeklickt wird, wird eine neue Tankinstanz mit dem Namen <b>Tank</b> erzeugt. Wir k&ouml;nnen sie in <b>SteuerbordTank</b> umbenennen und <b>Steuerbord-TankGeom</b> ausblenden.
</p><p>Wir k&ouml;nnen den gleichen Vorgang wiederholen, um <b>BackbordTank</b> zu generieren.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=FreeCAD-Ship-S60WeightsTanksPreview.png&amp;filetimestamp=20120727094549&amp;.html" class="mw-file-description" title="Ansicht erzeugter Gewichte."><img alt="Ansicht erzeugter Gewichte." src="../File/FreeCAD-Ship-S60WeightsTanksPreview.png" decoding="async" width="834" height="337" class="mw-file-element" data-file-width="834" data-file-height="337"></a><figcaption>Ansicht erzeugter Gewichte.</figcaption></figure>
<center><span style="font-variant:small-caps">Ansicht erzeugter Gewichte.</span></center>
<p>Die Abbildung zeigt unser Schiffsergebnis, das wir berechnen werden.
</p>
<h3><span class="mw-headline" id="GZ_Kurven_Berechnung">GZ Kurven Berechnung</span></h3>
<p>Der Schiffs Arbeitsbereich bietet ein Werkzeug zur einfachen Berechnung einer <i>GZ' Kurve.</i>
</p>
<figure class="mw-halign-center" typeof="mw:File"><a href="../index.php?title=Ship_GZ.svg&amp;filetimestamp=20170324172823&amp;.html" class="mw-file-description" title="GZ Kurven Berechnungswerkzeug Symbol."><img alt="GZ Kurven Berechnungswerkzeug Symbol." src="../File/Ship_GZ.svg" decoding="async" width="128" height="128" class="mw-file-element" data-file-width="64" data-file-height="64"></a><figcaption>GZ Kurven Berechnungswerkzeug Symbol.</figcaption></figure>
<center><span style="font-variant:small-caps">GZ Kurven Berechnungswerkzeug Symbol.</span></center>
<p>Mit gew&auml;hlter <b>Schiff</b> Instanz, k&ouml;nnen wir das Werkzeug ausf&uuml;hren. Das erste, was wir im ge&ouml;ffneten Dialog sehen k&ouml;nnen, ist eine Liste mit allen Tankinstanzen, die im aktiven Dokument gefunden wurden. Wir wollen beide verwenden, also klicken wir &uuml;ber die Tanks, die mit einem anderen Hintergrund versehen sind.
</p><p>Um die sich daraus ergebende Schiffsverdr&auml;ngung und den Tiefgang zu erfahren, k&ouml;nnen wir auf '<i>Verdr&auml;ngung und Tiefgang aktualisieren</i> dr&uuml;cken, was einige Zeit f&uuml;r die Berechnung ben&ouml;tigt. Wir erhalten folgende Daten:
</p>
<ul><li>Verdr&auml;ngung = 37505.5 kg</li>
<li>Tiefgang = 0.818664 m</li></ul>
<p>Wir befinden uns also in einer unbelasteten Situation, in der die Entw&uuml;rfe geringf&uuml;gig niedriger sind als die Konstruktionsentw&uuml;rfe. Normalerweise bedeuten niedrigere Tiefg&auml;nge eine geringere Schiffsstabilit&auml;t, der Tiefgang h&auml;ngt vom Beladungszustand ab. Wenn wir also wirklich erwarten, dass das Schiff in diesem Beladungszustand betrieben werden kann, k&ouml;nnen wir den Einsatz von Ballasttanks in Erw&auml;gung ziehen.
</p><p>Wir k&ouml;nnen auch automatisch den Schiffstrimm berechnen, ein Vorgang, der etwa eine Minute dauern kann, wobei wir feststellen k&ouml;nnen, dass unser Schiff einen Trimmwinkel von 0,95 Grad hat (positiv beim Heck). In diesem Beispiel werden wir ohne Trimmwinkel (0 Grad) arbeiten.
</p><p>Werkzeuganforderung Rollwinkel werden ebenfalls ber&uuml;cksichtigt. In diesem Fall wollen wir das gesamte Schiffsverhalten kennen, damit wir einstellen k&ouml;nnen:
</p>
<ul><li>0 Grad Anfangsrollwinkel.</li>
<li>180 Grad Endrollwinkel.</li>
<li>46 Punkte. Einer f&uuml;r je 2 Grad. Die GZ Berechnung kann einige Zeit in Anspruch nehmen, also achte auf die Anzahl der gew&uuml;nschten Punkte.</li></ul>
<p>Wenn wir '<i>Annehmen</i> dr&uuml;cken, startet das Werkzeug die Berechnung. Wenn du FreeCAD vom Terminal aus startest, kannst du den Arbeitsfortschritt sehen. In ein paar Sekunden erhalten wir die GZ Kurve.
</p><p>Dieses Werkzeug verwendet <a rel="nofollow" class="external text" href="http://www.pyxplot.org.uk/">pyxplot</a> und <a rel="nofollow" class="external text" href="http://www.ghostscript.com/">ghostscript</a> ebenfalls.  Du kannst sehen, wo die Ausgabedatei <b>gz.dat</b> in der Berichtsansicht (Ansicht/Ansichten/Berichtsansicht) platziert wurde, und sie mit Datenblattsoftware (z.B. <a rel="nofollow" class="external text" href="http://www.libreoffice.org">libreOffice</a>) laden. In der N&auml;he der Datendatei wurden auch mehrere Hilfsdateien erstellt:
</p>
<ul><li><b>gz.dat</b>: Berechnete GZ Kurvendaten.</li>
<li><b>gz.pyxplot</b>: pyxplot Layout, um die Kurve zu plotten..</li>
<li><b>gz.eps</b>: EPS Bildversion.</li>
<li><b>gz.png</b>: PNG Bildversion.</li></ul>
<p>Diese Dateien werden &uuml;berschrieben, wenn du das Werkzeug ein weiteres Mal ausf&uuml;hrst.
</p><p><span id="Results"></span>
</p>
<h3><span class="mw-headline" id="Ergebnisse">Ergebnisse</span></h3>
<figure class="mw-halign-center" typeof="mw:File"><a href="../index.php?title=FreeCAD-Ship-s60GZ.png&amp;filetimestamp=20120622125116&amp;.html" class="mw-file-description" title="Resultierende GZ Kurve."><img alt="Resultierende GZ Kurve." src="../File/FreeCAD-Ship-s60GZ.png" decoding="async" width="800" height="516" class="mw-file-element" data-file-width="1137" data-file-height="733"></a><figcaption>Resultierende GZ Kurve.</figcaption></figure>
<center><span style="font-variant:small-caps">Resultierende GZ Kurve.</span></center>
<p>Der <i>GZ</i> Maximalwert wird &uuml;ber 30 Grad (45 Grad) gelegt und erh&auml;lt 0,25 m bei 30 Grad (0,2 m ist das Minimum). Bis zu 30 Grad betr&auml;gt die Fl&auml;che unterhalb der <i>GZ</i> Kurve 0.065 m&middot;rad, bis zu 40 Grad haben wir 0.092 m&middot;rad, was der Fl&auml;che zwischen 30 und 40 Grad von 0.027 m&middot;rad entspricht. Unser Schiff erf&uuml;llt also nicht die Anforderungen der IMO. Die L&ouml;sung ist die Platzierung von Ballasttanks.
</p><p>Andererseits hat das Schiff in diesem schlechten Zustand positive <i>GZ</i> Werte bis zu 95 Grad Rollwinkel, war aber nicht ausreichend f&uuml;r die Stabilit&auml;tsanforderungen der IMO, was die harten Kriterien zeigt, die f&uuml;r diesen Punkt auferlegt wurden.
</p><p>Nat&uuml;rlich ist dieses Beispiel nicht real (erstens k&ouml;nnen die Treibstofftanks nicht in der Doppelbodenstruktur oder unter Verwendung der Rumpfseite als Struktur platziert werden), aber es ist ein gutes Beispiel, um den Umgang mit <a href="../de/Ship_Workbench.html" title="Ship Workbench/de">Schiff Arbeitsbereich</a> zu erlernen.
</p>
<!-- 
NewPP limit report
Cached time: 20251019190133
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.079 seconds
Real time usage: 0.102 seconds
Preprocessor visited node count: 86/1000000
Post&#8208;expand include size: 1067/2097152 bytes
Template argument size: 36/2097152 bytes
Highest expansion depth: 3/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 2171/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    3.522      1 -total
 53.83%    1.896      1 Template:TutorialInfo/de
 42.91%    1.511      1 Template:Button
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:68491-0!canonical and timestamp 20251019190133 and revision id 1668476. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>