<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">FreeCAD Managing Expectations/de</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="de" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-FreeCAD+Managing+Expectations&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--high" lang="de" dir="ltr">Deutsch</span></li>
<li><a href="../FreeCAD_Managing_Expectations.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="FreeCAD Managing Expectations (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../fr/FreeCAD_Managing_Expectations.html" class="mw-pt-progress mw-pt-progress--complete" title="FreeCAD - G&eacute;rer les attentes (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../pl/FreeCAD_Managing_Expectations.html" class="mw-pt-progress mw-pt-progress--complete" title="FreeCAD Oczekiwania (100% translated)" lang="pl" dir="ltr">polski</a></li></ul></div>
<div id="itsfree" class="warning-box">Wir begr&uuml;&szlig;en und f&ouml;rdern das Wachstum und die Beteiligung der Gemeinschaft, aber Forderungen, emotionale Tiraden und wilde Behauptungen kommen in der Regel schlecht an, da unsere Gemeinschaft aus vielen erfahrenen und leidenschaftlichen Unterst&uuml;tzern von FreeCAD besteht, die &auml;hnliche Aussagen schon oft geh&ouml;rt haben. Wenn man eine Funktion vermisst oder einen etwas st&ouml;rt, empfehlen wir dringend, sich mit dem Code selbst zu besch&auml;ftigen. FreeCAD wird gr&ouml;&szlig;tenteils von einer relativ kleinen Gruppe talentierter Menschen entwickelt, die alle einen Tagesberuf, Familien und andere Interessen haben, die &uuml;ber das Programmieren auf Abruf hinausgehen. Wenn man &uuml;ber die erforderlichen Kenntnisse (Python/C++) und die Motivation zur Mitarbeit verf&uuml;gt, k&ouml;nnen die eigenen Beitr&auml;ge dazu beitragen, FreeCAD noch besser zu machen, als es heute schon ist. Man findet die nachverfolgten Fehler/Feature-Anfragen <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/issues">hier</a>.</div>
<div style="clear:right; margin-bottom: .5em; float: right; padding: .5em 0 .8em 1.4em; background: none;"><meta property="mw:PageProp/toc"></div>
<p><span id="Purpose"></span>
</p>
<h2><span class="mw-headline" id="Zweck">Zweck</span></h2>
<p>Diese Wiki-Seite ist f&uuml;r neue FreeCAD-Nutzer gedacht, die von anderen CAD/CAM-Anwendungen kommen.
</p><p><span id="Opening_statement"></span>
</p>
<h2><span id="Er.C3.B6ffnungsrede"></span><span class="mw-headline" id="Er&ouml;ffnungsrede">Er&ouml;ffnungsrede</span></h2>
<p>Viele Hobbyanwender, freiberufliche Designer und kleine Unternehmen suchen oft Zuflucht vor den hohen Kosten und Lizenzbeschr&auml;nkungen kommerzieller Software, oder vielleicht entscheiden Sie sich einfach f&uuml;r FreeCAD, weil Sie an die Philosophie hinter <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/FOSS">FOSS</a> glauben. In jedem Fall: HERZLICH WILLKOMMEN! Es gibt viele Nutzer wie Sie, die f&uuml;r ihre privaten und beruflichen Zwecke erfolgreich auf FreeCAD umgestiegen sind. Diese Wiki-Seite soll Ihnen helfen, den Weg zum Erfolg zu finden und realistische Erwartungen zu entwickeln, w&auml;hrend Sie sich in die <i>FreeCAD-Methode</i> vertiefen, die sich wahrscheinlich erheblich von dem unterscheidet, was Sie von anderen g&auml;ngigen CAD-Programmen gewohnt sind.
</p><p><span id="What_can_I_expect?"></span>
</p>
<h2><span id="Was_kann_ich_erwarten.3F"></span><span class="mw-headline" id="Was_kann_ich_erwarten?">Was kann ich erwarten?</span></h2>
<p>Im Kern ist FreeCAD ein leistungsf&auml;higer parametrischer Modellierer. Sein Konzept basiert auf der Verwendung von modularen Arbeitsbereichen, wobei jeder Arbeitsbereich f&uuml;r bestimmte Aufgaben und Funktionen verantwortlich ist. Dieses Konzept ist sehr flexibel und kann f&uuml;r viele Zwecke erfolgreich eingesetzt werden. FreeCAD wird aktiv weiterentwickelt, produktiv eingesetzt und ist ziemlich stabil; aber wie jedes andere CAD-Programm ist auch FreeCAD nicht zu 100% stabil.
</p><p>Wenn man von einem anderen CAD-Programm kommt, muss man sicherlich die Terminologie, Struktur und Organisation von FreeCAD als etwas fremd empfinden. Man muss sicherlich seine Arbeitsabl&auml;ufe anpassen, funktionelle Workarounds erlernen oder die m&auml;chtige <a href="../de/Macros.html" title="Macros/de">Makro</a>-Umgebung verwenden, aber in den meisten F&auml;llen wird man erreichen, was man m&ouml;chte. Und wenn man Hilfe braucht: Wir haben ein sehr aktives und hilfsbereites <a rel="nofollow" class="external text" href="https://forum.freecad.org/index.php">Forum</a>. Unter den Mitgliedern des Forums sind auch viele (ehemalige) Anwender anderer CAD-Programme. Es gibt keinen Grund zu z&ouml;gern, diese Quelle anzuzapfen.
</p><p><span id="How_can_I_contribute?"></span>
</p>
<h2><span id="Wie_kann_ich_unterst.C3.BCtzen.3F"></span><span class="mw-headline" id="Wie_kann_ich_unterst&uuml;tzen?">Wie kann ich unterst&uuml;tzen?</span></h2>
<p>Es  gibt viele Wege: Man kann <a href="../de/Donate.html" title="Donate/de">spenden</a>, bei Fragen im <a rel="nofollow" class="external text" href="https://forum.freecad.org/index.php">Forum</a> helfen, die Dokumentation erg&auml;nzen oder Programmieren. Siehe <a href="../de/Help_FreeCAD.html" title="Help FreeCAD/de">Hilf FreeCAD</a>.
</p><p><span id="Learning_resources"></span>
</p>
<h2><span class="mw-headline" id="Lernmaterialien">Lernmaterialien</span></h2>
<p><span id="Official"></span>
</p>
<h3><span class="mw-headline" id="Offiziell">Offiziell</span></h3>
<ul><li><a href="../de/Main_Page.html" title="Main Page/de">Dieses Wiki</a></li>
<li><a rel="nofollow" class="external text" href="https://forum.freecad.org/viewforum.php?f=3">Das Hilfe-Forum</a></li>
<li><a href="../de/Workarounds.html" title="Workarounds/de">Behelfsl&ouml;sungen f&uuml;r bekannte Probleme</a></li></ul>
<p><span id="Un-official"></span>
</p>
<h3><span class="mw-headline" id="Inoffiziell">Inoffiziell</span></h3>
<p>Die folgenden YouTube-Kan&auml;le bieten Inhalte von recht guter Qualit&auml;t rund um FreeCAD (es wird empfohlen, alle Tutorials zu ignorieren, die auf Version 0.17 oder fr&uuml;her basieren):
</p>
<ul><li><i>MangoJelly Solutions</i> (mehrere Videoplaylists f&uuml;r Anf&auml;nger, Fortgeschrittene und Profis)</li>
<li><i>Joko EngineeringHelp</i> (Videos f&uuml;r Fortgeschrittene/Profis)</li>
<li><i>Brodie Fairhall</i> (Einige Videos, die Fusion 360-Benutzern den Umstieg auf FreeCAD erleichtern)</li>
<li>Und mehr...</li></ul>
<p><span id="Questions_and_answers"></span>
</p>
<h2><span class="mw-headline" id="Fragen_und_Antworten">Fragen und Antworten</span></h2>
<p><span id='"Can_FreeCAD_do_XYZ?"'></span>
</p>
<h3><span id=".22Kann_FreeCAD_XYZ_machen.3F.22"></span><span class="mw-headline" id='"Kann_FreeCAD_XYZ_machen?"'>"Kann FreeCAD XYZ machen?"</span></h3>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>FreeCAD already has the ability to do the following types of work:
</p>
<ul><li>Spline-based parametric modeling using the <a href="../Part_Workbench.html" title="Part Workbench">Part</a>, <a href="../PartDesign_Workbench.html" title="PartDesign Workbench">Part Design</a> and <a href="../Sketcher_Workbench.html" title="Sketcher Workbench">Sketcher</a> workbenches</li>
<li><a href="../Surface_Workbench.html" title="Surface Workbench">Surface</a>/<a href="../Curves_Workbench.html" title="Curves Workbench">Curves</a> modeling using NURBS</li>
<li><a href="../Mesh_Workbench.html" title="Mesh Workbench">Mesh</a> import/modifications</li>
<li>Assembly simulation (3 different approaches, <a href="../A2plus_Workbench.html" title="A2plus Workbench">A2+</a>,  <a href="../Assembly3_Workbench.html" title="Assembly3 Workbench">ASM3</a>, and <a href="../Assembly4_Workbench.html" title="Assembly4 Workbench">ASM4</a>, are all actively developed)</li>
<li><a href="../BIM_Workbench.html" title="BIM Workbench">BIM</a> design</li>
<li>Mechanical Stress Analysis (<a href="../FEM_Workbench.html" title="FEM Workbench">FEM/FEA</a>)</li>
<li>Computational Fluid Dynamic Analysis (<a href="../Cfd_Workbench.html" title="Cfd Workbench">CFD</a>)</li>
<li><a href="../TechDraw_Workbench.html" title="TechDraw Workbench">Technical Drawings</a>/<a href="../Draft_Workbench.html" title="Draft Workbench">Drafting</a></li>
<li>And more <a href="../Workbenches.html" title="Workbenches">core</a> and <a href="../External_workbenches.html" title="External workbenches">external</a> workbenches...</li></ul>
</div>
<p><span id='"User_interface_(UI/UX)_is_ugly,_odd,_confusing_or_not_like_XYZ_Software!"'></span>
</p>
<h3><span id=".22Die_Benutzeroberfl.C3.A4che_.28UI.2FUX.29_ist_h.C3.A4sslich.2C_seltsam.2C_verwirrend_oder_nicht_wie_die_Software_XYZ.21.22"></span><span class="mw-headline" id='"Die_Benutzeroberfl&auml;che_(UI/UX)_ist_h&auml;sslich,_seltsam,_verwirrend_oder_nicht_wie_die_Software_XYZ!"'>"Die Benutzeroberfl&auml;che (UI/UX) ist h&auml;sslich, seltsam, verwirrend oder nicht wie die Software XYZ!"</span></h3>
<p>FreeCAD erm&ouml;glicht eine <a href="../de/Interface_Customization.html" title="Interface Customization/de">umfassende Anpassung</a> der Benutzeroberfl&auml;che. Wir sind uns bewusst, dass die Standardfarben oder die Anordnung der Elemente m&ouml;glicherweise nicht jedem gefallen, empfehlen jedoch, diese an die individuellen Bed&uuml;rfnisse und Arbeitsabl&auml;ufe anzupassen. Wenn man der Meinung ist, dass man eine beliebte Anordnung/ein beliebtes Thema/angepasste Symbolleisten usw. gefunden hat, kann man gerne die k&uuml;rzlich hinzugef&uuml;gte Funktion <a href="../de/Preference_Packs.html" title="Preference Packs/de">Voreinstellungspakete</a> nutzen und diese mit der Community teilen. Vielleicht helfen die Bem&uuml;hungen anderen beim Umstieg auf FreeCAD. FOSS-Software lebt von allen Arten von Beitr&auml;gen der Gemeinschaft, und dies ist ein h&auml;ufiges Diskussionsthema.
</p><p><span id="&quot;Why_doesn't_this_feature_work_like_in_XYZ_software?&quot;"></span>
</p>
<h3><span id=".22Warum_funktioniert_diese_Funktion_nicht_wie_in_der_Software_XYZ.3F.22"></span><span class="mw-headline" id='"Warum_funktioniert_diese_Funktion_nicht_wie_in_der_Software_XYZ?"'>"Warum funktioniert diese Funktion nicht wie in der Software XYZ?"</span></h3>
<p>FreeCAD blickt auf eine &uuml;ber <a href="../de/History.html" title="History/de">20-j&auml;hrige</a> Entwicklungsgeschichte zur&uuml;ck. Funktionen und Verhaltensweisen werden vor ihrer Hinzuf&uuml;gung oder &Auml;nderung eingehend gepr&uuml;ft, diskutiert und bewertet. Seien Sie offen, auch wenn es vielleicht nicht offensichtlich ist, denn hinter solchen Dingen steckt wahrscheinlich eine sehr gute Begr&uuml;ndung. Das soll nicht hei&szlig;en, dass FreeCAD perfekt ist, aber man bedenke bitte, dass das, woran man sich gew&ouml;hnt hat, m&ouml;glicherweise nicht die einzige oder beste Methode ist, um etwas zu erreichen.
</p><p><span id="&quot;I_can't_figure_out_the_workflow_of_FreeCAD!&quot;"></span>
</p>
<h3><span id=".22Ich_kann_den_Arbeitsablauf_von_FreeCAD_nicht_nachvollziehen.21.22"></span><span class="mw-headline" id='"Ich_kann_den_Arbeitsablauf_von_FreeCAD_nicht_nachvollziehen!"'>"Ich kann den Arbeitsablauf von FreeCAD nicht nachvollziehen!"</span></h3>
<p>FreeCAD verfolgt die Philosophie, nicht vorzuschreiben, wie ma es verwenden soll. Vielmehr bietet es Werkzeuge und eine Vielzahl von Optionen, mit denen man arbeiten kann. Das bedeutet zweierlei: Erstens wird die Software nicht unbedingt zu einem bestimmten Stil oder Arbeitsablauf 'f&uuml;hren' oder 'lenken'. Zweitens bedeutet dies, dass man mit den Werkzeugen experimentieren und herausfinden kann, was f&uuml;r einen am besten funktioniert. Das hei&szlig;t nicht, dass es keine allgemeinen <a href="../de/Feature_editing.html" title="Feature editing/de">&bdquo;Best Practices&ldquo;</a> gibt, die man bei der Verwendung von FreeCAD beachten sollte, aber diese Best Practices gelten im Allgemeinen f&uuml;r jede professionelle Design-Software, wenn es darum geht, stabile Modelle zu erstellen.
</p><p><span id='"What_the_heck_is_with_all_these_workbenches?"'></span>
</p>
<h3><span id=".22Was_soll_das_mit_all_diesen_Arbeitsbereichen.3F.22"></span><span class="mw-headline" id='"Was_soll_das_mit_all_diesen_Arbeitsbereichen?"'>"Was soll das mit all diesen Arbeitsbereichen?"</span></h3>
<p>Eine der leistungsstarken Funktionen von FreeCAD ist seine Modularit&auml;t. Dies wird durch die Aufteilung der Werkzeugentwicklung in Arbeitsbereiche erreicht. Sobald manie mit den bereitgestellten Werkzeugen vertraut ist, k&ouml;nnen diese oft synergetisch zusammenwirken, um hochkomplexe und fortschrittliche Modelle zu erstellen. Eine gute Analogie ist, dass FreeCAD &auml;hnlich wie ein rollbarer Werkzeugkasten f&uuml;r Mechaniker aufgebaut ist und jeder Arbeitsbereich eine Schublade mit spezifischen Werkzeugen darstellt. Mit diesen Werkzeugen kann man ein Auto bauen, aber es liegt am Mechaniker, zu verstehen, wie er sie einsetzen muss, um sein Ziel zu erreichen.
</p><p><span id='"FreeCAD_is_fundamentally_broken,_my_models_blow-up!"'></span>
</p>
<h3><span id=".22FreeCAD_ist_grundlegend_defekt.2C_meine_Modelle_explodieren.21.22"></span><span class="mw-headline" id='"FreeCAD_ist_grundlegend_defekt,_meine_Modelle_explodieren!"'>"FreeCAD ist grundlegend defekt, meine Modelle explodieren!"</span></h3>
<p>FreeCAD basiert auf einem Open-Source-Geometrie-Modellierungskern namens "<a href="../de/OpenCASCADE.html" title="OpenCASCADE/de">OpenCascade Technology</a>" (oder OCC). Es handelt sich dabei um den funktionsreichsten und ausgereiftesten Open-Source-Modellierungskern, der derzeit verf&uuml;gbar ist. Allerdings weist er auch Fehler, Macken und Einschr&auml;nkungen auf. Eines davon wird als <a href="../de/Topological_naming_problem.html" title="Topological naming problem/de">"Problem der topologischen Benennung"</a> (oder TNP) bezeichnet. Bei jeder &Auml;nderung eines Modells werden die internen Namen von Fl&auml;chen und Kanten durch den Kernel ge&auml;ndert, was zu unerw&uuml;nschtem Verhalten bei allen Modellmerkmalen f&uuml;hrt, die auf diese Namen verweisen. Der aktuelle Entwicklungszyklus konzentriert sich auf die Implementierung eines Benennungsalgorithmus, der diesen Effekt unter den meisten Umst&auml;nden abmildern soll. Es ist jedoch zu beachten, dass die Abmilderung des TNP kein Ersatz f&uuml;r <a href="../de/Feature_editing.html" title="Feature editing/de">gute Modellierungspraktiken und -techniken</a> ist.
</p><p><span id="OpenCascade_kernel"></span>
</p>
<h2><span class="mw-headline" id="OpenCascade-Kernel">OpenCascade-Kernel</span></h2>
<p>OpenCascade (OCC) ist ein externer CAD-Kernel, von dem FreeCAD vollst&auml;ndig abh&auml;ngig ist. Es gibt viele offene 'Upstream'-Fehler, die die FreeCAD-Community in Bezug auf OCC identifiziert hat und verfolgt. Siehe:
</p>
<ul><li><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/issues?q=is%3Aopen+is%3Aissue+label%3A%223rd+Party%3A+OCC%22">Bugtracker</a></li>
<li><a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=20264">OCC-Fehler im Bugtracker (Forum-Thread)</a></li></ul>
<p><span id="Additional_links"></span>
</p>
<h2><span id="Zus.C3.A4tzliche_Verweise"></span><span class="mw-headline" id="Zus&auml;tzliche_Verweise">Zus&auml;tzliche Verweise</span></h2>
<ul><li><a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?f=8&amp;t=43461">Discussion: FreeCAD is not ready for 1.0 (forum thread)</a></li>
<li><a rel="nofollow" class="external text" href="https://www.youtube.com/watch?v=JBmdbipkbrk">Why the GIMP Team Obviously* Hates You (*We Actually Love You. **Mostly)</a> Pat David from GIMP team presentation at SCaLE16x California 2016</li>
<li><a rel="nofollow" class="external text" href="https://vimeo.com/144089061">Earning Your Support Instead of Buying it: A How-to Guide to Open Source Assistance</a> by <a rel="nofollow" class="external text" href="https://twitter.com/ijturton">Ian Turton</a> at FOSS4G Seoul 2015</li></ul>
<!-- 
NewPP limit report
Cached time: 20251203213758
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.032 seconds
Real time usage: 0.100 seconds
Preprocessor visited node count: 110/1000000
Post&#8208;expand include size: 1131/2097152 bytes
Template argument size: 964/2097152 bytes
Highest expansion depth: 3/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1082/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    7.269      1 -total
 64.95%    4.721      1 Template:VeryImportantMessage
 33.33%    2.423      1 Template:TOCright
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:291235-0!canonical and timestamp 20251203213757 and revision id 1710101. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>