<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Frequently asked questions/de</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="de" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Frequently+asked+questions&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="de" dir="ltr">Deutsch</span></li>
<li><a href="../Frequently_asked_questions.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Frequently asked questions (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/Frequently_asked_questions.html" class="mw-pt-progress mw-pt-progress--med" title="PREGUNTAS FRECUENTES (57% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/Frequently_asked_questions.html" class="mw-pt-progress mw-pt-progress--complete" title="Foire aux questions (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../hr/Frequently_asked_questions.html" class="mw-pt-progress mw-pt-progress--low" title="Frequently asked questions/hr (1% translated)" lang="hr" dir="ltr">hrvatski</a></li>
<li><a href="../it/Frequently_asked_questions.html" class="mw-pt-progress mw-pt-progress--high" title="Domande frequenti (94% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Frequently_asked_questions.html" class="mw-pt-progress mw-pt-progress--complete" title="Najcz&#281;&#347;ciej zadawane pytania (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt-br/Frequently_asked_questions.html" class="mw-pt-progress mw-pt-progress--high" title="Perguntas mais freq&uuml;entes (73% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../ru/Frequently_asked_questions.html" class="mw-pt-progress mw-pt-progress--med" title="&#1063;&#1072;&#1089;&#1090;&#1086; &#1079;&#1072;&#1076;&#1072;&#1074;&#1072;&#1077;&#1084;&#1099;&#1077; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099; (45% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li>
<li><a href="../ja/Frequently_asked_questions.html" class="mw-pt-progress mw-pt-progress--low" title="FAQ (1% translated)" lang="ja" dir="ltr">&#26085;&#26412;&#35486;</a></li>
<li><a href="../ko/Frequently_asked_questions.html" class="mw-pt-progress mw-pt-progress--med" title="&#51088;&#51452;&#54616;&#45716; &#51656;&#47928; (42% translated)" lang="ko" dir="ltr">&#54620;&#44397;&#50612;</a></li></ul></div>
<div class="docnav">
    <div><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-left.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span> <a href="../de/Import_Export.html" title="Import Export/de">Import/Export</a></div>
    <div><a href="../de/Tutorials.html" title="Tutorials/de">Tutorien</a>
 <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-right.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span></div>
    <div><a href="../de/Online_Help_Toc.html" title="Online Help Toc/de">Index</a> <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Online_Help_Toc.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span></div>
</div>
<p>Diese Seite versucht, die h&auml;ufigsten Fragen zu beantworten, die in den FreeCAD-Foren gestellt werden. Wenn Du ein Problem oder eine Frage zu FreeCAD hast, schau zuerst unten nach. Wenn Du dann keine Antwort auf deine spezielle Frage findest, gehe zum <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewforum.php?f=3">FreeCAD-Forum</a>!
</p><p><span id="Installation"></span>
</p>
<meta property="mw:PageProp/toc">
<h2><span class="mw-headline" id="Einrichtung">Einrichtung</span></h2>
<p><span id="What_is_the_easiest_way_to_install_FreeCAD_on_my_system?"></span>
</p>
<h3><span id="Was_ist_der_einfachste_Weg.2C_FreeCAD_auf_meinem_Rechner_zu_installieren_.3F"></span><span class="mw-headline" id="Was_ist_der_einfachste_Weg,_FreeCAD_auf_meinem_Rechner_zu_installieren_?">Was ist der einfachste Weg, FreeCAD auf meinem Rechner zu installieren&nbsp;?</span></h3>
<p>Wenn du unter Windows oder macOS arbeitest, ist der einfachste Weg zum <a href="../de/Download.html" title="Download/de">Herunterladen</a>, auf die Seite zu gehen, wo du mehrere installationsbereite Pakete findest. Wenn du auf Debian, Fedora oder Ubuntu und einigen anderen Distributionen bist, ist FreeCAD bereits in den Standard-Software-Repositorien enthalten und du kannst es einfach mit dem Software-Manager installieren. Unter Ubuntu unterh&auml;lt das FreeCAD-Team auch eigene <a href="../de/Installing_on_Linux.html#Stable_PPA" title="Installing on Linux/de">PPA-Repositorien</a>. Weitere Details zur Installation findest du auf der Installationsseite f&uuml;r dein Betriebssystem  (<a href="../de/Installing_on_Windows.html" title="Installing on Windows/de">Windows</a>, <a href="../de/Installing_on_Linux.html" title="Installing on Linux/de">Linux</a> oder <a href="../de/Installing_on_Mac.html" title="Installing on Mac/de">macOS</a>).
</p><p><span id="What_are_the_prerequisites_for_running_FreeCAD?"></span>
</p>
<h3><span id="Was_sind_die_Voraussetzungen_um_FreeCAD_auszuf.C3.BChren"></span><span class="mw-headline" id="Was_sind_die_Voraussetzungen_um_FreeCAD_auszuf&uuml;hren">Was sind die Voraussetzungen um FreeCAD auszuf&uuml;hren</span></h3>
<p>Im Gegensatz zu den meisten 3D CAD Programmen  kann FreeCAD problemlos auf den einfachsten Computern laufen - es ist bekannt, dass es auf Pentium IV und Intel Core2 Solo CPUs l&auml;uft. Wenn auf deinem Computer ein aktuelles Betriebssystem l&auml;uft, stehen die Chancen gut, dass FreeCAD l&auml;uft. Die einzige Voraussetzung ist, dass deine Grafikkarte oder dein Chipsatz <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/OpenGL">OpenGL</a> unterst&uuml;tzen muss, vorzugsweise nicht &auml;lter als v2.0. Bei Problemen lies bitte den Abschnitt <a class="mw-selflink-fragment" href="#Fehlerbehebung">Fehlerbehebung</a> dieser FAQ.
</p>
<h4><span class="mw-headline" id="Multithreading">Multithreading</span></h4>
<p>FreeCADs zugrundeliegender geometrischer Modellierungskern, die <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Open_Cascade_Technology">OpenCASCADE Technologie</a> (OCCT) Drittanbieterbibliothek,
<a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?f=4&amp;t=17501&amp;p=173095&amp;hilit=Multithread#p173095">hat derzeit nur teilweise Multi-Threading Unterst&uuml;tzung</a>. Siehe die <a href="../de/Multithreading.html" title="Multithreading/de">Multithreading</a>-Seite f&uuml;r weitere Einzelheiten.
</p><p><span id="What_if_I_want_to_compile_FreeCAD_myself?"></span>
</p>
<h3><span id="Was.2C_wenn_ich_FreeCAD_selbst_kompilieren_m.C3.B6chte.3F"></span><span class="mw-headline" id="Was,_wenn_ich_FreeCAD_selbst_kompilieren_m&ouml;chte?">Was, wenn ich FreeCAD selbst kompilieren m&ouml;chte?</span></h3>
<p>Der Quellcode von FreeCAD ist immer im Projekt-Quellcode-Repositorium verf&uuml;gbar. Wenn du FreeCAD selbst kompilierst, kannst du die neuesten Funktionen verwenden, die gerade entwickelt werden, erfordert aber ein wenig Computerkenntnisse, obwohl das Verfahren ziemlich einfach ist. Der Zugriff auf den Quellcode wird erkl&auml;rt <a href="../de/Compile_on_Linux.html#Abruf_der_Quelle" title="Compile on Linux/de">hier</a>, und wir haben detaillierte Anweisungen zum Kompilieren auf <a href="../de/Compile_on_Windows.html" title="Compile on Windows/de">Windows</a>, <a href="../de/Compile_on_Linux.html" title="Compile on Linux/de">Linux</a> und <a href="../de/Compile_on_MacOS.html" title="Compile on MacOS/de">macOS</a>.
</p><p><span id="FreeCAD_tells_me_some_module_or_application_is_missing"></span>
</p>
<h3><span id="FreeCAD_meldet.2C_dass_einige_Module_oder_Anwendungen_fehlen"></span><span class="mw-headline" id="FreeCAD_meldet,_dass_einige_Module_oder_Anwendungen_fehlen">FreeCAD meldet, dass einige Module oder Anwendungen fehlen</span></h3>
<p>FreeCAD h&auml;ngt von vielen Dingen ab, um seine gesamte Funktionalit&auml;t anzubieten. Alle wichtigen ben&ouml;tigten Komponenten sind normalerweise in deiner FreeCAD Installation enthalten oder werden von deinem Paketmanager bereitgestellt, so dass du dir normalerweise keine Sorgen machen musst. Wenn du FreeCAD jedoch aus inoffiziellen Quellen installiert hast oder FreeCAD selbst kompiliert hast, k&ouml;nnten einige Teile fehlen, die f&uuml;r FreeCAD selbst nicht kritisch sind, aber dazu f&uuml;hren k&ouml;nnen, dass einige Funktionen nicht verf&uuml;gbar sind. Einige spezifische Dateiformate wie Collada oder DWG ben&ouml;tigen auch zus&auml;tzliche Komponenten, die nicht in FreeCAD geb&uuml;ndelt sind und von dir selbst separat installiert werden m&uuml;ssen. 
</p><p>Alle diese Komponenten und das empfohlende Vorgehen zu deren Installation sind auf der <a href="../de/Extra_python_modules.html" title="Extra python modules/de">Zus&auml;tzliche Python Module</a> Seite aufgef&uuml;hrt.
</p><p><span id="Troubleshooting"></span>
</p>
<h2><span class="mw-headline" id="Fehlersuche">Fehlersuche</span></h2>
<p><span id="Known_OS-specific_issues"></span>
</p>
<h3><span class="mw-headline" id="Bekannte_betriebssystemspezifische_Probleme">Bekannte betriebssystemspezifische Probleme</span></h3>
<p>Bekannte betriebssystemspezifische Probleme findet man in diesem <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=30573">Forum-Fade</a>.
</p><p><span id="FreeCAD_doesn't_start_at_all"></span>
</p>
<h3><span id="FreeCAD_startet_.C3.BCberhaupt_nicht"></span><span class="mw-headline" id="FreeCAD_startet_&uuml;berhaupt_nicht">FreeCAD startet &uuml;berhaupt nicht</span></h3>
<p>Daf&uuml;r kann es eine Menge Gr&uuml;nde geben, am wahrscheinlichsten fehlen einige Bibliotheken. Versuche FreeCAD von einem Terminal zu starten (schreibe <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">freecad</span> an der Eingabeaufforderung, <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">FreeCAD</span> auf einigen Systemen), um hier zu sehen, ob Fehlermeldungen erscheinen. Lies auch den Rest der dieser HGF, da es dir weitere Anhaltspunkte geben kann, um die Ursache des Problems aufzusp&uuml;ren. Wenn nichts hilft, berichte dar&uuml;ber im <a rel="nofollow" class="external text" href="https://forum.freecad.org/">Forum</a> davon, dort findet sich sicher jemand, der helfen kann.
</p><p>Auf einigen &auml;lteren Windows-XP-Systemen erh&auml;ltst du m&ouml;glicherweise eine Fehlermeldung wie diese: <i>Die Anwendung kann nicht gestartet werden, da die Side-by-Side Konfiguration falsch ist. Die Neuinstallation der Anwendung kann das Problem l&ouml;sen.</i> Der Grund f&uuml;r dieses Problem ist, dass auf dem System entweder die CRT Laufzeitbibliotheken fehlen oder die installierte Version zu alt ist, weil FreeCAD mit einer neueren Version verkn&uuml;pft wurde. In diesem Fall musst du das <i>Microsoft Visual C++ Redistributable Package</i> installieren, das du bei Microsoft findest. Siehe auch den entsprechenden <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?f=3&amp;t=1298&amp;p=9961">Forenbeitrag</a>.
</p><p><span id="FreeCAD_starts_normally,_but_not_all_icons_are_displayed,_some_of_them_are_replaced_by_a_black_'X'"></span>
</p>
<h3><span id="FreeCAD_startet_normal.2C_aber_nicht_alle_Symbole_werden_angezeigt._Einige_werden_durch_ein_schwarzes_.27X.27_ersetzt."></span><span class="mw-headline" id="FreeCAD_startet_normal,_aber_nicht_alle_Symbole_werden_angezeigt._Einige_werden_durch_ein_schwarzes_'X'_ersetzt.">FreeCAD startet normal, aber nicht alle Symbole werden angezeigt. Einige werden durch ein schwarzes 'X' ersetzt.</span></h3>
<p>Einige Teile von FreeCAD h&auml;ngen von dem externen Pythonmodul, genannt Pivy ab. Unter Windows ist Pivy in der FreeCAD Installation enthalten. Auf Debian/Ubuntu Systemen ist das python-pivy Paket Teil der Standardsoftware Repositorien. Auf anderen Systemen muss pivy derzeit selbst kompiliert werden. Auf anderen Systemen musst du pivy im Moment eventuell selbst kompilieren. Beachte, dass zwar einige Werkzeuge ohne pivy nicht verf&uuml;gbar sind, der Rest von FreeCAD aber normal funktioniert.
</p><p><span id="I_have_display_problems,_the_3D_view_doesn't_behave_correctly,_there_is_garbage_when_I_move/rotate_the_view,_etc."></span>
</p>
<h3><span id="Ich_habe_Anzeigeprobleme.2C_die_3D-Ansicht_verh.C3.A4lt_sich_nicht_korrekt.2C_es_gibt_M.C3.BCll.2C_wenn_ich_die_Ansicht_bewege.2Fdrehe.2C_usw."></span><span class="mw-headline" id="Ich_habe_Anzeigeprobleme,_die_3D-Ansicht_verh&auml;lt_sich_nicht_korrekt,_es_gibt_M&uuml;ll,_wenn_ich_die_Ansicht_bewege/drehe,_usw.">Ich habe Anzeigeprobleme, die 3D-Ansicht verh&auml;lt sich nicht korrekt, es gibt M&uuml;ll, wenn ich die Ansicht bewege/drehe, usw.</span></h3>
<p>FreeCAD ist f&uuml;r die Anzeige von 3D Inhalten abh&auml;ngig von OpenGL und ben&ouml;tigt daher eine funktionierende OpenGL Umgebung. Auf einigen Systemen ist OpenGL nicht standardm&auml;&szlig;ig aktiviert, und du musst m&ouml;glicherweise deine Grafiktreiber installieren oder aktualisieren. Dieses Problem tritt am h&auml;ufigsten auf Linux Systemen oder auf virtuellen Systemen auf. Wenn du dich auf einem Linuxbasierten System befindest, versuche die folgenden Schritte:
</p>
<ul><li>&Uuml;berpr&uuml;fe, ob dein Computer eine 3D-f&auml;hige Grafikkarte hat</li>
<li>gib <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">glxinfo</span> in ein Terminalfenster ein und &uuml;berpr&uuml;fe in der Ausgabe, ob Direct Rendering auf "yes" gesetzt ist und ob der OpenGL Anbieter/Renderer/die Version mit deiner Grafikkarte &uuml;bereinstimmt.</li>
<li>Installiere andere OpenGL-basierte Software (<a rel="nofollow" class="external text" href="http://www.blender.org">Blender</a>, zum Beispiel) und pr&uuml;fe, ob sie korrekt l&auml;uft und angezeigt wird.</li></ul>
<p><span id="FreeCAD_crashes_on_startup"></span>
</p>
<h3><span id="FreeCAD_st.C3.BCrzt_beim_Start_ab"></span><span class="mw-headline" id="FreeCAD_st&uuml;rzt_beim_Start_ab">FreeCAD st&uuml;rzt beim Start ab</span></h3>
<p>Ein Absturz k&ouml;nnte eine ernsthafteren Fehler andeuten oder ein Problem in deiner Konfiguration. Die meisten Abst&uuml;rze treten aus einem der beiden folgenden Gr&uuml;nde auf:
</p><p><span id="OpenGL_drivers_are_not_installed,_or_not_working_properly"></span>
</p>
<h4><span id="Die_OpenGL_Treiber_sind_nicht_installiert_oder_funktionieren_nicht_ordnungsgem.C3.A4.C3.9F"></span><span class="mw-headline" id="Die_OpenGL_Treiber_sind_nicht_installiert_oder_funktionieren_nicht_ordnungsgem&auml;&szlig;">Die OpenGL Treiber sind nicht installiert oder funktionieren nicht ordnungsgem&auml;&szlig;</span></h4>
<p>Dies ist eine sehr h&auml;ufige Ursache f&uuml;r das Problem. Die Symptome sind einfach, dass FreeCAD beim Start abst&uuml;rzt, oder immer dann, wenn du eine 3D-Ansicht &ouml;ffnest (z.B. durch Erstellen eines neuen Dokuments). Versuche herauszufinden, was f&uuml;r einen Grafikchip du hast, dann finde heraus, ob er <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/OpenGL">OpenGL</a> unterst&uuml;tzt (die meisten neueren Chips tun das), dann finde den richtigen Treiber und installieren ihn. Eine gute M&ouml;glichkeit, um zu &uuml;berpr&uuml;fen, ob OpenGL verf&uuml;gbar ist, ist der Versuch, eine andere OpenGL Anwendung wie <a rel="nofollow" class="external text" href="http://www.blender.org">blender</a> zu starten.
</p><p>Und als allgemeiner Tip, um mehr Informationen &uuml;ber Abst&uuml;rze mit FreeCAD zu erhalten, kannst du es mit dem Programmparameter <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">--write-log</span> starten. Dadurch wird die Datei <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">FreeCAD.log</span> in <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">$XDG_CONFIG_HOME/FreeCAD</span> (<span style="font-size:small;color:green;">0.20 und neuer</span>) oder   <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">$HOME/.FreeCAD</span> (<span style="font-size:small;color:blue;">0.19 und davor</span>) auf Linux, in<span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">$HOME/Library/Preferences/FreeCAD</span> unter macOS oder <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">%APPDATA%/FreeCAD</span> auf Windows-Systemen erstellt.
</p><p>In einigen seltenen F&auml;llen wurde vielleicht eine Grafiktreiber installiert, der nicht zur Grafikkarte passt. Wir hatten einen Fall, wo im Laptop des Benutzer eine Intel on-board Grafik verbaut war, aber einige ATI-Treiber installiert waren. Siehe (<a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?f=13&amp;t=5160&amp;start=10#p41042">FreeCAD startet nicht</a>).
Nach dem Entfernen der Dateien und der Neuinstallation des richtigen Treibers begann FreeCAD zu arbeiten.
</p><p><span id="Some_library,_needed_by_FreeCAD,_is_not_present_on_your_system,_or_wasn't_found_by_FreeCAD"></span>
</p>
<h4><span id="Eine_Bibliothek.2C_die_von_FreeCAD_ben.C3.B6tigt_wird.2C_ist_nicht_auf_Ihrem_System_vorhanden_oder_wurde_von_FreeCAD_nicht_gefunden"></span><span class="mw-headline" id="Eine_Bibliothek,_die_von_FreeCAD_ben&ouml;tigt_wird,_ist_nicht_auf_Ihrem_System_vorhanden_oder_wurde_von_FreeCAD_nicht_gefunden">Eine Bibliothek, die von FreeCAD ben&ouml;tigt wird, ist nicht auf Ihrem System vorhanden oder wurde von FreeCAD nicht gefunden</span></h4>
<p>Es kann zwei Wege zu diesem Problem geben: entweder fehlt einfach eine Bibliothek und FreeCAD weigert sich deshalb zu starten, oder die Bibliothek ist zwar vorhanden, aber es ist eine &auml;ltere Version als die, die FreeCAD erwartet, so dass ein Absturz auftritt, wenn FreeCAD versucht, eine fehlende Funktion dieser Bibliothek zu verwenden. Ein h&auml;ufiges Beispiel ist, wenn du Qt3 und Qt4 auf deinem System installiert hast. FreeCAD k&ouml;nnte Qt4 erkennen, aber wenn deine Qt Installation nicht richtig konfiguriert ist, k&ouml;nnten einige Teile von Qt3 noch verwendet werden, was Abst&uuml;rze provoziert.
</p><p>Bitte &uuml;berpr&uuml;fe die Installationsprozedur (<a href="../de/Installing_on_Windows.html" title="Installing on Windows/de">Windows</a>, <a href="../de/Installing_on_Linux.html" title="Installing on Linux/de">Linux</a> oder <a href="../de/Installing_on_Mac.html" title="Installing on Mac/de">Mac</a>), stelle sicher, dass du alle erforderlichen Bibliotheken installiert hast (auf den meisten Linux-Systemen geschieht dies automatisch), und &uuml;berpr&uuml;fe, was die minimale Versionsnummer f&uuml;r jede der Komponenten ist.
</p><p>Wenn alles richtig aussieht, beschreibe das Problen im <a rel="nofollow" class="external text" href="https://forum.freecad.org/">Forum</a> oder <a href="../de/Tracker.html" title="Tracker/de">Einen Fehler &uuml;bermitteln</a>. Wenn Du auf einem Linux-System bist, ist es einfach, eine Fehlerr&uuml;ckverfolung zu erstellen, der f&uuml;r die Entwickler sehr wichtige Informationen &uuml;ber den Absturz liefert:
</p>
<ul><li>Tippe in einem Terminal <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">gdb freecad</span> (vorausgesetzt, das gdb Paket ist installiert)</li>
<li>In gdb, tippe <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">run</span></li>
<li>Nach dem Absturz tippe <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">bt</span>, um die R&uuml;ckverfolgung zu erhalten, die an deinen Fehlerbericht angef&uuml;gt werden kann.</li></ul>
<p><span id="FreeCAD_freezes_after_startup"></span>
</p>
<h3><span class="mw-headline" id="FreeCAD_friert_nach_dem_Hochfahren_ein">FreeCAD friert nach dem Hochfahren ein</span></h3>
<p>Beim Starten von FreeCAD erscheint die GUI fast augenblicklich, aber die GUI ist eingefroren und die CPU Auslastung bei ungef&auml;hr 99%. Das kann auf dem KDE Desktop passieren, wenn man das Oxygen Theme benutzt. Das ist ein Fehler im Oxygen Theme und die Wahl eines anderen Themes sollte das Problem l&ouml;sen.
</p><p><span id="FreeCAD_crashes_on_creating_a_new_document_or_opening_a_file"></span>
</p>
<h3><span id="FreeCAD_st.C3.BCrzt_beim_Erstellen_eines_neuen_Dokuments_oder_.C3.96ffnen_einer_Datei_ab"></span><span class="mw-headline" id="FreeCAD_st&uuml;rzt_beim_Erstellen_eines_neuen_Dokuments_oder_&Ouml;ffnen_einer_Datei_ab">FreeCAD st&uuml;rzt beim Erstellen eines neuen Dokuments oder &Ouml;ffnen einer Datei ab</span></h3>
<p>Wenn FreeCAD beim Erstellen einer neuen 3D-Ansicht abst&uuml;rzt, versuche, FreeCAD &uuml;ber ein Terminal zu starten. Wenn beim Absturz eine Fehlermeldung erscheint, die <span style="font-weight:normal; font-family:monospace, Consolas, Courier New, Courier; border: 1px solid #d8d8d8; padding: 2px 5px 2px 5px;">Assertion Failed</span> und einen Komponentennamen, der mit "So" beginnt (<span style="font-weight:normal; font-family:monospace, Consolas, Courier New, Courier; border: 1px solid #d8d8d8; padding: 2px 5px 2px 5px;">SoBase</span>, <span style="font-weight:normal; font-family:monospace, Consolas, Courier New, Courier; border: 1px solid #d8d8d8; padding: 2px 5px 2px 5px;">SoFieldContainer</span>, usw.), erw&auml;hnt, ist die Wahrscheinlichkeit sehr hoch, besonders wenn du unter Linux arbeitest, dass FreeCAD versucht, zwei verschiedene Versionen der Coin Bibliothek zu verwenden, was den Absturz verursacht.
Um zu &uuml;berpr&uuml;fen, ob dies tats&auml;chlich das Problem ist, versuche Folgendes:
</p>
<ul><li>Suche die ausf&uuml;hrbare Datei von FreeCAD (normalerweise in <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">/usr/lib/FreeCAD/bin</span>)</li>
<li>F&uuml;hre den Befehl <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">ldd FreeCAD</span> in einem Terminal aus</li>
<li>Notiere dir die Version der Bibliothek <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">libCoin.so</span>, die FreeCAD verwendet (zum Beispiel <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">libCoin.so.60</span>)</li>
<li>Suche die Bibliothek <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">libSoQt.so</span> (normalerweise in <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">/usr/lib</span>)</li>
<li>F&uuml;hre <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">ldd libSoQt.so</span> aus und pr&uuml;fe, ob es auf die gleiche Coin Version wie FreeCAD verweist.</li></ul>
<p>Wenn es einen Unterschied gibt, muss entweder FreeCAD oder SoQt neu kompiliert werden (besser ist es, dasjenige neu zu kompilieren, das die &auml;lteste Coin Version verwendet). Normalerweise sollte man versuchen, die Leute zu kontaktieren, die f&uuml;r das Paketieren von SoQt oder FreeCAD verantwortlich sind, und sie freundlich bitten, eine Neukompilierung in Betracht zu ziehen.
Wenn du diesen Schritt selbst unternehmen willst, und es nicht m&ouml;glich ist, SoQt neu zu kompilieren, weil es andere Anwendungen auf deinem System kaputt macht, kannst du FreeCAD mit <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">./configure --with-coin=DIR</span> zwingen, mit der ben&ouml;tigten Coin-Version zu kompilieren. Du musst aber sicherstellen, dass das richtige Entwicklungspaket dieser Coin-Version installiert ist.
</p><p><span id="FreeCAD_crashes_after_Edit_&rarr;_Alignment"></span>
</p>
<h3><span id="FreeCAD_st.C3.BCrzt_nach_Bearbeiten_.E2.86.92_Ausrichtung_ab"></span><span class="mw-headline" id="FreeCAD_st&uuml;rzt_nach_Bearbeiten_&rarr;_Ausrichtung_ab">FreeCAD st&uuml;rzt nach Bearbeiten &rarr; Ausrichtung ab</span></h3>
<p>Ein Segmentierungsfehler tritt bei <span style="font-weight:normal; font-family:monospace, Consolas, Courier New, Courier; border: 1px solid #d8d8d8; padding: 2px 5px 2px 5px;">vbo_save_playback_vertex_list()</span> auf. Dies bedeutet, dass die Implementierung von VBO im Grafiktreiber schlecht ist. Um das Zwischenspeichern von OpenGL Aufrufen zu vermeiden, kannst du versuchen, die Umgebungsvariable <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">IV_SEPARATOR_MAX_CACHES=0</span> zu setzen und FreeCAD neu zu starten.
</p><p><span id="I_cannot_change_numeric_values_in_FreeCAD's_properties_panels"></span>
</p>
<h3><span id="Ich_kann_keine_numerischen_Werte_in_den_Eigenschaftenfeldern_von_FreeCAD_.C3.A4ndern"></span><span class="mw-headline" id="Ich_kann_keine_numerischen_Werte_in_den_Eigenschaftenfeldern_von_FreeCAD_&auml;ndern">Ich kann keine numerischen Werte in den Eigenschaftenfeldern von FreeCAD &auml;ndern</span></h3>
<figure class="mw-halign-left" typeof="mw:File"><a href="../index.php?title=Jj62l.png&amp;filetimestamp=20130423090237&amp;.html" class="mw-file-description" title="Sprachoptionen"><img alt="Sprachoptionen" src="../File/Jj62l.png" decoding="async" width="480" height="297" class="mw-file-element" data-file-width="981" data-file-height="607"></a><figcaption>Sprachoptionen</figcaption></figure>
<p>H&ouml;chstwahrscheinlich hast du die regionalen Einstellungen von Windows falsch eingestellt. Bitte pr&uuml;fe, ob du in deinen L&auml;ndereinstellungen das gleiche Symbol f&uuml;r das Dezimaltrennzeichen und das Symbol f&uuml;r die Zifferngruppierung hast. Wenn ja, <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?f=4&amp;t=2655&amp;p=20046#p20041">passe deine Systemeinstellungen an</a>, um unterschiedliche Zeichen f&uuml;r das Zifferngruppensymbol und das Dezimaltrennzeichen zu verwenden. Beachte, dass der Punkt als Dezimaltrennzeichen nicht zwingend erforderlich ist. Es ist zwingend erforderlich, in diesen beiden Einstellungen unterschiedliche Symbole zu verwenden.
</p>
<div style="clear:both"></div>
<p><span id="FreeCAD_was_running_normally,_and_suddenly_it_doesn't_start_anymore"></span>
</p>
<h3><span id="FreeCAD_lief_normal.2C_aber_pl.C3.B6tzlich_startet_es_nicht_mehr"></span><span class="mw-headline" id="FreeCAD_lief_normal,_aber_pl&ouml;tzlich_startet_es_nicht_mehr">FreeCAD lief normal, aber pl&ouml;tzlich startet es nicht mehr</span></h3>
<p>Dies kann auch passieren, wenn du eine &auml;ltere Version von FreeCAD installiert hattest und auf eine neuere Version aktualisiert hast. Bei diesem Proze&szlig; k&ouml;nnten die Konfigurationsdateien von FreeCAD aus irgendeinem Grund besch&auml;digt worden sein, und nun kann FreeCAD sie nicht mehr lesen und startet nicht mehr. Die L&ouml;sung ist einfach, diese Konfigurationsdateien zu l&ouml;schen, so dass FreeCAD sie beim ersten Lauf neu erstellt.
</p>
<ul><li>Auf Windows: &Ouml;ffne den Datei Explorer und schreibe <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">%APPDATA%\FreeCAD</span> als Dateipfad. Dort angekommen, l&ouml;sche dort die Dateien <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">user.cfg</span> und <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">system.cfg</span></li>
<li>Auf Linux: Navigiere zu <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">/home/USERNAME/.local/share/FreeCAD</span> (<span style="font-size:small;color:green;">0.20 und neuer</span>) oder <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">/home/USERNAME/.FreeCAD</span> (<span style="font-size:small;color:blue;">0.19 und davor</span>) und l&ouml;sche dort die Dateien <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">user.cfg</span> und <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">system.cfg</span></li>
<li>Auf Mac: Navigiere zu <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">/Users/USERNAME/Library/Preferences/FreeCAD</span> und l&ouml;sche dort die Dateien <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">user.cfg</span> und <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">system.cfg</span></li></ul>
<p>FreeCAD sollte nun wieder normal, mit allen Einstellungen zur&uuml;ckgesetzt, starten.
</p><p><br>
Es gibt ein <a href="../de/Macro_findConfigFiles.html" title="Macro findConfigFiles/de">Makro findeKonfigDateien</a>, das beim Auffinden deiner Konfigurationsdateien hilft  Es kann &uuml;ber den Addon-Manager im Men&uuml; Extras installiert werden.  <b>Werkzeuge &rarr; Addon-Manager &rarr; Makros &rarr; findConfigFiles</b>.  Das Makro findet deinen Konfigurationsdateiordner, kopiert ihn in die Zwischenablage und (versucht), diesen Ort mit deinem Standard-Dateibrowser zu &ouml;ffnen. Es nimmt keine &Auml;nderungen an deinen Dateien oder Einstellungen vor.
</p><p><span id="Using_FreeCAD"></span>
</p>
<h2><span class="mw-headline" id="FreeCAD_benutzen">FreeCAD benutzen</span></h2>
<p><span id="Is_FreeCAD_really_free?_Even_for_commercial_use?"></span>
</p>
<h3><span id="Ist_FreeCAD_wirklich_kostenlos.3F_Sogar_f.C3.BCr_kommerzielle_Nutzung.3F"></span><span class="mw-headline" id="Ist_FreeCAD_wirklich_kostenlos?_Sogar_f&uuml;r_kommerzielle_Nutzung?">Ist FreeCAD wirklich kostenlos? Sogar f&uuml;r kommerzielle Nutzung?</span></h3>
<p>FreeCAD ist <a rel="nofollow" class="external text" href="https://de.wikipedia.org/wiki/Open_Source">Open-Source-Software</a> und ist nicht nur frei, um es f&uuml;r sich selbst oder f&uuml;r kommerzielle Zwecke zu nutzen, sondern auch, um es zu verteilen, zu modifizieren oder sogar in einer Closed-Source-Anwendung zu verwenden. Zusammenfassend, du bist frei (fast) alles damit machen zu k&ouml;nnen, was du willst. Siehe die <a href="../de/License.html" title="License/de">Lizenz</a>-Seite f&uuml;r weitere Details.
</p><p><span id="How_do_I_rotate_the_3D_view?"></span>
</p>
<h3><span id="Wie_drehe_ich_die_3D-Ansicht.3F"></span><span class="mw-headline" id="Wie_drehe_ich_die_3D-Ansicht?">Wie drehe ich die 3D-Ansicht?</span></h3>
<center>
<ul class="gallery mw-gallery-traditional">
		<li class="gallerybox" style="width: 335px">
			<div class="thumb" style="width: 330px; height: 230px;"><span typeof="mw:File"><a href="../index.php?title=Style_of_navigation.png&amp;filetimestamp=20240425200410&amp;.html" class="mw-file-description" title="Von der rechten Maustaste"><img alt="Von der rechten Maustaste" src="../File/Style_of_navigation.png" decoding="async" width="165" height="200" class="mw-file-element" data-file-width="336" data-file-height="407"></a></span></div>
			<div class="gallerytext">Von der <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">rechten Maustaste</span></div>
		</li>
		<li class="gallerybox" style="width: 335px">
			<div class="thumb" style="width: 330px; height: 230px;"><span typeof="mw:File"><a href="../index.php?title=Style_of_navigation_menu.png&amp;filetimestamp=20240425201620&amp;.html" class="mw-file-description" title="Vom Men&uuml; Bearbeiten &rarr; Einstellungen &rarr;"><img alt="Vom Men&uuml; Bearbeiten &rarr; Einstellungen &rarr;" src="../File/Style_of_navigation_menu.png" decoding="async" width="300" height="198" class="mw-file-element" data-file-width="708" data-file-height="467"></a></span></div>
			<div class="gallerytext">Vom Men&uuml; <b>Bearbeiten &rarr; Einstellungen &rarr;</b></div>
		</li>
</ul>
</center>
<div style="clear:both"></div>
<p>FreeCAD verf&uuml;gt &uuml;ber mehrere verschiedene <a href="../de/Mouse_navigation.html" title="Mouse navigation/de">Navigationsmodi</a>, die man im Einstellungsdialog einstellen oder durch einen Rechtsklick in der 3D-Ansicht &auml;ndern kann. Ausf&uuml;hrliche Informationen zu den Modi finden sich auf der Seite <a href="../de/Mouse_navigation.html" title="Mouse navigation/de">Mausnavigation</a>.
</p>
<div style="clear:both"></div>
<p><span id="What_can_I_do_with_FreeCAD?_Where_do_I_start?"></span>
</p>
<h3><span id="Was_kann_ich_mit_FreeCAD_tun.3F_Wo_soll_ich_anfangen.3F"></span><span class="mw-headline" id="Was_kann_ich_mit_FreeCAD_tun?_Wo_soll_ich_anfangen?">Was kann ich mit FreeCAD tun? Wo soll ich anfangen?</span></h3>
<p>Mach dich auf zur  <a href="../de/Getting_started.html" title="Getting started/de">Erste Schritte</a> Seite f&uuml;r eine kurze Beschreibung der Werkzeuge, die du verwenden kannst. Es gibt auch einen neuen Abschnitt <a href="../de/Tutorials.html" title="Tutorials/de">Tutorien</a> mit einigen Ressourcen. Der <a href="../de/User_hub.html" title="User hub/de">Anwenderzentrums</a> Abschnitt enth&auml;lt detailliertere Informationen &uuml;ber die verschiedenen Arbeitsbereiche von FreeCAD. Da FreeCAD relativ neu ist, ist die Benutzeroberfl&auml;che noch sehr kahl und bietet nicht viele Werkzeuge. Aber viel mehr fortgeschrittene Funktionalit&auml;t steht dir bereits &uuml;ber <a href="../de/Power_users_hub.html" title="Power users hub/de">Python Skripten</a> zur Verf&uuml;gung.
</p><p><span id="Is_there_documentation_for_newcomers?_How_can_I_learn_to_use_FreeCAD?"></span>
</p>
<h3><span id="Gibt_es_Dokumentation_f.C3.BCr_Neueinsteiger.3F_Wie_kann_ich_die_Benutzung_von_FreeCAD_lernen.3F"></span><span class="mw-headline" id="Gibt_es_Dokumentation_f&uuml;r_Neueinsteiger?_Wie_kann_ich_die_Benutzung_von_FreeCAD_lernen?">Gibt es Dokumentation f&uuml;r Neueinsteiger? Wie kann ich die Benutzung von FreeCAD lernen?</span></h3>
<p>Es gibt eine Menge Dokumentation, die an verschiedenen Stellen verteilt ist, sowohl auf der FreeCAD-Webseite als auch au&szlig;erhalb. Du solltest mit der Seite <a href="../de/Getting_started.html" title="Getting started/de">Erste Schritte</a> beginnen. Der Bereich <a href="../de/Tutorials.html" title="Tutorials/de">Anleitungen</a> enth&auml;lt viele spezialisierte Tutorienseiten, die dir den Einstieg in die verschiedenen Arbeitsbereiche erleichtern. Das <a href="../de/Manual;Introduction.html" title="Manual:Introduction/de">Handbuch:Einf&uuml;hrung</a> ist eine allgemeine, vollst&auml;ndige, benutzerorientierte Anleitung zu FreeCAD. Der Abschnitt <a href="../de/User_hub.html" title="User hub/de">Anwenderzentrum</a> dieses Wikis listet alle Seiten auf, die sich an Endanwender richten. Auf externen Seiten wie z.B. <a rel="nofollow" class="external text" href="https://www.youtube.com/results?search_query=freecad">Youtube</a> findest du auch eine Menge von Video-Anleitungen, die von Benutzern erstellt wurden. Und nicht zuletzt enth&auml;lt das <a rel="nofollow" class="external text" href="https://forum.freecad.org">Forum</a> eine Menge Antworten auf Fragen, die von anderen Neulingen gestellt wurden.
</p><p><span id="I_want_to_import/export_data_in_format_XYZ_to/from_FreeCAD._How_do_I_do_that?"></span>
</p>
<h3><span id="Ich_m.C3.B6chte_Daten_im_XYZ_Format_nach.2Fvon_FreeCAD_im-.2Fexportieren._Wie_mache_ich_das.3F"></span><span class="mw-headline" id="Ich_m&ouml;chte_Daten_im_XYZ_Format_nach/von_FreeCAD_im-/exportieren._Wie_mache_ich_das?">Ich m&ouml;chte Daten im XYZ Format nach/von FreeCAD im-/exportieren. Wie mache ich das?</span></h3>
<p>Bitte nutze die Seite <a href="../FreeCAD_Howto_Import_Export.html" title="FreeCAD Howto Import Export">FreeCAD Howto Import Export</a>. Vielleicht werden Deine Fragen dort bereits beantwortet.
</p><p><span id="Where_can_I_find_workarounds_for_features_that_FreeCAD_currently_does_not_support?"></span>
</p>
<h3><span id="Wo_finde_ich_Behelfsl.C3.B6sungen_f.C3.BCr_Funktionen.2C_die_FreeCAD_derzeit_nicht_unterst.C3.BCtzt.3F"></span><span class="mw-headline" id="Wo_finde_ich_Behelfsl&ouml;sungen_f&uuml;r_Funktionen,_die_FreeCAD_derzeit_nicht_unterst&uuml;tzt?">Wo finde ich Behelfsl&ouml;sungen f&uuml;r Funktionen, die FreeCAD derzeit nicht unterst&uuml;tzt?</span></h3>
<p>Man beachte die Seite <a href="../de/Workarounds.html" title="Workarounds/de">Behelfsl&ouml;sungen</a>.
</p><p><span id="Working_with_Part_geometry"></span>
</p>
<h2><span class="mw-headline" id="Arbeiten_mit_Part_Geometrie">Arbeiten mit Part Geometrie</span></h2>
<p><span id="How_do_I_extrude_stuff_into_solids?_I_don't_get_the_right_result"></span>
</p>
<h3><span id="Wie_extrudiere_ich_Sachen_in_Festk.C3.B6rper.3F_Ich_erhalte_nicht_das_richtige_Ergebnis"></span><span class="mw-headline" id="Wie_extrudiere_ich_Sachen_in_Festk&ouml;rper?_Ich_erhalte_nicht_das_richtige_Ergebnis">Wie extrudiere ich Sachen in Festk&ouml;rper? Ich erhalte nicht das richtige Ergebnis</span></h3>
<p>Die Theorie ist einfach: Linien (oder Linienz&uuml;ge) bilden beim Extrudieren Fl&auml;chen. Fl&auml;chen bilden beim Extrudieren Volumenk&ouml;rper.
</p><p>Wenn du etwas extrudierst und das Ergebnis kein Festk&ouml;rper ist, dann war das Etwas keine Fl&auml;che. Wenn du Linien hast und daraus einen Festk&ouml;rper extrudieren willst, musst du zuerst Linien ausw&auml;hlen, die einen geschlossenen Umriss bilden (w&auml;hle mehrere Objekte durch Dr&uuml;cken von <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">Ctrl</span> aus), verbinde sie zu einem Draht (Werkzeug <a href="../de/Draft_Upgrade.html" title="Draft Upgrade/de">Draft Heraufstufen</a>) und mache dann aus diesem Draht eine Fl&auml;che (nochmals Werkzeug<span typeof="mw:File"><a href="../index.php?title=Draft_Upgrade.svg&amp;filetimestamp=20210319102935&amp;.html" class="mw-file-description"><img src="../File/Draft_Upgrade.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../de/Draft_Upgrade.html" title="Draft Upgrade/de">Draft Heraufstufen</a>). So, wenn alles gut gegangen ist, kannst du jetzt zu einem Festk&ouml;rper extrudieren.
</p><p>Nun kann es viele kleine Verdrehungen geben, die dazu f&uuml;hren, dass du das falsche Ergebnis erh&auml;lst. Der beste Weg, um sicher zu gehen, ist zu &uuml;berpr&uuml;fen, was sich im Inneren des Objekts befindet, das du extrudierst. Der Inhalt von Objekten kann mit Python leicht erforscht werden. Angenommen, du hast ein Objekt mit dem Namen "Wire", dann k&ouml;nntest du dies in die Python Konsole eingeben:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">obj</span> <span class="o">=</span> <span class="n">FreeCAD</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">Wire</span>
<span class="n">shp</span> <span class="o">=</span> <span class="n">obj</span><span class="o">.</span><span class="n">Shape</span>
<span class="nb">print</span> <span class="n">shp</span><span class="o">.</span><span class="n">Faces</span>
<span class="nb">print</span> <span class="n">shp</span><span class="o">.</span><span class="n">Wires</span>
<span class="k">if</span> <span class="n">shp</span><span class="o">.</span><span class="n">Wires</span><span class="p">:</span>
    <span class="k">for</span> <span class="n">w</span> <span class="ow">in</span> <span class="n">shp</span><span class="o">.</span><span class="n">Wires</span><span class="p">:</span>
        <span class="nb">print</span> <span class="n">w</span><span class="o">.</span><span class="n">isClosed</span><span class="p">()</span>
</pre></div>
<p>Der obige Code ruft die Form von einem Objekt ab, zeigt die Fl&auml;chen und Dr&auml;hte an, die dein Objekt hat (falls vorhanden), und druckt, wenn Dr&auml;hte vorhanden sind, ob diese Dr&auml;hte geschlossen sind. Wenn du keine Fl&auml;che hast, erh&auml;lst du keinen Festk&ouml;rper. Wenn es keinen geschlossenen Draht gibt, wird er nicht zu einer Fl&auml;che. Wenn du daran interessiert bist, gibt es auf der Seite <a href="../de/Topological_data_scripting.html" title="Topological data scripting/de">Part Skripten</a> mehr Informationen dar&uuml;ber, was du mit Python &uuml;berpr&uuml;fen kannst. Wenn du mehrere Linien nicht zu einem Draht zusammenf&uuml;gen kannst, ist die wahrscheinlichste Ursache, dass sich deine Endpunkte nicht treffen, es m&uuml;ssen kleine L&uuml;cken zwischen (einigen) von ihnen sein. Da w&auml;re es meiner Erfahrung nach am schnellsten, einen Draht dar&uuml;ber neu zu zeichnen.
</p><p><span id="My_boolean_operations_fail,_or_give_weird_results"></span>
</p>
<h3><span id="Meine_booleschen_Operationen_schlagen_fehl_oder_liefern_merkw.C3.BCrdige_Ergebnisse"></span><span class="mw-headline" id="Meine_booleschen_Operationen_schlagen_fehl_oder_liefern_merkw&uuml;rdige_Ergebnisse">Meine booleschen Operationen schlagen fehl oder liefern merkw&uuml;rdige Ergebnisse</span></h3>
<p>Wie alle Kernel zum Modellieren von Festk&ouml;rpern hat auch der Kernel zum geometrischen Modellieren von <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Open_CASCADE_Technology">Open CASCADE</a>, der in FreeCAD f&uuml;r die Geometrie von Part-Objekten verwendet wird, seine Schw&auml;chen und Einschr&auml;nkungen, auch wenn er wahrscheinlich der beste zur Verf&uuml;gung stehende quelloffene Geometrie-Kernel ist. Boolesche Verkn&uuml;pfungen (Vereinigung, Differenz, Schnitt) sind komplizierte Vorg&auml;nge und liefern oft seltsame Ergebnisse. Dies ist derzeit eine Einschr&auml;nkung, die wir nicht auf einen Schlag l&ouml;sen k&ouml;nnen, daher ist es am besten, wenn man versuchst, das gew&uuml;nschte Ergebnis durch eine andere Art des Modellierens zu erhalten. Zum Beispiel k&ouml;nnen Probleme mit Grundelementen wie Zylindern oft gel&ouml;st werden, indem man stattdessen einen extrudierten Kreis verwendet. Komplanare Fl&auml;chen zwischen Teilen k&ouml;nnen Probleme verursachen, ebenso wie tangierende Fl&auml;chen. Als allgemeine Regel gilt: Wenn eine Form nicht funktioniert, versuche, sie auf eine andere Weise umzuformen. In 99&nbsp;% der F&auml;lle wird man am Ende das gew&uuml;nschte Ergebnis erhalten.
</p><p>Um boolesche Operationen besser zu verstehen, liest man bitte die folgenden Artikel:
</p>
<ul><li><a rel="nofollow" class="external free" href="https://wiki.mcneel.com/rhino/booleanfaq">https://wiki.mcneel.com/rhino/booleanfaq</a></li>
<li><a rel="nofollow" class="external free" href="https://dev.opencascade.org/doc/overview/html/specification__boolean_operations.html#autotoc_md293">https://dev.opencascade.org/doc/overview/html/specification__boolean_operations.html#autotoc_md293</a></li></ul>
<p><span id="When_I_export_(or_view)_my_model,_the_holes_are_filled_in"></span>
</p>
<h3><span id="Wenn_ich_mein_Modell_exportiere_.28oder_anzeige.29.2C_werden_die_L.C3.B6cher_ausgef.C3.BCllt"></span><span class="mw-headline" id="Wenn_ich_mein_Modell_exportiere_(oder_anzeige),_werden_die_L&ouml;cher_ausgef&uuml;llt">Wenn ich mein Modell exportiere (oder anzeige), werden die L&ouml;cher ausgef&uuml;llt</span></h3>
<p>Verwende nicht <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">Strg</span> + <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">A</span> (Alles ausw&auml;hlen), um alles aus dem Hierarchiebaum zu exportieren.  Wenn das Modell aus einem einzigen Element besteht, versuche, nur das neueste Element (normalerweise das letzte) im Hierarchiebaum auszuw&auml;hlen.
</p><p>Wenn wir ein Modell im Arbeitsbereich <a href="../de/PartDesign_Workbench.html" title="PartDesign Workbench/de">PartDesign</a> erstellen, nimmt jedes Formelement die Form des letzten an und f&uuml;gt etwas hinzu oder entfernt etwas, wodurch lineare Abh&auml;ngigkeiten von Formelement zu Formelement entstehen, w&auml;hrend das Modell erstellt wird. Ein "Schnitt" Formelement ist also nicht nur das Schnittloch selbst, sondern das ganze Teil mit dem Schnitt. Aus diesem Grund sollte der Benutzer in der Regel nur das neueste Element (Formelement) im Modellbaum sichtbar haben, da sich sonst die Phasen des Modells &uuml;berlagern und L&ouml;cher von den fr&uuml;heren Modell-Formelementen ausgef&uuml;llt werden.
</p><p>Um die Sichtbarkeit eines Objekts ein- oder auszuschalten, w&auml;hle es im Hierarchiebaum aus und dr&uuml;cke die <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">Leertaste</span> auf deiner Tastatur. Normalerweise sollte alles bis auf das letzte Element im Hierarchiebaum ausgegraut und damit in der <a href="../de/3D_View.html" title="3D View/de">3D-Ansicht</a> nicht sichtbar sein.
</p><p><span id="My_parametric_objects_break_when_I_modify_their_base_sketches"></span>
</p>
<h3><span id="Meine_parametrischen_Objekte_gehen_kaputt.2C_wenn_ich_ihre_Basisskizzen_.C3.A4ndere"></span><span class="mw-headline" id="Meine_parametrischen_Objekte_gehen_kaputt,_wenn_ich_ihre_Basisskizzen_&auml;ndere">Meine parametrischen Objekte gehen kaputt, wenn ich ihre Basisskizzen &auml;ndere</span></h3>
<p>Du bist auf das (un)bekannte <a href="../de/Topological_naming_problem.html" title="Topological naming problem/de">Problem der topologischen Benennung</a> (Topological Naming Problem, TNP) Problem getroffen. Dies mag noch immer ein gro&szlig;es Problem f&uuml;r Neueinsteiger in FreeCAD darstellen. Es kann &uuml;berall in FreeCAD vorhanden, tritt aber bei der Verwendung von <a href="../de/Sketcher_Workbench.html" title="Sketcher Workbench/de">Skizzen</a> st&auml;rker hervor. Die Erkl&auml;rung ist einfach: Beim Neuberechnen einer Skizze werden die geometrischen Elemente (Kanten, Fl&auml;chen...) in einer anderen Reihenfolge neu aufgebaut, abh&auml;ngig von der Priorit&auml;t der Randbedingungen. Sie erhalten dann einen anderen Namen (Kante1, Kante2, Fl&auml;che1, Fl&auml;che2...). Die meisten nachfolgenden Operationen h&auml;ngen von diesen Namen ab, um zu identifizieren, an welcher Unterkomponente sie arbeiten. Wenn die Skizze neu erstellt wird, kann es daher vorkommen, dass Formelemente, die auf solchen Unterkomponenten basieren, pl&ouml;tzlich ihre Basisgeometrie ge&auml;ndert bekommen und ein falsches Ergebnis liefern.
</p><p><span style="font-size:small;"><a href="../de/Release_notes_1.0.html" title="Release notes 1.0/de">eingef&uuml;hrt in 1.0</a></span>: Der Code f&uuml;r die Verminderung von TNP ist implementiert, kann das Problem aber nur teilweise beseitigen und Anwender sollten sich noch immer an die untenstehenden guten Ratschl&auml;ge halten:
</p>
<ul><li>Du musst wissen, dass Skizzen sehr empfindlich auf das Problem reagieren. Das Referenzieren einer bestimmten Kante einer Skizze oder einer Fl&auml;che eines Objekts, das auf einer Skizze aufgebaut ist, wie z. B. ein <a href="../de/PartDesign_Pad.html" title="PartDesign Pad/de">PartDesign Polster</a>, ist gef&auml;hrlich, es sei denn, du bist dir ziemlich sicher, dass sich diese Skizzen im Laufe der Zeit nicht &auml;ndern werden oder die Skizze sehr einfach ist. Ein Polster, das auf einer einfachen rechteckigen Skizze aufgebaut ist, ist z. B. wahrscheinlich sicher, da es nur eine Fl&auml;che erzeugt, so dass es kein Ordnungsproblem gibt.</li>
<li>Bevorzuge andere Arten von Objekten wie <a href="../de/Part_Workbench.html" title="Part Workbench/de">Part</a> oder <a href="../de/Draft_Workbench.html" title="Draft Workbench/de">Entwurf</a>, wenn m&ouml;glich. Diese Objekte werden immer auf die gleiche Art und Weise gebaut, und daher folgen ihre geometrischen Komponenten normalerweise jedes Mal der gleichen Reihenfolge, wenn sie neu gebaut werden. Sie sind viel weniger anf&auml;llig f&uuml;r Topobenennung Probleme.</li>
<li>Um weitere Objekte an die Fl&auml;chen von skizzenbasierter Geometrie anzuh&auml;ngen, verwende  vorzugsweise <a href="../de/PartDesign_Plane.html" title="PartDesign Plane/de">Bezugsgeometrie</a>. Diese unsichtbaren "Hilfsobjekte" sind nicht von der Skizzengeometrie abh&auml;ngig und bleiben daher &uuml;ber die Zeit stabil.</li></ul>
<p><span id="Contributing_to_FreeCAD"></span>
</p>
<h2><span class="mw-headline" id="Zu_FreeCAD_beitragen">Zu FreeCAD beitragen</span></h2>
<p><span id="FreeCAD_is_such_a_great_program!_How_can_I_help?"></span>
</p>
<h3><span id="FreeCAD_ist_so_ein_tolles_Programm.21_Wie_kann_ich_helfen.3F"></span><span class="mw-headline" id="FreeCAD_ist_so_ein_tolles_Programm!_Wie_kann_ich_helfen?">FreeCAD ist so ein tolles Programm! Wie kann ich helfen?</span></h3>
<p>Es gibt viele verschiedene M&ouml;glichkeiten zu helfen, auch wenn du kein Programmierer bist. Hier sind ein paar Dinge, die du tun kannst:
</p>
<ul><li>Gib den FreeCAD Entwicklern eine R&uuml;ckmeldung: Es ist immer n&uuml;tzlich zu wissen, was die Leute denken, was sie gut fanden, was sie vermissen, etc. Schreibe eine Notiz im <a rel="nofollow" class="external text" href="https://forum.freecad.org/">Forum</a> und teile deine Meinung mit oder stelle eine Anfrage in unserem Abschnitt <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/issues">Issues</a>!</li>
<li>Hilf beim Schreiben der Dokumentation: Die Dokumentation, die wir hier auf dieser Seite haben, ist manchmal sehr begrenzt. Wenn du etwas entdeckt hast, das nicht gut dokumentiert ist, f&uuml;ge dein Wissen dort hinzu!</li>
<li>Hilf anderen Neulingen: H&auml;nge im Forum herum und hilf Neulingen, grundlegende Fragen zu l&ouml;sen, wie z.B. wie installiere ich, wie f&uuml;ge ich einen W&uuml;rfel hinzu, usw.</li>
<li><a href="../de/Help_FreeCAD.html#%C3%9Cbersetze_die_Dokumentation" title="Help FreeCAD/de">&Uuml;bersetze die Dokumentation</a> in deine eigene Sprache</li>
<li><a href="../de/Help_FreeCAD.html#%C3%9Cbersetzen_FreeCAD" title="Help FreeCAD/de">&Uuml;bersetze FreeCAD</a> in deine eigene Sprache</li>
<li>Schreibe <a href="../de/Tutorials.html" title="Tutorials/de">Tutorien</a>, oder nehme Videotutorien auf: Tutorien sind ein sehr einfacher Weg f&uuml;r Neulinge, eine neue Software zu erlernen. Wenn du etwas Sch&ouml;nes gemacht hast, warum zeigst du es nicht anderen Leuten, wie es geht?</li>
<li>Trage mit Aktivposten und Beispielen bei: Wir vermissen immer noch gute Beispieldateien in FreeCAD. Wenn du etwas Gutes erstellt hast, teile  es mit uns!</li>
<li><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/issues">Submit bugs</a>: Es ist sehr wichtig, dass alle m&ouml;glichen Fehler behoben werden. Wenn Du einen findest, melde ihn so deutlich wie m&ouml;glich, damit wir genau verstehen k&ouml;nnen, was passiert ist.</li>
<li>Versuche, etwas in Python zu programmieren: Du hast noch nie programmiert, aber du willst es versuchen? Python ist einfach. Lies unsere <a href="../de/Introduction_to_Python.html" title="Introduction to Python/de">Einf&uuml;hrung in Python</a>, aber Vorsicht, du k&ouml;nntest schnell s&uuml;chtig werden!</li>
<li>Siehe die <a href="../de/Help_FreeCAD.html" title="Help FreeCAD/de">Hilf FreeCAD</a> Seite f&uuml;r weitere Details, wie du beitragen kannst.</li></ul>
<p><span id="How_can_I_get_edit_permission_on_the_wiki?"></span>
</p>
<h3><span id="Wie_kann_ich_Bearbeitungsrechte_f.C3.BCr_das_Wiki_erhalten.3F"></span><span class="mw-headline" id="Wie_kann_ich_Bearbeitungsrechte_f&uuml;r_das_Wiki_erhalten?">Wie kann ich Bearbeitungsrechte f&uuml;r das Wiki erhalten?</span></h3>
<p>Siehe den <a href="../de/Help_FreeCAD.html#Arbeiten_an_der_Dokumentation" title="Help FreeCAD/de">Arbeiten an der Dokumentation</a> Abschnitt der Seite f&uuml;r weitere Details, wie beigetragen werden kann.
</p><p><span id="Does_FreeCAD_participate_in_Google_Summer_of_Code?"></span>
</p>
<h3><span id="Nimmt_FreeCAD_am_.22Google_Summer_of_Code.22_teil.3F"></span><span class="mw-headline" id='Nimmt_FreeCAD_am_"Google_Summer_of_Code"_teil?'>Nimmt FreeCAD am "Google Summer of Code" teil?</span></h3>
<p>Ja. Seit 2016 nimmt FreeCAD am Google Summer of Code teil. Siehe <a href="../Google_Summer_of_Code_2020.html" title="Google Summer of Code 2020">Google Summer of Code 2020</a> f&uuml;r Informationen zu vergangenen Ausgaben und <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?f=8&amp;t=13838">Google Summer Of Code 2016</a> im Forum f&uuml;r die urspr&uuml;ngliche Ank&uuml;ndigung.
</p><p><span id="I_want_to_start_translating_the_wiki_in_my_own_language._What_do_I_do?"></span>
</p>
<h3><span id="Ich_m.C3.B6chte_anfangen.2C_das_Wiki_in_meine_Sprache_zu_.C3.BCbersetzen._Was_muss_ich_tun.3F"></span><span class="mw-headline" id="Ich_m&ouml;chte_anfangen,_das_Wiki_in_meine_Sprache_zu_&uuml;bersetzen._Was_muss_ich_tun?">Ich m&ouml;chte anfangen, das Wiki in meine Sprache zu &uuml;bersetzen. Was muss ich tun?</span></h3>
<p>Dieses Wiki beherbergt eine Vielzahl von Inhalten. Das aktuellste und interessanteste Material ist im <a href="../de/Online_Help_Toc.html" title="Online Help Toc/de">Handbuch</a> gesammelt. 
</p><p>Siehe den <a href="../de/Help_FreeCAD.html#Bearbeiten_der_Dokumentation" title="Help FreeCAD/de">Dokumentation &uuml;bersetzen</a> Abschnitt der Seite f&uuml;r weitere Details, wie man das Wiki &uuml;bersetzt.
</p><p><span id="Can_I_buy_swag?"></span>
</p>
<h3><span id="Kann_ich_Fanartikel_kaufen.3F"></span><span class="mw-headline" id="Kann_ich_Fanartikel_kaufen?">Kann ich Fanartikel kaufen?</span></h3>
<p>FreeCAD bietet keine Werbeartikel an, die man zur Unterst&uuml;tzung des Projekts bestellen kann. Man kann jedoch seine eigenen erstellen. Anweisungen dazu findet man auf unserer Seite <a href="../de/Swag.html" title="Swag/de">Fanartikel</a>.
</p><p><span id="Licensing,_copying_and_reuse"></span>
</p>
<h2><span id="Lizenzierung.2C_kopieren_und_Wiederverwendung"></span><span class="mw-headline" id="Lizenzierung,_kopieren_und_Wiederverwendung">Lizenzierung, kopieren und Wiederverwendung</span></h2>
<p><span id="Do_I_have_to_pay_something_to_use_FreeCAD?"></span>
</p>
<h3><span id="Muss_ich_etwas_bezahlen.2C_um_FreeCAD_nutzen_zu_k.C3.B6nnen.3F"></span><span class="mw-headline" id="Muss_ich_etwas_bezahlen,_um_FreeCAD_nutzen_zu_k&ouml;nnen?">Muss ich etwas bezahlen, um FreeCAD nutzen zu k&ouml;nnen?</span></h3>
<p>Nein. FreeCAD ist v&ouml;llig kostenlos zu verwenden, herunterzuladen, weiterzugeben oder zu modifizieren. Es ist <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Open_source">open-source software</a>, ver&ouml;ffentlicht unter den Bedingungen der <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/GNU_Lesser_General_Public_License">GNU Lesser General Public License 2.1</a>, die Dir diese Freiheiten garantiert und, was noch wichtiger ist, Dir garantiert, dass Dir diese Freiheiten nie genommen werden.
</p><p><span id="Can_I_reuse_any_part_of_the_FreeCAD_artwork_or_pieces_of_the_website?"></span>
</p>
<h3><span id="Kann_ich_einen_beliebigen_Teil_der_FreeCAD_Illustrationen_oder_Teile_der_Webseite_wiederverwenden.3F"></span><span class="mw-headline" id="Kann_ich_einen_beliebigen_Teil_der_FreeCAD_Illustrationen_oder_Teile_der_Webseite_wiederverwenden?">Kann ich einen beliebigen Teil der FreeCAD Illustrationen oder Teile der Webseite wiederverwenden?</span></h3>
<p>Sicher. Alle Illustrationen (Symbole, Banner, usw.) von FreeCAD sind LGPL lizenziert, ebenso wie der FreeCAD Code. Bediene dich auf der Seite <a href="../de/Artwork.html" title="Artwork/de">Artwork</a>. Die Website ist eine Standard MediaWiki Seite, alle grafischen Elemente k&ouml;nnen frei wiederverwendet werden, und wenn Du neugierig bist, wie wir die MediaWiki Software optimiert haben, suche nach den speziellen Common css- und js Seiten.
</p><p><span id="Can_I_reuse_pieces_of_FreeCAD_in_another_application?"></span>
</p>
<h3><span id="Kann_ich_Teile_von_FreeCAD_in_anderen_Anwendungen_wiederverwenden.3F"></span><span class="mw-headline" id="Kann_ich_Teile_von_FreeCAD_in_anderen_Anwendungen_wiederverwenden?">Kann ich Teile von FreeCAD in anderen Anwendungen wiederverwenden?</span></h3>
<p>Ja, du kannst die Kernteile von FreeCAD in anderen Anwendungen verwenden, solange du die Bedingungen der LGPL einh&auml;ltst. Bibliotheken von Drittanbietern, <a href="../de/External_workbenches.html" title="External workbenches/de">externe Arbeitsbereiche</a> und <a href="../de/Macros.html" title="Macros/de">Makros</a> k&ouml;nnen ihren eigenen Lizenzbedingungen unterliegen, also wende dich bitte an ihre Autoren. Weitere Informationen findest Du auf der <a href="../de/License.html" title="License/de">Lizenz</a>-Seite.
</p><p><br>
</p>
<div class="docnav">
    <div><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-left.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span> <a href="../de/Import_Export.html" title="Import Export/de">Import Export</a></div>
    <div><a href="../de/Tutorials.html" title="Tutorials/de">Tutorien</a>
 <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-right.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span></div>
    <div><a href="../de/Online_Help_Toc.html" title="Online Help Toc/de">Index</a> <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Online_Help_Toc.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span></div>
</div>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><span typeof="mw:File"><a href="../index.php?title=User_hub.png&amp;filetimestamp=20190221145008&amp;.html" class="mw-file-description"><img src="../File/User_hub.png" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../de/User_hub.html" title="User hub/de">Anwenderdokumentation</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b><a href="../de/Getting_started.html" title="Getting started/de">Erste Schritte</a></b></li>
<li><b>Installation:</b> <a href="../de/Download.html" title="Download/de">Herunterladen</a>, <a href="../de/Installing_on_Windows.html" title="Installing on Windows/de">Windows</a>, <a href="../de/Installing_on_Linux.html" title="Installing on Linux/de">Linux</a>, <a href="../de/Installing_on_Mac.html" title="Installing on Mac/de">Mac</a>, <a href="../de/Installing_additional_components.html" title="Installing additional components/de">Zus&auml;tzliche Komponenten</a>, <a href="../de/Compile_on_Docker.html" title="Compile on Docker/de">Docker</a>, <a href="../de/AppImage.html" title="AppImage/de">AppImage</a>, <a href="../de/Ubuntu_Snap.html" title="Ubuntu Snap/de">Ubuntu Snap</a></li>
<li><b>Grundlagen:</b> <a href="../de/About_FreeCAD.html" title="About FreeCAD/de">&Uuml;ber FreeCAD</a>, <a href="../de/Interface.html" title="Interface/de">Graphische Oberfl&auml;che</a>, <a href="../de/Mouse_navigation.html" title="Mouse navigation/de">Mausbedienung</a>, <a href="../de/Selection_methods.html" title="Selection methods/de">Auswahlmethoden</a>, <a href="../de/Object_name.html" title="Object name/de">Objektname</a>, <a href="../de/Preferences_Editor.html" title="Preferences Editor/de">Voreinstellungseditor</a>, <a href="../de/Workbenches.html" title="Workbenches/de">Arbeitsbereiche</a>, <a href="../de/Document_structure.html" title="Document structure/de">Dokumentstruktur</a>, <a href="../de/Property.html" title="Property/de">Objekteigenschaften</a>, <a href="../de/Help_FreeCAD.html" title="Help FreeCAD/de">FreeCAD unterst&uuml;tzen</a>, <a href="../de/Donate.html" title="Donate/de">Spenden</a></li></ul>
<hr>
<ul><li><b>Hilfe:</b> <a href="../de/Tutorials.html" title="Tutorials/de">Anleitungen</a>, <a href="../de/Video_tutorials.html" title="Video tutorials/de">Videoanleitungen</a></li>
<li><b><a href="../de/Workbenches.html" title="Workbenches/de">Arbeitsbereiche</a>:</b> <a href="../de/Std_Base.html" title="Std Base/de">Std Base</a>, <a href="../de/Arch_Workbench.html" title="Arch Workbench/de">Arch</a>, <a href="../de/Assembly_Workbench.html" title="Assembly Workbench/de">Assembly</a>, <a href="../de/BIM_Workbench.html" title="BIM Workbench/de">BIM</a>, <a href="../de/CAM_Workbench.html" title="CAM Workbench/de">CAM</a>, <a href="../de/Draft_Workbench.html" title="Draft Workbench/de">Draft</a>, <a href="../de/FEM_Workbench.html" title="FEM Workbench/de">FEM</a>, <a href="../de/Inspection_Workbench.html" title="Inspection Workbench/de">Inspection</a>, <a href="../de/Material_Workbench.html" title="Material Workbench/de">Material</a>, <a href="../de/Mesh_Workbench.html" title="Mesh Workbench/de">Mesh</a>, <a href="../de/OpenSCAD_Workbench.html" title="OpenSCAD Workbench/de">OpenSCAD</a>, <a href="../de/Part_Workbench.html" title="Part Workbench/de">Part</a>, <a href="../de/PartDesign_Workbench.html" title="PartDesign Workbench/de">PartDesign</a>, <a href="../de/Points_Workbench.html" title="Points Workbench/de">Points</a>, <a href="../de/Reverse_Engineering_Workbench.html" title="Reverse Engineering Workbench/de">Reverse Engineering</a>, <a href="../de/Robot_Workbench.html" title="Robot Workbench/de">Robot</a>, <a href="../de/Sketcher_Workbench.html" title="Sketcher Workbench/de">Sketcher</a>, <a href="../de/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/de">Spreadsheet</a>, <a href="../de/Surface_Workbench.html" title="Surface Workbench/de">Surface</a>, <a href="../de/TechDraw_Workbench.html" title="TechDraw Workbench/de">TechDraw</a>, <a href="../de/Testing.html" title="Testing/de">Test Framework</a></li></ul>
<hr>
<ul><li><b><a href="../de/Addon.html" title="Addon/de">Addon</a>:</b> <a href="../de/Std_AddonMgr.html" title="Std AddonMgr/de">Addon-Manager</a>, <a href="../de/External_workbenches.html" title="External workbenches/de">Externe Arbeitsbereiche</a>, <a href="../de/Scripting_and_macros.html" title="Scripting and macros/de">Skripten und Makros</a></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="../de/User_hub.html" title="User hub/de">Anwenderzentrum</a>, <a href="../de/Power_users_hub.html" title="Power users hub/de">Hauptanwenderzentrum</a>, <a href="../de/Developer_hub.html" title="Developer hub/de">Entwicklerzentrum</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20251230142116
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.106 seconds
Real time usage: 0.159 seconds
Preprocessor visited node count: 660/1000000
Post&#8208;expand include size: 13326/2097152 bytes
Template argument size: 3280/2097152 bytes
Highest expansion depth: 5/100
Expensive parser function count: 1/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 5562/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   44.657      1 -total
 11.57%    5.165      1 Template:Userdocnavi/de
  8.94%    3.990     11 Template:SystemInput
  6.68%    2.982      2 Template:VersionPlus/de
  6.62%    2.957      1 Template:Code
  4.77%    2.130      1 Template:Version/de
  4.62%    2.064      1 Template:Navigation_menu_2
  4.48%    2.001     20 Template:FileName
  4.46%    1.992      2 Template:Docnav/de
  4.05%    1.809      3 Template:Clear
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:229166-0!canonical and timestamp 20251230142116 and revision id 1723972. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>