<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">History/de</span></h1><?xml encoding="UTF-8"><div class="mw-parser-output"><div class="mw-pt-languages noprint" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="de" dir="ltr">Deutsch</span></li>
<li><a href="../History.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="History (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/History.html" class="mw-pt-progress mw-pt-progress--complete" title="Historia (85% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/History.html" class="mw-pt-progress mw-pt-progress--complete" title="Histoire (93% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/History.html" class="mw-pt-progress mw-pt-progress--complete" title="La storia di FreeCAD (93% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/History.html" class="mw-pt-progress mw-pt-progress--complete" title="Historia (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt/History.html" class="mw-pt-progress mw-pt-progress--stub" title="History/pt (0% translated)" lang="pt" dir="ltr">portugu&ecirc;s</a></li>
<li><a href="../pt-br/History.html" class="mw-pt-progress mw-pt-progress--high" title="Historia (67% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../ro/History.html" class="mw-pt-progress mw-pt-progress--stub" title="Istorie (12% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><a href="../ru/History.html" class="mw-pt-progress mw-pt-progress--low" title="&#1048;&#1089;&#1090;&#1086;&#1088;&#1080;&#1103; (33% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li>
<li><a href="../zh-cn/History.html" class="mw-pt-progress mw-pt-progress--stub" title="&#21457;&#23637;&#21382;&#21490; (8% translated)" lang="zh-Hans-CN" dir="ltr">&#20013;&#25991;&#65288;&#20013;&#22269;&#22823;&#38470;&#65289;</a></li>
<li><a href="../ja/History.html" class="mw-pt-progress mw-pt-progress--stub" title="&#27508;&#21490; (12% translated)" lang="ja" dir="ltr">&#26085;&#26412;&#35486;</a></li>
<li><a href="../ko/History.html" class="mw-pt-progress mw-pt-progress--stub" title="&#50669;&#49324; (5% translated)" lang="ko" dir="ltr">&#54620;&#44397;&#50612;</a></li></ul></div>
<meta property="mw:PageProp/toc">
<h2><span class="mw-headline" id="Geschichte">Geschichte</span></h2>
<figure typeof="mw:File/Thumb"><a href="../index.php?title=Screenshot_mesh.jpg&amp;filetimestamp=20090514190409&amp;.html" class="mw-file-description"><img src="../File/Screenshot_mesh.jpg" decoding="async" width="300" height="227"></a><figcaption>Fr&uuml;hes FreeCAD, Version unbekannt</figcaption></figure>
<figure typeof="mw:File/Thumb"><a href="../index.php?title=Part_BooleanOperations.png&amp;filetimestamp=20090426092531&amp;.html" class="mw-file-description"><img src="../File/Part_BooleanOperations.png" decoding="async" width="300" height="231"></a><figcaption>FreeCAD Version 0.7 von 2009</figcaption></figure>
<h3><span class="mw-headline" id="Wie_alles_begann">Wie alles begann</span></h3>
<p>FreeCAD begann im Januar 2001, als <a href="../User;Jriegel.html" title="User:Jriegel">J&uuml;rgen Riegel</a> mit der Arbeit an dem Cas.CADE Projekt begann. Cas.CADE war ein kommerzielles Softwareentwicklungsrahmenwerk, das einen <a href="../Glossary.html#Geometric_modeling_kernel" title="Glossary">geometrischen Modellierungskern</a> (oder CAD-Kernel) enthielt: Es wurde im Jahr 2000 unter einer Open-Source-Lizenz ver&ouml;ffentlicht und in <a href="../de/OpenCASCADE.html" title="OpenCASCADE/de">OpenCASCADE</a> umbenannt. Dies erm&ouml;glichte die Realisierung eines quelloffenen 3D-CAD-Programms, da die Programmierung eines CAD-Kerns von Grund auf einen enormen Arbeitsaufwand bedeutet h&auml;tte.
</p><p>In J&uuml;rgens eigenen Worten:
</p>
<blockquote class="templatequote"><p><i>Ich begann mit dem FreeCAD-Projekt im Jahr 2001, als einem sogenannten GOM (grafischer Objektmodellierer), mit der Idee, Qt, Python und Cas.CADE zu verwenden, einem kommerziellen CAD-Kern, den ich zu der Zeit im Daimler-Projekt benutzte. Cas.CADE wurde kurz vorher Open-Source, so dass es die richtige Zeit schien, den zu der Zeit freien Raum eines Open-Source-CAD zu besetzen. Ich hatte zwei Jahre Erfahrung mit OpenCascade in einem Projekt namens QSpect, in dem ich zum Schluss der Haupt-Software-Designer war. Ich habe eine Menge &uuml;ber 3D- und CAD-Programmierung gelernt. Ich war auch beeinflusst von Catia V5 und dessen sehr ungew&ouml;hnlicher Benutzer- und Programmieroberfl&auml;che. Am 17. M&auml;rz 2002 habe ich w&auml;hrend des OpenCasCade-Projektes die Software als FreeCAD registriert. Mir fiel kein besserer Name ein, ich bin sehr schlecht bei Namen. Im April 2003 wechselte Werner Mayer, einer den Kollegen im QSpect-Projekt, zu einer Firma namens Imetric. Der Kontakt zu Imetric war vielversprechend, denn sie suchten nach einer 3D-Software-Plattform f&uuml;r ihre 3D-Sensoren. Imetric spendete im Jahr 2005 das Meiste des Mesh-Moduls an FreeCAD und die Open-Source-Community und verwendeten seitdem FreeCAD als Basis f&uuml;r ihre Sensorsystem-Software. Seit dieser Zeit ist Werner Mayer ein sehr aktiver FreeCAD-Entwickler. Nach einem Jahr Anstrengungen habe ich 2005 entschieden, das OpenCasCade-Dokument-Ger&uuml;st herauszutrennen und durch eine Eigenentwicklung zu ersetzen. Schlussendlich benutzen wir nur den CAD-Kern von OpenCasCade und nicht den Rest des Ger&uuml;stes. 2007 war ein weiterer interessanter Meilenstein. Wir wechselten zu Qt4 und dadurch zur LGPL. Zu der Zeit haben wir viel Arbeit geleistet, haupts&auml;chlich Werner</i>.</p><div class="templatequotecite">&mdash;<a href="../User;Jriegel.html" title="User:Jriegel">J&uuml;rgen Riegel</a>,&nbsp;<cite><i><a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?f=8&amp;t=295">Wer steckt hinter FreeCad?</a></i></cite></div>
</blockquote>
<p>Das Projekt wurde der &Ouml;ffentlichkeit 2003 im <a rel="nofollow" class="external text" href="https://dev.opencascade.org/forums">OpenCascade-Forum</a> vorgestellt:
</p>
<blockquote class="templatequote"><p><i>Hallo zusammen, mein Name ist J&uuml;rgen Riegel und heute m&ouml;chte ich ein OpenCasCade-Projekt ank&uuml;ndigen, FreeCAD. Es ist ein Open-Source-CAx-RAD, basierend auf OpenCasCade, Qt und Python. Es bietet einige wichtige Ideen wie Makroaufzeichnung, Arbeitsbereiche, die M&ouml;glichkeit als Server zu arbeiten und als eine dynamisch ladbare Anwendungserweiterung, und es plattformunabh&auml;ngig ausgelegt... Obwohl es sich in einer fr&uuml;hen Phase befindet und weder f&uuml;r Anwender noch f&uuml;r Entwickler benutzbar ist &mdash; die erste Benutzerausgabe ist f&uuml;r Ende 2003 geplant &mdash;, m&ouml;chte ich gerne etwas Feedback zur Richtung und zum Design von FreeCAD haben. Die Benutzeroberfl&auml;che ist fast fertig und wir, mein Co-Entwickler Werner Mayer und ich, haben damit angefangen, die ersten CAD-Funktionen hinzuf&uuml;gen. FreeCAD kann als ein universelles Mechanik-CAD-System angesehen werden, aber die erste Zielgruppe, denke ich, werden CAx-Entwickler sein, die eine Grundlage f&uuml;r die eigene Entwicklung ben&ouml;tigen</i>.</p><div class="templatequotecite">&mdash;<a href="../User;Jriegel.html" title="User:Jriegel">J&uuml;rgen Riegel</a>,&nbsp;<cite><i><a rel="nofollow" class="external text" href="https://dev.opencascade.org/content/announcing-freecad-project">Ank&uuml;ndigung FreeCAD Projekt am Sun, 08/17/2003 - 19:23</a></i></cite></div>
</blockquote>
<h3><span class="mw-headline" id="Werner_Mayer">Werner Mayer</span></h3>
<p>Werner Mayer trat dem Projekt bei, sobald es als Open-Source-Projekt angek&uuml;ndigt wurde (vor der Ank&uuml;ndigung war das Projekt ein privates Projekt von J&uuml;rgen). Siehe diesen Forumsbeitrag von Werner auf Deutsch: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=13&amp;t=40235&amp;start=10#p342330">https://forum.freecad.org/viewtopic.php?f=13&amp;t=40235&amp;start=10#p342330</a>
</p><p>Mit der Zeit gewann das Projekt an Zugkraft und es kamen neue wichtige Mitwirkende zur Gemeinschaft hinzu.
</p>
<ul><li><b>Linux Anfang</b></li></ul>
<blockquote class="templatequote"><p><i>Eine lustige Tatsache ist, dass er eine Open-Source-CAD-Software haupts&auml;chlich f&uuml;r Linux haben wollte, weil es zu dieser Zeit eigentlich nichts f&uuml;r diese Plattform gab. Von Anfang an entwickelten wir jedoch f&uuml;r die n&auml;chsten 1,5 Jahre ausschlie&szlig;lich unter Windows. Dann leistete ein Tscheche einen Beitrag, um den Code des Core-Builds auf Linux zu bringen: <a rel="nofollow" class="external free" href="https://github.com/berndhahnebach/All_FreeCAD/commit/9fd2e27c95ba3dc84778d92e2564cd094793ce2f#diff-480477e89f9b6ddafb30c4383dcdd705">https://github.com/berndhahnebach/All_FreeCAD/commit/9fd2e27c95ba3dc84778d92e2564cd094793ce2f#diff-480477e89f9b6ddafb30c4383dcdd705</a></i>
</p></blockquote>
<blockquote class="templatequote"><p><i>Ein halbes Jahr sp&auml;ter habe ich den Linux-Build weitergef&uuml;hrt: <a rel="nofollow" class="external free" href="https://github.com/berndhahnebach/All_FreeCAD/commit/35b962d7d751dd80f7c7781df60f93bc9a3da992">https://github.com/berndhahnebach/All_FreeCAD/commit/35b962d7d751dd80f7c7781df60f93bc9a3da992</a></i>
</p></blockquote>
<p><b>F:</b> Kannst du mitteilen, wie die ersten 1,5 Jahre verliefen? Habt ihr euch pers&ouml;nlich oder online getroffen?
</p>
<blockquote class="templatequote"><p><i>Nun, damals waren wir Kollegen (bis 2005), so dass wir Dinge von Angesicht zu Angesicht besprechen konnten. Danach hatten wir noch einige pers&ouml;nliche Treffen, aber die meisten Dinge haben wir per E-Mail oder Telefon besprochen.</i>
</p></blockquote>
<blockquote class="templatequote"><p><i>Als dritter Kernentwickler kam Yorik Ende 2007 hinzu, aber es dauerte weitere 3 oder 4 Jahre, bis die Gemeinschaft und die Zahl der Mitwirkenden deutlich zu wachsen begannen.</i>
</p></blockquote>
<p><b>F:</b> Habt ihr die Aufgaben aufgeteilt oder an konkurrierenden Implementierungen gearbeitet?
</p>
<blockquote class="templatequote"><p><i>Ja. J&uuml;rgen entwarf und implementierte den gr&ouml;&szlig;ten Teil der Anwendung und Dokumentenlogik, und ich k&uuml;mmerte mich um die Grundlagen der Benutzeroberfl&auml;che.</i>
</p></blockquote>
<blockquote class="templatequote"><p><i>Dies war jedoch kein stetiger Prozess, sondern wir haben zu Beginn mit vielen Dingen experimentiert. In der ersten Version nutzten wir beispielsweise OCCs Dokumenten-Rahmenwerk OCAF und seinen Betrachter, aber nach ein oder zwei Jahren gerieten wir in eine Sackgasse, weil die Dokumentation zu OCC sehr d&uuml;rftig war und wir es nicht hinbekamen, OCAF um unsere eigenen Funktionstypen zu erweitern. Also beschlossen wir, nur die Modellierungskapazit&auml;ten von OCC zu nutzen, aber unser eigenes Anwendungs-/Dokumenten-Rahmenwerk zu entwickeln.</i>
</p></blockquote>
<p><b>F:</b> H&auml;ttest du damals gedacht, dass FreeCAD dort stehen w&uuml;rde, wo es heute ist?
</p>
<blockquote class="templatequote"><p><i>Wir wussten es nicht, aber wir hofften es. Nat&uuml;rlich konnten wir nicht vorhersehen, wie genau FreeCAD heute aussehen wird.<br>Die wichtigsten Gestaltungsentscheidungen waren, es auf allen wichtigen Plattformen zur Verf&uuml;gung zu stellen und die gesamte SW so zug&auml;nglich wie m&ouml;glich zu gestalten, d.h. alle wichtigen Funktionen in Python zu implementieren, damit Hauptanwender FreeCAD mit eigenen Funktionen erweitern k&ouml;nnen. Auf diese Weise hofften wir, ein breites Publikum zu erreichen.</i>
</p></blockquote>
<p>(Siehe diesen Forumsbeitrag von Werner <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?f=8&amp;t=47703#p411612">Re: FreeCAD Geschichte</a>)
</p>
<h3><span class="mw-headline" id="Yorik_tritt_dem_Projekt_bei">Yorik tritt dem Projekt bei</span></h3>
<p><a href="../User;Yorik.html" title="User:Yorik">Yorik van Havre</a> trat dem Projekt 2008 bei und begann mit der Arbeit am <a href="../de/Draft_Workbench.html" title="Draft Workbench/de">Draft-Modul</a>. Vor diesem Zeitpunkt gab es keine M&ouml;glichkeit, 2D-Geometrie mit der Benutzeroberfl&auml;che (<a href="../de/Glossary.html#GUI" title="Glossary/de">GUI</a>) zu erstellen. Dieses Modul wurde vollst&auml;ndig in Python programmiert und nicht in C++, der in FreeCAD verwendeten Kernprogrammiersprache. Der neue Arbeitsbereich Draft bewies, dass die Python-Integration ein Erfolg war und dazu genutzt werden konnte, die F&auml;higkeiten von FreeCAD zu erweitern oder anzupassen. Zus&auml;tzlich zu seiner Arbeit am Draft-Modul arbeitete Yorik an der Erweiterung der FreeCAD-Dokumentation und wurde zum <i>de facto</i> "Artdirektor" von FreeCAD, der viele Symbole f&uuml;r die FreeCAD-Benutzeroberfl&auml;che erstellt und <a href="../de/Artwork.html" title="Artwork/de">ihren Stil gepr&auml;gt</a> hat.
</p><p>FreeCAD Version 0.7 wurde im April 2009 ver&ouml;ffentlicht und war die erste mit dem Draft-Modul. Das Part-Modul enthielt einen einfachen <a href="../de/Glossary.html#Constructive_Solid_Geometry" title="Glossary/de">CSG</a>-Arbeitsablauf mit Erstellen von Grundformen (Primitive) und booleschen Verkn&uuml;pfungen, beides &uuml;ber das Part-Men&uuml; zu erreichen. Extrusion von 2D-Profilen und Verrundung war ebenfalls m&ouml;glich.
</p><p>Version 0.8 wurde im Juli 2009 ver&ouml;ffentlicht und enthielt weitere Arbeit am Draft-Modul, darunter ein neues Bema&szlig;ungswerkzeug. Das Part-Modul profitierte von einer neuen Werkzeugleiste zusammen mit neuen Werkzeugen, Drehen und Schnitt.
</p><p>Gegen Ende 2009 wurde FreeCAD als Debian-Paket in den Debian-Repositories akzeptiert. FreeCAD wurde 2010 in den Ubuntu 10.04-Repositories hinzugef&uuml;gt.
</p>
<h3><span class="mw-headline" id="Das_Projekt_geht_weiter">Das Projekt geht weiter</span></h3>
<p>Version 0.10 wurde im Juli 2010 ver&ouml;ffentlicht und f&uuml;hrte den Arbeitsbereich <a href="../de/Sketcher_Workbench.html" title="Sketcher Workbench/de"> Sketcher</a> ein, der auf Sketchsolve basiert, einem auf Bedingungen basierendem Gleichungsl&ouml;ser zur Erstellung von 2D-Geometrie. Die erste Version war begrenzt auf die Erstellung von Rechtecken und Linien.
</p><p>Anfang 2011, die Gelegenheit nutzend, die die Online-Plattform <a rel="nofollow" class="external text" href="https://launchpad.net">Launchpad</a> bereitstellte, wurde 
das <a rel="nofollow" class="external text" href="https://launchpad.net/~freecad-maintainers">FreeCAD Instandhalter Team</a> ins Leben gerufen, um den Benutzern des Ubuntu Betriebssystems aktuelle stabile Ausgaben neben t&auml;glichen Build-Paketen von FreeCAD bereitzustellen.
</p><p>Version 0.11 wurde im Mai 2011 ver&ouml;ffentlicht und f&uuml;hrte den Arbeitsbereich Part Design ein, der Werkzeuge wie Block, Tasche, Verrundung und Fase umfasste. Der Arbeitsbereich Draft erhielt Verbesserungen und neue Werkzeuge, wie B-Spline. Der Arbeitsbereich Robot bekam weitere GUI-Werkzeuge.
</p><p>Version 0.12 wurde im Januar 2012 ver&ouml;ffentlicht und enthielt einen vervollst&auml;ndigten Arbeitsbereich Sketcher. Er enthielt einen v&ouml;llig neu geschriebenen Gleichungsl&ouml;ser, FreeGCS. Es war das Ergebnis monatelanger Arbeit der FreeCAD-Hauptentwickler zusammen mit den Neueinsteigern logari81 (der den L&ouml;ser programmiert hat) und mrlukeparry. Dem Arbeitsbereich PartDesign wurden weitere Werkzeuge hinzugef&uuml;gt.
</p>
<h3><span id="Vergr.C3.B6.C3.9Ferung_des_Kern_Entwickler_Teams"></span><span class="mw-headline" id="Vergr&ouml;&szlig;erung_des_Kern_Entwickler_Teams">Vergr&ouml;&szlig;erung des Kern Entwickler Teams</span></h3>
<p>Im April 2019 wurde das Team der Kernentwickler erweitert: Zu J&uuml;rgen, Werner und Yorik gesellten sich Abdullah, Bernd, sliptonic und WandererFan
</p>
<h2><span id="Interessante_Beitr.C3.A4ge_im_Forum"></span><span class="mw-headline" id="Interessante_Beitr&auml;ge_im_Forum">Interessante Beitr&auml;ge im Forum</span></h2>
<ul><li>&uuml;ber PartDesignNext und andere Gestaltungsentscheidungen: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=8&amp;t=34923&amp;start=130#p297074">https://forum.freecad.org/viewtopic.php?f=8&amp;t=34923&amp;start=130#p297074</a></li>
<li>&uuml;ber die Geschichte des Forums: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=8&amp;t=7448&amp;start=200#p287106">https://forum.freecad.org/viewtopic.php?f=8&amp;t=7448&amp;start=200#p287106</a></li>
<li>&uuml;ber die Projektgeschichte: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=8&amp;t=47703">https://forum.freecad.org/viewtopic.php?f=8&amp;t=47703</a></li>
<li>&uuml;ber die Code Historie: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=10&amp;t=46733&amp;start=10#p405068">https://forum.freecad.org/viewtopic.php?f=10&amp;t=46733&amp;start=10#p405068</a> BTW: der erste Code-Checkin war am 18. M&auml;rz 2002 (vielleicht ist das der Geburtstag?)</li>
<li>&uuml;ber das Projekt, das OpenSource werden soll: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=13&amp;t=40235&amp;start=10#p342330">https://forum.freecad.org/viewtopic.php?f=13&amp;t=40235&amp;start=10#p342330</a></li>
<li>&uuml;ber die Historie der Ver&ouml;ffentlichungs Commits: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=8&amp;t=23695#p184940">https://forum.freecad.org/viewtopic.php?f=8&amp;t=23695#p184940</a></li>
<li>&uuml;ber Wer steckt hinter FreeCAD: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=8&amp;t=295">https://forum.freecad.org/viewtopic.php?f=8&amp;t=295</a></li>
<li>&uuml;ber die FEM Geschichte: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=18&amp;t=48646#p416389">https://forum.freecad.org/viewtopic.php?f=18&amp;t=48646#p416389</a></li>
<li>&uuml;ber die Geschichte der FEM Polygonnetzbildner: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=18&amp;t=48733#p417627">https://forum.freecad.org/viewtopic.php?f=18&amp;t=48733#p417627</a></li></ul>
<p><span id="Release_history"></span>
</p>
<h2><span id="Ver.C3.B6ffentlichungshistorie"></span><span class="mw-headline" id="Ver&ouml;ffentlichungshistorie">Ver&ouml;ffentlichungshistorie</span></h2>
<h4><span id=".C3.9Cberblick"></span><span class="mw-headline" id="&Uuml;berblick">&Uuml;berblick</span></h4>
<table class="wikitable" style="margin: 0.4em 0 0.5em;">

<tbody><tr>
<th style="background-color: #cccccc;">Version
</th>
<th class="unsortable" style="background-color: #cccccc;">Ver&ouml;ffentlichungsname
</th>
<th style="background-color: #cccccc; white-space: nowrap;">Ver&ouml;ffentlichungsdatum
</th>
<th class="unsortable" style="background-color: #cccccc;">Ver&ouml;ffentlichungsverpflichtung
</th>
<th class="unsortable" style="background-color: #cccccc;">Ver&ouml;ffentlichungszweig
</th></tr>
<tr>
<td style="background-color: #C1E6F5;">1.1
</td>
<td>-
</td>
<td>in Entwicklung
</td>
<td><a href="../de/Release_notes_1.1.html" title="Release notes 1.1/de">Versionshinweise 1.1</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/main">head main</a>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #D4F4B4;">1.0
</td>
<td>BGBSWW
</td>
<td>2024-11-18
</td>
<td><a href="../de/Release_notes_1.0.html" title="Release notes 1.0/de">Versionshinweise 1.0</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-1-0">release commit 1.0</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-1-0">branch bugfixes 1.0</a>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.21
</td>
<td>-
</td>
<td>2023-08-02
</td>
<td><a href="../de/Release_notes_0.20.html" title="Release notes 0.20/de">Versionshinweise 0.21</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-21">release commit 0.21</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-21">branch bugfixes 0.21</a>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.20
</td>
<td>-
</td>
<td>2022-06-14
</td>
<td><a href="../de/Release_notes_0.20.html" title="Release notes 0.20/de">Versionshinweise 0.20</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-20">release commit 0.20</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-20">branch bugfixes 0.20</a>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.19
</td>
<td>-
</td>
<td>2021-03-20
</td>
<td><a href="../de/Release_notes_0.19.html" title="Release notes 0.19/de">Versionshinweise 0.19</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-19">release commit 0.19</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-19">branch bugfixes 0.19</a>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.18
</td>
<td>-
</td>
<td>2019-03-12
</td>
<td><a href="../de/Release_notes_0.18.html" title="Release notes 0.18/de">Versionshinweise 0.18</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-18">release commit 0.18</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-18">branch bugfixes 0.18</a>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.17
</td>
<td>Roland
</td>
<td>2018-04-06
</td>
<td><a href="../de/Release_notes_0.17.html" title="Release notes 0.17/de">Versionshinweise 0.17</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-17">release commit 0.17</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-17">branch bugfixes 0.17</a>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.16
</td>
<td>-
</td>
<td>2016-04-18
</td>
<td><a href="../de/Release_notes_0.16.html" title="Release notes 0.16/de">Versionshinweise 0.16</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-16">release commit 0.16</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-16">branch bugfixes 0.16</a>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.15
</td>
<td>-
</td>
<td>2015-04-08
</td>
<td><a href="../de/Release_notes_0.15.html" title="Release notes 0.15/de">Versionshinweise 0.15</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-15">release commit 0.15</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-15">branch bugfixes 0.15</a>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.14
</td>
<td>-
</td>
<td>2014-07-01
</td>
<td><a href="../de/Release_notes_0.14.html" title="Release notes 0.14/de">Versionshinweise 0.14</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-14">release commit 0.14</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-14">branch bugfixes 0.14</a>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.13
</td>
<td>-
</td>
<td>2013-01-29
</td>
<td><a href="../de/Release_notes_0.13.html" title="Release notes 0.13/de">Versionshinweise 0.13</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-13">release commit 0.13</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-13">branch bugfixes 0.13</a>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.12
</td>
<td>-
</td>
<td>2011-12-20
</td>
<td><a href="../Release_notes_0.12.html" title="Release notes 0.12">Versionshinweise 0.12</a>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.11
</td>
<td>-
</td>
<td>2011-05-03
</td>
<td><a href="../de/Release_notes_0.11.html" title="Release notes 0.11/de">Versionshinweise 0.11</a>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.10
</td>
<td>-
</td>
<td>2010-07-24
</td>
<td>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.9
</td>
<td>-
</td>
<td>2010-01-16
</td>
<td>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.8
</td>
<td>-
</td>
<td>2009-07-10
</td>
<td>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.7
</td>
<td>-
</td>
<td>2009-04-24
</td>
<td>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.6
</td>
<td>-
</td>
<td>2007-02-27
</td>
<td>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.5
</td>
<td>-
</td>
<td>2006-10-05
</td>
<td>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.4
</td>
<td>-
</td>
<td>2006-01-15
</td>
<td>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.3
</td>
<td>-
</td>
<td>2005-10-31
</td>
<td>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.2
</td>
<td>-
</td>
<td>2005-08-09
</td>
<td>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.1
</td>
<td>-
</td>
<td>2003-01-27
</td>
<td>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.0.1
</td>
<td>-
</td>
<td>2002-10-29
</td>
<td>Initial Upload of a version
</td>
<td>
</td>
<td>
</td></tr></tbody></table>
<p><span id="Legend"></span>
</p>
<h4><span class="mw-headline" id="Legende">Legende</span></h4>
<table class="wikitable" style="margin: 0.4em 0 0.5em;">

<tbody><tr>
<th style="background-color: #cccccc;">Farbe
</th>
<th style="background-color: #cccccc;">Versionstyp
</th></tr>
<tr>
<td style="background-color: #C1E6F5;">
</td>
<td>Zuk&uuml;nftige Ver&ouml;ffentlichung
</td></tr>
<tr>
<td style="background-color: #D4F4B4;">
</td>
<td><b>Letzte Version</b>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">
</td>
<td>Alte Version
</td></tr>
</tbody></table>
<h2><span class="mw-headline" id="Externe_Verweise">Externe Verweise</span></h2>
<ul><li><a rel="nofollow" class="external text" href="http://sourceforge.net/projects/free-cad/files/">SourceForge Bereich Dateien</a></li>
<li><a rel="nofollow" class="external text" href="http://sourceforge.net/projects/free-cad/files/OldFiles/">SourceForge Bereich Alte Dateien</a></li>
<li><a rel="nofollow" class="external text" href="http://www.opencascade.org/org/forum/thread_6572/?forum=11">Ank&uuml;ndigung des FreeCAD Projekts</a> im OpenCascade Forum</li></ul>
<!-- 
NewPP limit report
Cached time: 20250705141226
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc, no&#8208;toc&#8208;conversion]
CPU time usage: 0.130 seconds
Real time usage: 0.189 seconds
Preprocessor visited node count: 191/1000000
Post&#8208;expand include size: 6468/2097152 bytes
Template argument size: 5528/2097152 bytes
Highest expansion depth: 5/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 2089/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    4.640      1 -total
 78.57%    3.646      9 Template:Quote
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:93762-0!canonical and timestamp 20250705141226 and revision id 1602974. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>