<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Macro Wiring And Hoses/de</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="de" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Macro+Wiring+And+Hoses&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="de" dir="ltr">Deutsch</span></li>
<li><a href="../Macro_Wiring_And_Hoses.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Macro Wiring And Hoses (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../fr/Macro_Wiring_And_Hoses.html" class="mw-pt-progress mw-pt-progress--complete" title="Macro Wiring And Hoses (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/Macro_Wiring_And_Hoses.html" class="mw-pt-progress mw-pt-progress--low" title="Macro Cablaggio e Tubazioni (5% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Macro_Wiring_And_Hoses.html" class="mw-pt-progress mw-pt-progress--complete" title="Makrodefinicja: Okablowanie i ruroci&#261;gi (100% translated)" lang="pl" dir="ltr">polski</a></li></ul></div>
<table class="fcinfobox wikitable ct" width="100%" style="float: right; width: 230px; margin-left: 10px;">
<tbody><tr>
<td class="ctTitle" style="font-weight: bold; font-size: 125%;">
<p><span typeof="mw:File"><a href="../index.php?title=Text-x-python.png&amp;filetimestamp=20121224162851&amp;.html" class="mw-file-description" title="Generisches Makro-Symbol Erstellen Sie Ihr pers&ouml;nliches Symbol mit demselben Namen des Makros"><img alt="Generisches Makro-Symbol Erstellen Sie Ihr pers&ouml;nliches Symbol mit demselben Namen des Makros" src="../File/Text-x-python.png" decoding="async" width="32" height="32" class="mw-file-element" data-file-width="48" data-file-height="48"></a></span><span> </span>
Macro Wiring And Hoses
</p>
</td></tr>
<tr>
<th class="ctOdd">Beschreibung
</th></tr>
<tr>
<td class="ctEven left macro-description">Diese Makros unterst&uuml;tzen die Erstellung und Wartung von Kabeln und Leitungen.<br><br>Autor: Piffpoof<br>
</td></tr>
<tr>
<th class="ctOdd">Autor
</th></tr>
<tr>
<td class="ctEven macro-author"><a href="../User;Piffpoof.html" title="User:Piffpoof">Piffpoof</a>
</td></tr>
<tr>
<th class="ctOdd">Herunterladen
</th></tr>
<tr>
<td class="ctEven macro-download"><i>None</i>
</td></tr>
<tr>
<th class="ctOdd">Links
</th></tr>
<tr>
<td class="ctEven macro-Links"><a href="../de/Macros_recipes.html" title="Macros recipes/de">Makros Rezepte</a><br><a href="../de/How_to_install_macros.html" title="How to install macros/de">Wie man Makros installiert</a><br><a href="../de/Customize_Toolbars.html" title="Customize Toolbars/de">Symbolleisten anpassen</a>
</td></tr>
<tr>
<th class="ctOdd">Macro-Version
</th></tr>
<tr>
<td class="ctEven macro-version">1.0
</td></tr>
<tr>
<th class="ctOdd">Datum der letzten &Auml;nderung
</th></tr>
<tr>
<td class="ctEven macro-date"><i>None</i>
</td></tr>
<tr>
<th class="ctOdd">FreeCAD-Version(s)
</th></tr>
<tr>
<td class="ctEven FreeCAD-version"><i>None</i>
</td></tr>
<tr>
<th class="ctOdd">Standardverkn&uuml;pfung
</th></tr>
<tr>
<td class="ctEven"><i>None</i>
</td></tr>
<tr>
<th class="ctOdd">Siehe auch
</th></tr>
<tr>
<td class="ctEven"><i>None</i>
</td></tr>
<tr>
<th class="ctOdd">
</th></tr>
<tr>
<td class="ctToc"><br><meta property="mw:PageProp/toc">
</td></tr>
</tbody></table>
<p><b>Hinweis von <a href="../User;Piffpoof.html" title="User:Piffpoof">User:Piffpoof</a>: Einige &Auml;nderungen zwischen Version 0.14 und Version 0.15 haben Auswirkungen auf dieses Makro, wodurch sich dessen Ver&ouml;ffentlichung verz&ouml;gert.</b>
</p><p>Diese Makros unterst&uuml;tzen die Erstellung und Wartung von Verkabelungen und Leitungen.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Wiring_And_HosesCompletedHouse.jpg&amp;filetimestamp=20150225164901&amp;.html" class="mw-file-description"><img src="../File/Macro_Wiring_And_HosesCompletedHouse.jpg" decoding="async" width="500" height="418" class="mw-file-element" data-file-width="500" data-file-height="418"></a></span>
</p><p><span id="Background"></span>
</p>
<h2><span class="mw-headline" id="Hintergrund">Hintergrund</span></h2>
<p>Im Rahmen unserer anderen FreeCAD-Projekte ben&ouml;tigten wir eine M&ouml;glichkeit, Verkabelungen und Leitungen zu dokumentieren. Diese Makros wurden entwickelt, um diesen Bedarf zu decken. Dieses System kann vieles nicht, aber es kann Verkabelungen und Leitungen visuell darstellen, entweder als isoliertes System oder im Kontext eines FreeCAD-Modells. Die Aufzeichnungen aller Kabel und Leitungen werden in einer CSV-Datei au&szlig;erhalb von FreeCAD gespeichert. Die Datei kann also in ein Tabellenkalkulationsprogramm geladen oder von anderer Software verwendet werden.
</p>
<h2><span class="mw-headline" id="Beschreibung">Beschreibung</span></h2>
<p>Im Rahmen eines Dokumentationsprojekts stellten wir fest, dass wir Verkabelungen und Leitungen dokumentieren mussten. Wir probierten verschiedene Szenarien aus, beispielsweise das Erstellen von Linien oder Zylindern als Teil des bestehenden Modells. Aufgrund von Problemen bei der Verwendung oder Pflege entschieden wir uns jedoch daf&uuml;r, die Informationen in einem anderen Format und au&szlig;erhalb von FreeCAD zu speichern. Auf diese Weise konnten sie eigenst&auml;ndig oder innerhalb eines bestehenden Dokuments erstellt werden. Diese Entscheidung erm&ouml;glichte es den Benutzern, mit den Verkabelungen und Leitungen auf die f&uuml;r sie passende Weise zu arbeiten. Au&szlig;erdem konnten sie je nach Bedarf zu unterschiedlichen Zeitpunkten auf unterschiedliche Weise damit arbeiten.
</p><p>Anfangs waren wir uns nicht sicher, wie wir eine Liste der Leitungen und Verkabelungen f&uuml;hren sollten, und probierten verschiedene Ans&auml;tze aus. Am einfachsten schien es, das seit langem bekannte CSV-Dateiformat zu verwenden. Au&szlig;erdem gab es bereits Routinen f&uuml;r die Verwaltung von CSV-Dateien aus Python. Einige der Vorteile waren:
</p>
<ul><li>f&uuml;r Menschen lesbar</li>
<li>kann in jede Tabellenkalkulation geladen werden</li>
<li>kann mit einer Tabellenkalkulation oder einem einfachen Texteditor gepflegt werden</li>
<li>eine m&ouml;gliche zuk&uuml;nftige Verbesserung w&auml;re die Verwendung mit dem FreeCAD-Arbeitsbereich Spreadsheet</li></ul>
<p>Die n&auml;chsten Entscheidungen betrafen die Frage, "wie" solche Kabelverl&auml;ufe definiert werden sollten. Da unser Ziel in erster Linie die Dokumentation war, entschieden wir uns daf&uuml;r, Liniensegmente von Punkt zu Punkt zu verlegen. Probleme wie der Biegeradius werden nicht behandelt. Auch der Kabeldurchmesser wird nicht ber&uuml;cksichtigt. Eine Tabelle der Kabelverl&auml;ufe wird &uuml;ber die CSV-Datei gepflegt, aber Dinge wie die N&auml;he von Kabeln (wegen elektrischer Interferenzprobleme) und die Verlegungsl&auml;nge werden nicht unterst&uuml;tzt (obwohl es m&ouml;glich w&auml;re, eine rudiment&auml;re Kabelverlegungsl&auml;nge recht einfach hinzuzuf&uuml;gen).
</p><p>Dieser Satz von Makros ist im Wesentlichen ein "Konzeptnachweis", der einige Ideen und deren Machbarkeit demonstriert. Unser Hauptziel war die Dokumentation, nicht das physische Anlagenmanagement. Wir haben uns entschieden, eine Datenstruktur aus Punkten zu pflegen, durch die die Verkabelungen und Leitungen verlaufen. Zweitens haben wir eine Datenstruktur eingerichtet, die die Verkabelungen und Leitungen anhand der Punkte definiert, durch die sie verlaufen. Ein Kabel kann also nur dort verlegt werden, wo Punkte daf&uuml;r definiert wurden.
</p><p>F&uuml;r die beiden Datenstrukturen haben wir folgende Namen gew&auml;hlt:
</p>
<ul><li>Nexus &ndash; ein Punkt, durch den ein Kabel oder Schlauch gef&uuml;hrt werden kann (der Plural lautet Nexi). Nexi sind einfach Punkte im dreidimensionalen Raum. Zur besseren Visualisierung platziert die Software Toroidringe um den Standort, dies dient jedoch nur der Benutzerfreundlichkeit. Die Toroidringe k&ouml;nnen je nach Benutzerpr&auml;ferenz ein- oder ausgeschaltet werden.</li>
<li>Flows &ndash; allgemein sind dies Routen, die aus Nexi bestehen. Jedem Typ ist ein Code zugeordnet, wobei die Standardcodes wie folgt lauten
<ul><li>W &ndash; elektrische Leitungen</li>
<li>C &ndash; Leitungsrohre, die in erster Linie f&uuml;r Leitungen vorgesehen sind, aber alles enthalten k&ouml;nnen</li>
<li>H &ndash; Schl&auml;uche zum Transport verschiedener Fl&uuml;ssigkeiten</li>
<li>G &ndash; Gasleitungen</li>
<li>K &ndash; eine Kameraf&uuml;hrung, die eigentlich nur f&uuml;r zuk&uuml;nftige Erkundungen gem&auml;&szlig; <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?f=24&amp;t=8437">Tour-Kameraanimation</a> reserviert ist.</li></ul></li></ul>
<p><br>
Sowohl Nexi als auch Flows haben vom Benutzer zugewiesene Namen, zus&auml;tzlich hat Nexi intern IDs zugewiesen, um die Verwaltung zu erleichtern. Da es sich um Punkte oder Orte im 3-dimensionalen Raum handelt, haben Nexi keine Farben, aber Flows k&ouml;nnen eine von 48 definierten Farben haben. Die Betonung der Farben kn&uuml;pft an den beabsichtigten Zweck der Dokumentation an.
</p><p><br>
Der allgemeine Arbeitsablauf ist
</p>
<ul><li>Nexi definieren und positionieren</li>
<li>Flows in Bezug auf Nexi definieren</li>
<li>zu Wartungszwecken sowohl Nexi als auch Flows entweder visuell &uuml;ber die FreeCAD-GUI oder mithilfe eines tabellarischen Ansatzes und der CSV-Definitionen bearbeiten</li></ul>
<p><br>
Da die Datendatei, die sowohl die Nexi- als auch die Flow-Definition enth&auml;lt, textbasiert ist, kann sie in jedem Texteditor oder jedem anderen Programm verwendet werden, das auf die Daten zugreifen m&ouml;chte.
</p><p><br>
</p>
<h3><span class="mw-headline" id="Navigationsmodi">Navigationsmodi</span></h3>
<p>Da ein Gro&szlig;teil der Arbeit mit diesen Makros davon abh&auml;ngt, die Anzeige des Modells zu manipulieren, um die Platzierung von Punkten im 3-dimensionalen Raum zu platzieren und zu &uuml;berpr&uuml;fen, ist es unerl&auml;sslich, mit den Navigationsmodi von FreeCAD vertraut zu sein, die auf der Seite <a href="../de/Mouse_navigation.html" title="Mouse navigation/de">Mausnavigation</a> dokumentiert sind. Es ist unerl&auml;sslich, das Modell im 3-dimensionalen Raum drehen zu k&ouml;nnen und dann Operationen an einem station&auml;ren Modell durchzuf&uuml;hren.
</p><p><br>
</p>
<h2><span class="mw-headline" id="Installation">Installation</span></h2>
<p>Der Code f&uuml;r "Verkabelung und Leitungen" befindet sich in mehreren Makros und einer Bibliothek. Die Installation umfasst daher das Kopieren des Codes in das entsprechende Makroverzeichnis und das Aufrufen des Build-Dienstprogramms &uuml;ber das Makro-Men&uuml;, die Python-Konsole oder eine Symbolleisten-Schaltfl&auml;che (die bevorzugte Methode).
</p><p><br>
&lt;mehr folgt&gt;
</p>
<ul><li>siehe <a href="../de/How_to_install_macros.html" title="How to install macros/de">Wie man Makros installiert</a> zu Informationen zur Installation dieses Makro-Codes</li>
<li>siehe <a href="../de/Customize_Toolbars.html" title="Customize Toolbars/de">Symbolleisten anpassen</a> zu Informationen zur Installation als Schaltfl&auml;che in einer Symbolleiste</li></ul>
<h2><span class="mw-headline" id="Verwendung">Verwendung</span></h2>
<p>Es gibt zwei verschiedene Ans&auml;tze f&uuml;r die Arbeit mit diesen Makros: Die Nexi und Flows k&ouml;nnen eigenst&auml;ndig unter Verwendung von 3-Raum-Koordinaten definiert werden, oder es kann ein vorhandenes FreeCAD-Dokument verwendet werden, in dessen Kontext die Nexi und Flows definiert werden k&ouml;nnen. Dies ist keine "Entweder-oder"-Entscheidung, sondern beide Ans&auml;tze k&ouml;nnen verwendet werden, wenn sie am besten geeignet sind. Da die Definitionen der Nexi und Flows in einer CSV-Datei au&szlig;erhalb von FreeCAD gespeichert werden, hat das Vorhandensein oder Fehlen eines FreeCAD-Dokuments keinen Einfluss auf die Arbeit mit den Nexi und Flows, sondern erleichtert diese lediglich durch die Bereitstellung eines visuellen Kontexts. F&uuml;r diese Beschreibung der Verwendung wird das Beispiel ein zuvor geladenes FreeCAD-Dokument als Kontext verwenden, da es einfacher ist, die 
</p><p><br>
Die Verwendung dieser Makros l&auml;sst sich in drei Abschnitte unterteilen:
</p>
<ul><li>Nexi definieren</li>
<li>Flows definieren</li>
<li>Die CSV-Formatdatei bearbeiten, um Nexi und Flows zu &auml;ndern oder hinzuzuf&uuml;gen</li></ul>
<p><br>
Es gibt alternative M&ouml;glichkeiten, einige der unten beschriebenen Aufgaben auszuf&uuml;hren, und die pers&ouml;nliche Pr&auml;ferenz kann dabei ausschlaggebend sein. In diesem Beispiel werden die elektrische Verkabelung und die Kaltwasserinstallation in einem Haus vorgenommen. Unser leeres Haus sieht wie folgt aus
</p><p><br>
<span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Wiring_And_HosesEmptyHouse.jpg&amp;filetimestamp=20150225164838&amp;.html" class="mw-file-description"><img src="../File/Macro_Wiring_And_HosesEmptyHouse.jpg" decoding="async" width="500" height="440" class="mw-file-element" data-file-width="500" data-file-height="440"></a></span>
</p><p>und wartet darauf, dass kaltes Wasser und Strom installiert werden. Zur besseren &Uuml;bersichtlichkeit sind alle elektrischen Ger&auml;te in Gelb und das Wasser in Blau dargestellt (mit Ausnahme der beiden Waschbecken).
</p><p><br>
</p>
<h3><span class="mw-headline" id="Nexi_definieren">Nexi definieren</span></h3>
<p>Der erste Schritt besteht darin, Punkte im 3-dimensionalen Raum zu erstellen (im Plural &bdquo;Nexi&rdquo; oder &bdquo;Nexus&rdquo; genannt). Diese Punkte werden im n&auml;chsten Schritt verwendet, um einen Flow zu definieren. Wir erstellen diese Punkte, indem wir auf eine Oberfl&auml;che klicken (d. h. sie ausw&auml;hlen) und dann einen Namen f&uuml;r die Nexi eingeben. Diese Beschreibung bezieht sich auf die Definition der Nexi f&uuml;r den Wasser-Flow.
</p><p><br>
</p>
<ol><li>Auf das &lt;N-Symbol&gt; klicken.</li>
<li>Der folgende Dialog wird angezeigt:</li></ol>
<p>&lt;Bildschirmfoto M&ouml;chten Sie laden?&gt;
Hier wird man gefragt, ob man ein FreeCAD-Dokument &ouml;ffnen und laden m&ouml;chte, das das Modell enth&auml;lt, zu dem man Nexi und Flows hinzuf&uuml;gen m&ouml;chte. Es ist nicht notwendig, ein Dokument zu laden, aber f&uuml;r dieses Beispiel laden wir unser leeres Haus.
</p>
<ol><li>Eine Oberfl&auml;che durch Anklicken ausw&auml;hlen. Sie wird im Baumfenster hervorgehoben und mit einer Farbe gekennzeichnet, die die Auswahl anzeigt.</li>
<li>Auf das &lt;N-Symbol&gt; klicken</li>
<li>Es erscheint das folgende Dialogfeld, in dem man nach einem Namen f&uuml;r den neuen Nexus gefragt wird:</li></ol>
<p>&lt;Bildschirmaufnahme Nexus Name&gt;
</p>
<ol><li>Der Nexus wird nun definiert. Er wird im 3-D-Raum so positioniert, dass er auf der Linie von der ausgew&auml;hlten Fl&auml;che zum Betrachter liegt, und zwar knapp au&szlig;erhalb der Fl&auml;che, sodass er sich nicht innerhalb des Objekts befindet. Auch wenn der Nexus m&ouml;glicherweise nicht perfekt positioniert ist, man l&auml;sst ihn vorerst so, wie er ist, da er in einem sp&auml;teren Schritt bearbeitet wird. Es wird ein Toroid (d. h. ein Ring) angezeigt, der auf den Punkt des Nexus zentriert ist. Dieser Ring dient lediglich der Visualisierung, damit die Position des Punktes identifiziert werden kann. Die Visualisierungsringe k&ouml;nnen jederzeit ein- und ausgeschaltet werden.</li>
<li>Man definier weitere Nexi auf die gleiche Weise und gibt jedem einen aussagekr&auml;ftigen Namen</li>
<li>Auf das Symbol &lt;N&gt; klicken</li>
<li>Das folgende Dialogfeld wird angezeigt:</li></ol>
<p>&lt;Bildschirmaufnahme In einer Datei speichern&gt;
</p>
<ol><li>Die Frage mit "Ja" beantworten, um die neuen Nexi zu speichern</li></ol>
<p><strong>Hinweis</strong>: Man kann jederzeit ein bestehendes Projekt zusammenf&uuml;hren, um einen visuellen Kontext zu erhalten
</p><p><br>
</p>
<h3><span class="mw-headline" id="Flow_definieren">Flow definieren</span></h3>
<p>Sobald Nexi definiert sind, k&ouml;nnen sie zur Definition eines Flows verwendet werden. Unser Haus sieht nun wie folgt aus:
</p><p>&lt; Bildschirmaufnahme eines Hauses mit Nexi, aber ohne Flows &gt;
</p><p>Es hat Nexi f&uuml;r das Wasser-Flow definiert, aber jetzt flie&szlig;t es noch nicht.
</p><p><br>
</p>
<ol><li>Auf das &lt;F-Symbol&gt; klicken.</li></ol>
<p>Das folgende Dialogfeld wird angezeigt:
</p><p>&lt;Bildschirmfoto Nexi f&uuml;r den Flow ausw&auml;hlen&gt;
</p><p><br>
Hier wird man gebeten, die Nexi in der Reihenfolge auszuw&auml;hlen, in der sie den Flow erstellen sollen.
</p>
<ol><li>Man w&auml;hl die Art des Flows aus: Kabel, Leitungen, Schl&auml;uche, Gasleitungen.</li>
<li>Im zweiten Popup-Fenster die Nexi in der gew&uuml;nschten Reihenfolge ausw&auml;hlen</li></ol>
<p>&lt;Bildschirmaufnahme Ausgew&auml;hlte Nexi f&uuml;r den Flow&gt;
</p><p><br>
</p>
<ol><li>Einen Namen f&uuml;r den Flow eingeben</li>
<li>Eine Farbe f&uuml;r den Flow ausw&auml;hlen</li>
<li>Auf "OK" oder "Abbrechen" klicken. Wenn man bei der Auswahl der Nexi einen Fehler gemacht hat (entweder bei der Reihenfolge oder durch Einf&uuml;gen einer falschen Nexi), klickt man auf "Abbrechen" und wiederholt diesen Schritt.</li></ol>
<p>&lt; Bildschirmaufnahme des Haus mit Wasser-Flow&gt;
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Wiring_And_HosesFlowsOnly.jpg&amp;filetimestamp=20150226104411&amp;.html" class="mw-file-description"><img src="../File/Macro_Wiring_And_HosesFlowsOnly.jpg" decoding="async" width="500" height="358" class="mw-file-element" data-file-width="500" data-file-height="358"></a></span>
</p><p><br>
</p>
<h3><span class="mw-headline" id="Bearbeiten_von_Nexi_und_Flows">Bearbeiten von Nexi und Flows</span></h3>
<p>Es gibt drei verschiedene M&ouml;glichkeiten, Nexi zu bearbeiten. Da Flows in Bezug auf Nexi definiert sind, wirkt sich eine &Auml;nderung von Nexi auf alle Flows aus, die diese enthalten. F&uuml;r beschreibende Flow-Attribute wie Farbe und Name gibt es eine M&ouml;glichkeit, &Auml;nderungen vorzunehmen.
</p><p>Bisher haben wir in diesem Beispiel die folgende Tabelle erstellt:
</p><p>&lt;Bildschirmfoto Bearbeiten einer Tabelle&gt;
</p><p>&lt;Bildschirmfoto Bearbeiten der Nexus-Position&gt;
</p><p>&lt;Bildschirmfoto Doppelklick-Bearbeitung eines Toroids&gt;
</p><p><br>
</p>
<h2><span id="Benutzeroberfl.C3.A4che"></span><span class="mw-headline" id="Benutzeroberfl&auml;che">Benutzeroberfl&auml;che</span></h2>
<p>Die Benutzeroberfl&auml;che ist eine Kombination aus benutzerdefinierten Bildschirmen und Standardkomponenten der FreeCAD-GUI.
</p><p>&lt;Bildschirmfoto 1: Definition von Nexi&gt;
</p><p>&lt;Bildschirmfoto 2: Definition des Flows&gt;
</p><p>&lt;Bildschirmfoto 3: Bearbeiten einer CSV-Datei&gt;
</p><p>&lt;Bildschirmfoto 1: Bearbeiten einer Position&gt;
</p>
<h2><span class="mw-headline" id="Optionen">Optionen</span></h2>
<p>Derzeit gibt es keine Optionen f&uuml;r Verkabelung und Leitungen.
</p>
<h2><span class="mw-headline" id="Beispieldateien">Beispieldateien</span></h2>
<p>blah blah blah
</p>
<h2><span class="mw-headline" id="Anmerkungen">Anmerkungen</span></h2>
<p>blah blah blah
</p>
<h2><span class="mw-headline" id="Bekannte_Probleme">Bekannte Probleme</span></h2>
<p>blah blah blah
</p>
<h2><span id="Zuk.C3.BCnftige_M.C3.B6glichkeiten"></span><span class="mw-headline" id="Zuk&uuml;nftige_M&ouml;glichkeiten">Zuk&uuml;nftige M&ouml;glichkeiten</span></h2>
<p>blah blah blah
</p>
<h2><span class="mw-headline" id="Glossar">Glossar</span></h2>
<p>blah blah blah
</p>
<h2><span class="mw-headline" id="Verweise">Verweise</span></h2>
<p>blah blah blah
</p>
<h2><span class="mw-headline" id="Skript">Skript</span></h2>
<p>blah blah blah
</p>
<div style="clear:both"></div>
<!-- 
NewPP limit report
Cached time: 20251205110800
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.048 seconds
Real time usage: 0.063 seconds
Preprocessor visited node count: 121/1000000
Post&#8208;expand include size: 2099/2097152 bytes
Template argument size: 177/2097152 bytes
Highest expansion depth: 7/100
Expensive parser function count: 2/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1239/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    9.596      1 -total
 73.40%    7.043      1 Template:Macro/de
 22.05%    2.116      1 Template:Clear
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:405965-0!canonical and timestamp 20251205110800 and revision id 1710756. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>