<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Macro Heat Flow Convection Conduction/de</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="de" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Macro+Heat+Flow+Convection+Conduction&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="de" dir="ltr">Deutsch</span></li>
<li><a href="../Macro_Heat_Flow_Convection_Conduction.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Macro Heat Flow Convection Conduction (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../fr/Macro_Heat_Flow_Convection_Conduction.html" class="mw-pt-progress mw-pt-progress--high" title="Macro Heat Flow Convection Conduction (99% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li></ul></div>
<table class="fcinfobox wikitable ct" width="100%" style="float: right; width: 230px; margin-left: 10px;">
<tbody><tr>
<td class="ctTitle" style="font-weight: bold; font-size: 125%;">
<p><span typeof="mw:File"><a href="../index.php?title=Text-x-python.png&amp;filetimestamp=20121224162851&amp;.html" class="mw-file-description" title="Generisches Makro-Symbol Erstellen Sie Ihr pers&ouml;nliches Symbol mit demselben Namen des Makros"><img alt="Generisches Makro-Symbol Erstellen Sie Ihr pers&ouml;nliches Symbol mit demselben Namen des Makros" src="../File/Text-x-python.png" decoding="async" width="32" height="32" class="mw-file-element" data-file-width="48" data-file-height="48"></a></span><span> </span>
Macro Heat Flow Convection Conduction
</p>
</td></tr>
<tr>
<th class="ctOdd">Beschreibung
</th></tr>
<tr>
<td class="ctEven left macro-description">Dieses Makro berechnet die W&auml;rmeflussrate in einer Richtung aufgrund von Konvektion und (oder) W&auml;rmeleitung, wenn sich das Ph&auml;nomen im station&auml;ren Zustand befindet. Es berechnet auch die Temperaturen zwischen den Schichten der Materialien.<br><br>Versionsmakro&nbsp;: 0.0.2<br>Datum der letzten &Auml;nderung&nbsp;: 2025-09-14<br>FreeCAD version&nbsp;: Alle<br>Herunterladen&nbsp;: <a rel="nofollow" class="external text" href="https://www.freecadweb.org/wiki/images/2/2c/Text-x-python.png">Text-x-python.png</a><br>Autor: Garlic<br>
</td></tr>
<tr>
<th class="ctOdd">Autor
</th></tr>
<tr>
<td class="ctEven macro-author"><a href="../index.php?title=User;Garlic&amp;action=edit&amp;redlink=1.html" class="new" title="User:Garlic (page does not exist)">Garlic</a>
</td></tr>
<tr>
<th class="ctOdd">Herunterladen
</th></tr>
<tr>
<td class="ctEven macro-download"><a rel="nofollow" class="external text" href="https://www.freecadweb.org/wiki/images/2/2c/Text-x-python.png">Text-x-python.png</a>
</td></tr>
<tr>
<th class="ctOdd">Links
</th></tr>
<tr>
<td class="ctEven macro-Links"><a rel="nofollow" class="external text" href="https://git.disroot.org/CrowdDiscussesAlternatives/ScriptsForFreeCAD/src/branch/master/Thermal/HeatFlowConvectionConduction_documentation.pdf">W&auml;rmestr&ouml;mung Konvektion W&auml;rmeleitung Dokumentation</a><br><a href="../de/Macros_recipes.html" title="Macros recipes/de">Makros Rezepte</a><br><a href="../de/How_to_install_macros.html" title="How to install macros/de">Wie man Makros installiert</a><br><a href="../de/Customize_Toolbars.html" title="Customize Toolbars/de">Symbolleisten anpassen</a>
</td></tr>
<tr>
<th class="ctOdd">Macro-Version
</th></tr>
<tr>
<td class="ctEven macro-version">0.0.2
</td></tr>
<tr>
<th class="ctOdd">Datum der letzten &Auml;nderung
</th></tr>
<tr>
<td class="ctEven macro-date">2025-09-14
</td></tr>
<tr>
<th class="ctOdd">FreeCAD-Version(s)
</th></tr>
<tr>
<td class="ctEven FreeCAD-version">Alle
</td></tr>
<tr>
<th class="ctOdd">Standardverkn&uuml;pfung
</th></tr>
<tr>
<td class="ctEven"><i>None</i>
</td></tr>
<tr>
<th class="ctOdd">Siehe auch
</th></tr>
<tr>
<td class="ctEven"><i>None</i>
</td></tr>
<tr>
<th class="ctOdd">
</th></tr>
<tr>
<td class="ctToc"><br><meta property="mw:PageProp/toc">
</td></tr>
</tbody></table>
<p><span id="Description"></span>
</p>
<h2><span class="mw-headline" id="Beschreibung">Beschreibung</span></h2>
<p>Dies ist ein Algorithmus, der den W&auml;rmefluss aufgrund von W&auml;rmeleitung und/oder Konvektion in einer Richtung berechnet (z. B. bei einer Wand, die aus verschiedenen Materialien wie Putz, Ziegeln und D&auml;mmstoff besteht, oder bei einem Fenster mit Doppelverglasung und einem mit Luft gef&uuml;llten Hohlraum usw.). Das Ph&auml;nomen muss sich im station&auml;ren Zustand befinden (d. h. es darf nicht zeitabh&auml;ngig sein).
</p><p>Die Eingabe der Daten muss in einer Tabelle in <a rel="nofollow" class="external text" href="https://freecad.org">FreeCAD</a> erfolgen, und die Ergebnisse werden in derselben Tabelle einige Zeilen unterhalb der zuletzt geschriebenen Zeile ausgegeben. Diese Eingabedaten m&uuml;ssen (in einer bestimmten Reihenfolge) die thermischen Eigenschaften der Materialien der Schichten, in denen der W&auml;rmefluss stattfindet, die Dicke jeder Schicht, die Fl&auml;che, die Temperatur des ersten und letzten Punktes in Richtung des W&auml;rmeflusses, die Art des Ph&auml;nomens in jeder Schicht (z. B. <a rel="nofollow" class="external text" href="https://de.wikipedia.org/wiki/W%C3%A4rmeleitung">W&auml;rmeleitung</a>, oder erzwungene <a rel="nofollow" class="external text" href="https://de.wikipedia.org/wiki/Konvektion">Konvektion</a>, oder freie Konvektion an einer horizontalen, vertikalen, geneigten Oberfl&auml;che oder einem geschlossenen Hohlraum). Die Ergebnisse sind die W&auml;rmeleistungsrate (in Watt), die relative Genauigkeit der Berechnungen (der Algorithmus verwendet thermische Str&ouml;mungsgleichungen und l&ouml;st das Problem in Iterationen, wobei er versucht, zu konvergieren) und die berechneten Temperaturen der beiden Oberfl&auml;chen auf jeder Schicht.
</p>
<h2><span class="mw-headline" id="Installation">Installation</span></h2>
<p>Man beachte, dass die folgenden Schritte nur einmal ausgef&uuml;hrt werden m&uuml;ssen:
</p>
<ol><li>Im FreeCAD-Men&uuml; auf <b>Makro &rarr; Makros</b> gehen</li>
<li>Herausfinden, welcher Pfad in das Feld  <b>"Speicherort der Benutzermakros"</b> geschrieben wurde:</li>
<li>Diesen Ordner mit dem Datei-Explorer (oder einer anderen Dateiverwaltungsanwendung) &ouml;ffnen.</li>
<li>Die Dateien <b>HeatFlowConvectionConduction.py</b>, <b>Thermal.py</b> und <b>SpreadsheetDataReadWrite.py</b> von <a rel="nofollow" class="external free" href="https://git.disroot.org/CrowdDiscussesAlternatives/ScriptsForFreeCAD/src/branch/master/Thermal">https://git.disroot.org/CrowdDiscussesAlternatives/ScriptsForFreeCAD/src/branch/master/Thermal</a> herunterladen und in diesen Ordner kopieren.</li>
<li>Mit der Schaltfl&auml;che <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">Schliessen</span> das <a href="../de/Std_DlgMacroExecute.html" title="Std DlgMacroExecute/de">Dialogfenster Makro ausf&uuml;hren</a> schliessen.</li></ol>
<p>Weitere Informationen zur manuellen Installation von Makros findet man <a href="../de/How_to_install_macros.html" title="How to install macros/de">hier</a>.
</p><p><span id="Usage"></span>
</p>
<h2><span class="mw-headline" id="Anwendung">Anwendung</span></h2>
<p>Die folgenden Beispiele demonstrieren, wie das Skript genutzt wird.
</p><p><span id="Example_1"></span>
</p>
<h3><span class="mw-headline" id="Beispiel_1">Beispiel 1</span></h3>
<p>In diesem Beispiel wird die W&auml;rmeleistung berechnet, die durch ein doppelt verglastes Fenster flie&szlig;t. Es ist gegeben, dass die Umgebungstemperatur im Raum 25 &deg;C betr&auml;gt und die Umgebungstemperatur au&szlig;erhalb des Fensters 10 &deg;C. Die Gr&ouml;&szlig;e des Fensters betr&auml;gt 0,57 m H&ouml;he &times; 0,43 m Breite (d. h. eine Fl&auml;che von 0,2451 m<sup>2</sup>). Die Dicke jedes Glases betr&auml;gt 4 mm (d. h. 0,004 m) und der Luftspalt dazwischen betr&auml;gt 16 mm.
</p><p>Um den Algorithmus zu verwenden, &ouml;ffnet man zun&auml;chst die FreeCAD-Anwendung. W&auml;hlt dann den <a href="../de/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/de">Arbeitsbereich Spreadsheet</a>, erzeugt ein neues  <span typeof="mw:File"><a href="../index.php?title=Std_New.svg&amp;filetimestamp=20240528091658&amp;.html" class="mw-file-description"><img src="../File/Std_New.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../de/Std_New.html" title="Std New/de">Dokument</a> und erstellt danach ein neues <span typeof="mw:File"><a href="../index.php?title=Spreadsheet_CreateSheet.svg&amp;filetimestamp=20240527155333&amp;.html" class="mw-file-description"><img src="../File/Spreadsheet_CreateSheet.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../de/Spreadsheet_CreateSheet.html" title="Spreadsheet CreateSheet/de">Tabellenblatt</a>.
</p><p><span id="Input_data"></span>
</p>
<h4><span class="mw-headline" id="Eingabedaten">Eingabedaten</span></h4>
<p>Der Algorithmus durchsucht die erste Spalte der Tabelle, um die erste Zahl zu finden. Wenn er sie findet, nimmt er an, dass dies die ID der ersten Ebene ist. Anschlie&szlig;end sucht er nach der ID der zweiten Ebene. Wenn f&uuml;nf aufeinanderfolgende Zeilen keine Zahl in der ersten Spalte enthalten, geht er davon aus, dass es keine weiteren Ebenen gibt. Die Zeilen zwischen den Daten der Ebenen k&ouml;nnen verwendet werden, um Einheiten, Kommentare usw. einzutragen. Die Eigenschaften jeder Ebene m&uuml;ssen in einer bestimmten Reihenfolge eingetragen werden.
</p><p>F&uuml;r dieses Beispiel k&ouml;nnen die Daten in der Tabelle wie in der Abbildung unten dargestellt geschrieben werden.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=HeatFlowConvectionConduction_Macro_Example1_InputData.png&amp;filetimestamp=20251102065941&amp;.html" class="mw-file-description"><img src="../File/HeatFlowConvectionConduction_Macro_Example1_InputData.png" decoding="async" width="1039" height="298" class="mw-file-element" data-file-width="1039" data-file-height="298"></a></span>
</p><p>Zeile 4 enth&auml;lt die Daten der Schicht mit der ID 1. Dies ist die Schicht, in der die Konvektion zwischen der Umgebungsluft au&szlig;erhalb des Fensters und der Au&szlig;enfl&auml;che der Au&szlig;enverglasung des Fensters stattfindet. <b>Die Einheiten der Daten sind in  <a rel="nofollow" class="external text" href="https://de.wikipedia.org/wiki/Internationales_Einheitensystem">SI</a></b> (metrisches System).
</p><p>Temp. 1 ist die Au&szlig;enumgebungstemperatur in Kelvin (die bekannt ist: 10 &deg;C + 273,15 = 283,15 K).
</p><p>Temp. 2 ist die Temperatur der Au&szlig;enfl&auml;che des Au&szlig;englases und wird grob auf 286,15 K gesch&auml;tzt. Dies ist ein Anfangswert f&uuml;r den L&ouml;ser, um die erste Iteration zu starten. Diese Temperatur wird berechnet und in den Ergebnissen dargestellt. Um einen Anfangswert zu sch&auml;tzen, haben wir die folgende Gleichung verwendet: (25 - 10) / 5 = 3, wobei 25 &deg;C die Innentemperatur, 10 &deg;C die Au&szlig;entemperatur und 5 die Anzahl der Schichten sind, sodass wir 3 zu 283,15 K addiert haben.
</p><p>0,2451 m<sup>2</sup> ist die Fl&auml;che des Fensters.
</p><p>2 ist die Zahl, die die Kategorie <i>"freie Konvektion auf einer geneigten oder vertikalen Fl&auml;che"</i> (als Mechanismus der W&auml;rme&uuml;bertragung in dieser Schicht) angibt.
</p><p>101325 Pa ist der atmosph&auml;rische Druck auf Meeresh&ouml;he.
</p><p>0,7 (70% / 100) ist die relative Luftfeuchtigkeit der Aussenluft.
</p><p>0,57 m ist die charakteristische L&auml;nge (bei einer freien Konvektion auf einer vertikalen Ebene ist die charakteristische L&auml;nge die H&ouml;he der Ebene).
</p><p>0 Grad ist der Winkel zwischen der Ebene und der Vertikalen.
</p><p><b>Man beachte, dass die Daten in der oben genannten Reihenfolge geschrieben werden m&uuml;ssen, damit der Algorithmus sie verstehen kann.</b> (ohne leere Zellen dazwischen), wenn der W&auml;rme&uuml;bertragungsmechanismus freie Konvektion auf einer vertikalen Ebene ist.
</p><p>Zeile 7 enth&auml;lt die Daten der Schicht, in der die W&auml;rmeleitung am Au&szlig;enfensterglas stattfindet. 2 ist die ID dieser Schicht.
</p><p>Temp. 1 ist die Temperatur der Au&szlig;enfl&auml;che des Au&szlig;enverglasung und wird grob auf 286,15 K gesch&auml;tzt (sie muss denselben Wert wie Temp. 2 der vorherigen Schicht haben, da sie sich auf dieselbe Oberfl&auml;che bezieht).
</p><p>Temp. 2 ist die Temperatur der Innenfl&auml;che des Au&szlig;enfensters (d. h. der Fl&auml;che, die mit der zwischen den beiden Fenstern eingeschlossenen Luft in Kontakt steht) und wird grob auf 289,15 K gesch&auml;tzt (die vorherige Temperatur plus 3 K). Diese Temperatur wird vom L&ouml;ser berechnet.
</p><p>0,2451 m<sup>2</sup> ist die Fl&auml;che des Fensters.
</p><p>1 ist die Zahl, die die Kategorie <i>"W&auml;rmeleitung"</i> (als Mechanismus der W&auml;rme&uuml;bertragung in dieser Schicht) angibt.
</p><p>0,96 W / (m &times; K) ist die W&auml;rmeleitf&auml;higkeit des Glases <a rel="nofollow" class="external autonumber" href="https://www.engineeringtoolbox.com/thermal-conductivity-d_429.html">[1]</a>. Im Internet gibt es verschiedene Tabellen, die die thermischen Eigenschaften der g&auml;ngigsten Materialien enthalten. Man kann auch den <a href="../de/Material_Workbench.html" title="Material Workbench/de">Arbeitsbereich Material</a> verwenden, um die Eigenschaften eines <a href="../de/Std_SetMaterial.html" title="Std SetMaterial/de">Materials</a> anzuzeigen.
</p><p>0,004 m ist die Dicke des Glases.
</p><p>Die oben genannte Reihenfolge ist diejenige, in der die Daten in die Tabelle geschrieben werden m&uuml;ssen, wenn es um die Durchf&uuml;hrung geht.
</p><p>Zeile 10 enth&auml;lt die Daten der Luftschicht, die zwischen den beiden Gl&auml;sern eingeschlossen ist. 3 ist die ID dieser Schicht.
</p><p>289,15 K ist die ungef&auml;hr gesch&auml;tzte Temperatur der Innenfl&auml;che des Au&szlig;enverglasung.
</p><p>292,15 K ist die grob gesch&auml;tzte Temperatur der gegen&uuml;berliegenden Oberfl&auml;che, die die Luft umschlie&szlig;t (d. h. die Oberfl&auml;che des anderen Glases, das mit der eingeschlossenen Luft in Kontakt steht). Diese Temperatur wird ebenfalls vom L&ouml;ser berechnet.
</p><p>0,2451 m<sup>2</sup> ist die Fensterfl&auml;che.
</p><p>4 ist die Zahl, die die Kategorie <i>"freie Konvektion in einem geschlossenen Raum"</i> (als Mechanismus der W&auml;rme&uuml;bertragung in dieser Schicht) angibt. Man beachte, dass die Gleichungen im Algorithmus (f&uuml;r diesen Fall) nur f&uuml;r kleine Zwischenr&auml;ume geeignet sind, &auml;hnlich wie der Zwischenraum in einem doppelt verglasten Fenster (d. h. weniger als 0,05 m).<a rel="nofollow" class="external autonumber" href="https://iopscience.iop.org/article/10.1088/1757-899X/939/1/012049/pdf">[2]</a>.
</p><p>101325 Pa ist der atmosph&auml;rische Druck auf Meeresh&ouml;he.
</p><p>0,2 (20% / 100) ist die relative Luftfeuchtigkeit der der eingeschlossenen Luft.
</p><p>0,016 m ist die charakteristische L&auml;nge (bei freier Konvektion in einem Geh&auml;use ist die charakteristische L&auml;nge die Dicke des Luftspalts, d. h. der Abstand zwischen den beiden Gl&auml;sern).
</p><p>Zeile 13 enth&auml;lt die Daten der Ebene mit der ID 4, die sich auf die W&auml;rmeleitung (Kategorie 1) beziehen, die am zweiten Glas des Fensters auftritt.
</p><p>Zeile 16 enth&auml;lt die Daten der Schicht mit der ID 5, die sich auf die freie Konvektion (Kategorie 2) bezieht, die an der Oberfl&auml;che der zweiten Glasscheibe des Fensters auftritt, die mit der Umgebungsluft des Raums in Kontakt steht. Man beachte, dass die Temperatur 2 dieser Schicht 298,15 K betr&auml;gt, was 25 &deg;C entspricht (einem in diesem Beispiel vorgegebenen Wert).
</p><p>Man beachte, dass die verwendeten Gleichungen f&uuml;r einen Wertebereich der Eingabedaten g&uuml;ltig sind (die Kommentare im Skript <a rel="nofollow" class="external text" href="https://git.disroot.org/CrowdDiscussesAlternatives/ScriptsForFreeCAD/src/branch/master/Thermal/Thermal.py">Thermal.py</a> definieren diese Bereiche). <b>Wenn diese Bereiche &uuml;berschritten werden, werden Warnungen (oder Fehler) in der <a href="../de/Python_Console.html" title="Python Console/de">Python-Konsole</a> von FreeCAD ausgegeben.</b>
</p><p><span id="Executing_the_script"></span>
</p>
<h4><span id="Das_Skript_ausf.C3.BChren"></span><span class="mw-headline" id="Das_Skript_ausf&uuml;hren">Das Skript ausf&uuml;hren</span></h4>
<p>Damit der Algorithmus ausgef&uuml;hrt werden kann, muss die <a href="../de/Python_Console.html" title="Python Console/de">Python-Konsole</a> in FreeCAD ge&ouml;ffnet werden und der folgenden Code ausgef&uuml;hrt werden (d. h. jede Zeile des folgenden Codes separat kopieren und einf&uuml;gen und jedes Mal <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">Enter</span> dr&uuml;cken).
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="kn">import</span> <span class="nn">HeatFlowConvectionConduction</span>
<span class="n">heatFlowObj</span> <span class="o">=</span> <span class="n">HeatFlowConvectionConduction</span><span class="o">.</span><span class="n">HeatFlowConvectionConduction</span><span class="p">()</span>
<span class="n">heatFlowObj</span><span class="o">.</span><span class="n">calcHeatFlowConvectionConduction</span><span class="p">()</span>
</pre></div>
<p>Man beachte, dass nach dem &Ouml;ffnen von FreeCAD die ersten beiden Zeilen dieses Codes nur einmal kopiert und eingef&uuml;gt werden m&uuml;ssen (die erste Zeile importiert das Skript und die zweite Zeile erstellt ein Objekt). Wenn dann der Algorithmus des Skripts ausgef&uuml;hrt werden soll (um die Daten der Tabellenkalkulation zu lesen, den L&ouml;ser auszuf&uuml;hren und die Ergebnisse anzuzeigen), kopiert man einfach die dritte Zeile des obigen Codes und dr&uuml;ckt dann <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">Enter</span>.
</p><p>Die Ergebnisse werden in dieselbe Tabelle geschrieben, drei Zeilen unterhalb der zuletzt geschriebenen Zeile (bitte beachten, dass der Algorithmus nur &uuml;berpr&uuml;ft, ob die ersten zehn Spalten in sieben aufeinanderfolgenden Zeilen leer sind, und wenn dies der Fall ist, geht er davon aus, dass er &bdquo;die zuletzt geschriebene Zeile&rdquo; gefunden hat).
</p><p><span id="Results"></span>
</p>
<h4><span class="mw-headline" id="Ergebnisse">Ergebnisse</span></h4>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=HeatFlowConvectionConduction_Macro_Example1_Results.png&amp;filetimestamp=20251102070338&amp;.html" class="mw-file-description"><img src="../File/HeatFlowConvectionConduction_Macro_Example1_Results.png" decoding="async" width="831" height="179" class="mw-file-element" data-file-width="831" data-file-height="179"></a></span>
</p><p>Die W&auml;rmeleistung betr&auml;gt 2,62 W. Wir haben zuerst die niedrigere Temperatur angegeben, daher zeigt das Minuszeichen in der Abbildung oben an, dass die Str&ouml;mung in die entgegengesetzte Richtung verl&auml;uft (d. h. von der h&ouml;heren zur niedrigeren Temperatur).
</p><p>Die relative Genauigkeit betr&auml;gt 0,76&nbsp;% (der L&ouml;ser des Algorithmus wird beendet, wenn die relative Genauigkeit weniger als 5&nbsp;% betr&auml;gt oder die Anzahl der Iterationen mehr als zehn betr&auml;gt &ndash; diese Grenzwerte k&ouml;nnen ge&auml;ndert werden, indem ihre Werte in der Funktion <code>simulate_thermal_flow</code> im Skript ge&auml;ndert werden).
</p><p>Die Temperaturen jeder Schicht werden berechnet. Die &uuml;brigen Eingabedaten werden der &Uuml;bersichtlichkeit halber ebenfalls f&uuml;r jede Schicht erneut ausgegeben.
</p><p><span id="Example_2"></span>
</p>
<h3><span class="mw-headline" id="Beispiel_2">Beispiel 2</span></h3>
<p>Ein Wind mit einer Geschwindigkeit von 10 m/s, einer Luftfeuchtigkeit von 40&nbsp;% und einer Temperatur von 10 &deg;C str&ouml;mt parallel zur Breite einer Wand, die 5 m breit und 3 m hoch ist und deren Oberfl&auml;che eine Temperatur von 11 &deg;C hat.
</p><p>Um die W&auml;rmeleistung zu berechnen, m&uuml;ssen wir die Daten in der richtigen Reihenfolge in die Tabelle eintragen.
</p><p>1 ist die ID der Ebene.
</p><p>283,15 K ist die Temperatur der Luft (die Temperatur der Wand h&auml;tte auch zuerst angegeben werden k&ouml;nnen).
</p><p>284,15 K ist die Temperatur der Wandoberfl&auml;che.
</p><p>15 m<sup>2</sup> ist die Fl&auml;che der Oberfl&auml;che.
</p><p>5 legt die Kategorie <i>"erzwungene Konvektion parallel zu einer ebenen Fl&auml;che"</i> fest.
</p><p>101325 Pa ist der atmosph&auml;rische Druck auf Meeresh&ouml;he.
</p><p>0,4 ist die relative Luftfeuchtigkeit geteilt durch 100.
</p><p>5 m ist die charakteristische L&auml;nge (bei erzwungener Konvektion ist dies die Abmessung der Oberfl&auml;che, die parallel zur Str&ouml;mung verl&auml;uft).
</p><p>10 m/s ist die Str&ouml;mungsgeschwindigkeit.
</p><p>Die Ergebnisse zeigen, dass die W&auml;rmeleistung 367,18 W betr&auml;gt.
</p><p><span id="Example_3"></span>
</p>
<h3><span class="mw-headline" id="Beispiel_3">Beispiel 3</span></h3>
<p>Die Fl&auml;che einer Terrasse hat eine Gr&ouml;&szlig;e von 50m<sup>2</sup> (10 m L&auml;nge &times; 5 m Breite) und einer Temperatur von 11 &deg;C. Die Au&szlig;enumgebungstemperatur betr&auml;gt 10 &deg;C und die Luftfeuchtigkeit 50&nbsp;%.
</p><p>Um die W&auml;rmeleistung zu berechnen, m&uuml;ssen wir diese Daten in der richtigen Reihenfolge eingeben.
</p><p>1 ist die ID der Ebene.
</p><p>283,15 K ist die Temperatur der Umgebungsluft (d. h. die Temperatur der Fl&uuml;ssigkeit au&szlig;erhalb der <a rel="nofollow" class="external text" href="https://de.wikipedia.org/wiki/Thermische_Grenzschicht">thermische Grenzschicht</a>, in Kelvin).
</p><p>284,15 K ist die Temperatur der Terasse.
</p><p>50 m<sup>2</sup> ist die Fl&auml;che der Oberfl&auml;che.
</p><p>3 legt die Kategorie <i>"erzwungene Konvektion parallel zu einer ebenen Fl&auml;che"</i> fest.
</p><p>101325 Pa ist der atmosph&auml;rische Druck auf Meeresh&ouml;he.
</p><p>0,5 ist die relative Luftfeuchtigkeit geteilt durch 100.
</p><p>1,67 m ist die charakteristische L&auml;nge (bei freier Konvektion auf einer horizontalen Fl&auml;che ist dies die Fl&auml;che der Oberfl&auml;che geteilt durch den Umfang: 50 / (10 + 5 + 10 + 5)). <b>Man beachte, dass damit die Daten korrekt gelesen werden k&ouml;nnen, in die Zelle der Tabelle 1,67 (und nicht = 50 / (10 + 5 + 10 + 5)) eingetragen werden sollten.</b>
</p><p>1 ist die Richtung der Oberfl&auml;che. Da sich die Luft oben auf der Oberfl&auml;che befindet, muss dieser Eintrag 1 sein. Bef&auml;nde sich die Luft unten auf der Oberfl&auml;che (z. B. im Fall einer Decke), dann sollte -1 eingetragen werden.
</p><p>2 ist der letzte Eintrag in der Zeile und gibt an, dass temp. 1 die Lufttemperatur und temp. 2 die Oberfl&auml;chentemperatur ist. H&auml;tte man zuerst die Oberfl&auml;chentemperatur und dann die Lufttemperatur angegeben, m&uuml;sste dieser letzte Eintrag 1 sein.
</p><p>Die Ergebnisse zeigen, dass die W&auml;rmeleistung 92,55 W betr&auml;gt.
</p><p><span id="Simulated_cases_of_heat_transfer"></span>
</p>
<h3><span id="Simulierte_F.C3.A4lle_von_W.C3.A4rme.C3.BCbertragung"></span><span class="mw-headline" id="Simulierte_F&auml;lle_von_W&auml;rme&uuml;bertragung">Simulierte F&auml;lle von W&auml;rme&uuml;bertragung</span></h3>
<p>Die oben genannten Beispiele decken die f&uuml;nf F&auml;lle (Kategorien) ab, in denen der Algorithmus im Skript den W&auml;rmefluss berechnen kann:
</p>
<ul><li>Kategorie 1: W&auml;rmeleitung.</li>
<li>Kategorie 2: Freie Konvektion auf einer geneigten oder vertikalen Fl&auml;che.</li>
<li>Kategorie 3: Freie Konvektion auf einer horizontalen Fl&auml;che.</li>
<li>Kategorie 4: Freie Konvektion in einem geschlossenen Raum (f&uuml;r kleine Zwischenr&auml;ume, &auml;hnlich dem Zwischenraum in einem doppelt verglasten Fenster).</li>
<li>Kategorie 5: Erzwungene Konvektion parallel zu einer ebenen Fl&auml;che.</li></ul>
<p><span id="Scripts"></span>
</p>
<h2><span class="mw-headline" id="Skript">Skript</span></h2>
<p>Die Dateien HeatFlowConvectionConduction.py, Thermal.py und
SpreadsheetDataReadWrite.py k&ouml;nnen heruntergeladen werden unter:
</p><p><a rel="nofollow" class="external free" href="https://git.disroot.org/CrowdDiscussesAlternatives/ScriptsForFreeCAD/src/branch/master/Thermal">https://git.disroot.org/CrowdDiscussesAlternatives/ScriptsForFreeCAD/src/branch/master/Thermal</a>
</p><p><span id="Links"></span>
</p>
<h2><span class="mw-headline" id="Verweise">Verweise</span></h2>
<p>Die Forumsdiskussion: <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=99795">Presenting HeatFlowConvectionConduction macro</a>
</p><p>Die Dokumentation dieses Skripts im PDF-Format: <a rel="nofollow" class="external text" href="https://git.disroot.org/CrowdDiscussesAlternatives/ScriptsForFreeCAD/src/branch/master/Thermal/HeatFlowConvectionConduction_documentation.pdf">W&auml;rmestr&ouml;mung Konvektion W&auml;rmeleitung Dokumentation</a>
</p><p><span id="References"></span>
</p>
<h2><span class="mw-headline" id="Referenzen">Referenzen</span></h2>
<ol><li><a rel="nofollow" class="external text" href="https://www.engineeringtoolbox.com/thermal-conductivity-d_429.html">W&auml;rmeleitf&auml;higkeit g&auml;ngiger Materialien &ndash; Feststoffe, Fl&uuml;ssigkeiten und Gase (englisch)</a></li>
<li>W&auml;rme&uuml;bertragung durch ein doppelt verglastes Fenster mittels Konvektion, V &#1040; &#1052;&#1072;i&#1086;r&#1086;v. Zitat V A Maiorov 2020 IOP Conf. Ser.: Mater. Sci. Eng. 939 012049, DOI 10.1088/1757-899X/939/1/012049. <a rel="nofollow" class="external free" href="https://iopscience.iop.org/article/10.1088/1757-899X/939/1/012049/pdf">https://iopscience.iop.org/article/10.1088/1757-899X/939/1/012049/pdf</a></li>
<li>Handbuch zur W&auml;rme&uuml;bertragung, von Adrian Bejan und Allan D. Kraus</li></ol>
<!-- 
NewPP limit report
Cached time: 20251208184021
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.070 seconds
Real time usage: 0.194 seconds
Preprocessor visited node count: 185/1000000
Post&#8208;expand include size: 4283/2097152 bytes
Template argument size: 1293/2097152 bytes
Highest expansion depth: 7/100
Expensive parser function count: 3/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1532/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   36.774      1 -total
 37.86%   13.923      1 Template:Macro/de
 16.63%    6.115      1 Template:Code
 16.11%    5.923      3 Template:Button
 12.96%    4.766      1 Template:MenuCommand
 11.33%    4.165      1 Template:Incode
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:398459-0!canonical and timestamp 20251208184020 and revision id 1713025. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>