<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Macro Half-Hull Model/de</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="de" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Macro+Half-Hull+Model&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--high" lang="de" dir="ltr">Deutsch</span></li>
<li><a href="../Macro_Half-Hull_Model.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Macro Half-Hull Model (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../fr/Macro_Half-Hull_Model.html" class="mw-pt-progress mw-pt-progress--complete" title="Macro Half-Hull Model (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/Macro_Half-Hull_Model.html" class="mw-pt-progress mw-pt-progress--med" title="Macro Modello di mezzo scafo (66% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Macro_Half-Hull_Model.html" class="mw-pt-progress mw-pt-progress--low" title="Makrodefinicja: Model p&oacute;&#322;kad&#322;ubowy (2% translated)" lang="pl" dir="ltr">polski</a></li></ul></div>
<table class="fcinfobox wikitable ct" width="100%" style="float: right; width: 230px; margin-left: 10px;">
<tbody><tr>
<td class="ctTitle" style="font-weight: bold; font-size: 125%;">
<p><span typeof="mw:File"><a href="../index.php?title=Macro_Half_Hull_Model.png&amp;filetimestamp=20240210201133&amp;.html" class="mw-file-description"><img src="../File/Macro_Half_Hull_Model.png" decoding="async" width="32" height="32" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span><span> </span>
Halb-Rumpf-Modell
</p>
</td></tr>
<tr>
<th class="ctOdd">Beschreibung
</th></tr>
<tr>
<td class="ctEven left macro-description">Dieses Makro erzeugt sowohl dreidimensionale Halb- als auch Vollrumpfmodelle aus einer Reihe von 2D-Linienzeichnungen.<br>Dieses Makro erstellt einfache Modelle der R&uuml;mpfe von Booten und Schiffen. Es soll Menschen helfen, die R&uuml;mpfe modellieren oder entwerfen, indem es die Oberfl&auml;che des Rumpfes in einer einfachen und zeitnahen Weise bereitstellt, so dass sie den zeitaufwendigen vollst&auml;ndigen Prozess vermeiden k&ouml;nnen.<br><br>Versionsmakro&nbsp;: 1.0<br>Datum der letzten &Auml;nderung&nbsp;: 2016-01-25<br>FreeCAD version&nbsp;: &lt;= 0.16<br>Herunterladen&nbsp;: <a rel="nofollow" class="external text" href="https://wiki.freecad.org/images/4/44/Macro_Half_Hull_Model.png">Werkzeugleisten-Symbol</a><br>Autor: Piffpoof<br>
</td></tr>
<tr>
<th class="ctOdd">Autor
</th></tr>
<tr>
<td class="ctEven macro-author"><a href="../User;Piffpoof.html" title="User:Piffpoof">Piffpoof</a>
</td></tr>
<tr>
<th class="ctOdd">Herunterladen
</th></tr>
<tr>
<td class="ctEven macro-download"><a rel="nofollow" class="external text" href="https://wiki.freecad.org/images/4/44/Macro_Half_Hull_Model.png">Werkzeugleisten-Symbol</a>
</td></tr>
<tr>
<th class="ctOdd">Links
</th></tr>
<tr>
<td class="ctEven macro-Links"><a href="../de/Macros_recipes.html" title="Macros recipes/de">Makros Rezepte</a><br><a href="../de/How_to_install_macros.html" title="How to install macros/de">Wie man Makros installiert</a><br><a href="../de/Customize_Toolbars.html" title="Customize Toolbars/de">Symbolleisten anpassen</a>
</td></tr>
<tr>
<th class="ctOdd">Macro-Version
</th></tr>
<tr>
<td class="ctEven macro-version">1.0
</td></tr>
<tr>
<th class="ctOdd">Datum der letzten &Auml;nderung
</th></tr>
<tr>
<td class="ctEven macro-date">2016-01-25
</td></tr>
<tr>
<th class="ctOdd">FreeCAD-Version(s)
</th></tr>
<tr>
<td class="ctEven FreeCAD-version">&lt;= 0.16
</td></tr>
<tr>
<th class="ctOdd">Standardverkn&uuml;pfung
</th></tr>
<tr>
<td class="ctEven"><i>None</i>
</td></tr>
<tr>
<th class="ctOdd">Siehe auch
</th></tr>
<tr>
<td class="ctEven"><i>None</i>
</td></tr>
<tr>
<th class="ctOdd">
</th></tr>
<tr>
<td class="ctToc"><br><meta property="mw:PageProp/toc">
</td></tr>
</tbody></table>
<p><span id="Description"></span>
</p>
<h2><span class="mw-headline" id="Beschreibung">Beschreibung</span></h2>
<p>Dieses Makro erstellt einfache Modelle der R&uuml;mpfe von Booten und Schiffen. Es soll Personen, die R&uuml;mpfe modellieren oder entwerfen, helfen, indem es die Oberfl&auml;che des Rumpfes auf einfache und zeitnahe Weise bereitstellt, so dass sie den zeitaufw&auml;ndigen vollst&auml;ndigen Prozess vermeiden k&ouml;nnen.
</p>
<div class="toccolours mw-collapsible mw-collapsed" style="cursor:not-allowed">
<p>Temporary code for external macro link. Do not use this code. This code is used exclusively by <a href="../Std_AddonMgr.html" title="Std AddonMgr">Addon Manager</a>. <i>Link for optional manual installation: <a rel="nofollow" class="external text" href="http://pastebin.com/raw/tZMpUi6F">Macro</a></i>
</p>
<div class="mw-collapsible-content">
<pre>

# This code is copied instead of the original macro code
# to guide the user to the online download page.
# Use it if the code of the macro is larger than 64 KB and cannot be included in the wiki
# or if the RAW code URL is somewhere else in the wiki.

from PySide import QtGui, QtCore

diag = QtGui.QMessageBox(QtGui.QMessageBox.Information,
    "Information",
    "This macro must be downloaded from this link\n"
    "\n"
    "http://pastebin.com/raw/tZMpUi6F" + "\n"
    "\n"
    "Quit this window to access the download page")

diag.setWindowFlags(QtCore.Qt.WindowStaysOnTopHint)
diag.setWindowModality(QtCore.Qt.ApplicationModal)
diag.exec_()

import webbrowser 
webbrowser.open("http://pastebin.com/raw/tZMpUi6F")
</pre>
</div>
</div>
<div style="display:none;">&lt;class="rawcodeurl"&gt;&lt;a href="<a rel="nofollow" class="external free" href="http://pastebin.com/raw/tZMpUi6F">http://pastebin.com/raw/tZMpUi6F</a>"&gt;raw code&lt;/a&gt;</div>
<p><br>
<span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Half-Hull_ModelScreenBoatInABottle.jpg&amp;filetimestamp=20150123183027&amp;.html" class="mw-file-description"><img src="../File/Macro_Half-Hull_ModelScreenBoatInABottle.jpg" decoding="async" width="550" height="323" class="mw-file-element" data-file-width="550" data-file-height="323"></a></span>
</p><p><span id="Background"></span>
</p>
<h2><span class="mw-headline" id="Hintergrund">Hintergrund</span></h2>
<p>Seit der Antike mussten Bootsbauer Boote entwerfen und sie dann in einer dreidimensionalen Umgebung realisieren, in der nur wenige Linien gerade, nur wenige Fl&auml;chen eben und keine Winkel &uuml;ber eine Strecke konstant sind. Anhand von Rumpfmodellen wurden ma&szlig;stabsgetreue Modelle angefertigt, die dann zur &Uuml;berpr&uuml;fung des Entwurfs oder zur Kommunikation von Konzepten mit anderen Personen verwendet werden konnten. Die Gesetze der Hydrodynamik verlangen, dass jedes Schiff, das sich durch eine Fl&uuml;ssigkeit bewegt, im Querschnitt symmetrisch sein muss, wenn es genau verfolgt werden soll (sich in einer geraden Linie bewegen soll). Folglich gen&uuml;gte es, eine Seite des Rumpfes im Modell zu bauen - wenn der halbe Rumpf perfekt war, dann w&uuml;rde auch sein Spiegelbild perfekt sein. In sp&auml;teren Jahren wurden Halbr&uuml;mpfe f&uuml;r symbolische Zwecke wie Plaketten und nautische Kunst verwendet.
</p><p>Dieser Code entstand aus einem Projekt zur Erstellung eines Modells in FreeCAD von einem 12,5 Meter langen Segelboot. Die Erbauer hatten keine Zeichnungen mehr und der Sohn des urspr&uuml;nglichen Besitzers bezweifelte, dass es jemals vollst&auml;ndige Zeichnungen gab. Folglich mussten die Rumpfabmessungen gemessen und dann ein Modell in der Software konstruiert werden. Moderne Softwarepakete wie FreeCAD bieten viele n&uuml;tzliche Funktionen wie Symmetriebeschr&auml;nkungen, aber wenn das Endergebnis ein Modell sein soll, das &bdquo;ins Auge sticht&ldquo;, ist viel &bdquo;Feinarbeit&ldquo; an den Modellen erforderlich. Dieser Code wurde geschrieben, um diesen Prozess zu automatisieren.
</p><p>Der urspr&uuml;ngliche Zweck dieses Codes war es, einen symmetrischen Rumpf bereitzustellen, der formbar war, damit er an das zu konstruierende 3D-Modell angepasst werden konnte. Im weiteren Verlauf wurde das Programm verallgemeinert, so dass es hoffentlich f&uuml;r Personen von Nutzen sein wird:
</p>
<ul><li>Bootskonstrukteure, die Bootspl&auml;ne erstellen, aus denen gebaut werden kann</li>
<li>Bootsbauer, die versuchen, das zu modellieren, was auf ihren Pl&auml;nen beschrieben ist</li>
<li>Modellrumpfbauer.</li></ul>
<p>Nat&uuml;rlich verf&uuml;gen kommerzielle Bootsdesigner &uuml;ber alle Arten von High-End-Software, die sie bei ihrer Arbeit unterst&uuml;tzt. Dieses Programm soll diese nicht ersetzen. Vielmehr ist es f&uuml;r Hobbybastler oder Selbstbauer gedacht, die gerne herumt&uuml;fteln.
</p><p>Nautische Blaupausen haben eine eigene Geschichte in Bezug auf Bauten und sind daher etwas anders in der Darstellung. Dies ist ein Beispiel f&uuml;r ein Segelboot, das mehr als ein Jahrhundert alt ist: 
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Half-Hull_ModelImage0.jpg&amp;filetimestamp=20150124080025&amp;.html" class="mw-file-description"><img src="../File/Macro_Half-Hull_ModelImage0.jpg" decoding="async" width="500" height="280" class="mw-file-element" data-file-width="500" data-file-height="280"></a></span>
</p><p>Eines der Endziele dieses Programms ist es, mit der Entwurf Arbeitsbereich einige dieser Pl&auml;ne zu generieren, indem das Modell zur Erzeugung der Linien verwendet wird.
</p><p><b>Hinweis zu Einheiten in FreeCAD:</b>
</p><p>Zur Zeit gibt es kein wirkliches Einheiten-Verwaltungssystem in FreeCAD, aber nat&uuml;rlich braucht ein Bootsbauer oder Modellbauer ein genaues Ma&szlig;system. Um dieses Makro zu verwenden, entscheidet man sich, die FreeCAD-Rastergr&ouml;&szlig;e auf das einzustellen, was immer f&uuml;r die Arbeit angemessen ist (z. B. mm, cm, Zoll, Fu&szlig;). FreeCAD ist konsistent, eine FreeCAD-Einheit wird immer gleich einer FreeCAD-Einheit sein. Und wenn man sich entschieden hat, dass eine FreeCAD-Einheit einer bestimmten physikalischen L&auml;nge entspricht, dann werden die Zeichnungen konsistent bema&szlig;t bleiben. Zur Zeit wird an einem Einheitensystem f&uuml;r FreeCAD gearbeitet, so dass sich diese Situation bald &auml;ndern k&ouml;nnte.
</p><p><span id="Description"></span>
</p>
<h2><span class="mw-headline" id="Beschreibung_2">Beschreibung</span></h2>
<p>F&uuml;r dieses Makro werden die Rumpfformen durch ein Minimum von drei FreeCAD-Skizzen definiert: eine in der YZ-Ebene, eine oder mehrere in der XZ-Ebene, eine in der XY-Ebene. Hier ist der minimale Rumpf, der von diesem Makro unterst&uuml;tzt wird, er hat nur drei Skizzen:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Half-Hull_ModelImage1.jpg&amp;filetimestamp=20150123210026&amp;.html" class="mw-file-description"><img src="../File/Macro_Half-Hull_ModelImage1.jpg" decoding="async" width="500" height="384" class="mw-file-element" data-file-width="500" data-file-height="384"></a></span>
</p><p><b>Anmerkung</b>: In der obigen Abbildung schauen wir direkt auf das Heck, der Bug zeigt vom Standpunkt weg.
</p><p>Von vorne nach hinten (vom Bug zum Heck) sind die drei Skizzen:
</p>
<table style="width: 500px" border="1">
        <tbody><tr>
          <td>Steven<br>
          </td>
          <td>YZ-Ebene<br>
          </td>
          <td>rote Linie in der Skizze<br>
          </td>
        </tr>
        <tr>
          <td>Querspante<br>
          </td>
          <td>XZ-Ebene<br>
          </td>
          <td>gr&uuml;ne Linie in der Skizze<br>
          </td>
        </tr>
        <tr>
          <td>Querbalken<br>
          </td>
          <td>XY-Ebene<br>
          </td>
          <td>blaue Linie in der Skizze<br>
          </td>
        </tr>
    </tbody></table>
<p><br>
Vielleicht ist es mit sieben Skizzen (eine in der YZ-Ebene, eine in der XY-Ebene und f&uuml;nf in der XZ-Ebene) einfacher zu sehen:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Half-Hull_ModelImage2.jpg&amp;filetimestamp=20150123210254&amp;.html" class="mw-file-description"><img src="../File/Macro_Half-Hull_ModelImage2.jpg" decoding="async" width="500" height="323" class="mw-file-element" data-file-width="500" data-file-height="323"></a></span>
</p><p>Mit f&uuml;nf Skizzen in der XZ-Ebene wird es immer einfacher, die Form des Rumpfes zu erkennen. Die n&auml;chsten zwei Bilder zeigen die Skizzenlinien, die dem von FreeCAD konstruierten Modell &uuml;berlagert sind,
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Half-Hull_ModelImage3.jpg&amp;filetimestamp=20150123210332&amp;.html" class="mw-file-description"><img src="../File/Macro_Half-Hull_ModelImage3.jpg" decoding="async" width="500" height="399" class="mw-file-element" data-file-width="500" data-file-height="399"></a></span>
</p><p>das zweite ist das gleiche Modell um 90 Grad gedreht, so dass der Bug im Vordergrund ist:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Half-Hull_ModelImage3a.jpg&amp;filetimestamp=20150123212620&amp;.html" class="mw-file-description"><img src="../File/Macro_Half-Hull_ModelImage3a.jpg" decoding="async" width="500" height="332" class="mw-file-element" data-file-width="500" data-file-height="332"></a></span>
</p><p>Einige Punkte, die zu beachten sind:
</p>
<ul><li>Die Skizzen gelten nur f&uuml;r:
<ul><li>den Steven (oder Buglinie) in der YZ-Ebene (rot in der obigen Abbildung);</li>
<li>die Oberseite des Heckspiegels in der XY-Ebene (blau in der obigen Abbildung);</li>
<li>mehrere Querschnitte des Rumpfes in der XZ-Ebene (gr&uuml;n in der obigen Abbildung)</li></ul></li>
<li>In den Skizzen wird nur die Steuerbordseite des Rumpfes gezeichnet, die Backbordseite wird als Spiegelbild erzeugt.</li>
<li>Jede Linie mit mehreren Segmenten muss in einer separaten Skizze enthalten sein.</li>
<li>Jede Skizze muss die gleiche Anzahl von Liniensegmenten haben (in den vorherigen Beispielen sind es drei).</li>
<li>Je mehr Liniensegmente in jeder Skizze enthalten sind, desto genauer entspricht das von FreeCAD generierte Modell einem gekr&uuml;mmten Rumpf.</li>
<li>Die Anzahl der Liniensegmente in jeder Skizze ist unbegrenzt, es kann eine beliebige Anzahl ab eins sein.</li>
<li>Die Anzahl der Skizzen in der XZ-Ebene (d. h. Querschnitte) ist unbegrenzt, es kann eine beliebige Anzahl ab eins sein.</li></ul>
<p>Mit gen&uuml;gend Skizzen kann sich das generierte Modell sogar ann&auml;hern an:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Half-Hull_ModelImage4.jpg&amp;filetimestamp=20150123205457&amp;.html" class="mw-file-description"><img src="../File/Macro_Half-Hull_ModelImage4.jpg" decoding="async" width="500" height="175" class="mw-file-element" data-file-width="500" data-file-height="175"></a></span>
</p><p>Das HalbRumpf-Makro erzeugt vier Modelle:
</p>
<ul><li>Steuerbord-Halbrumpf</li>
<li>Backbord-Halbrumpf</li>
<li>Kompletter Rumpf</li>
<li>Schotten f&uuml;r den kompletten Rumpf, entweder mit einem Glattdeck oder mit einem Kaj&uuml;tdeck</li></ul>
<p>Diese Modelle werden alle im einheitlichen Ortsraum von FreeCAD ausgegeben, sodass sie zusammengef&uuml;gt werden k&ouml;nnen, beispielsweise k&ouml;nnen die Schotten nahtlos in den kompletten Rumpf eingef&uuml;gt werden. Dies ist ein Bild von Schotten in einem Bootsmodell w&auml;hrend des Baus:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Half-Hull_ModelImage5.jpg&amp;filetimestamp=20150123205110&amp;.html" class="mw-file-description"><img src="../File/Macro_Half-Hull_ModelImage5.jpg" decoding="async" width="428" height="320" class="mw-file-element" data-file-width="428" data-file-height="320"></a></span>
</p><p>Sowie die durch das Makro erzeugten Schotten (es muss beachtet werden, dass diese Schotten f&uuml;r ein Kaj&uuml;tdeck und nicht f&uuml;r ein Glattdeck bestimmt sind):
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Half-Hull_ModelImage6.jpg&amp;filetimestamp=20150123204845&amp;.html" class="mw-file-description"><img src="../File/Macro_Half-Hull_ModelImage6.jpg" decoding="async" width="465" height="325" class="mw-file-element" data-file-width="465" data-file-height="325"></a></span>
</p><p>Das folgende zusammengesetzte Bild zeigt die wichtigsten Ergebnisse dieses Programms (die Backbord-Halbschale ist nicht abgebildet, entspricht jedoch der Steuerbord-Halbschale, die abgebildet ist). Die Ergebnisse sind im Uhrzeigersinn von der oberen linken Ecke aus angeordnet:
</p>
<ul><li>Steuerbord-Halbschale</li>
<li>Kompletter Rumpf</li>
<li>Schotten (f&uuml;r ein Glattdeck, die Schotten im vorherigen Bild waren f&uuml;r ein Kaj&uuml;tdeck vorgesehen)</li>
<li>der komplette Rumpf mit eingef&uuml;gten Schotten</li></ul>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Half-Hull_ModelImage7.jpg&amp;filetimestamp=20150124072817&amp;.html" class="mw-file-description"><img src="../File/Macro_Half-Hull_ModelImage7.jpg" decoding="async" width="500" height="400" class="mw-file-element" data-file-width="500" data-file-height="400"></a></span>
</p><p>Als neue Funktionen kann das Makro optional auch Tafeln f&uuml;r die Halbschalen und sogar eine Flasche f&uuml;r den kompletten Rumpf erstellen:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Half-Hull_ModelImage8.jpg&amp;filetimestamp=20150124072946&amp;.html" class="mw-file-description"><img src="../File/Macro_Half-Hull_ModelImage8.jpg" decoding="async" width="500" height="136" class="mw-file-element" data-file-width="500" data-file-height="136"></a></span>
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Half-Hull_ModelImage9.jpg&amp;filetimestamp=20150124073017&amp;.html" class="mw-file-description"><img src="../File/Macro_Half-Hull_ModelImage9.jpg" decoding="async" width="500" height="335" class="mw-file-element" data-file-width="500" data-file-height="335"></a></span>
</p>
<h2><span class="mw-headline" id="Installation">Installation</span></h2>
<p>Der gesamte Code f&uuml;r halfHullModel.FCMacro befindet sich in einem Makro. Die Installation besteht also darin, den Code in das entsprechende Makroverzeichnis zu kopieren und das Build-Dienstprogramm &uuml;ber das Makro-Men&uuml;, die Python-Konsole oder eine Symbolleisten-Schaltfl&auml;che (die bevorzugte Methode) aufzurufen.
</p>
<ul><li>siehe <a href="../de/How_to_install_macros.html" title="How to install macros/de">Wie man Makros installiert</a> Informationen zur Installation dieses Makro-Codes</li>
<li>siehe <a href="../de/Customize_Toolbars.html" title="Customize Toolbars/de">Symbolleisten anpassen</a> f&uuml;r Informationen zur Installation als Schaltfl&auml;che in einer Symbolleiste</li></ul>
<p><span id="Usage"></span>
</p>
<h2><span class="mw-headline" id="Anwendung">Anwendung</span></h2>
<p>Die FreeCAD-Operationen, die bei der Erstellung des Rumpfmodells zum Einsatz kommen, sind ziemlich komplex und zahlreich. Dinge wie die Richtung, in der eine Linie gezeichnet wird, k&ouml;nnen dazu f&uuml;hren, dass die FreeCAD-Konstruktion des Rumpfes entweder abgebrochen wird oder wie folgt aussieht:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Half-Hull_ModelUsage1.jpg&amp;filetimestamp=20150125144403&amp;.html" class="mw-file-description"><img src="../File/Macro_Half-Hull_ModelUsage1.jpg" decoding="async" width="445" height="397" class="mw-file-element" data-file-width="445" data-file-height="397"></a></span>
</p><p>Daher m&uuml;ssen die folgenden Schritte genau befolgt werden. Das Makro l&auml;sst zwar gewisse Dateninkonsistenzen zu, aber im Allgemeinen sieht das Ergebnis bei falschen Daten (d. h. den Skizzen) wie eine K&auml;sereibe aus oder das Makro schl&auml;gt mit einer Fehlermeldung fehl.
</p><p>Die folgenden Anweisungen beziehen sich auf die Quadranten des XY-Diagramms, d. h. auf die vier Viertel des XY-Diagramms, die wie folgt bezeichnet sind:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Half-Hull_ModelUsage2.jpg&amp;filetimestamp=20150125144832&amp;.html" class="mw-file-description"><img src="../File/Macro_Half-Hull_ModelUsage2.jpg" decoding="async" width="294" height="285" class="mw-file-element" data-file-width="294" data-file-height="285"></a></span>
</p><p><b>Ein neues Dokument erzeugen</b>
</p><p>Als Erstes erstellt man ein neues Dokument in FreeCAD <span typeof="mw:File"><a href="../index.php?title=Document-new.svg&amp;filetimestamp=20240704191830&amp;.html" class="mw-file-description"><img src="../File/Document-new.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span>. Dieses Dokument enth&auml;lt alle Skizzen, aus denen sich die Rumpfdefinition zusammensetzt.
</p><p><span id="Create_the_Stemline"></span>
</p>
<h3><span class="mw-headline" id="Den_Kiel_erstellen">Den Kiel erstellen</span></h3>
<p>Der erste Schritt besteht darin, Daten f&uuml;r das zu erstellende Rumpfmodell zu erstellen. Die Daten werden in Form von Skizzen innerhalb von FreeCAD bereitgestellt. Nachdem das Rumpfmodell erstellt wurde, k&ouml;nnen &Auml;nderungen einfach durch Bearbeiten der Skizzen vorgenommen werden. Der zweite Schritt besteht darin, das Makro wiederholt auszuf&uuml;hren.
</p>
<ol><li>Eine neue Skizze  <span typeof="mw:File"><a href="../index.php?title=Sketcher_NewSketch.svg&amp;filetimestamp=20231231201726&amp;.html" class="mw-file-description"><img src="../File/Sketcher_NewSketch.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span>, in der YZ-Ebene erstellen</li>
<li>Am Ursprung (0,0) beginnen und nach oben in den Quadranten I zeichnen.<br><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Half-Hull_ModelUsage3.jpg&amp;filetimestamp=20150125145234&amp;.html" class="mw-file-description"><img src="../File/Macro_Half-Hull_ModelUsage3.jpg" decoding="async" width="500" height="555" class="mw-file-element" data-file-width="500" data-file-height="555"></a></span></li>
<li>Das untere Ende des Kiels befindet sich am Ursprung (0,0). Dies ist der Punkt, von dem aus die Platzierung aller Querschnitte und des Heckspiegel erfolgt.</li>
<li>Die Anzahl der Liniensegmente in dieser Skizze bestimmt die Anzahl, die in jeder anderen Skizze erforderlich ist.</li>
<li>Skizze speichern <span typeof="mw:File"><a href="../index.php?title=Sketcher_LeaveSketch.svg&amp;filetimestamp=20231231201626&amp;.html" class="mw-file-description"><img src="../File/Sketcher_LeaveSketch.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span></li>
<li>Zur leichteren Identifizierung empfiehlt es sich, die Skizze beispielsweise als &bdquo;Kiel-Skizze&rdquo; zu benennen.</li></ol>
<p><span id="Create_the_Cross-section_Sketch(es)"></span>
</p>
<h3><span class="mw-headline" id="Die_Querschnittsskizzen_erstellen">Die Querschnittsskizzen erstellen</span></h3>
<div lang="en" dir="ltr" class="mw-content-ltr">
<ol><li>create a new sketch <span typeof="mw:File"><a href="../index.php?title=Sketcher_NewSketch.svg&amp;filetimestamp=20231231201726&amp;.html" class="mw-file-description"><img src="../File/Sketcher_NewSketch.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span>, in the XZ-Plane</li>
<li>the following dialog will appear:<br><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Half-Hull_ModelScreenSnapshot1.jpg&amp;filetimestamp=20150125145436&amp;.html" class="mw-file-description"><img src="../File/Macro_Half-Hull_ModelScreenSnapshot1.jpg" decoding="async" width="239" height="250" class="mw-file-element" data-file-width="239" data-file-height="250"></a></span><br>The dialog is asking how far from the origin the Sketch should be placed. This will refer to how far the cross-section is from the bottom of the stemline (which was placed at (0,0)). The cross-sections can be equally spaced but need not be. The forward-most cross-section will be at Y=0 (i.e. the origin where the stemline bottom ends) or at Y&lt;=0. The cross-sections will be at increasingly negative Y values until the transom is at the most negative Y value. In the example above, the cross-section Sketch will be placed 50 FreeCAD units from the origin on the negative Y axis.</li>
<li>start on the Y axis and draw upwards into Quadrant I<br>- the first (i.e. foremost) cross-section should start at origin (0,0) (or it will look odd as the stemline ends at 0,0) but other cross-sections need only start on the Y axis.<br><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Half-Hull_ModelUsage3.jpg&amp;filetimestamp=20150125145234&amp;.html" class="mw-file-description"><img src="../File/Macro_Half-Hull_ModelUsage3.jpg" decoding="async" width="500" height="555" class="mw-file-element" data-file-width="500" data-file-height="555"></a></span></li>
<li>use the same number of line segments as in the Stemline Sketch</li>
<li>save sketch <span typeof="mw:File"><a href="../index.php?title=Sketcher_LeaveSketch.svg&amp;filetimestamp=20231231201626&amp;.html" class="mw-file-description"><img src="../File/Sketcher_LeaveSketch.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span></li>
<li>repeat as this step necessary, it may be quicker to copy this sketch  and then space the copies on the Y-axis, modifications may be made to the individual Sketches as required</li>
<li>for naming, it will make things easier to give some sort of sequence to the cross-sections, starting at the bow (i.e. the stemline) and increasing towards the stern (i.e. the transom)</li></ol>
</div>
<p><span id="Create_the_Transom_Sketch_in_the_XY_Plane"></span>
</p>
<h3><span class="mw-headline" id="Die_Heckspiegel-Skizze_in_der_XY-Ebene_erstellen">Die Heckspiegel-Skizze in der XY-Ebene erstellen</span></h3>
<div lang="en" dir="ltr" class="mw-content-ltr">
<ol><li>create a new sketch <span typeof="mw:File"><a href="../index.php?title=Sketcher_NewSketch.svg&amp;filetimestamp=20231231201726&amp;.html" class="mw-file-description"><img src="../File/Sketcher_NewSketch.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span>, in the XY-Plane</li>
<li>start on the Y axis between quadrant III and IV,  and draw upwards into Quadrant IV so that the end point is coincident with the rightmost point of the lowest cross-section Sketch in the YZ-plane<br><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Half-Hull_ModelUsage4.jpg&amp;filetimestamp=20150125145616&amp;.html" class="mw-file-description"><img src="../File/Macro_Half-Hull_ModelUsage4.jpg" decoding="async" width="500" height="315" class="mw-file-element" data-file-width="500" data-file-height="315"></a></span></li>
<li>use the same number of line segments as in the stemline Sketch</li>
<li>save sketch <span typeof="mw:File"><a href="../index.php?title=Sketcher_LeaveSketch.svg&amp;filetimestamp=20231231201626&amp;.html" class="mw-file-description"><img src="../File/Sketcher_LeaveSketch.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span></li>
<li>for ease of identification it is probably worth naming the Sketch something like "transom sketch"</li></ol>
</div>
<p><b>Das neue Dokument speichern</b>
</p><p>Nun kann das Dokument <span typeof="mw:File"><a href="../index.php?title=Document-save.svg&amp;filetimestamp=20240522171704&amp;.html" class="mw-file-description"><img src="../File/Document-save.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span>, das die Skizzen enth&auml;lt, die die Rumpfform definieren, gespeichert werden. Dazu vergibt man einen aussagekr&auml;ftigen Namen.
</p><p>Nachdem alle Skizzen erstellt und positioniert wurden, sollte das Dokument von oben betrachtet wie folgt aussehen <span typeof="mw:File"><a href="../index.php?title=View-top.svg&amp;filetimestamp=20240704202304&amp;.html" class="mw-file-description"><img src="../File/View-top.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span>:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Half-Hull_ModelUsage5.jpg&amp;filetimestamp=20150125174015&amp;.html" class="mw-file-description"><img src="../File/Macro_Half-Hull_ModelUsage5.jpg" decoding="async" width="500" height="605" class="mw-file-element" data-file-width="500" data-file-height="605"></a></span>
</p><p>Die wichtigsten Einschr&auml;nkungen f&uuml;r die Erstellung des Modells sind:
</p>
<ul><li>Der untere Rand des Kiels sollte bei (0,0) enden.</li>
<li>Das untere mittlere Ende jedes Querschnitts sollte an der Y-Achse enden &ndash; es muss beachtet werden, dass es einen beliebigen Z-Wert haben kann.</li></ul>
<p>Damit ist der erste Schritt abgeschlossen, bei dem die Daten erstellt werden, die das Makro zum Erstellen von Halbschalen und vollst&auml;ndigen Schalen verwendet. Der zweite Schritt wird im folgenden Abschnitt mit dem Titel Benutzeroberfl&auml;che beschrieben.
</p><p><span id="User_Interface"></span>
</p>
<h2><span id="Benutzeroberfl.C3.A4che"></span><span class="mw-headline" id="Benutzeroberfl&auml;che">Benutzeroberfl&auml;che</span></h2>
<p>In diesem Schritt sammelt das Makro einige Informationen vom Benutzer und verarbeitet dann die eingegebenen Skizzen, um die gew&uuml;nschten Rumpfmodelle zu generieren. Dies ist das einzige GUI-Bild f&uuml;r das Makro und enth&auml;lt in erster Linie Konfigurationsdetails f&uuml;r die Erstellung der Rumpfmodelle aus den Skizzen:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Half-Hull_ModelScreenSnapshot2.jpg&amp;filetimestamp=20150129190008&amp;.html" class="mw-file-description"><img src="../File/Macro_Half-Hull_ModelScreenSnapshot2.jpg" decoding="async" width="500" height="361" class="mw-file-element" data-file-width="500" data-file-height="361"></a></span>
</p><p>Die Auswahlm&ouml;glichkeiten im GUI-Fenster sind:
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<ul><li>Starboard half-hull: checking this will cause the macro to produce a starboard half-hull model
<ul><li>Mounting plaque: if checked the macro will mount the half-hull on a plaque</li>
<li>Allow space for keel: if checked will cause the half hull to be mounted higher on the plaque than the centre position, this is so a separately generated keel could be placed below the hull</li></ul></li>
<li>Port half-hull: checking this will cause the macro to produce a port half-hull model
<ul><li>Mounting plaque: if checked the macro will mount the half-hull on a plaque</li>
<li>Allow space for keel: if checked will cause the half hull to be mounted higher on the plaque than the centre position, this is so a separately generated keel could be placed below the hull</li></ul></li>
<li>Complete hull: checking this will cause the macro to produce a complete model
<ul><li>Bottle for complete hull: if checked the macro will place the complete hull inside a transparent bottle (complete with cork)</li>
<li>Allow space for keel: if checked will cause the half hull to be positioned higher in the bottle than the centre position, this is so a separately generated keel could be placed below the hull</li></ul></li>
<li>Bulkheads for flush deck: checking this will cause the macro to produce bulkheads whose tops are level with the top of the hull, bulkheads will not be generated for the most forward 2 cross-sections or the aft-most 2 cross-sections</li>
<li>Bulkheads for coachhouse: checking this will cause the macro to produce bulkheads whose tops are possibly above the top of the hull.
<ul><li>Bulkheads to skip at bow determines how many cross-sections will be left without a bulkhead at the bow</li>
<li>Bulkheads to skip at stern determines how many cross-sections will be left without a bulkhead at the stern</li></ul></li>
<li>The dimensions of the top of the bulkheads will be configured as per the following diagram:<br><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Half-Hull_ModelUi1.jpg&amp;filetimestamp=20150125150428&amp;.html" class="mw-file-description"><img src="../File/Macro_Half-Hull_ModelUi1.jpg" decoding="async" width="500" height="336" class="mw-file-element" data-file-width="500" data-file-height="336"></a></span></li>
<li>Cancel button: the execution is halted and the window closes</li>
<li>Re-Use Last File button: the execution uses the data file AND SETTINGS from the the last run, any changes to settings are ignored</li>
<li>Select File button: the standard Open File window is opened where the user can either select a file or Cancel and exit</li></ul>
</div>
<p>Wenn das Makro ausgef&uuml;hrt wird, nimmt es Konfigurationsdaten vom Benutzer entgegen und liest dann Sketcher-Skizzen in der ausgew&auml;hlten Eingabedatei.
</p><p><b>Hinweis</b>: W&auml;hrend das Makro die Skizzen durchl&auml;uft, druckt es alle Ausnahmen sowie einige Meilensteine in der Berichtsansicht aus. Wenn man unerwartete Ergebnisse erh&auml;lt oder Teile fehlen, sollte man wahrscheinlich zuerst hier nachsehen.
</p><p><span id="Options"></span>
</p>
<h2><span class="mw-headline" id="Optionen">Optionen</span></h2>
<p>Es gibt verschiedene Arten von Bug- und Heckformen f&uuml;r Boote, wobei die Heckformen eine viel gr&ouml;&szlig;ere Vielfalt aufweisen als die Bugformen. Hier sind Beispiele f&uuml;r Heckspiegel und Bugformen aus der realen Welt neben den entsprechenden Makro-Ausgaben:
</p><p><b>Deckssprung-Heck</b>
</p><p>Wahrscheinlich der h&auml;ufigste Hecktyp, typisch f&uuml;r alle Schiffsgr&ouml;&szlig;en, von Handelsschiffen bis hin zu Ruderbooten.
</p>
<table style="width: 500pix" border="0">
  <tbody><tr>
    <td><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Half-Hull_ModelOption1.jpg&amp;filetimestamp=20150128165532&amp;.html" class="mw-file-description"><img src="../File/Macro_Half-Hull_ModelOption1.jpg" decoding="async" width="200" height="150" class="mw-file-element" data-file-width="200" data-file-height="150"></a></span></td>
    <td><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Half-Hull_ModelOption2.jpg&amp;filetimestamp=20150128165605&amp;.html" class="mw-file-description"><img src="../File/Macro_Half-Hull_ModelOption2.jpg" decoding="async" width="200" height="200" class="mw-file-element" data-file-width="200" data-file-height="200"></a></span></td>
  </tr>
</tbody></table>
<ul><li>Der XY-Heckspiegel sollte so nah wie m&ouml;glich am hintersten Querschnitt liegen.</li></ul>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p><b>Sugar-Scoop Stern</b>
</p>
</div>
<p>Am ehesten auf einer Segelyacht zu finden, ist es ein Produkt des Designs zur Maximierung der Wasserlinienl&auml;nge, um von den Klassenregeln f&uuml;r Segelregatten zu profitieren.
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<table style="width: 500pix" border="0">
  <tbody><tr>
    <td><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Half-Hull_ModelOption3.jpg&amp;filetimestamp=20150128165706&amp;.html" class="mw-file-description"><img src="../File/Macro_Half-Hull_ModelOption3.jpg" decoding="async" width="200" height="150" class="mw-file-element" data-file-width="200" data-file-height="150"></a></span></td>
    <td><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Half-Hull_ModelOption4.jpg&amp;filetimestamp=20150128165907&amp;.html" class="mw-file-description"><img src="../File/Macro_Half-Hull_ModelOption4.jpg" decoding="async" width="200" height="200" class="mw-file-element" data-file-width="200" data-file-height="200"></a></span></td>
  </tr>
</tbody></table>
<ul><li>place the aftmost 2 cross-sections as close as is feasible, then rotate the aftmost of the two through to an angle of 45 degrees (or whatever is called for) around the X-axis</li></ul>
</div>
<p><b>Kanu-Heck</b>
</p><p>Zu finden auf allen Arten von Wasserfahrzeugen, Motor- und Segelbooten, Freizeit- und Handelsbooten.
</p>
<table style="width: 500pix" border="0">
  <tbody><tr>
    <td><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Half-Hull_ModelOption5.jpg&amp;filetimestamp=20150128170008&amp;.html" class="mw-file-description"><img src="../File/Macro_Half-Hull_ModelOption5.jpg" decoding="async" width="200" height="201" class="mw-file-element" data-file-width="200" data-file-height="201"></a></span></td>
    <td><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Half-Hull_ModelOption6.jpg&amp;filetimestamp=20150128170024&amp;.html" class="mw-file-description"><img src="../File/Macro_Half-Hull_ModelOption6.jpg" decoding="async" width="200" height="152" class="mw-file-element" data-file-width="200" data-file-height="152"></a></span></td>
  </tr>
</tbody></table>
<ul><li>Die beiden hintersten Querschnitte so nah wie m&ouml;glich aneinanderlegen, dann den hintersten der beiden um 45 Grad um die X-Achse drehen.</li></ul>
<p><b>Normaler Bogen</b>
</p><p>Bei den Bugformen gibt es viel weniger Vielfalt als bei den Heckspiegeln:
</p>
<table style="width: 500pix" border="0">
  <tbody><tr>
    <td><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Half-Hull_ModelOption7.jpg&amp;filetimestamp=20150129082357&amp;.html" class="mw-file-description"><img src="../File/Macro_Half-Hull_ModelOption7.jpg" decoding="async" width="200" height="207" class="mw-file-element" data-file-width="200" data-file-height="207"></a></span></td>
    <td><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Half-Hull_ModelOption8.jpg&amp;filetimestamp=20150129082428&amp;.html" class="mw-file-description"><img src="../File/Macro_Half-Hull_ModelOption8.jpg" decoding="async" width="200" height="183" class="mw-file-element" data-file-width="200" data-file-height="183"></a></span></td>
  </tr>
</tbody></table>
<p><b>Trireme-Bug</b>
</p><p>Obwohl es in den letzten 2000 Jahren nicht mehr sehr h&auml;ufig anzutreffen war, war dies einst das definitive Bugprofil f&uuml;r Kriegsschiffe:
</p>
<table style="width: 500pix" border="0">
  <tbody><tr>
    <td><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Half-Hull_ModelOption9.jpg&amp;filetimestamp=20150129082511&amp;.html" class="mw-file-description"><img src="../File/Macro_Half-Hull_ModelOption9.jpg" decoding="async" width="200" height="203" class="mw-file-element" data-file-width="200" data-file-height="203"></a></span></td>
    <td><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Half-Hull_ModelOption10.jpg&amp;filetimestamp=20150129082524&amp;.html" class="mw-file-description"><img src="../File/Macro_Half-Hull_ModelOption10.jpg" decoding="async" width="200" height="142" class="mw-file-element" data-file-width="200" data-file-height="142"></a></span></td>
  </tr>
</tbody></table>
<ul><li>Damit der Bug korrekt ist, muss die Polylinie f&uuml;r den Steven von unten nach oben gezeichnet werden, was im Sketcher von rechts nach links bedeutet.</li></ul>
<p><span id="Sample_Files"></span>
</p>
<h2><span class="mw-headline" id="Beispieldateien">Beispieldateien</span></h2>
<p>Diese Dateien sind Beispiele f&uuml;r Skizzen-Daten, die mit dem Makro verwendet werden k&ouml;nnen. Es handelt sich dabei haupts&auml;chlich um die Modelle f&uuml;r die Bildschirmaufnahmen im Abschnitt Optionen oben. Die Dateien funktionieren mit dem Makro und k&ouml;nnen daher heruntergeladen und an die spezifischen Anforderungen angepasst werden. Das Pr&auml;fix 5x3 (zum Beispiel) bedeutet, dass das Modell 5 Querschnitte und 3 Liniensegmente pro Querschnitt (d. h. Skizze) hat.
</p><p>Um eine der Beispieldateien zu verwenden, mit der rechten Maustaste auf den Dateilink klicken und im Men&uuml; Datei speichern unter... w&auml;hlen. Der Dateiname wird angegeben. Den gew&uuml;nschten Ordner/das gew&uuml;nschte Verzeichnis w&auml;hlen, in dem die Beispieldatei gespeichert werden soll.
</p>
<ul><li><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/Examples/raw/master/Half_Hull_Macro_ExampleFiles/3x1.FCStd?raw=true%7C">3x1 H&uuml;lle</a> mit der minimalen Anzahl von Skizzen (Stammlinie, ein Querschnitt, Querbalken) mit 1 Liniensegment pro Skizze &lt;&lt;&lt;&lt;&lt; FUNKTIONIERT DERZEIT NICHT</li>
<li><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/Examples/raw/master/Half_Hull_Macro_ExampleFiles/5x3%20bowNormal.FCStd?raw=true%7C">5x3 mit normalem Bug</a></li>
<li><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/Examples/raw/master/Half_Hull_Macro_ExampleFiles/5x3%20bowTrireme.FCStd?raw=true%7C">5x3 mit Trireme-Bug</a></li>
<li><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/Examples/raw/master/Half_Hull_Macro_ExampleFiles/5x3%20sternCanoeStern.FCStd?raw=true%7C">5x3 mit Kanuheck</a></li>
<li><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/Examples/raw/master/Half_Hull_Macro_ExampleFiles/5x3%20sternSheerTransom.FCStd?raw=true%7C">5x3 mit durchsichtigem Heckspiegel</a></li>
<li><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/Examples/raw/master/Half_Hull_Macro_ExampleFiles/5x3%20sternSugarScoop.FCStd?raw=true%7C">5x3 mit Zuckerschaufel Heck</a></li>
<li><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/Examples/raw/master/Half_Hull_Macro_ExampleFiles/5x5%20workboat.FCStd?raw=true%7C">5x5 Arbeitsschiff</a></li>
<li><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/Examples/raw/master/Half_Hull_Macro_ExampleFiles/7x5%20pirate.FCStd?raw=true%7C">7x5 Piratenschiff</a></li>
<li><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/Examples/raw/master/Half_Hull_Macro_ExampleFiles/12x3%20halfHullS.FCStd?raw=true%7C">12x3 Segelyacht</a></li></ul>
<p><span id="Remarks"></span>
</p>
<h2><span class="mw-headline" id="Anmerkungen">Anmerkungen</span></h2>
<ul><li>Fast alle Beispiele auf dieser Seite wurden mit nur drei Liniensegmenten erstellt, die die Seite des Rumpfes definieren, was zu einem sehr facettierten Erscheinungsbild f&uuml;hrt. Eine Erh&ouml;hung der Anzahl der Segmente in jeder Skizze w&uuml;rde eine viel glattere Oberfl&auml;che erzeugen, was den Realismus erh&ouml;hen w&uuml;rde.</li>
<li>Es werden keine Kiele, Skegs oder Ruder erstellt, d. h. es werden keine Teile des nassen Bereichs erstellt.</li>
<li>Es werden keine quadratischen Bugspitzen wie bei Schubbooten oder Schleppk&auml;hnen erstellt.</li>
<li>Es werden keine U-Boote erstellt (allerdings wird die untere H&auml;lfte eines U-Boots erstellt).</li></ul>
<p><span id="Known_Problems"></span>
</p>
<h2><span class="mw-headline" id="Bekannte_Probleme">Bekannte Probleme</span></h2>
<p>Die Funktion &bdquo;Ruled Surface&ldquo; (Regelfl&auml;che) von FreeCAD wird verwendet, um die Rumpfabschnitte aus den Skizzen zu generieren. Manchmal kann es vorkommen, dass sie ein falsches Ergebnis liefert und statt einer glatten, ebenen Fl&auml;che eine geriffelte Oberfl&auml;che anzeigt. Dies tritt in der Regel auf, wenn die Skizzen gedreht werden, beispielsweise beim Modellieren eines Sugar-Scoop-Hecks. Auch das Abwinkeln eines Sheer-Transom-Hecks kann dies verursachen. Wenn dies auftritt, dann in der Regel entweder bei den Halbschalenmodellen oder beim kompletten Rumpfmodell &ndash; es scheint nie bei allen drei Modellen desselben Rumpfes aufzutreten. Au&szlig;erdem tritt es in der Regel nur am &auml;u&szlig;ersten Bug oder Heck auf. Wenn es in der Mitte des Bootes auftritt, wurde h&ouml;chstwahrscheinlich eine der Skizzen in die falsche Richtung gezeichnet (d. h. entweder in zuf&auml;lliger Reihenfolge oder von oben nach unten, w&auml;hrend alle Linien von unten nach oben gezeichnet werden sollten).
</p><p>Es kann in der Regel mit den folgenden Schritten entfernt werden:
</p>
<ul><li>In der Registerkarte Modell der Combo-Ansicht auf das fehlerhafte Segment klicken, um es auszuw&auml;hlen. Das fehlerhafte Segment wird dann in der Anzeige hervorgehoben angezeigt.</li>
<li>Die Registerkarte Daten in der unteren H&auml;lfte der Combo-Ansicht ausw&auml;hlen. Im unteren Teil des Fensters befindet sich die Bezeichnung &bdquo;Regelfl&auml;che&ldquo; mit einem einzigen Parameter &bdquo;Ausrichtung&ldquo;.</li>
<li>Rechts davon befindet sich ein Popup-Men&uuml; mit den Werten &bdquo;Automatisch&ldquo;, &bdquo;Vorw&auml;rts&ldquo; und &bdquo;Umgekehrt&ldquo;. Es ist zun&auml;chst auf &bdquo;Automatisch&ldquo; eingestellt.</li>
<li>Eine der anderen Einstellungen ausprobieren (daran denken, dass das fehlerhafte Segment weiterhin im oberen Teil der Combo-Ansicht ausgew&auml;hlt sein muss). In der Regel wird das Problem dadurch behoben.</li></ul>
<p>Die folgende Bildschirmaufnahme zeigt den relevanten Teil des Bildschirms:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Half-Hull_ModelKnownProblems1.jpg&amp;filetimestamp=20150129111454&amp;.html" class="mw-file-description"><img src="../File/Macro_Half-Hull_ModelKnownProblems1.jpg" decoding="async" width="500" height="404" class="mw-file-element" data-file-width="500" data-file-height="404"></a></span>
</p><p><span id="Future_Possibilities"></span>
</p>
<h2><span id="Zuk.C3.BCnftige_M.C3.B6glichkeiten"></span><span class="mw-headline" id="Zuk&uuml;nftige_M&ouml;glichkeiten">Zuk&uuml;nftige M&ouml;glichkeiten</span></h2>
<ul><li>Ersetzen von Liniensegmenten von Querschnitten durch gekr&uuml;mmte Linien: Dies befindet sich noch in der Ideenphase, w&uuml;rde jedoch zu einer wesentlich glatteren Oberfl&auml;che in vertikaler Richtung f&uuml;hren, w&auml;hrend die horizontale Oberfl&auml;che weiterhin facettiert bliebe, wie es derzeit der Fall ist.</li>
<li>Integration mit dem Arbeitsbereich Draft, um Zeichnungen aus Modellen zu erstellen: ein erstes Ziel, dessen Machbarkeit jedoch noch nicht untersucht wurde</li>
<li>Umgang mit Kielen, Skegs und Rudern: Eine M&ouml;glichkeit, Kiele mit dem derzeitigen System zu modellieren, besteht darin, den Kiel als eigenst&auml;ndigen Halbrumpf zu modellieren und ihn dann am Boden des Hauptrumpfs anzubringen; f&uuml;r Ruder und Skegs w&uuml;rde dies jedoch nichts &auml;ndern.</li></ul>
<p><span id="Glossary"></span>
</p>
<h2><span class="mw-headline" id="Glossar">Glossar</span></h2>
<p>Wie bei jedem alten und praktizierten Handwerk hat sich auch im Zusammenhang mit Schiffen, Booten und nautischen Praktiken ein reichhaltiges und manchmal verwirrendes Vokabular entwickelt. Bei der Beschreibung dieses Makros ist es sowohl umst&auml;ndlich als auch ineffizient, den Prozess ohne die Verwendung der korrekten und genauen Begriffe zu beschreiben. Das offensichtliche Problem besteht darin, dass der durchschnittliche Laie mit solchen Begriffen nicht vertraut ist, daher dieses Vokabular:
</p>
 <table style="width: 100%;" border="0">
        <tbody><tr>
          <td>achtern
          </td>
          <td>die R&uuml;ckseite von irgendetwas auf einem Boot
          </td>
        </tr>
        <tr>
          <td><br>
          </td>
          <td><br>
          </td>
        </tr>
        <tr>
          <td>chine</td>
          <td style="height: 19.2px;">Eine ebene Fl&auml;che einer H&uuml;lle kann verwendet werden, um eine gekr&uuml;mmte Oberfl&auml;che zu approximieren oder als fertige Bautechnik.</td>
        </tr>
        <tr>
          <td><br>
          </td>
          <td><br>
          </td>
        </tr>
        <tr>
         <td style="vertical-align: top;"> coachhouse - Kutscherhaus
          </td>
          <td>Der Teil des Mitteldecks, der &uuml;ber das Deck hinausragt &ndash; in der Regel, um mehr Kopffreiheit im Inneren des Bootes zu schaffen.
          </td>
        </tr>
        <tr>
          <td><br>
          </td>
          <td><br>
          </td>
        </tr>
        <tr>
          <td>flush deck
          </td>
          <td>ein Deck, das sich nahtlos von einer Seite des Rumpfes zur anderen erstreckt, das Gegenteil eines Kaj&uuml;tdecks
          </td>
        </tr>
        <tr>
          <td><br>
          </td>
          <td><br>
          </td>
        </tr>
        <tr>
          <td>bugw&auml;rts
          </td>
          <td>Ebenso 'Bug'; die Vorderseite von allem auf einem Boot
          </td>
        </tr>
        <tr>
          <td><br>
          </td>
          <td><br>
          </td>
        </tr>
        <tr>
          <td>Backbord
          </td>
          <td>linke Seite nach vorne blickend
          </td>
        </tr>
     <tr>
          <td><br>
          </td>
          <td><br>
          </td>
        </tr>
        <tr>
          <td>Steuerbord
          </td>
          <td>rechte Seite nach vorne blickend
          </td>
        </tr>
        <tr>
          <td><br>
          </td>
          <td><br>
          </td>
        </tr>
        <tr>
          <td>Stammlinie
          </td>
          <td>die geneigte vertikale Kante, die den Bug eines Rumpfes bildet
          </td>
        </tr>
        <tr>
          <td><br>
          </td>
          <td><br>
          </td>
        </tr>
        <tr>
          <td>Querbalken
          </td>
          <td>die gekr&uuml;mmte Oberkante der Heckfl&auml;che, die flach oder gekr&uuml;mmt sein kann
          </td>
        </tr>
    </tbody></table>
<p><span id="Links"></span>
</p>
<h2><span class="mw-headline" id="Verweise">Verweise</span></h2>
<ul><li><a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Half_hull_model_ship">Half Hull Model Ship</a> (Wikipedia)</li>
<li><a rel="nofollow" class="external text" href="http://www.halfhullshipmodels.com/smf/discussions-of-half-hulls-and-ship-models/understanding-and-practising-half-hull-boat-modelling/?PHPSESSID=56fedd9f6fa2db453a77347f10d57b7f">Why Half Hulls</a> (Maritime Half Hull Ship Models and Nautical Art website)</li>
<li><a rel="nofollow" class="external text" href="http://pages.swcp.com/usvmyg/design/design.htm">Traditional Model Yacht Design</a> (US Vintage Model Yacht Group)</li></ul>
<p><span id="Script"></span>
</p>
<h2><span class="mw-headline" id="Skript">Skript</span></h2>
<p>Werkzeugleisten-Symbol <span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Half_Hull_Model.png&amp;filetimestamp=20240210201133&amp;.html" class="mw-file-description"><img src="../File/Macro_Half_Hull_Model.png" decoding="async" width="64" height="64" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span>
</p><p><b>Macro_Half_Hull_Model.FCMacro</b>
</p><p>Dieses Skript l&auml;uft fehlerfrei. Aufgrund der Vielzahl m&ouml;glicher Eingaben kann es jedoch bei einigen Eingaben zu Fehlern kommen. In diesem Wenn ja, meldet man dies bitte.
</p><p>Das Skript ist zu lang, um es im Wiki anzuzeigen, daher muss es kopiert oder heruntergeladen werden von <a rel="nofollow" class="external text" href="http://pastebin.com/raw.php?i=tZMpUi6F">ungek&uuml;rzte Skriptdatei auf pastebin.com</a>
</p>
<div style="clear:both"></div>
<!-- 
NewPP limit report
Cached time: 20260115173155
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.124 seconds
Real time usage: 0.206 seconds
Preprocessor visited node count: 240/1000000
Post&#8208;expand include size: 2902/2097152 bytes
Template argument size: 975/2097152 bytes
Highest expansion depth: 5/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1953/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    8.694      1 -total
 41.35%    3.595      1 Template:Macro/de
 36.77%    3.197      1 Template:Codeextralink
 16.82%    1.462      1 Template:Clear
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:226691-0!canonical and timestamp 20260115173155 and revision id 1738959. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>