<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">PartDesign Bearingholder Tutorial I/de</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="de" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-PartDesign+Bearingholder+Tutorial+I&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="de" dir="ltr">Deutsch</span></li>
<li><a href="../PartDesign_Bearingholder_Tutorial_I.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="PartDesign Bearingholder Tutorial I (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../tr/PartDesign_Bearingholder_Tutorial_I.html" class="mw-pt-progress mw-pt-progress--low" title="PartDesign Bearingholder Tutorial I/tr (2% translated)" lang="tr" dir="ltr">T&uuml;rk&ccedil;e</a></li>
<li><a href="../es/PartDesign_Bearingholder_Tutorial_I.html" class="mw-pt-progress mw-pt-progress--low" title="PartDesign Soporte de rodamiento Tutorial I (8% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/PartDesign_Bearingholder_Tutorial_I.html" class="mw-pt-progress mw-pt-progress--complete" title="PartDesign Tutoriel pour la conception d'un support de roulement (I) (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/PartDesign_Bearingholder_Tutorial_I.html" class="mw-pt-progress mw-pt-progress--complete" title="Prima parte del tutorial per creare un supporto per cuscinetto con PartDesign (100% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/PartDesign_Bearingholder_Tutorial_I.html" class="mw-pt-progress mw-pt-progress--complete" title="Poradnik: Projekt cz&#281;&#347;ci, uchwyt &#322;o&#380;yska cze&#347;&#263; 1 (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt-br/PartDesign_Bearingholder_Tutorial_I.html" class="mw-pt-progress mw-pt-progress--low" title="Tutorial de Projeto de Mancais de Apoio I (2% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../ro/PartDesign_Bearingholder_Tutorial_I.html" class="mw-pt-progress mw-pt-progress--high" title="PartDesign Bearingholder Tutorial I (92% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><a href="../ru/PartDesign_Bearingholder_Tutorial_I.html" class="mw-pt-progress mw-pt-progress--low" title="PartDesign Bearingholder Tutorial I/ru (2% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li></ul></div>
<table class="fcinfobox wikitable ct" style="width: 230px; float: right; margin-left: 1em">
<tbody><tr>
<td class="ctTitle" style="font-weight: bold; font-size: 125%;"><span typeof="mw:File"><span><img src="../File/Freecad.svg" decoding="async" width="32" height="32" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span> Anleitung
</td></tr>
<tr>
<th class="ctOdd">Thema
</th></tr>
<tr>
<td class="ctEven">Modellierung
</td></tr>
<tr>
<th class="ctOdd">Niveau
</th></tr>
<tr>
<td class="ctEven">Erfahrene Anwender
</td></tr>
<tr>
<th class="ctOdd">Bearbeitungszeit
</th></tr>
<tr>
<td class="ctEven"><i>Not provided</i>
</td></tr>
<tr>
<th class="ctOdd">Autoren
</th></tr>
<tr>
<td class="ctEven">NormanC
</td></tr>
<tr>
<th class="ctOdd">FreeCAD-Version
</th></tr>
<tr>
<td class="ctEven">0.19.23300 oder h&ouml;her
</td></tr>
<tr>
<th class="ctOdd">Beispieldateien
</th></tr>
<tr>
<td class="ctEven"><i>None</i>
</td></tr>
<tr>
<th class="ctOdd">Siehe auch
</th></tr>
<tr>
<td class="ctEven"><i>None</i>
</td></tr>
<tr>
<td class="ctToc"><br><meta property="mw:PageProp/toc">
</td></tr></tbody></table>
<p><span id="Purpose_in_Brief"></span>
</p>
<h2><span id="Verwendungszweck_in_K.C3.BCrze"></span><span class="mw-headline" id="Verwendungszweck_in_K&uuml;rze">Verwendungszweck in K&uuml;rze</span></h2>
<p>Der Zweck der Anleitung ist es, zwei verschiedene Arbeitsabl&auml;ufe zur Erstellung eines Gussteils mit Formschr&auml;ge und Verrundungen vorzustellen. Je nachdem, welche anderen CAD-Programme bisher verwendet wurden, k&ouml;nnte das eine oder andere vertraut sein. Als Arbeitsbeispiel werden wir ein einfaches Lagergeh&auml;use modellieren.
</p><p>Dies ist der erste Teil der Anleitung. Es wird der so genannte "Einzelk&ouml;rper"-Arbeitsablauf verwendet, wobei das (einfachere) Oberteil des Geh&auml;uses als Beispiel dient.
</p><p>Zum Durcharbeiten dieser Anleitung muss der Arbeitsbereich PartDesign aktiviert werden.
</p><p><span typeof="mw:File"><a href="../index.php?title=HolderTop1-1.jpg&amp;filetimestamp=20130609182657&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-1.jpg" decoding="async" width="400" height="277" class="mw-file-element" data-file-width="600" data-file-height="416"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Anleitung Lagergeh&auml;use - Fertiggestelltes Lagergeh&auml;use (Oberteil)</p>
<p><span id="Design_data"></span>
</p>
<h2><span class="mw-headline" id="Konstruktionsdaten">Konstruktionsdaten</span></h2>
<p>Das Geh&auml;use sollte in der Lage sein, ein Lager mit einem Durchmesser von 90 mm und einer Breite von bis zu 33 mm aufzunehmen (z.B. DIN 630 Typ 2308). Das Lager erfordert eine Schulterh&ouml;he von mindestens 4,5 mm im Halter (und auf der Welle). Der obere Teil des Halters wird mit zwei 12mm Schrauben an der Unterseite verschraubt. Auf beiden Seiten des Lagers sollte eine Nut vorhanden sein, die einen Standard Wellendichtring DIN 3760 aufnehmen kann: 38x55x7 oder 40x55x7 auf der einen Seite, 50x68x8 auf der anderen Seite.
</p><p>Das Geh&auml;use wird ein Sandguss mit einer Mindestwandst&auml;rke von 5 mm, einem Entformungswinkel von 2 Grad und einem minimalen Verrundungsradius von 3 mm sein.
</p><p><br clear="all">
</p>
<h2><span class="mw-headline" id="Einrichten_der_Skelettgeometrie">Einrichten der Skelettgeometrie</span></h2>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop1-2.jpg&amp;filetimestamp=20130610181806&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-2.jpg" decoding="async" width="400" height="284" class="mw-file-element" data-file-width="560" data-file-height="397"></a><figcaption>Lagergeh&auml;use mit den beiden wichtigsten Skelettebenen</figcaption></figure>
<p>Die Idee der Skelettgeometrie besteht darin, die grundlegenden Konstruktionsabmessungen in einem einzigen Bezugselement (z.B. einer Ebene oder einer Achse) zu erfassen. Wenn sich die Konstruktionsbema&szlig;ung &auml;ndert, muss nur das Skelettelement ge&auml;ndert werden. Wenn das Modell gut aufgebaut ist, werden alle seine Formelemente neu berechnet, um die Konstruktions&auml;nderung widerzuspiegeln. Dadurch wird die Gefahr verringert, dass du in einem komplexen Modell, in dem die grundlegenden Konstruktionsbema&szlig;ungen an mehreren Stellen verwendet werden, vergisst, sie irgendwo zu &auml;ndern.
</p><p>Die Alternative zur Skelettgeometrie besteht darin, eine Tabelle mit den grundlegenden Bema&szlig;ungen des Entwurfs zu haben, die jeder Bema&szlig;ung einen symbolischen Namen zuweist, und dann den symbolischen Namen &uuml;berall dort zu verwenden, wo die Bema&szlig;ung f&uuml;r den Bau des Modells erforderlich ist. FreeCAD erlaubt diesen Ansatz noch nicht.
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop1-3.jpg&amp;filetimestamp=20130610183102&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-3.jpg" decoding="async" width="400" height="277" class="mw-file-element" data-file-width="700" data-file-height="485"></a><figcaption>Basisebenen und alle Bezugsebenen</figcaption></figure>
<p>F&uuml;r den Fall des Lagergeh&auml;usese sind die beiden wichtigsten Konstruktionsma&szlig;e der Abstand zwischen den Schrauben (was die Gr&ouml;&szlig;e des einsetzbaren Lagers begrenzt) und die H&ouml;he der Schraubenk&ouml;pfe. Die gew&auml;hlten Abmessungen sind
</p>
<ul><li>Abstand zwischen den Schrauben: Radius des Lagers (45) + Wanddicke (5) plus Radius der Bohrung f&uuml;r den Schrauben ( 7 ) = 57 mm, so dass die vertikale Ebene um 57 mm von der YZ Ebene versetzt ist.  Um diese Bezugsebene zu erzeugen, w&auml;hle die YZ Ebene und w&auml;hle dann eine neue Bezugsebene. Gib den Versatz in den Dialog ein, der sich &ouml;ffnet</li>
<li>H&ouml;he der Schraubenk&ouml;pfe: Dies wurde als ein Versatz von 28 mm von der XZ Ebene gew&auml;hlt.</li></ul>
<p>Der Einfachheit halber k&ouml;nnen zwei weitere Bezugsebenen erstellt werden, die die Materialmenge widerspiegeln, die von den Seiten des Lagergeh&auml;uses weggeschnitten werden muss. Sie sind um +22 und -22 von der XY-Ebene versetzt.
</p><p>Es ist ratsam, der Skelettgeometrie klare Namen zu geben. Meistens wirst du die Sichtbarkeit f&uuml;r Bezugsebenen ausschalten wollen, weil sie den Bildschirm &uuml;berladen, und wenn die Ebenen selbsterkl&auml;rende Namen haben, kannst du sie einfach nach Namen statt nach dem Bildschirm ausw&auml;hlen.
<br clear="all">
</p><p><span id="The_solid_geometry"></span>
</p>
<h2><span id="Die_Volumenk.C3.B6rpergeometrie"></span><span class="mw-headline" id="Die_Volumenk&ouml;rpergeometrie">Die Volumenk&ouml;rpergeometrie</span></h2>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop1-4.jpg&amp;filetimestamp=20130612185214&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-4.jpg" decoding="async" width="400" height="244" class="mw-file-element" data-file-width="1126" data-file-height="686"></a><figcaption>Skizze des ersten Blocks</figcaption></figure>
<p>Jetzt ist es an der Zeit, mit der Erstellung einer echten Geometrie zu beginnen. Die Skizze f&uuml;r den ersten Block ist auf der rechten Seite abgebildet. Er wird auf der XY Ebene platziert. Es gibt nur drei Dimensionen: Der Innenradius (22,5 mm), die Bearbeitungszugabe (3 mm) an der Basis als Versatz zur XZ Ebene und der Abstand von der Bezugsebene, die die Schraubenachse darstellt (7 mm). Das bedeutet, wenn du sp&auml;ter die Bezugsebene verschiebst, passt der Block automatisch seinen Au&szlig;enradius an. Denke daran, dass du die Bezugsebene, bevor du sie zur Bema&szlig;ung verwenden kannst, als Au&szlig;engeometrie in den Skizzierer einf&uuml;gen musst.
</p><p>Du fragst dich wahrscheinlich, warum sich am Ende jedes Bogens ein kleines gerades Segment befindet. Dieses Segment sorgt daf&uuml;r, dass auf den B&ouml;gen ein Entwurfswinkel von 2 Grad entsteht. Das mag nach viel Arbeit f&uuml;r einen sehr kleinen Nutzen aussehen, aber viele CAD Programme (und vielleicht eines Tages auch FreeCAD) haben Werkzeuge, die ein Volumenmodell in verschiedenen Farben hervorheben und dir sofort alle Fl&auml;chen anzeigt, bei denen der Entwurfswinkel nicht korrekt ist. Du willst doch nicht, dass das mit deinem Modell passiert, besonders nachdem du viele Verrundungen angebracht hast!
</p><p>Wenn du die Skizze erstellt hast (was wegen der 2-Grad-Tangentiallinien etwas knifflig ist), polstere sie einfach symmetrisch zur Skizzierebene mit einer L&auml;nge von 62 mm auf: 34 mm f&uuml;r das Lager, 2x 9 mm f&uuml;r die Dichtungsringe, 2x 5 mm f&uuml;r die Wandst&auml;rke.
<br>
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop1-5.jpg&amp;filetimestamp=20130612190636&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-5.jpg" decoding="async" width="400" height="229" class="mw-file-element" data-file-width="1048" data-file-height="601"></a><figcaption>Skizze des Ausschnitts an der Seite des Blocks</figcaption></figure>
<p>Als n&auml;chstes wollen wir an den Stellen, an denen sich die Dichtungsringe befinden, etwas Material wegschneiden, da ihr Au&szlig;endurchmesser viel kleiner ist als der des Lagers. Der einfachste Weg, die Skizzen zu erstellen, besteht darin, die Skizze des Blocks auszuw&auml;hlen und dann "Auswahl duplizieren" aus dem Bearbeitungsmen&uuml; zu w&auml;hlen. Du kannst dann die Skizze auf die Seite des Blocks umordnen und sie wie im Bild gezeigt modifizieren.
</p><p>Die beiden einzigen wichtigen Ma&szlig;e in der Skizze sind 3 mm Bearbeitungszugabe am Boden und ein Innendurchmesser von 78 mm: 68 mm f&uuml;r den Au&szlig;endurchmesser des Dichtrings + 2x 5 mm Wandst&auml;rke. Da der Dichtring auf der anderen Seite nur einen Durchmesser von 55 mm haben wird, kann der Ausschnitt hier 65 mm betragen.
</p><p>Nachdem du die Skizze erstellt hast, koffere sie bis zu der Bezugsebene aus, die die Lagerseite plus 5 mm Wandst&auml;rke markiert. Wenn du den Halter modifizieren m&ouml;chtest, um breitere Lager aufnehmen zu k&ouml;nnen, musst du nur die Abmessungen dieser Bezugsebenen &auml;ndern, und die Ausschnitttiefe folgt dementsprechend.
<br clear="all">
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop1-6.jpg&amp;filetimestamp=20130612193209&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-6.jpg" decoding="async" width="400" height="254" class="mw-file-element" data-file-width="1106" data-file-height="703"></a><figcaption>Skizze des Ausschnitts im Inneren des Blocks</figcaption></figure>
<p>Um den Bearbeitungsaufwand zu reduzieren, wollen wir auch etwas Material im Inneren des Halters wegschneiden. Auch hier ist es praktisch, die Skizze des ersten Polsters zu duplizieren. Es muss noch nicht einmal nachgebildet werden. Auch hier sind die einzigen wichtigen Abmessungen die Bearbeitungszugabe (3 mm) und die Au&szlig;endurchmesser: 84 mm f&uuml;r die Stelle, an der sich das Lager befinden wird (90 mm - 2x Bearbeitungszugabe), 49 mm f&uuml;r den kleineren Dichtring (55 mm - 2x 3 mm) und 62 mm f&uuml;r den gr&ouml;&szlig;eren Dichtring.
</p><p>Nachdem du die Skizzen erstellt hast, koffere sie aus: Symetrisch 28mm f&uuml;r den Lagerausschnitt (34mm - 2x Bearbeitungszugabe) und einseitig 23mm f&uuml;r die Ausschnitte f&uuml;r die Dichtringe: 34 mm / 2 f&uuml;r die halbe Lagerbreite + 9 mm f&uuml;r die Dichtringe - 3 mm Bearbeitungszugabe. 
<br clear="all">
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop1-7.jpg&amp;filetimestamp=20130612193845&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-7.jpg" decoding="async" width="400" height="273" class="mw-file-element" data-file-width="1050" data-file-height="717"></a><figcaption>Hauptgeometrie des Geh&auml;uses oben</figcaption></figure>
<p>Dein Teil sollte nun wie auf dem Bild rechts aussehen. Beachte, wie die verschiedenen Ausschnitte zusammen eine fast gleichm&auml;&szlig;ige Wandst&auml;rke ergeben, wodurch das Gie&szlig;en einfacher und poren&auml;rmer wird.
<br clear="all">
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop1-8.jpg&amp;filetimestamp=20130612194752&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-8.jpg" decoding="async" width="400" height="276" class="mw-file-element" data-file-width="1123" data-file-height="774"></a><figcaption>Skizze mit Entwurf, wo die Schrauben sein werden</figcaption></figure>
<p>Jetzt muss nur noch etwas Material f&uuml;r die Schrauben hergestellt werden, damit sie durchgehen k&ouml;nnen. Du kannst versucht sein, diese als Kreis zu skizzieren und sie dann aufzuf&uuml;llen, aber das wird Ihnen Schwierigkeiten bereiten, wenn du sp&auml;ter versuchst, den Entwurf darauf zu setzen (ich nehme an, das ist eine Schw&auml;che von OpenCascade). Um die Probleme zu umgehen, ist es also besser, eine Skizze mit dem eingeschlossenen Entwurfswinkel zu erstellen und diese dann um 360 Grad zu drehen.
</p><p>Auch hier kommen wieder die Skelettebenen zum Einsatz. Als Au&szlig;engeometrie ben&ouml;tigst du die Schraubenachsenebene und die Schraubenkopfebene. Erstelle dann eine gerade Linie f&uuml;r die Rotationsachse und stelle sicher, dass sie an die Schraubenachsenebenen Referenz gebunden ist. Schalte sie als Konstruktionsgeometrie ein. Skizziere dann den Rest der Kontur. Die wichtigen Ma&szlig;e sind die Bearbeitungszugabe oben und unten und der Radius von 12 mm: 7 mm f&uuml;r den Lochradius + 5 mm Wandst&auml;rke.
<br clear="all">
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop1-9.jpg&amp;filetimestamp=20130612195344&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-9.jpg" decoding="async" width="400" height="273" class="mw-file-element" data-file-width="1116" data-file-height="763"></a><figcaption>Fertige Geometrie der Geh&auml;useoberseite (ohne Entwurf und Verrundungen)</figcaption></figure>
<p>Erstelle ein Rotations Formelement von der Skizze und spiegle es dann auf der YZ Ebene. Dies ist die gesamte Volumenk&ouml;rpergeometrie, die wir zum Modellieren ben&ouml;tigen. Der Rest sind Entwurf und Verrundungen.
<br clear="all">
</p><p><span id="Applying_draft_to_the_side_faces"></span>
</p>
<h2><span id="Anwenden_des_Entwurfs_auf_die_Seitenfl.C3.A4chen"></span><span class="mw-headline" id="Anwenden_des_Entwurfs_auf_die_Seitenfl&auml;chen">Anwenden des Entwurfs auf die Seitenfl&auml;chen</span></h2>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop1-10.jpg&amp;filetimestamp=20130616085052&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-10.jpg" decoding="async" width="400" height="254" class="mw-file-element" data-file-width="1104" data-file-height="700"></a><figcaption>Die neutrale Ebene f&uuml;r die Erstellung von Entw&uuml;rfen</figcaption></figure>
<p>Der n&auml;chste Schritt ist die Anwendung von Entw&uuml;rfen auf alle Seiten. Dabei ist es wichtig, die Lage der neutralen Ebene zu ber&uuml;cksichtigen, d.h. der Ebene, um die die Fl&auml;che "gedreht" wird. Wenn wir als neutrale Ebene die Unterseite des Geh&auml;uses w&auml;hlen, dann haben wir ein Problem mit der Wandst&auml;rke im oberen Teil des Halters. Daher erstellen wir eine Bezugsebene mit einem Versatz von 40 mm von der XZ Ebene als Kompromiss zwischen der Oberseite des Halters, die zu d&uuml;nn und der Unterseite, die zu breit wird.
<br clear="all">
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop1-11.jpg&amp;filetimestamp=20130616085807&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-11.jpg" decoding="async" width="400" height="170" class="mw-file-element" data-file-width="1035" data-file-height="441"></a><figcaption>Anwenden des Entwurfs auf die Seitenfl&auml;chen des Geh&auml;uses</figcaption></figure>
<p>Um einen Entwurf auf eine Fl&auml;che zu legen, w&auml;hle diese Fl&auml;che aus und erstelle das Entwurf Formelement. Du kannst dann weitere Fl&auml;chen ausw&auml;hlen, auf die der Entwurf angewendet werden soll. Wenn du ein gro&szlig;es Teil hast, ist es ratsam, jeweils nur eine Fl&auml;che zu entwerfen. Das bedeutet, dass wenn du die Geometrie &auml;nderst und ein Entwurf fehlschl&auml;gt, nur dieses eine Formelement fehlschl&auml;gt, wohingegen, wenn du alle Fl&auml;chen in ein Entwurfs Formelement setzt, das gesamte Formelement fehlschlagen kann, weil eine Fl&auml;che fehlschl&auml;gt. F&uuml;r ein kleines Teil wie das Lagergeh&auml;use reicht es aus, zwei Entwurf Formelemente zu erzeugen: Eines f&uuml;r die vier Au&szlig;enfl&auml;chen und eines f&uuml;r die Innenfl&auml;chen.
</p><p>Der Dialog zwingt dich, vor dem Abschluss eine neutrale Ebene auszuw&auml;hlen. Du kannst die Zugrichtung leer lassen, in diesem Fall ist sie normal zur neutralen Ebene. Vergiss nicht, den Entwurfswinkel auf 2 Grad einzustellen.
<br clear="all">
</p><p><span id="Filleting_the_holder"></span>
</p>
<h2><span id="Verrundung_des_Geh.C3.A4uses"></span><span class="mw-headline" id="Verrundung_des_Geh&auml;uses">Verrundung des Geh&auml;uses</span></h2>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop1-13.jpg&amp;filetimestamp=20130616091631&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-13.jpg" decoding="async" width="400" height="275" class="mw-file-element" data-file-width="965" data-file-height="663"></a><figcaption>Ausrundung, wo die Schrauben hinkommen</figcaption></figure>
<p>Wir k&ouml;nnen das Teil nun verrunden. Das Bild zeigt den ersten Satz Verrundungen. Beginne mit den kleinen kreisf&ouml;rmigen Verrundungen und mache sie mit einem Radius von 4 mm. Obwohl 3 mm laut Spezifikation des Teils ausreichen w&uuml;rden, bedeutet ein Radius von 4 mm, dass nach der Bearbeitung 1 mm der Verrundung &uuml;brig bleibt, wodurch die durch die Bearbeitung erzeugte scharfe Kante reduziert wird. Die gro&szlig;en Verrundungen haben einen Radius von 6 mm, um die Verteilung der Kraft von den Schrauben auf den Rest des Teils zu erleichtern. Es w&auml;re sch&ouml;n, diesen Radius noch gr&ouml;&szlig;er zu machen, aber leider kann OpenCascade noch nicht mit &uuml;berlappenden Verrundungen umgehen.
</p><p>Wie bei Entw&uuml;rfen solltest du in einem komplexen Teil nur eine Kante auf einmal verrunden, um unn&ouml;tige Fehler zu vermeiden, wenn sich die Grundgeometrie &auml;ndert.
<br clear="all">
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop1-12.jpg&amp;filetimestamp=20130616091416&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-12.jpg" decoding="async" width="400" height="259" class="mw-file-element" data-file-width="1036" data-file-height="671"></a><figcaption>Verrundung der Au&szlig;enseite des Geh&auml;uses</figcaption></figure>
<p>Die restlichen Verrundungen haben einfach 3mm Radius. Wenn man sich das Bild rechts anschaut, k&ouml;nnten die beiden hervorgehobenen Verrundungen tats&auml;chlich mit 5 mm verrundet werden, um eine gleichm&auml;&szlig;igere Wandst&auml;rke f&uuml;r das Gussteil zu erreichen. Nach der Bearbeitung w&uuml;rde die Mindestwandst&auml;rke von 5 mm immer noch eingehalten werden. Aber auch hier hindert uns die Tatsache, dass OpenCascade keine &uuml;berlappenden Verrundungen verarbeiten kann, daran, dies f&uuml;r die innere der beiden hervorgehobenen Verrundungen zu tun.
<br clear="all">
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop1-14.jpg&amp;filetimestamp=20130616092602&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-14.jpg" decoding="async" width="400" height="331" class="mw-file-element" data-file-width="833" data-file-height="689"></a><figcaption>Verrundung der Innenseite des Geh&auml;uses - problematische Kante</figcaption></figure>
<p>Das Ausf&uuml;llen der Innenseite des Teils stellt uns vor eine Schwierigkeit, die mit den aktuellen Werkzeugen im PartDesign Arbeitsbereich nicht gel&ouml;st werden kann. Die hervorgehobene Kante kann &uuml;berhaupt nicht verrundet werden, wiederum weil sich die Runden &uuml;berlappen w&uuml;rden. Dies k&ouml;nnte umgangen werden, indem eine Austragung anstelle einer Verrundung erstellt wird, mit der Ausnahme, dass Austragungen in PartDesign noch nicht implementiert sind. Vorl&auml;ufig sind wir gezwungen, die Kante so zu belassen, wie sie ist.
<br clear="all">
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop1-15.jpg&amp;filetimestamp=20130616093234&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-15.jpg" decoding="async" width="400" height="279" class="mw-file-element" data-file-width="1051" data-file-height="734"></a><figcaption>Das verrundeten Teil (mit Ausnahme der unm&ouml;glichen Kante)</figcaption></figure>
<p>Das Bild rechts zeigt das fertige Teil in dem Zustand, in dem es sich vor der Bearbeitung befinden wird (mit Ausnahme der einen Kante, die nicht verrundet werden kann). Du wirst feststellen, dass eine Kante, die um das gesamte Teil herum verl&auml;uft, absichtlich nicht ausgef&uuml;llt wurde. Dies ist die Kante, an der sich die Unterseite und die Oberseite der Form treffen. Hier ist keine Verrundung m&ouml;glich (und wird auch nicht ben&ouml;tigt).
<br clear="all">
</p><p><span id="Machining"></span>
</p>
<h2><span class="mw-headline" id="Spanende_Bearbeitung">Spanende Bearbeitung</span></h2>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop1-16.jpg&amp;filetimestamp=20130616094809&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-16.jpg" decoding="async" width="400" height="201" class="mw-file-element" data-file-width="1098" data-file-height="552"></a><figcaption>Spanende Bearbeitung der Ober- und Unterseite des Geh&auml;uses</figcaption></figure>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop1-17.jpg&amp;filetimestamp=20130616115136&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-17.jpg" decoding="async" width="400" height="295" class="mw-file-element" data-file-width="958" data-file-height="706"></a><figcaption>Spanende Bearbeitung der Innenseite des Lagergeh&auml;uses</figcaption></figure>
<p>Jetzt k&ouml;nnen wir das zu bearbeitende Material vom rohen Gussteil wegschneiden. Dies ist sehr einfach, wenn die Skelettgeometrie definiert ist. Die Idee besteht darin, alle Bearbeitungsmerkmale (Taschen und Nuten) nur mit Bezugsformelementen zu erzeugen. Das bedeutet, dass sie v&ouml;llig unabh&auml;ngig von der Volumengeometrie des Lagergeh&auml;uses sind, was uns einige gro&szlig;e Vorteile bringt:
</p>
<ul><li>Unabh&auml;ngig davon, wie du die Volumenk&ouml;rpergeometrie &auml;nderst, k&ouml;nnen die Formelemente f&uuml;r die Bearbeitung nie versagen.</li>
<li>Du kannst die Bearbeitungsgeometrie vor der Fertigstellung des Solids erstellen, was dir eine n&uuml;tzliche visuelle R&uuml;ckmeldung gibt.</li>
<li>Wenn du die Bezugsebenen des Skeletts verschiebst, passen sich sowohl die Volumenk&ouml;rpergeometrie als auch die Bearbeitung automatisch an.</li>
<li>Wenn du einen Fehler in deiner Festk&ouml;rpergeometrie machst, ist die Bearbeitung immer noch in der richtigen Position, und sehr wahrscheinlich wird der Fehler deutlich sichtbar (z.B. eine Wandst&auml;rke von 2 mm statt 5 mm). Wenn du dagegen die Bearbeitung auf die Festk&ouml;rpergeometrie beziehst, wird sie sich an den Fehler im Festk&ouml;rper anpassen und z.B. die 5mm Wandst&auml;rke beibehalten, nur an der falschen Stelle, an der sich der Festk&ouml;rper  befindet.</li></ul>
<p>Bevor auf der Bearbeitungsgeometrie begonnen wird, m&ouml;chte ich einen Bezugspunkt im Baum platzieren und ihm einen Namen geben, etwa "Bearbeitung_beginnt_hier". Dies ist n&uuml;tzlich, wenn du zwischen dem Roh- und dem Bearbeitungszustand des Werkst&uuml;cks wechseln m&ouml;chtest, da du auf einen Blick siehst, wohin du den Einf&uuml;gepunkt verschieben musst, um den Rohzustand zu erhalten.
</p><p>Um die Unterseite des Geh&auml;uses zu bearbeiten, skizziere einfach ein gro&szlig;es Rechteck auf der XZ Ebene und koffere es aus. F&uuml;r die Oberseite skizziere einen Kreis auf der Bezugsebene, der die Position des Schraubenkopfes definiert, und spiegle dann die Tasche auf der YZ Ebene. Auf die gleiche Weise erzeugst du eine Tasche f&uuml;r die Bohrung, durch die die Schraube hindurchgehen soll, und spiegeln diese. Um die Innenseite des Geh&auml;uses zu bearbeiten, erstelle eine Skizze auf der YZ Ebene und nute sie ein.
<br clear="all">
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop1-1.jpg&amp;filetimestamp=20130609182657&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-1.jpg" decoding="async" width="400" height="277" class="mw-file-element" data-file-width="600" data-file-height="416"></a><figcaption>Fertiges Teil</figcaption></figure>
<p>Nachdem du die Bearbeitung durchgef&uuml;hrt hast, kannst du einen sch&ouml;nen visuellen Effekt erzielen, indem du alle bearbeiteten Fl&auml;chen einf&auml;rbst, so dass du auf einen Blick erkennen kannst, welche Teile roh gegossen und welche nach dem Gie&szlig;en bearbeitet werden.
</p><p><br clear="all">
</p><p><span id="Final_notes"></span>
</p>
<h2><span class="mw-headline" id="Schlussbemerkungen">Schlussbemerkungen</span></h2>
<p>Wir haben die Oberseite des Lagergeh&auml;uses mit den Abmessungen modelliert, die er nach dem Gie&szlig;en haben wird. Um die Gussform zu erstellen, musst du dein Teil schrumpfen lassen, denn nach dem Gie&szlig;en, wenn das hei&szlig;e Metall abk&uuml;hlt, wird es um einige Prozent schrumpfen (je nach Material). In der Regel ist es am besten, die Anwendung der Schrumpfung der Gie&szlig;erei zu &uuml;berlassen, die das Teil herstellt, da sie &uuml;ber die erforderlichen Spezialkenntnisse verf&uuml;gt. Du solltest Ihnen auch sagen, ob dein Teil problematische Bereiche aufweist, z.B. sehr dicke W&auml;nde, die sich pl&ouml;tzlich mit sehr d&uuml;nnen Abschnitten verbinden, ohne dass dazwischen ein richtig verj&uuml;ngter Abschnitt liegt.
</p>
<h2><span class="mw-headline" id="Teil_Zwei">Teil Zwei</span></h2>
<p><a href="../de/PartDesign_Bearingholder_Tutorial_II.html" title="PartDesign Bearingholder Tutorial II/de">PartDesign Lagergeh&auml;use Tutorium II</a>
</p>
<div style="clear:both"></div>
<!-- 
NewPP limit report
Cached time: 20251220223853
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.066 seconds
Real time usage: 0.083 seconds
Preprocessor visited node count: 106/1000000
Post&#8208;expand include size: 1565/2097152 bytes
Template argument size: 126/2097152 bytes
Highest expansion depth: 4/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 2460/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    4.738      1 -total
 42.40%    2.009      1 Template:TutorialInfo/de
 30.37%    1.439      1 Template:Caption
 21.80%    1.033      1 Template:Clear
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:66235-0!canonical and timestamp 20251220223853 and revision id 1654691. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>