<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Release notes 0.16/de</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="de" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Release+notes+0.16&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="de" dir="ltr">Deutsch</span></li>
<li><a href="../Release_notes_0.16.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Release notes 0.16 (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/Release_notes_0.16.html" class="mw-pt-progress mw-pt-progress--low" title="Notas del lanzamiento 0.16 (3% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/Release_notes_0.16.html" class="mw-pt-progress mw-pt-progress--complete" title="Notes de version 0.16 (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/Release_notes_0.16.html" class="mw-pt-progress mw-pt-progress--complete" title="Note di rilascio della versione 0.16 (100% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Release_notes_0.16.html" class="mw-pt-progress mw-pt-progress--complete" title="Informacje o wydaniu 0.16 (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt/Release_notes_0.16.html" class="mw-pt-progress mw-pt-progress--med" title="Notas de lan&ccedil;amento da vers&atilde;o 0.16 (22% translated)" lang="pt" dir="ltr">portugu&ecirc;s</a></li>
<li><a href="../ru/Release_notes_0.16.html" class="mw-pt-progress mw-pt-progress--low" title="&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1103; &#1082; &#1074;&#1099;&#1087;&#1091;&#1089;&#1082;&#1091; 0.16 (3% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li></ul></div>
<p>FreeCAD 0.16 wurde am 18. April 2016 ver&ouml;ffentlicht, man kann es von der <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/releases/tag/0.16">Github</a>-Seite herunterladen. Dies ist eine Zusammenfassung der interessantesten &Auml;nderungen. Die komplette Liste der &Auml;nderungen kann man im <a rel="nofollow" class="external text" href="http://www.freecad.org/tracker/changelog_page.php">Mantis changelog</a> finden. &Auml;ltere Versionen:
<a href="../de/Release_notes_0.15.html" title="Release notes 0.15/de">0.15</a> - 
<a href="../de/Release_notes_0.14.html" title="Release notes 0.14/de">0.14</a> - 
<a href="../de/Release_notes_0.13.html" title="Release notes 0.13/de">0.13</a> - 
<a href="../Release_notes_0.12.html" title="Release notes 0.12">0.12</a> - 
<a href="../de/Release_notes_0.11.html" title="Release notes 0.11/de">0.11</a><br>
</p><p><span typeof="mw:File"><a href="../index.php?title=Satnogs_Rotator_FreeCAD.jpg&amp;filetimestamp=20160201215017&amp;.html" class="mw-file-description"><img src="../File/Satnogs_Rotator_FreeCAD.jpg" decoding="async" width="1024" height="576" class="mw-file-element" data-file-width="1920" data-file-height="1080"></a></span>
</p>
<center>Satnogs Rotator (<a rel="nofollow" class="external free" href="https://satnogs.org/">https://satnogs.org/</a>)</center>
<meta property="mw:PageProp/toc">
<h2><span class="mw-headline" id="Highlights">Highlights</span></h2>
<p><b>Expression support</b> wurde eingef&uuml;hrt. Es erlaubt das Definieren von Formel-gest&uuml;tzten Beziehungen zwischen Objekteigenschaften. "Expression support" ist ein gro&szlig;er Sprung vorw&auml;rts, um bessere parametrische Modelle in FreeCAD zu erstellen. Expressions bietet ein benutzerfreundliches Interface, um Modelle zu erstellen, die durch eine Tabelle (mittels Spreadsheet Workbench) gesteuert werden.
</p><p><span typeof="mw:File"><a href="../index.php?title=Expressions-demo.png&amp;filetimestamp=20160104174250&amp;.html" class="mw-file-description"><img src="../File/Expressions-demo.png" decoding="async" width="300" height="173" class="mw-file-element" data-file-width="561" data-file-height="323"></a></span>
</p><p>"Sketcher Solver (Skizzen-Gleichungsl&ouml;ser)" wurde im Verhalten stark verbessert. Es wurde nicht nur schneller und stabiler, auch sollten nun keine Abst&uuml;rze mehr bei unl&ouml;sbaren Skizzen erfolgen. Automatischer Neuaufbau der Skizzen nach jeder geringf&uuml;gigen &Auml;nderung kann nun abgeschaltet werden, was das fl&uuml;ssige Editieren von Skizzen mit sehr vielen Abh&auml;ngigkeiten erlaubt.
</p><p><span typeof="mw:File"><a href="../index.php?title=Sketcher-v0.16-demo.png&amp;filetimestamp=20160104175547&amp;.html" class="mw-file-description"><img src="../File/Sketcher-v0.16-demo.png" decoding="async" width="300" height="225" class="mw-file-element" data-file-width="519" data-file-height="389"></a></span>
</p><p>FreeCAD unterst&uuml;tzt nun Touchscreen 3D Navigation. Dies erm&ouml;glicht es, FreeCAD ohne eine Maus auf einem Laptop mit Touchscreen und Stift zu benutzen, abseits des Schreibtisches.
</p><p>Der Arbeitsbereich "FEM" hat ebenfalls viele Verbesserungen erhalten. Er hat sich bew&auml;hrt zur Durchf&uuml;hrung von verschiedenen Arten mechanischer Analysen.
</p><p><span typeof="mw:File"><a href="../index.php?title=Multiple_material.jpg&amp;filetimestamp=20160115220713&amp;.html" class="mw-file-description"><img src="../File/Multiple_material.jpg" decoding="async" width="700" height="438" class="mw-file-element" data-file-width="1440" data-file-height="900"></a></span>
</p>
<h2><span class="mw-headline" id="Allgemein">Allgemein</span></h2>
<ul><li>Unterst&uuml;tzung f&uuml;r Ausdr&uuml;cke/Formeln</li>
<li>Drei neue Navigations-Stile: Gesture-Navigation (mit Touchscreen-Unterst&uuml;tzung unter Windows), Maya Navigation und OpenCascade Navigation</li>
<li>Personalisierung der Arbeitsbereich-Liste (Liste kann umgeordnet werden, und jeder Arbeitsberich der Liste kann ausgeblendet werden)</li>
<li>Wiederherstellungs-Werkzeug</li>
<li>Neue Speicherungs-Optionen(R&uuml;ckg&auml;ngig, Speichern einer Kopie)</li>
<li>Neugestaltung der Homepage</li></ul>
<h2><span id="Arbeitsbereich_.22Part.22_.28Formteil.29"></span><span class="mw-headline" id='Arbeitsbereich_"Part"_(Formteil)'>Arbeitsbereich "Part" (Formteil)</span></h2>
<ul><li>Neue Werkzeuge um Objekte mit einer Wandst&auml;rke (z.B. Rohre) zu verbinden: <a href="../Part_JoinConnect.html" title="Part JoinConnect">Connect</a>, <a href="../Part_JoinEmbed.html" title="Part JoinEmbed">Embed</a> und <a href="../Part_JoinCutout.html" title="Part JoinCutout">Cutout</a></li>
<li>Neues Werkzeug: Erstelle Fl&auml;che von Skizze (parametrisch)</li></ul>
<h2><span id="Arbeitsbereiche_.22Part_Design.22_und_.22Sketcher.22"></span><span class="mw-headline" id='Arbeitsbereiche_"Part_Design"_und_"Sketcher"'>Arbeitsbereiche "Part Design" und "Sketcher"</span></h2>
<ul><li>Neues Werkzeug: Umschalt-Modus f&uuml;r <a href="../de/Sketcher_ToggleDrivingConstraint.html" title="Sketcher ToggleDrivingConstraint/de">Reference/Driving constraints</a></li>
<li>Neues Merkmal: Continous creation mode</li>
<li>Neues Merkmal: Gesteuerte Beschr&auml;nkungen</li>
<li>Starker Geschwindigkeitszuwachs</li>
<li>Erweiterte Kontrolle des Gleichungsl&ouml;sers (Solvers)</li>
<li>Neue Merkmale: Werkzeuge f&uuml;r Duplizieren, Spiegeln und Orthogonales Array</li>
<li>Unterst&uuml;tzung f&uuml;r <a href="../Expressions.html" title="Expressions">expressions/formulas</a> in Beschr&auml;nkungen und Eigenschaften</li></ul>
<h2><span class="mw-headline" id="Spreadsheet_Workbench">Spreadsheet Workbench</span></h2>
<ul><li>Neue Funktionen: round (runden), trunc (k&uuml;rzen), ceil (Decke) und floor (Boden)</li></ul>
<h2><span class="mw-headline" id="Draft_Workbench">Draft Workbench</span></h2>
<ul><li><b>Neuer DXF importer</b>: Der Arbeitsbereich "Draft" hat nun einen brandneuen DXF-Importer, komplett in C++ programmiert, &uuml;bernommen von <a rel="nofollow" class="external text" href="https://github.com/Heeks/heekscad">HeeksCad</a>, welcher nun nicht mehr externe Komponenten herunterzuladen braucht, und ist nun viel schneller und kann auch viel gr&ouml;&szlig;ere DXF-Dateien laden. Eine Option in den DXF-Einstellungen erlaubt nun, falls n&ouml;tig, die Umschaltung zum alten Import.</li>
<li>Ein neues <b><a href="../Draft_Mirror.html" title="Draft Mirror">Mirror tool</a></b> erlaubt ein Spiegeln von Objekten "auf Draft Art".</li>
<li>Viele <b>DXF-Vorlagen</b> wurden zu den entsprechenden SCG-Vorlagen hinzugef&uuml;gt und erleichtern so den Export von Zeichnungen nach DXF.</li>
<li><a href="../Draft_Rectangle.html" title="Draft Rectangle">Rectangles</a>,<a href="../Draft_Wire.html" title="Draft Wire">wires and lines</a> k&ouml;nnen nun <b>unterteilt</b> werden und erlauben so eine Menge neuer K&ouml;rper-Kombinationen.</li></ul>
<p><br>
<span typeof="mw:File"><a href="../index.php?title=Draft_subdivisions.jpg&amp;filetimestamp=20160106133831&amp;.html" class="mw-file-description"><img src="../File/Draft_subdivisions.jpg" decoding="async" width="1024" height="538" class="mw-file-element" data-file-width="1503" data-file-height="790"></a></span>
</p>
<h2><span id="Arbeitsbereich_.22Drawing.22"></span><span class="mw-headline" id='Arbeitsbereich_"Drawing"'>Arbeitsbereich "Drawing"</span></h2>
<ul><li>Ein neues Werkzeug namens <b><a href="../index.php?title=Drawing_SpreadsheetView/de&amp;action=edit&amp;redlink=1.html" class="new" title="Drawing SpreadsheetView/de (page does not exist)">spreadsheet view</a></b> erlaubt es nun, einen Bereich von Zellen eines <a href="../de/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/de">Tabellenblatts</a> auf ein Zeichnungsblatt zu platzieren.</li></ul>
<p><span typeof="mw:File"><a href="../index.php?title=Drawing_spreadsheetview.jpg&amp;filetimestamp=20160106133510&amp;.html" class="mw-file-description"><img src="../File/Drawing_spreadsheetview.jpg" decoding="async" width="1024" height="421" class="mw-file-element" data-file-width="1919" data-file-height="789"></a></span>
</p>
<h2><span id="Arbeitsbereich_.22Arch.22"></span><span class="mw-headline" id='Arbeitsbereich_"Arch"'>Arbeitsbereich "Arch"</span></h2>
<ul><li><b><a href="../Arch_SetMaterial.html" title="Arch SetMaterial">Materials support</a></b>: Arch Objekte k&ouml;nnen nun mit <a href="../Material.html" title="Material">material</a> versehen werden, welches das FreeCAD-interne Materialschema benutzt. Diese Materialien werden auch in anderen Arbeitsbereichen benutzt. Diese Materialien unterst&uuml;tzen komplett den IFC Im- und Export.</li>
<li>Das Werkzeug <b><a href="../Arch_SectionPlane.html" title="Arch SectionPlane">Section plane</a></b> kann nun Schnitte in 3D durchf&uuml;hren und den Bereich in Echtzeit anzeigen.</li></ul>
<p><span typeof="mw:File"><a href="../index.php?title=Arch_clip_plane.jpg&amp;filetimestamp=20160106132627&amp;.html" class="mw-file-description"><img src="../File/Arch_clip_plane.jpg" decoding="async" width="1024" height="769" class="mw-file-element" data-file-width="1112" data-file-height="835"></a></span>
</p>
<ul><li>Mehrere Verbesserungen am <b>IFC importer</b> wie z.B. neue Optionen f&uuml;r gro&szlig;e IFC-Dateien, bessere Unterst&uuml;tzung f&uuml;r Extrusionen (werden nun beim Import bereits erkannt) und kurvigen Segementen, ebenso wie Unterst&uuml;tzung von 2D Bemerkungen. Der Import von Analytical IFC wurde hinzugef&uuml;gt. Im Moment wird der Import von allen geometrischen Darstellungen von allen analytischen Objekten unterst&uuml;tzt.</li>
<li>Bessere <b>Vernetzungsoptionen</b> f&uuml;r DAE und IFC-Formate.</li>
<li>Ein neues Werkzeug <a href="../de/Arch_Schedule.html" title="Arch Schedule/de">Arch Schedule/de</a> erlaubt es verschiedene Arten von St&uuml;cklisten von einem BIM-Modell zu erstellen.</li>
<li><b>IFC attributes</b> k&ouml;nnen nun importiert, editiert und exportiert werden. Dies ist im Wesentlichen ein Spreadsheet-Objekt angeh&auml;ngt an ein Arch-Objekt.</li></ul>
<h2><span class="mw-headline" id="Arbeitsbereich_FEM">Arbeitsbereich FEM</span></h2>
<ul><li><b>GUI</b> FEM Befehle haben nun Tastaturk&uuml;rzel. Ein Einstellungen-Dialog f&uuml;r FEM wurde eingef&uuml;hrt. Der Pfad zur Calculix-Exe ist eine der Benutzer-Einstellungen</li>
<li><b>GUI analysis container</b> Unterpunkte der Analyse unterst&uuml;tzen nun Drag &amp; Drop. Sie k&ouml;nnen in einen Container und aus einem Container heraus bewegt werden. Da es nun Unterst&uuml;tzung von mehreren Analysen gibt, k&ouml;nnen die Unterpunkte zu einer anderen Analyse verschoben werden. Mehrere Beschr&auml;nkungen k&ouml;nnen nun in einer einzigen Studie erstellt werden.</li>
<li><b>GUI one click analysis</b> Eine Ein-Klick-Analyse wurde der Benutzeroberfl&auml;che hinzugef&uuml;gt. Sie l&ouml;scht die Ergebnisse, schreibt ein Calculix-Input-File und f&uuml;hrt die Analyse f&uuml;r den erkannten Solver durch. Es wird &uuml;berpr&uuml;ft, ob "multithreading" f&uuml;r Calculix zur Verf&uuml;gung steht und benutzt die maximal m&ouml;gliche Anzahl an Threads.</li>
<li><b>Input file</b> FreeCADs eingebauter Editor unterst&uuml;tzt das Bearbeiten von Calculix input files (*.inp). Syntax highlighting wurde ebenfalls implementiert.</li>
<li><b>Netgen mesh object</b> Die Benutzeroberfl&auml;che und der Eigenschaften-Editor von netgen mesh objects wurde &uuml;berarbeitet. Tetraeder-Vernetzung mit Elementen ersten und zweiter Ordnung wird genauso unterst&uuml;tzt wie das Anpassen von Vernetzungs-Parametern.</li>
<li><b>Constraint force and constraint fix objects</b> Es ist nun m&ouml;glich, Kr&auml;fte und Einspannungen auf Kanten und (Eck-)Punkte zu geben.</li>
<li><b>Constraint pressure object</b> Ein neues Objekt f&uuml;r Druck-Belastung auf Fl&auml;chen wurde hinzugef&uuml;gt. Der Druck (Kraft pro Fl&auml;che) wird direkt an Calculix &uuml;bergeben, was bedeutet, die Belastung der Knoten wird nicht von FreeCAD, sondern von Calculix berechnet.</li>
<li><b>Constraint prescribed displacement object</b> Ein neues Objekt f&uuml;r vorgegebene Verschiebungen wurde hinzugef&uuml;gt. Die vordefinierten Verschiebungen k&ouml;nnen Ecken, Kanten und Fl&auml;chen zugeordnet werden.</li>
<li><b>Beam section object</b> Das neue beam section Objekt erlaubt eine rechteckige Schnittfl&auml;che f&uuml;r Balken-FEM. Unterschiedliche Schnitte in einer einzigen Analyse werden unterst&uuml;tzt, indem Referenz-Objekte f&uuml;r jeden Schnitt definiert werden.</li>
<li><b>Shell thickness object</b> Das neue shell thickness Objekt erlaubt das Definieren von Schalendicken. Wie in den Balkenschnitten werden auch hier durch das Definieren von Referenz-Objekten mehrere Schalendicken in einer Analyse unterst&uuml;tzt.</li>
<li><b>Material object</b> Mehrere Materialien werden unterst&uuml;tzt f&uuml;r Ecken, Schalen und Volumenk&ouml;rper-Netze. Wie bei den Beam section- und den Shell thickness-Objekten wird ein angemessenes FEM-Netz ben&ouml;tigt, um das Material zu benutzen.</li>
<li><b>Solver object</b> Eine Grundlage f&uuml;r mehrere Solver-Objekte wurde geschaffen. Alle Unterpunkte k&ouml;nnen von einer Analyse zur anderen verschoben/kopiert werden.</li>
<li><b>Frequency analysis</b> Eine Frequenzanalyse kann durchgef&uuml;hrt werden, die Anzahl der Eigenfrequenzen und der Eigenschwingungen kann in dem Einstellungs-Fenster angepasst werden.</li>
<li><b> View provider</b> Schalen und Balken-FEM-Netze k&ouml;nnen in FreeCAD angezeigt werden und so auch die Ergebnisse der Analysen.</li>
<li><b>Python API</b> Methoden, um mit FEM-Netzen zu arbeiten und eine Analyse aus Python heraus zu generieren, wurden hinzugef&uuml;gt.</li>
<li><b>GMSH Macro</b> Eine interessante externe Entwicklung ist das <a href="../Macro_GMSH.html" title="Macro GMSH">Macro_GMSH</a>, welches es erm&ouml;glicht, GMSH zur Vernetzung zu benutzen. Sehr n&uuml;tzlich f&uuml;r alle, denen es nicht m&ouml;glich ist, FreeCAD mit Netgen zu kompilieren, um Schalen oder Kanten vernetzen zu k&ouml;nnen.</li>
<li><b>General Improvements</b> Aufgrund der starken Entwicklungsaktivit&auml;ten konnten sehr viele Verbesserungen am Basis-Code des FEM-Modules eingebracht werden.</li></ul>
<p><span id="Path_Workbench"></span>
</p>
<h2><span id="Arbeitsbereich_.22Path.22"></span><span class="mw-headline" id='Arbeitsbereich_"Path"'>Arbeitsbereich "Path"</span></h2>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Exercise_path_02.jpg&amp;filetimestamp=20160121205256&amp;.html" class="mw-file-description"><img src="../File/Exercise_path_02.jpg" decoding="async" width="804" height="582" class="mw-file-element" data-file-width="804" data-file-height="582"></a></span>
</p><p>Ein neuer <a href="../index.php?title=Path_Workbench/Path-Arbeitsbereich&amp;action=edit&amp;redlink=1.html" class="new" title="Path Workbench/Path-Arbeitsbereich (page does not exist)">Path Workbench/Path-Arbeitsbereich</a> wurde in FreeCAD hinzugef&uuml;gt. Dieser Arbeitsbereich, obwohl immer noch stark in der Entwicklung, hat bereits einige CAM-Operationen implementiert und erlaubt es, komplette G-Code (<a rel="nofollow" class="external autonumber" href="https://de.wikipedia.org/wiki/Computerized_Numerical_Control#DIN/ISO-Programmierung_bzw._G-Code">[1]</a>) Programme f&uuml;r eine gro&szlig;e Anzahl CNC-Maschinen zu exportieren. 
</p><p>In seinem momentanen Zustand erlaubt es der Arbeitsbereich, Profile und Taschen mit Objekten aus dem <a href="../de/Part_Workbench.html" title="Part Workbench/de">Part</a>-Arbeitsbereich zu erstellen, komplexe Pfade zu erstellen durch Aneinanderf&uuml;gen mehrerer Teilpfade, den Inhalt der G-Code Programme der Pfade zu betrachten und editieren, eine Werkzeugliste zu verwalten und beim Im- und Export von G-Code zwischen verschiedenen pre-processing- und post-processing-Skripten zu w&auml;hlen.
Es stellt bereits eine komplette <a href="../de/Path_scripting.html" class="mw-redirect" title="Path scripting/de">python API</a> zur Verf&uuml;gung.
</p><p><span id="Additional_Modules"></span>
</p>
<h2><span id="Zus.C3.A4tzliche_Module"></span><span class="mw-headline" id="Zus&auml;tzliche_Module">Zus&auml;tzliche Module</span></h2>
<p>Eine Reihe neuer <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD-addons">addons workbenches</a> wurde von Community-Mitgliedern zur Verf&uuml;gung gestellt. Diese Arbeitsbereiche sind sehr leicht in eine bestehende FreeCAD-Installation einzubinden.
Unter den neuen Arbeitsbereichen sind z.B.:
</p>
<ul><li>Eine <a rel="nofollow" class="external text" href="https://github.com/microelly2/Animation">Animation Workbench</a>, die es erm&ouml;glicht, Animationen von FreeCAD-Modellen zu erstellen, indem man die Bewegung einer Kamera definiert und eine Reihe von Bildern exportiert.</li>
<li>Ein <a rel="nofollow" class="external text" href="https://github.com/marmni/FreeCAD-Kerkythea">Kerkythea exporter macro</a> erm&ouml;glicht den Export der FreeCAD-Modelle zu dem freien <a rel="nofollow" class="external text" href="http://www.kerkythea.net/cms/">Kerkythea renderer</a>.</li>
<li>Ein in der Entwicklung befindliches <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?f=22&amp;t=10892%7CPie">Menu</a> ist ebenfalls verf&uuml;gbar.</li>
<li>Au&szlig;erdem wurde ein <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD-addons">addons repository</a> geschaffen, um alle interessanten Arbeitsbereiche, Module und Makros rund um FreeCAD zu sammeln. Diese Datenbank stellt auch einen Installer bereit, der sich um Installation und Update der Eintr&auml;ge k&uuml;mmert.</li></ul>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_installer_02.jpg&amp;filetimestamp=20151225190104&amp;.html" class="mw-file-description"><img src="../File/Macro_installer_02.jpg" decoding="async" width="404" height="377" class="mw-file-element" data-file-width="404" data-file-height="377"></a></span>
</p>
<!-- 
NewPP limit report
Cached time: 20251009172011
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.071 seconds
Real time usage: 0.142 seconds
Preprocessor visited node count: 74/1000000
Post&#8208;expand include size: 9/2097152 bytes
Template argument size: 0/2097152 bytes
Highest expansion depth: 2/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1758/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    0.000      1 -total
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:68503-0!canonical and timestamp 20251009172011 and revision id 1659704. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>