<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Sketcher Tutorial/de</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="de" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Sketcher+Tutorial&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="de" dir="ltr">Deutsch</span></li>
<li><a href="../Sketcher_Tutorial.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Sketcher Tutorial (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/Sketcher_Tutorial.html" class="mw-pt-progress mw-pt-progress--med" title="Tutorial Croquizador (41% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/Sketcher_Tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Sketcher Tutoriel (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../hr/Sketcher_Tutorial.html" class="mw-pt-progress mw-pt-progress--low" title="Sketcher Tutorial/hr (1% translated)" lang="hr" dir="ltr">hrvatski</a></li>
<li><a href="../it/Sketcher_Tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Sketcher Tutorial (100% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Sketcher_Tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Poradnik dla &#347;rodowiska pracy Szkicownik (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../ru/Sketcher_Tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="&#1059;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082; &#1087;&#1086; &#1057;&#1082;&#1077;&#1090;&#1095;&#1077;&#1088; (100% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li></ul></div>
<table class="fcinfobox wikitable ct" style="width: 230px; float: right; margin-left: 1em">
<tbody><tr>
<td class="ctTitle" style="font-weight: bold; font-size: 125%;"><span typeof="mw:File"><span><img src="../File/Freecad.svg" decoding="async" width="32" height="32" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span> Anleitung
</td></tr>
<tr>
<th class="ctOdd">Thema
</th></tr>
<tr>
<td class="ctEven">Sketcher
</td></tr>
<tr>
<th class="ctOdd">Niveau
</th></tr>
<tr>
<td class="ctEven">Anf&auml;nger
</td></tr>
<tr>
<th class="ctOdd">Bearbeitungszeit
</th></tr>
<tr>
<td class="ctEven">
</td></tr>
<tr>
<th class="ctOdd">Autoren
</th></tr>
<tr>
<td class="ctEven">Ulrich
</td></tr>
<tr>
<th class="ctOdd">FreeCAD-Version
</th></tr>
<tr>
<td class="ctEven">
</td></tr>
<tr>
<th class="ctOdd">Beispieldateien
</th></tr>
<tr>
<td class="ctEven">
</td></tr>
<tr>
<th class="ctOdd">Siehe auch
</th></tr>
<tr>
<td class="ctEven"><i>None</i>
</td></tr>
<tr>
<td class="ctToc"><br><meta property="mw:PageProp/toc">
</td></tr></tbody></table>
<p><span id="Introduction"></span>
</p>
<h2><span class="mw-headline" id="Einleitung">Einleitung</span></h2>
<p>Der Sketcher ist ein Werkzeug zur Erzeugung von 2D-Objekten zur Verwendung in der Bauteilkonstruktion. Der Sketcher unterscheidet sich von herk&ouml;mmlichen Zeichenwerkzeugen. Eine M&ouml;glichkeit, den Unterschied aufzuzeigen, ist die Konstruktion eines Dreiecks. Ein Dreieck wird durch 3 Werte vollst&auml;ndig definiert, eine beliebige Kombination von Werten aus folgender Liste: Seitenl&auml;nge, Winkel, H&ouml;he, Fl&auml;che. Die einzige Ausnahme sind drei Winkel, die die Gr&ouml;&szlig;e nicht definieren.
</p><p>Um ein Dreieck aus 3 L&auml;ngen auf herk&ouml;mmliche Weise zu konstruieren, ist folgendes zu tun: 
</p>
<ul><li>die Grundlinie zeichnen</li>
<li>zwei Kreise mit Radien zeichnen, die durch die beiden anderen Seitenl&auml;ngen gegeben sind, oder alternativ die Koordinaten des dritten Knotens berechnen</li>
<li>die fehlenden beiden Seiten von den Endpunkten der Grundlinie bis zum Schnittpunkt der beiden Kreise oder dem berechneten Knoten zeichnen.</li></ul>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Traditional_triangle.png&amp;filetimestamp=20140520190800&amp;.html" class="mw-file-description"><img src="../File/Traditional_triangle.png" decoding="async" width="325" height="190" class="mw-file-element" data-file-width="325" data-file-height="190"></a></span>
</p><p>Die Seite <a rel="nofollow" class="external text" href="https://de.wikipedia.org/wiki/Dreieck">wikipedia Dreieck</a> zeigt eine Sammlung von Formeln zur Berechnung der fehlenden Informationen, um aus der Mindestangabe ein Dreieck zu zeichnen. Diese werden ben&ouml;tigt, wenn das Dreieck durch vorberechnete Koordinaten definiert werden soll.
</p><p>Der Sketcher ist anders. Die Formeln und die obigen Hilfskonstruktionen werden nicht ben&ouml;tigt. Um den Unterschied zu verstehen, ist es am besten, selbst ein Dreieck zu konstruieren.
</p><p><span id="First_sketch:_a_triangle"></span>
</p>
<h2><span class="mw-headline" id="Erste_Skizze:_ein_Dreieck">Erste Skizze: ein Dreieck</span></h2>
<p>F&uuml;r die Anfertigung einer Skizze wird ein ge&ouml;ffnetes Dokument ben&ouml;tigt. Wenn kein Dokument ge&ouml;ffnet ist, wird durch Klicken auf <span typeof="mw:File"><a href="../Std_New.html" title="Std New"><img src="../File/Std_New.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> ein neues Dokument erstellt. Dann wird der Arbeitsbereich Sketcher ausgew&auml;hlt: 
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Workbench_select_sketcher.png&amp;filetimestamp=20140507181022&amp;.html" class="mw-file-description"><img src="../File/Workbench_select_sketcher.png" decoding="async" width="400" height="200" class="mw-file-element" data-file-width="400" data-file-height="200"></a></span>
</p><p>Eine neue Skizze wird durch Klicken auf <span typeof="mw:File"><a href="../de/Sketcher_NewSketch.html" title="Sketcher NewSketch/de"><img src="../File/Sketcher_NewSketch.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> erstellt. Es erscheint ein Dialogfeld, in dem die Ausrichtung der neuen Skizze im 3D-Raum ausgew&auml;hlt werden kann. In diesem Fall spielt es keine Rolle, sodass die XY-Ebene &uuml;bernommen werden kann. Es wird eine neue leere Skizze erstellt und im Bearbeitungsmodus ge&ouml;ffnet. Es wird ein Gitter mit einem Koordinatensystem angezeigt mit einem roten Punkt am Ursprung.
</p><p>Im Sketcher ist es in Ordnung, ein beliebiges Dreieck mit dem  <span typeof="mw:File"><a href="../de/Sketcher_CreatePolyline.html" title="Sketcher CreatePolyline/de"><img src="../File/Sketcher_CreatePolyline.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> Linienzugwerkzeug zu zeichnen und seine Eigenschaften in einem sp&auml;teren Schritt festzulegen. Jeder Klick in der Zeichenebene setzt einen Eckpunkt. Das Dreieck muss geschlossen sein, daher ist f&uuml;r die letzte Linie ein Klick auf den ersten erzeugten Knoten erforderlich. Vor dem Klicken sollte ein roter Punkt in der N&auml;he des Mauszeigers sichtbar sein.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Closed_triangle_with_pointer_small.png&amp;filetimestamp=20140427203907&amp;.html" class="mw-file-description"><img src="../File/Closed_triangle_with_pointer_small.png" decoding="async" width="400" height="200" class="mw-file-element" data-file-width="400" data-file-height="200"></a></span>
</p><p>Dies sorgt daf&uuml;r, dass der letzte Knoten mit dem ersten identisch ist und damit das Profil geschlossen. Die Symbole, die unterhalb des Mauszeigers erscheinen, zeigen die automatischen Randbedingungen an. Sie werden automatisch festgelegt, wenn man an diese Stelle klickt. Der rote Punkt unter dem Zeiger weist auf die Randbedingung Koinzidenz zwischen den beiden Knoten hin, das hei&szlig;t, dass die Knoten dieser unterschiedlichen Zeichnungselemente an derselben Stelle zusammengelegt werden.
</p><p>Das erstellte Dreieck ist flexibel. Ein Knoten kann mit der Maus ber&uuml;hrt und herumgezogen werden. Die Seiten des Dreiecks folgen dem Knoten. Dasselbe kann mit einer Linie gemacht werden.
</p><p>Jede Seitenl&auml;nge kann nun einfach durch Auswahl mit der Maus festgelegt werden: Das ausgew&auml;hlte Element f&auml;rbt sich gr&uuml;n. Wenn man auf das Werkzeug <span typeof="mw:File"><a href="../de/Sketcher_ConstrainDistance.html" title="Sketcher ConstrainDistance/de"><img src="../File/Sketcher_ConstrainDistance.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> Abstand festlegen klickt, &ouml;ffnet sich ein Dialog und die gew&uuml;nschte L&auml;nge kann eingegeben werden. Das Bild unten zeigt ein Dreieck mit Seitenl&auml;ngen von 35 mm, 27 mm und 25 mm. Die Grundlinie wurde horizontal festgelegt, indem sie ausgew&auml;hlt und auf das Werkzeug <span typeof="mw:File"><a href="../de/Sketcher_ConstrainHorizontal.html" title="Sketcher ConstrainHorizontal/de"><img src="../File/Sketcher_ConstrainHorizontal.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> Horizontal festlegen geklickt wurde.
</p><p><br> 
<span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Sketcher_triangle3_small.png&amp;filetimestamp=20140507193409&amp;.html" class="mw-file-description"><img src="../File/Sketcher_triangle3_small.png" decoding="async" width="400" height="200" class="mw-file-element" data-file-width="400" data-file-height="200"></a></span>
</p><p>Diese L&auml;ngen-Festlegungen werden (ma&szlig;liche) Randbedingungen genannt (oder auch Beschr&auml;nkungen, Einschr&auml;nkungen, Zw&auml;nge). Randbedingungen werden verwendet, um aus der flexiblen geometrischen Eingabe eine unbewegliche (statisch bestimmte) Konstruktion festzulegen. Der Sketcher bietet alle Randbedingungen, die zur Definition jeder Art von Dreieck erforderlich sind. Nur die Fl&auml;che (der Fl&auml;cheninhalt) kann nicht zur Definition eines Dreiecks verwendet werden. So kann das erstellte Dreieck kann neu festgelegt werden, indem der Wert einer Randbedingung ge&auml;ndert wird oder indem Randbedingungen gel&ouml;scht und andere hinzugef&uuml;gt werden. Hier folgt eine Liste von Dreiecken mit anderen vorgegebenen Eigenschaften. Es ist kein Problem, das soeben erstellte Dreieck in eines dieser Dreiecke zu verwandeln.
</p>
<ul><li>Ein oder zwei vorgegebene Winkel: Zwei Seiten des Dreiecks m&uuml;ssen ausgew&auml;hlt werden. Ein Klick auf <span typeof="mw:File"><a href="../de/Sketcher_ConstrainAngle.html" title="Sketcher ConstrainAngle/de"><img src="../File/Sketcher_ConstrainAngle.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> &ouml;ffnet einen Dialog zur Festlegung des Winkels.</li></ul>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Triangel_angle_small.png&amp;filetimestamp=20140427210102&amp;.html" class="mw-file-description"><img src="../File/Triangel_angle_small.png" decoding="async" width="400" height="200" class="mw-file-element" data-file-width="400" data-file-height="200"></a></span>
</p>
<ul><li>Rechtwinkliges Dreieck: Zwei Seiten des Dreiecks m&uuml;ssen ausgew&auml;hlt werden. Ein Klick auf <span typeof="mw:File"><a href="../de/Sketcher_ConstrainPerpendicular.html" title="Sketcher ConstrainPerpendicular/de"><img src="../File/Sketcher_ConstrainPerpendicular.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> legt einen rechten Winkel zwischen den beiden Seiten fest.</li></ul>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Right_triangle_sketcher.png&amp;filetimestamp=20140427213057&amp;.html" class="mw-file-description"><img src="../File/Right_triangle_sketcher.png" decoding="async" width="400" height="200" class="mw-file-element" data-file-width="400" data-file-height="200"></a></span>
</p>
<ul><li>Gleichseitiges Dreieck: F&uuml;r eine Seite muss eine L&auml;nge festgelegt werden. Dann m&uuml;ssen alle Seiten ausgew&auml;hlt werden und ein Klick auf <span typeof="mw:File"><a href="../Sketcher_ConstrainEqual.html" title="Sketcher ConstrainEqual"><img src="../File/Sketcher_ConstrainEqual.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> Gleichheit festlegen erstellt diese Randbedingung zweimal, um alle Seiten auf die gleiche L&auml;nge zu bringen.</li></ul>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Triangle_equilateral_small.png&amp;filetimestamp=20140428202540&amp;.html" class="mw-file-description"><img src="../File/Triangle_equilateral_small.png" decoding="async" width="400" height="200" class="mw-file-element" data-file-width="400" data-file-height="200"></a></span>
</p>
<ul><li>Gleichschenkliges Dreieck (zwei identische L&auml;ngen) mit gegebener H&ouml;he: Zuerst die beiden Seiten mit der gleichen L&auml;nge ausw&auml;hlen. Ein Klick auf <span typeof="mw:File"><a href="../de/Sketcher_ConstrainEqual.html" title="Sketcher ConstrainEqual/de"><img src="../File/Sketcher_ConstrainEqual.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> legt eine (L&auml;ngen-) Gleichheit zwischen den beiden Seiten fest. Dann die Grundlinie und den oberen Knoten ausw&auml;hlen und auf das Werkzeug <span typeof="mw:File"><a href="../de/Sketcher_ConstrainDistance.html" title="Sketcher ConstrainDistance/de"><img src="../File/Sketcher_ConstrainDistance.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> Abstand festlegen klicken.</li></ul>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Triangle_isosceles_small.png&amp;filetimestamp=20140428202700&amp;.html" class="mw-file-description"><img src="../File/Triangle_isosceles_small.png" decoding="async" width="400" height="200" class="mw-file-element" data-file-width="400" data-file-height="200"></a></span>
</p><p>Randbedingungen k&ouml;nnen durch Klicken auf das Symbol oder durch Klicken in der Liste Einschr&auml;nkungen (im Aufgabenbereich) ausgew&auml;hlt werden. Sie k&ouml;nnen gel&ouml;scht oder im Falle von Randbedingungen mit einem Wert nach einem Doppelklick editiert werden. Ein gegebenes Dreieck kann sp&auml;ter in einen anderen Typ von Dreieck umgewandelt werden, indem die Randbedingungen bearbeitet oder ge&auml;ndert werden. Der Sketcher ist ein Teil des parametrischen FreeCAD-Modellierungsansatzes. Was man erstellt hat, kann zu einem sp&auml;teren Zeitpunkt leicht ge&auml;ndert werden, wenn beispielsweise eine Variante der Konstruktion ben&ouml;tigt wird.
</p><p>Die oben gezeigten Dreiecke haben wei&szlig;e Linien. Das ist ein Hinweis darauf, dass die Skizze noch einige nicht bestimmte Freiheitsgrade hat. Dies kann durch Ziehen an einigen Linien oder Punkten getestet werden. Wenn sich die Linie oder der Punkt bewegt, ist dieser Punkt nicht vollst&auml;ndig festgelegt (bestimmt). Eine Skizze, die keine nicht bestimmten Freiheitsgrade mehr hat, wird gr&uuml;n.
</p><p>Dem gleichschenkligen Dreieck fehlt die Festlegung f&uuml;r die L&auml;nge der Grundlinie und es kann sich auf der Zeichnungsebene des Sketchers frei bewegen und drehen.
</p><p>Wenn die Dreieckseigenschaften definiert sind, muss es immer noch in der Zeichenebene fixiert werden. Die Zeichenebene des Sketchers hat ein Koordinatensystem. Der Ursprung des Koordinatensystems ist als roter Punkt in der Mitte der rosa x-Achse und der hellgr&uuml;nen y-Achse sichtbar. Am einfachsten l&auml;sst er sich fixieren, indem ein Knoten ausgew&auml;hlt und auf <span typeof="mw:File"><a href="../de/Sketcher_ConstrainLock.html" title="Sketcher ConstrainLock/de"><img src="../File/Sketcher_ConstrainLock.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> geklickt wird. Dadurch wird ein horizontaler und ein vertikaler Abstand vom Knoten zum Ursprung des Koordinatensystems hinzugef&uuml;gt. Das Dreieck kann immer noch einen Freiheitsgrad f&uuml;r die Drehung haben. Daher muss eine Seite horizontal, vertikal oder mit einem Winkel zu einer der Koordinatenachsen festgelegt werden. Das n&auml;chste Bild zeigt eine vollst&auml;ndig bestimmte Skizze. Alle Linien und Knoten sind jetzt gr&uuml;n.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Sketcher_triangle3_fc_small.png&amp;filetimestamp=20140507202524&amp;.html" class="mw-file-description"><img src="../File/Sketcher_triangle3_fc_small.png" decoding="async" width="400" height="200" class="mw-file-element" data-file-width="400" data-file-height="200"></a></span>
</p><p><span id="More_about_Constraints"></span>
</p>
<h2><span id="Mehr_.C3.BCber_Randbedingungen"></span><span class="mw-headline" id="Mehr_&uuml;ber_Randbedingungen">Mehr &uuml;ber Randbedingungen</span></h2>
<p>Der Sketcher kennt die Dreiecksformeln aus Wikipedia nicht. Stattdessen erstellt er ein Gleichungssystem f&uuml;r die 2-dimensionalen Koordinaten auf der Grundlage der gegebenen Randbedingungen. Dieses Gleichungssystem wird dann numerisch gel&ouml;st (berechnet).
</p><p>Auf diesem Weg kann eine Vielzahl von geometrischen Problemen gel&ouml;st werden. Es gibt aber auch einen Nachteil. Wenn der Gleichungssatz mehrere L&ouml;sungen hat, erhalten wir vielleicht etwas ganz anderes als das, was wir erwarten. Dies ist besonders &auml;rgerlich, wenn die gleiche Konstruktion f&uuml;r verschiedene Abmessungen verwendet werden soll. Das typische Symptom ist, dass die Skizze nach einer &Auml;nderung einer L&auml;ngenfestlegung auf etwas v&ouml;llig anderes umspringt. Ein einfaches Beispiel ist die Aufteilung einer Strecke in drei gleiche Teilungen. Das folgende Bild zeigt drei Linien in einer Reihe, wobei Randbedingungen f&uuml;r Gleichheit und Parallelit&auml;t festgelegt wurden. Der Gesamtabstand ist auf 10 mm eingestellt.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Dimension_partitions_parallel.png&amp;filetimestamp=20140511211052&amp;.html" class="mw-file-description"><img src="../File/Dimension_partitions_parallel.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>Das funktioniert gut, solange nur gr&ouml;&szlig;ere Abst&auml;nde eingegeben werden. Wenn der Abstand &uuml;ber ein bestimmtes Verh&auml;ltnis hinaus verringert wird, falten sich die Linien zusammen. Wir erhalten also nicht mehr ein Drittel des gegebenen Abstandes, sondern den Abstand selbst oder zwei Drittel davon. Einige Linien unserer Reihe haben ihre Ausrichtung ge&auml;ndert. Dies gibt immer noch eine g&uuml;ltige L&ouml;sung f&uuml;r die Menge der Zw&auml;nge, ist aber nicht das, was beabsichtigt war. Das folgende Bild der gleichen Skizze zeigt dies. Die L&auml;ngenfestlegung wurde auf 1000 mm gesetzt und dann auf 5 mm reduziert.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Dimension_partitions_flipped.png&amp;filetimestamp=20140511211333&amp;.html" class="mw-file-description"><img src="../File/Dimension_partitions_flipped.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>Die L&ouml;sung ist die Festlegung eines Winkels von 180&deg; zwischen den Teilungslinien als Ersatz f&uuml;r die Parallelit&auml;tsbedingung. F&uuml;r die 180&deg;-Bedingung gibt es nur eine L&ouml;sung. Die Skizze ist nun robust gegen&uuml;ber gro&szlig;en &Auml;nderungen des Abstands. Es muss gesagt werden, dass ggf. auch eine 0&deg;-Bedingung dem gleichen Zweck dient.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Constraint180_600x400.png&amp;filetimestamp=20140512164523&amp;.html" class="mw-file-description"><img src="../File/Constraint180_600x400.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>Die 180&deg;-Bedingung ist eine L&ouml;sung f&uuml;r viele Probleme. Einige &auml;ltere Versionen von FreeCAD haben Probleme mit der Darstellung der 180&deg;-Bedingung in der Skizzenebene. In den meisten F&auml;llen wird der 180&deg;-Bogen <b>nicht</b> in der Skizzenbene wie erwartet dargestellt. Dies ist ein bekanntes Problem f&uuml;r FreeCAD vor Version 14.3613.
</p><p>Bei mehreren inkrementellen Abmessungen in einer geraden Linie kann es ratsam sein, zuerst eine Zick&shy;zack-Linie zu zeichnen und dann die 180&deg;-Bedingungen festzulegen. Das hilft, keine zu vergessen, oder eine zweimal zu setzen.
</p><p><br>
</p><p><br>
Die folgende Tabelle zeigt einige Kombinationen von Randbedingungen f&uuml;r die Festlegung eines einfachen Winkels. Die Kombination wurde getestet, indem die horizontale Abmessung von 10 mm L&auml;nge auf gr&ouml;&szlig;ere Werte vergr&ouml;&szlig;ert wurde, bis der Winkel seine Ausrichtung umkehrt. Die Tabelle dokumentiert f&uuml;r jede gezeigte Kombination der Randbedingung die ge&auml;nderte L&auml;nge, an der das Umkippen erfolgt. 
</p>
<table border="1" cellspacing="0" cellpadding="2" rules="all" class="hintergrundfarbe1 rahmenfarbe1" style="margin:1em 1em 1em 0; border-style:solid; border-width:1px; border-collapse:collapse; empty-cells:show;" width="100%">

<tbody><tr>
<th>Kombination der Randbedingungen
</th>
<th>Anmerkungen
</th></tr>
<tr>
<td>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Elbow_equality_horizontal_vertical.png&amp;filetimestamp=20140518142225&amp;.html" class="mw-file-description"><img src="../File/Elbow_equality_horizontal_vertical.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p>
</td>
<td>
<p>Festlegung der L&auml;nge: Randbedingung Gleichheit festlegen f&uuml;r beide L&auml;ngen<br><br>
Festlegung der Ausrichtung: Randbedingungen Horizontal festlegen und Vertikal festlegen<br><br>
Kippt bei 51 mm
</p>
</td></tr>
<tr>
<td>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Elbow_fix_point_onto_object_52mm.png&amp;filetimestamp=20140519102919&amp;.html" class="mw-file-description"><img src="../File/Elbow_fix_point_onto_object_52mm.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p>
</td>
<td>
<p>Festlegung der L&auml;nge:  Randbedingung Gleichheit festlegen f&uuml;r die vertikale L&auml;nge, ein Bogen f&uuml;r die horizontalen L&auml;nge.<br><br>
Festlegung der Ausrichtung: zwei Punkte f&uuml;r die horizontale Ausrichtung und Randbedingung Vertikal festlegen<br><br>
Kippt bei 52 mm
</p>
</td></tr>
<tr>
<td>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Elbow_equality_perpendicular_vertical.png&amp;filetimestamp=20140519104410&amp;.html" class="mw-file-description"><img src="../File/Elbow_equality_perpendicular_vertical.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p>
</td>
<td>
<p>Festlegung der L&auml;nge: Randbedingung Gleichheit festlegen f&uuml;r beide L&auml;ngen<br><br>
Festlegung der Ausrichtung: Randbedingung Rechtwinklig festlegen zwischen Y-Achse und horizontaler Linie und Randbedingung Vertikal festlegen.<br><br>
Kippt bei 51 mm
</p>
</td></tr>
<tr>
<td>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Elbow_dimension_length_82_mm.png&amp;filetimestamp=20140519101709&amp;.html" class="mw-file-description"><img src="../File/Elbow_dimension_length_82_mm.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p>
</td>
<td>
<p>Festlegung der L&auml;nge: Randbedingung Abstand festlegen f&uuml;r die horizontale L&auml;nge. Randbedingung Gleichheit festlegen f&uuml;r die vertikale L&auml;nge.<br><br>
Festlegung der Ausrichtung: Randbedingungen Horizontal festlegen und Vertikal festlegen<br><br>
Kippt bei 82 mm<br><br>
Festlegung der L&auml;nge: Randbedingung Horizontalen Abstand festlegen f&uuml;r die horizontale L&auml;nge. Randbedingung Gleichheit festlegen f&uuml;r die vertikale L&auml;nge.<br><br>Festlegung der Ausrichtung: Randbedingungen Horizontal festlegen und Vertikal festlegen<br><br>
Die horizontale Linie kippt bei einem Test von 10 km nicht um, aber die vertikale Linie wurde umgedreht!<br><br>
</p>
</td></tr>
<tr>
<td>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Elbow_equality_90%C2%B0to_vertical.png&amp;filetimestamp=20140519110511&amp;.html" class="mw-file-description"><img src="../File/Elbow_equality_90%C2%B0to_vertical.png" decoding="async" width="600" height="440" class="mw-file-element" data-file-width="600" data-file-height="440"></a></span>
</p>
</td>
<td>
<p>Festlegung der L&auml;nge: Gleichheitsbeschr&auml;nkung f&uuml;r die Festlegung der L&auml;nge<br><br>
Festlegung der Ausrichtung: Randbedingung Winkel festlegen mit 90&deg;zwischen den Linien und Randbedingung Vertikal festlegen f&uuml;r die vertikale Linie <br><br>
kippt nicht, getestet bis zu 10 km
</p>
</td></tr></tbody></table>
<p>Der Test hat folgendes gezeigt: Gr&ouml;&szlig;ere &Auml;nderungen der ma&szlig;lichen Randbedingungen k&ouml;nnen aufgrund von Mehrfachl&ouml;sungen des zugrundeliegenden Gleichungssystems zu einem Umkippen einiger Linien der Skizze f&uuml;hren. Die einzigen Randbedingungen, die die Ausrichtung der Elemente, auf die sie angewendet werden, beibehalten, sind die Winkelfestlegung sowie die horizontalen und vertikalen ma&szlig;lichen Festlegungen. 
Die Unterschiede zwischen den anderen Randbedingungen hinsichtlich der Beibehaltung der Orientierung sind gering.
</p><p>Empfehlung: <b> Verwende die Randbedingungen Winkel festlegen, Horizontal festlegen und Vertikal Festlegen an kritischen Stellen, um eine Skizze robust gegen&uuml;ber Ma&szlig;&auml;nderungen zu machen. </b>
</p><p><span id="Problematic_combination_of_constraints"></span>
</p>
<h2><span class="mw-headline" id="Problematische_Kombination_von_Randbedingungen">Problematische Kombination von Randbedingungen</span></h2>
<p>Manchmal legen zwei oder mehr Randbedingungen die gleiche Eigenschaft fest. Als Beispiel k&ouml;nnen f&uuml;r zwei verbundene Linien dienen, wobei der Verbindungspunkt der Mittelpunkt einer Symmetriebedingung f&uuml;r die Endpunkte der Linien ist. Diese Linien haben nun die gleiche L&auml;nge und sind parallel. All dies ist die Folge der Randbedingung Symmetrie festlegen.
</p><p>Was passiert, wenn diese beiden Linien bereits eine Gleichheitsbedingung und eine Parallelfestlegung haben und die Symmetriebedingung ebenfalls hinzugef&uuml;gt wird? Nun wird die Eigenschaft Parallelit&auml;t durch zwei Bedingungen definiert, und die gleichen L&auml;ngen werden ebenfalls durch zwei Bedingungen definiert. Im Prinzip sollte das zugrundeliegende Gleichungssystem eine L&ouml;sung haben. Aber es kann numerische Probleme geben. Dies kann getestet werden, indem man versucht, die Linien zu verschieben. In den meisten F&auml;llen sind die Linien eingefroren, auch wenn der Skechert noch mehrere nicht bestimmte Freiheitsgrade angibt.
</p><p>Der obige Fall zeigt ein Problem, das f&uuml;r die Programmierer des Sketchers schwer zu l&ouml;sen zu sein scheint. Der Anwender muss also vorsichtig vorgehen, um solche Situationen zu vermeiden. &Uuml;berbestimmte Skizzen, d.h. solche mit &uuml;berz&auml;hligen Randbedingungen, verhalten sich unerwartet und problematisch. Symptome dieser &uuml;berz&auml;hligen Randbedingungen sind der oben beschriebene eingefrorene Zustand oder Meldungen bez&uuml;glich &uuml;berz&auml;hliger Randbedingungen nach der &Auml;nderung eines anderen Objekts in der Skizze.
</p><p>Im Allgemeinen gibt der Sketcher eine Warnung aus, wenn &uuml;berz&auml;hlige Randbedingungen entdeckt werden. Dieser Erkennungsmechanismus scheint jedoch nicht in allen F&auml;llen zu funktionieren. Wenn das Problem erkannt wird, kann es vermieden werden, indem einfach die &uuml;berz&auml;hligen Randbedingungen gel&ouml;scht werden. Manchmal ist es n&ouml;tig, eine andere Kombination von Randbedingungen  zu w&auml;hlen.  
</p><p>Die folgenden F&auml;lle sind Quellen f&uuml;r &uuml;berz&auml;hlige Randbedingungen:
</p>
<ul><li>Eine Gleichheitsfestlegung f&uuml;r zwei Radien desselben Bogens</li>
<li>Eine Symmetriefestlegung f&uuml;r zwei Radien desselben Bogens</li>
<li>Eine Symmetriefestlegung in Kombination mit Parallel-, Gleichheits- und oder Rechtwinklig-Festlegungen</li></ul>
<p>Ein anderer problematischer Fall sind Parallelen mit einem Schnittpunkt im Unendlichen. Es ist m&ouml;glich, eine 180&deg;-Festlegung f&uuml;r zwei parallele Linien ohne Schnittpunkt zu setzen. Dies wird <i>nicht'</i> empfohlen. Stattdessen sollte ein Winkel zu einer anderen Linie oder Achse festgelegt werden.
</p><p><br>
Ein anderes Problem ist die &Auml;nderung der Ausrichtung von Winkeln. Dies kann passieren, wenn Winkel&auml;nderungen &uuml;ber 180&deg; vorgenommen werden. Wenn dies in kleineren Schritten geschieht, wird das Problem vermieden.
</p><p><span id="Construction_Lines_-_Step_by_Step_Example"></span>
</p>
<h2><span id="Konstruktionslinien_-_Schritt-f.C3.BCr-Schritt-Beispiel"></span><span class="mw-headline" id="Konstruktionslinien_-_Schritt-f&uuml;r-Schritt-Beispiel">Konstruktionslinien - Schritt-f&uuml;r-Schritt-Beispiel</span></h2>
<p>Im ersten Teil wurde gezeigt, dass Konstruktionsgeometrie f&uuml;r die Konstruktion von Dreiecken nicht notwendig ist. Dennoch beinhaltet der Sketcher auch Konstruktionsgeometrie, die bei komplexeren Problemen n&uuml;tzlich ist. Jede Linie kann mit der Schaltfl&auml;che <span typeof="mw:File"><a href="../de/Sketcher_ToggleConstruction.html" title="Sketcher ToggleConstruction/de"><img src="../File/Sketcher_ToggleConstruction.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> in eine Konstruktionslinie umgewandelt werden. Die Konstruktionslinien werden in der Skizze als blaue Linien dargestellt. Sie k&ouml;nnen auf die gleiche Weise wie andere Linien mit Randbedingungen verwendet werden, werden jedoch nicht angezeigt und nicht verwendet, wenn die Skizze geschlossen wird.
</p><p>Die Aufgabe ist, ein Rechteck mit Seitenl&auml;ngen, die dem goldenen Schnitt entsprechen, zu bilden. Wikipedia zeigt, wie man zwei Linien mit einem L&auml;ngenverh&auml;ltnis des Goldenen Schnittes konstruiert. 
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Goldener_Schnitt_Konstr_beliebt.svg&amp;filetimestamp=20151124195817&amp;.html" class="mw-file-description"><img src="../File/Goldener_Schnitt_Konstr_beliebt.svg" decoding="async" width="645" height="404" class="mw-file-element" data-file-width="645" data-file-height="404"></a></span>
</p><p>Der Sketcher ist ein perfektes Werkzeug, um ein Rechteck mit dem goldenen Schnitt f&uuml;r die Seitenl&auml;nge zu konstruieren. Die Gr&ouml;&szlig;e des Rechtecks kann sp&auml;ter ge&auml;ndert werden, ohne eine neue Konstruktion zu erstellen. Die Konstruktionsschritte f&uuml;r den Goldenen Schnitt nach Wikipedia sind:
</p>
<ol><li>Mit einer Strecke AB wird ein Lot BC im Punkt B gef&auml;llt, wobei BC die halbe L&auml;nge von AB hat und anschlie&szlig;end die Hypotenuse AC gezeichnet.</li>
<li>Einen Bogen mit Radius BC um den Mittelpunkt C zeichnen. Dieser Bogen schneidet die Hypotenuse AC im Punkt D.</li>
<li>Einen Bogen mit Radius AD um den Mittelpunkt A zeichnen. Dieser Bogen schneidet das urspr&uuml;ngliche Liniensegment AB im Punkt S. Punkt S teilt die urspr&uuml;ngliche Strecke AB in die Teilstrecken AS und SB mit L&auml;ngen im Verh&auml;ltnis des goldenen Schnitts.</li></ol>
<p><br>
</p><p>Hier ist eine Schritt-f&uuml;r-Schritt-Erkl&auml;rung, wie dies erreicht werden kann.
</p>
<ul><li>Eine neue Skizze erstellen, wie am Dreiecksbeispiel erl&auml;utert.</li>
<li>In der Skizze ein Rechteck zeichnen. Die Schaltfl&auml;che <span typeof="mw:File"><a href="../de/Sketcher_CreateRectangle.html" title="Sketcher CreateRectangle/de"><img src="../File/Sketcher_CreateRectangle.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> dr&uuml;cken. Die folgende Abbildung zeigt das Rechteck. FreeCAD hat dem Rechteck horizontale und vertikale Beschr&auml;nkungen hinzugef&uuml;gt. Dieses Rechteck kann nicht gedreht werden.</li></ul>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Step1_rectangle_600x400.png&amp;filetimestamp=20140513201026&amp;.html" class="mw-file-description"><img src="../File/Step1_rectangle_600x400.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>Das Rechteck sollte in der Mitte des Koordinatensystems bleiben. Um dies zu erreichen, wird eine Symmetriebebedingung zu einer horizontalen Linie hinzugef&uuml;gt. Dies geschieht, indem zuerst die beiden Knoten der horizontalen Linie und dann die vertikale Achse des Koordinatensystems ausgew&auml;hlt werden. Die Symmetriebedingung wird durch Klicken auf die Schaltfl&auml;che <span typeof="mw:File"><a href="../de/Sketcher_ConstrainSymmetric.html" title="Sketcher ConstrainSymmetric/de"><img src="../File/Sketcher_ConstrainSymmetric.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> hinzugef&uuml;gt. Dasselbe geschieht f&uuml;r eine vertikale Linie, aber stattdessen wird jetzt die horizontale Achse als Symmetrieachse ausgew&auml;hlt. Die Abbildung unten zeigt das Ergebnis. Das Rechteck bleibt nun in der Mitte und kann nur in der Gr&ouml;&szlig;e ver&auml;ndert, aber nicht verschoben werden.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Step2_rectangle_with_symmetry_600x400.png&amp;filetimestamp=20140513201459&amp;.html" class="mw-file-description"><img src="../File/Step2_rectangle_with_symmetry_600x400.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>Dies war die Vorbereitung f&uuml;r das Rechteck. Die obere horizontale Linie sollte der Abstand AS f&uuml;r die Konstruktion des goldenen Schnittes sein. Eine zus&auml;tzliche Linie ist erforderlich, um den SB-Abstand darzustellen. Sie wird ein wenig schr&auml;g gezeichnet, wie unten gezeigt. Dadurch wird die automatische Randbedingung Horizontal festlegen vermieden. Diese Linie sollte stattdessen sp&auml;ter mit einem Winkel von 180&deg; festgelegt werden, um zu vermeiden, dass es mehrere L&ouml;sungen f&uuml;r die konstruierte Kombination der Randbedingungen gibt. Wenn die Linie mit der Bedingung horizontal festlegen gezeichnet wird, beschwert sich der Sketcher sp&auml;ter beim Hinzuf&uuml;gen der 180&deg;-Winkelbedingung. Die horizontale Festlegung muss in einem solchen Fall entfernt werden. Das Bild zeigt, wie eine Winkelabedingung hinzugef&uuml;gt wird, indem zwei Linien ausgew&auml;hlt und auf <span typeof="mw:File"><a href="../de/Sketcher_ConstrainAngle.html" title="Sketcher ConstrainAngle/de"><img src="../File/Sketcher_ConstrainAngle.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> geklickt wird. Nach dem Hinzuf&uuml;gen einer Linie ist es oft ratsam, mit der Maus an der Linie zu ziehen. Dadurch ist leicht zu erkennen, wenn eine Linie nicht mit den anderen gezeichneten Elementen verbunden ist. Wenn eine Linie nicht korrekt mit den anderen Linien verbunden ist, k&ouml;nnen in sp&auml;teren Schritten der Bauteilkonstruktion Probleme auftreten.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Step3_making_SB_600x400.png&amp;filetimestamp=20140513203541&amp;.html" class="mw-file-description"><img src="../File/Step3_making_SB_600x400.png" decoding="async" width="600" height="399" class="mw-file-element" data-file-width="600" data-file-height="399"></a></span>
</p><p>Die letzte Linie ist nicht Teil des Rechtecks. Sie muss daher in eine Konstruktionslinie gewandelt werden. Durch Markieren der Linie und Klicken auf die Schaltfl&auml;che <span typeof="mw:File"><a href="../de/Sketcher_ToggleConstruction.html" title="Sketcher ToggleConstruction/de"><img src="../File/Sketcher_ToggleConstruction.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> wird die Konvertierung durchgef&uuml;hrt. 
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Step4_make_SB_construction_line_600x400.png&amp;filetimestamp=20140515193001&amp;.html" class="mw-file-description"><img src="../File/Step4_make_SB_construction_line_600x400.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>Die Linie hat nun eine blaue Farbe, wie unten zu sehen ist. Das Rezept aus Wikipedia f&uuml;r den goldenen Schnitt erfordert eine Linie mit der H&auml;lfte der Entfernung AB. Um daf&uuml;r einen Bezugspunkt zu erhalten, wird mit dem Werkzeug <span typeof="mw:File"><a href="../de/Sketcher_CreatePoint.html" title="Sketcher CreatePoint/de"><img src="../File/Sketcher_CreatePoint.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> Punkt erstellen ein zus&auml;tzlicher Knoten an die Linie gesetzt. Dies ist unten dargestellt.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Step5_helper_vertex.png&amp;filetimestamp=20140515193517&amp;.html" class="mw-file-description"><img src="../File/Step5_helper_vertex.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>Der Referenzpunkt sollte in der Mitte des Abstands AB bleiben. Dies wird erreicht, indem zuerst die beiden Endpunkte des Abstands AB und als drittes der Mittelpunkt ausgew&auml;hlt werden. Wenn alle drei Punkte in der richtigen Reihenfolge ausgew&auml;hlt wurden, kann die Symmetriebedingungung durch Klicken auf die Schaltfl&auml;che <span typeof="mw:File"><a href="../de/Sketcher_ConstrainSymmetric.html" title="Sketcher ConstrainSymmetric/de"><img src="../File/Sketcher_ConstrainSymmetric.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> gesetzt werden, wie unten dargestellt.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Step6_symmetry_setting.png&amp;filetimestamp=20140515193603&amp;.html" class="mw-file-description"><img src="../File/Step6_symmetry_setting.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>Das Bild unten zeigt bereits die zweite Seite BC des Konstruktionsdreiecks. Diese Linie wurde wie oben beschrieben gezeichnet und in eine Konstruktionslinie umgewandelt. Diese Linie muss eine vertikale Festlegung erhalten, wie im Bild zu sehen ist. Dies kann leicht erreicht werden, indem die Linie nahezu vertikal gezeichnet wird. Wenn die Linie nahezu vertikal verl&auml;uft, wird das Symbol der Randbedingung Vertikal festlegen angezeigt und (diese) vom Sketcher gesetzt, wenn die Linie in diesem Zustand fertiggestellt wird.
</p><p>Die Linie BC muss die H&auml;lfte der L&auml;nge von AB haben. F&uuml;r diesen Zweck steht nur ein Bezugspunkt zur Verf&uuml;gung, so dass die Gleichheitsbedingung nicht verwendet werden kann. Die Gleichheitsbedingung w&uuml;rde eine Linie mit dieser L&auml;nge als Referenz ben&ouml;tigen, die in der Konstruktion nicht vorhanden ist. Daher wird der klassische Bogen zur Festlegung der L&auml;nge BC verwendet. Das folgende Bild zeigt die Zeichnung des Bogens. Es wird das Bogen-Werkzeug <span typeof="mw:File"><a href="../de/Sketcher_CreateArc.html" title="Sketcher CreateArc/de"><img src="../File/Sketcher_CreateArc.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span>  verwendet. Zuerst wird der Mittelpunkt auf B gesetzt. Der Punkt sollte beim Klicken auf B unter dem Bogenwerkzeug sichtbar sein. Oft muss das Bogenwerkzeug nicht direkt &uuml;ber dem Zielpunkt, sondern etwas darunter liegen, um den Koinzidenzpunkt sichtbar zu machen. Danach wird der Radius des Bogens definiert, indem der n&auml;chste Punkt auf den Referenzpunkt gesetzt wird. Der letzte Punkt des Bogens wird in der N&auml;he des Punktes C gesetzt. Es ist wichtig, dass die ersten beiden Punkte auf C und den Mittelpunkt festgelegt werden. Dies sollte nach Fertigstellung des Bogens durch Ziehen am Bogen getestet werden.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Step7_arc_defining_BC.png&amp;filetimestamp=20140515193651&amp;.html" class="mw-file-description"><img src="../File/Step7_arc_defining_BC.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>Um die L&auml;nge von BC zu definieren, muss die Linie am Bogen enden. Dies geschieht durch die Einstellung einer Koinzidenzbedingung zwischen dem letzten Bogenpunkt und dem Punkt C, wie unten dargestellt. Beide Punkte m&uuml;ssen ausgew&auml;hlt werden, und die Schaltfl&auml;che  <span typeof="mw:File"><a href="../de/Constraint_PointOnPoint.html" title="Constraint PointOnPoint/de"><img src="../File/Constraint_PointOnPoint.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> Koinzidenz festlegen muss angeklickt werden.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Step8_arc_BC_finishing.png&amp;filetimestamp=20140515193732&amp;.html" class="mw-file-description"><img src="../File/Step8_arc_BC_finishing.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>Das n&auml;chste Bild zeigt das fertige Dreieck. Die Hypotenuse AC ist bereits gezeichnet und in eine Konstruktionslinie umgewandelt.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Step9_triangle_ready.png&amp;filetimestamp=20140515193821&amp;.html" class="mw-file-description"><img src="../File/Step9_triangle_ready.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>Nun muss Schritt 2 des Wikipedia-Rezepts konstruiert werden. Es muss ein zweiter Bogen gezeichnet werden mit dem Mittelpunkt bei C und dem Startpunkt bei B. Der letzte Punkt sollte bei der Hypotenuse enden, wie im Bild unten gezeigt. 
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Step10_second_arc.png&amp;filetimestamp=20140515193909&amp;.html" class="mw-file-description"><img src="../File/Step10_second_arc.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>Der gezeichnete Bogen wurde in eine Konstruktionslinie umgewandelt. Nun beginnt Schritt 3 des Wikipedia Rezepts mit dem Zeichnen des letzten Bogens, wie in der Abbildung unten gezeigt. Der Radius dieses Bogens muss mit dem oben konstruierten Punkt auf der Hypotenuse definiert werden. Der letzte Punkt wird normalerweise nicht an einer Ecke des Rechtecks enden. Dies ist jedoch kein Problem, da es sp&auml;ter behoben wird. Der letzte Punkt kann wie unten gezeigt gesetzt werden.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Step11_last_arc.png&amp;filetimestamp=20140515193951&amp;.html" class="mw-file-description"><img src="../File/Step11_last_arc.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>Nun muss der letzte Schritt erfolgen, um die horizontale Linie des Rechtecks gleich dem Abstand AS zu machen. Dies wird unten gezeigt, indem man die Randbedingung Koinzidenz festlegen zwischen dem Ende des letzten Bogens und der Ecke des Rechtecks festlegt. 
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Step12_define_ratio.png&amp;filetimestamp=20140515194106&amp;.html" class="mw-file-description"><img src="../File/Step12_define_ratio.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>Nun muss die vertikale Linie zur L&auml;nge des Abstandes SC gemacht werden. Dies geschieht durch Einstellen einer Gleichheitsbedingung durch Auswahl der Schaltfl&auml;che <span typeof="mw:File"><a href="../de/Sketcher_ConstrainEqual.html" title="Sketcher ConstrainEqual/de"><img src="../File/Sketcher_ConstrainEqual.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> wie unten gezeigt.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Step12_define_rectangle.png&amp;filetimestamp=20140515194359&amp;.html" class="mw-file-description"><img src="../File/Step12_define_rectangle.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>Das n&auml;chste Bild zeigt das Rechteck mit einem Seitenl&auml;ngenverh&auml;ltnis, das dem Goldenen Schnitt entspricht. Das Rechteck sollte nur noch einen Freiheitsgrad haben. Daher sollte es beim Ziehen an ihm nur seine Gr&ouml;&szlig;e ver&auml;ndern, aber sich nicht bewegen. Wenn eine bestimmte Gr&ouml;&szlig;e einer Seite ben&ouml;tigt wird, kann dieser Seite eine L&auml;ngenfestlegung hinzugef&uuml;gt werden. Ansonsten ist die Skizze fertig und kann geschlossen werden. Im FreeCAD-Fenster sollte dann nur noch ein Rechteck sichtbar sein.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Step14_rectangle_with_golden_ratio.png&amp;filetimestamp=20140515194458&amp;.html" class="mw-file-description"><img src="../File/Step14_rectangle_with_golden_ratio.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p><span id="Exercise:_resilient_sketch"></span>
</p>
<h2><span id=".C3.9Cbung:_elastische_Skizze"></span><span class="mw-headline" id="&Uuml;bung:_elastische_Skizze">&Uuml;bung: elastische Skizze</span></h2>
<p>Das obige Beispiel f&uuml;hrte Konstruktionslinien ein. Nun werden einige wichtige Dinge zur Erstellung belastbarer Skizzen besprochen. Hier ist eine &Uuml;bung, um etwas Praxis im Umgang mit dem Sketcher zu bekommen. Ziel ist es, eine Skizze f&uuml;r so etwas wie einen speziellen Rahmen, wie unten gezeigt, anzufertigen.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Frame_erxercise_pad.png&amp;filetimestamp=20140519201221&amp;.html" class="mw-file-description"><img src="../File/Frame_erxercise_pad.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>Es sollten nur drei Ma&szlig;e zur Festlegung des Rahmens erforderlich sein. Um das &Auml;ndern von Ma&szlig;en zu erleichtern, k&ouml;nnen die Randbedingungen in etwas Einpr&auml;gsames umbenannt werden. Einfach die Randbedingung in der Listenansicht ausw&auml;hlen und &lt;F2&gt; dr&uuml;cken. Die Randbedingung kann z.B. in "Dicke" umbenannt werden. 
Die Zeichnung unten zeigt die Ma&szlig;e. Die Spitze auf der rechten Seite sollte die zweifache Wanddicke haben.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Frame_exercise_dimensions.png&amp;filetimestamp=20140519201841&amp;.html" class="mw-file-description"><img src="../File/Frame_exercise_dimensions.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>Die Skizze sollte auch nach &Auml;nderung der Schl&uuml;sselma&szlig;e, z.B. auf 2000 mm und wieder auf 30 mm, wie beabsichtigt aussehen. M&ouml;glicherweise m&uuml;ssen an bestimmten Stellen Winkelbedingungen verwendet werden, um dieses Ziel zu erreichen. Das Bild unten zeigt eine Skizze, die nicht robust gegen&uuml;ber solchen &Auml;nderungen war. Sie ist jetzt unbrauchbar. Um den urspr&uuml;nglichen Zustand wieder herzustellen, kann die R&uuml;ckg&auml;ngig-Schaltfl&auml;che <span typeof="mw:File"><a href="../de/Std_Undo.html" title="Std Undo/de"><img src="../File/Std_Undo.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> verwendet werden.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Frame_erxercise_failed_sketch.png&amp;filetimestamp=20140519202547&amp;.html" class="mw-file-description"><img src="../File/Frame_erxercise_failed_sketch.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>Die obige Skizze ist f&uuml;r den Arbeitsbereich Part-Design unbrauchbar. Nur Profile ohne sich schneidende Linien sind erlaubt. Konstruktionslinien d&uuml;rfen sich schneiden. Diese werden nicht zur Herstellung von Volumenk&ouml;rpern verwendet.
</p><p><br>
Einer der Haupteinsatzbereiche des Sketchers ist die Konstruktion von Bauteilen im Arbeitsbereich Part-Design. Bereits vorhandene Geometrie kann &auml;hnlich wie Konstruktionslinien verwendet werden. Da sich dieses Tutorial mehr auf die grundlegende Sketcher-Funktionalit&auml;t konzentriert, sollte man hier einen Blick auf die Verwendung von externer Geometrie werfen: <a href="../de/Sketcher_External.html" title="Sketcher External/de">Sketcher Extern</a>
</p>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><a href="../de/Sketcher_Workbench.html" title="Sketcher Workbench/de">Sketcher</a> <span typeof="mw:File"><a href="../index.php?title=Workbench_Sketcher.svg&amp;filetimestamp=20231231194727&amp;.html" class="mw-file-description"><img src="../File/Workbench_Sketcher.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<p>(FIXME)
</p>
<ul><li><b>Die Werkzeuge:</b> <a href="../de/Sketcher_NewSketch.html" title="Sketcher NewSketch/de">Skizze erstellen</a>, <a href="../de/Sketcher_EditSketch.html" title="Sketcher EditSketch/de">Skizze bearbeiten</a>, <a href="../de/Sketcher_LeaveSketch.html" title="Sketcher LeaveSketch/de">Skizze verlassen</a>, <a href="../de/Sketcher_ViewSketch.html" title="Sketcher ViewSketch/de">Skizze anzeigen</a>, <a href="../de/Sketcher_ViewSection.html" title="Sketcher ViewSection/de">View section</a>, <a href="../de/Sketcher_MapSketch.html" title="Sketcher MapSketch/de">Skizze einer Fl&auml;che zuordnen...</a>, <a href="../de/Sketcher_ReorientSketch.html" title="Sketcher ReorientSketch/de">Reorient sketch</a>, <a href="../de/Sketcher_ValidateSketch.html" title="Sketcher ValidateSketch/de">Skizze &uuml;berpr&uuml;fen</a>, <a href="../de/Sketcher_MergeSketches.html" title="Sketcher MergeSketches/de">Skizzen zusammenf&uuml;hren</a>, <a href="../de/Sketcher_MirrorSketch.html" title="Sketcher MirrorSketch/de">Skizze spiegeln</a></li></ul>
<hr>
<ul><li><b>Skizzen-Geometrien:</b> <a href="../de/Sketcher_CreatePoint.html" title="Sketcher CreatePoint/de">Punkt</a>, <a href="../de/Sketcher_CreateLine.html" title="Sketcher CreateLine/de">Linie</a>, <b><a href="../de/Sketcher_CompCreateArc.html" class="mw-redirect" title="Sketcher CompCreateArc/de">B&ouml;gen erstellen</a>,</b> <a href="../de/Sketcher_CreateArc.html" title="Sketcher CreateArc/de">Bogen</a>, <a href="../de/Sketcher_Create3PointArc.html" title="Sketcher Create3PointArc/de">Kreisbogen durch drei Punkte</a>, <b><a href="../de/Sketcher_CompCreateCircle.html" class="mw-redirect" title="Sketcher CompCreateCircle/de">Kreise erstellen</a></b>, <a href="../de/Sketcher_CreateCircle.html" title="Sketcher CreateCircle/de">Kreis</a>, <a href="../de/Sketcher_Create3PointCircle.html" title="Sketcher Create3PointCircle/de">Kreis durch drei Punkte</a>, <b><a href="../de/Sketcher_CompCreateConic.html" class="mw-redirect" title="Sketcher CompCreateConic/de">Kegelf&ouml;rmige K&ouml;rper erstellen</a></b>, <a href="../de/Sketcher_CreateEllipseByCenter.html" title="Sketcher CreateEllipseByCenter/de">Ellipse mit Mittelpunkt</a>, <a href="../de/Sketcher_CreateEllipseBy3Points.html" title="Sketcher CreateEllipseBy3Points/de">Ellipse durch drei Punkte</a>, <a href="../de/Sketcher_CreateArcOfEllipse.html" title="Sketcher CreateArcOfEllipse/de">Ellipsenbogen</a>, <a href="../de/Sketcher_CreateArcOfHyperbola.html" title="Sketcher CreateArcOfHyperbola/de">Hyperbel erstellen</a>, <a href="../de/Sketcher_CreateArcOfParabola.html" title="Sketcher CreateArcOfParabola/de">Parabel erstellen</a>, <b><a href="../de/Sketcher_CompCreateBSpline.html" class="mw-redirect" title="Sketcher CompCreateBSpline/de">B-splines erstellen</a></b>, <a href="../de/Sketcher_CreateBSpline.html" title="Sketcher CreateBSpline/de">B-spline</a>, <a href="../de/Sketcher_CreatePeriodicBSpline.html" title="Sketcher CreatePeriodicBSpline/de">Create periodic B-spline</a>, <a href="../de/Sketcher_CreatePolyline.html" title="Sketcher CreatePolyline/de">Linienzug (Mehrpunktlinie)</a>, <a href="../de/Sketcher_CreateRectangle.html" title="Sketcher CreateRectangle/de">Rechteck</a>, <b><a href="../de/Sketcher_CompCreateRegularPolygon.html" class="mw-redirect" title="Sketcher CompCreateRegularPolygon/de">Regul&auml;res Polygon erstellen</a></b>, <a href="../de/Sketcher_CreateTriangle.html" title="Sketcher CreateTriangle/de">Dreieck</a>, <a href="../de/Sketcher_CreateSquare.html" title="Sketcher CreateSquare/de">Quadrat</a>, <a href="../de/Sketcher_CreatePentagon.html" title="Sketcher CreatePentagon/de">F&uuml;nfeck</a>, <a href="../de/Sketcher_CreateHexagon.html" title="Sketcher CreateHexagon/de">Sechseck</a>, <a href="../de/Sketcher_CreateHeptagon.html" title="Sketcher CreateHeptagon/de">Siebeneck</a>, <a href="../de/Sketcher_CreateOctagon.html" title="Sketcher CreateOctagon/de">Achteck</a>, <a href="../de/Sketcher_CreateRegularPolygon.html" title="Sketcher CreateRegularPolygon/de">Create Regular Polygon</a>, <a href="../de/Sketcher_CreateSlot.html" title="Sketcher CreateSlot/de">Nut</a>, <a href="../de/Sketcher_CreateFillet.html" title="Sketcher CreateFillet/de">Abrundung erstellen</a>, <a href="../de/Sketcher_Trimming.html" title="Sketcher Trimming/de">Kante zuschneiden</a>, <a href="../de/Sketcher_Extend.html" title="Sketcher Extend/de">Verl&auml;ngern</a>, <a href="../de/Sketcher_External.html" title="Sketcher External/de">Externe Geometrie</a>, <a href="../de/Sketcher_CarbonCopy.html" title="Sketcher CarbonCopy/de">CarbonCopy</a>, <a href="../de/Sketcher_ToggleConstruction.html" title="Sketcher ToggleConstruction/de">Konstruktionsmodus</a></li></ul>
<hr>
<ul><li><b>Skizzenbeschr&auml;nkungen</b>
<ul><li><b>Geometrische Beschr&auml;nkungen</b> <a href="../de/Sketcher_ConstrainCoincident.html" title="Sketcher ConstrainCoincident/de">Koinzidenz erzwingen</a>, <a href="../de/Sketcher_ConstrainPointOnObject.html" title="Sketcher ConstrainPointOnObject/de">Punkt auf Objekt festlegen</a>, <a href="../de/Sketcher_ConstrainVertical.html" title="Sketcher ConstrainVertical/de">Vertikal</a>, <a href="../de/Sketcher_ConstrainHorizontal.html" title="Sketcher ConstrainHorizontal/de">Horizontal</a>, <a href="../de/Sketcher_ConstrainParallel.html" title="Sketcher ConstrainParallel/de">Parallel</a>, <a href="../de/Sketcher_ConstrainPerpendicular.html" title="Sketcher ConstrainPerpendicular/de">Orthogonal</a>, <a href="../de/Sketcher_ConstrainTangent.html" title="Sketcher ConstrainTangent/de">Tangente</a>, <a href="../de/Sketcher_ConstrainEqual.html" title="Sketcher ConstrainEqual/de">Gleichheit</a>, <a href="../de/Sketcher_ConstrainSymmetric.html" title="Sketcher ConstrainSymmetric/de">Symmetrisch</a>, <a href="../de/Sketcher_ConstrainBlock.html" title="Sketcher ConstrainBlock/de">Constrain Block</a></li>
<li><b>Dimensional constraints</b> <a href="../de/Sketcher_ConstrainLock.html" title="Sketcher ConstrainLock/de">Sperren</a>, <a href="../de/Sketcher_ConstrainDistanceX.html" title="Sketcher ConstrainDistanceX/de">Horizontaler Abstand</a>, <a href="../de/Sketcher_ConstrainDistanceY.html" title="Sketcher ConstrainDistanceY/de">Vertikaler Abstand</a>, <a href="../de/Sketcher_ConstrainDistance.html" title="Sketcher ConstrainDistance/de">Distanz festlegen</a>, <a href="../de/Sketcher_ConstrainRadius.html" title="Sketcher ConstrainRadius/de">Radius festlegen</a>, <a href="../de/Sketcher_ConstrainAngle.html" title="Sketcher ConstrainAngle/de">Winkel festlegen</a>, <a href="../de/Sketcher_ConstrainSnellsLaw.html" title="Sketcher ConstrainSnellsLaw/de">Snell's Law</a>, <a href="../de/Sketcher_ToggleDrivingConstraint.html" title="Sketcher ToggleDrivingConstraint/de">Umschalten auf steuernde Bema&szlig;ung</a>,</li></ul></li></ul>
<hr>
<ul><li><b>Sketcher tools</b> <a href="../de/Sketcher_SelectElementsWithDoFs.html" title="Sketcher SelectElementsWithDoFs/de">Select solver DOFs</a>, <a href="../de/Sketcher_CloseShape.html" title="Sketcher CloseShape/de">Close Shape</a>, <a href="../de/Sketcher_ConnectLines.html" title="Sketcher ConnectLines/de">Connect Edges</a>, <a href="../de/Sketcher_SelectConstraints.html" title="Sketcher SelectConstraints/de">Select Constraints</a>, <a href="../de/Sketcher_SelectOrigin.html" title="Sketcher SelectOrigin/de">Select Origin</a>, <a href="../de/Sketcher_SelectVerticalAxis.html" title="Sketcher SelectVerticalAxis/de">Select Vertical Axis</a>, <a href="../de/Sketcher_SelectHorizontalAxis.html" title="Sketcher SelectHorizontalAxis/de">Select Horizontal Axis</a>, <a href="../de/Sketcher_SelectRedundantConstraints.html" title="Sketcher SelectRedundantConstraints/de">Select Redundant Constraints</a>, <a href="../de/Sketcher_SelectConflictingConstraints.html" title="Sketcher SelectConflictingConstraints/de">Select Conflicting Constraints</a>, <a href="../de/Sketcher_SelectElementsAssociatedWithConstraints.html" title="Sketcher SelectElementsAssociatedWithConstraints/de">Select Elements Associated with constraints</a>, <a href="../de/Sketcher_RestoreInternalAlignmentGeometry.html" title="Sketcher RestoreInternalAlignmentGeometry/de">Show/Hide internal geometry</a>, <a href="../de/Sketcher_Symmetry.html" title="Sketcher Symmetry/de">Symmetry</a>, <a href="../de/Sketcher_Clone.html" title="Sketcher Clone/de">Clone</a>, <a href="../de/Sketcher_Copy.html" title="Sketcher Copy/de">Copy</a>, <a href="../de/Sketcher_Move.html" title="Sketcher Move/de">Move</a>, <a href="../de/Sketcher_RectangularArray.html" title="Sketcher RectangularArray/de">Rectangular Array</a>, <a href="../de/Sketcher_DeleteAllGeometry.html" title="Sketcher DeleteAllGeometry/de">Delete All Geometry</a>, <a href="../de/Sketcher_DeleteAllConstraints.html" title="Sketcher DeleteAllConstraints/de">Delete All Constraints</a></li></ul>
<hr>
<ul><li><b>Sketcher B-spline tools</b> <a href="../de/Sketcher_BSplineDegree.html" title="Sketcher BSplineDegree/de">Show/Hide B-spline degree</a>, <a href="../de/Sketcher_BSplinePolygon.html" title="Sketcher BSplinePolygon/de">Show/Hide B-spline control polygon</a>, <a href="../de/Sketcher_BSplineComb.html" title="Sketcher BSplineComb/de">Show/Hide B-spline curvature comb</a>, <a href="../de/Sketcher_BSplineKnotMultiplicity.html" title="Sketcher BSplineKnotMultiplicity/de">Show/Hide B-spline knot multiplicity</a>, <a href="../de/Sketcher_BSplineConvertToNURBS.html" title="Sketcher BSplineConvertToNURBS/de">Convert Geometry to B-spline</a>, <a href="../de/Sketcher_BSplineIncreaseDegree.html" title="Sketcher BSplineIncreaseDegree/de">Increase degree</a>, <a href="../de/Sketcher_BSplineIncreaseKnotMultiplicity.html" title="Sketcher BSplineIncreaseKnotMultiplicity/de">Increase knot multiplicity</a>, <a href="../de/Sketcher_BSplineDecreaseKnotMultiplicity.html" title="Sketcher BSplineDecreaseKnotMultiplicity/de">Decrease knot multiplicity</a></li></ul>
<hr>
<ul><li><b>Sketcher virtual space</b> <a href="../de/Sketcher_SwitchVirtualSpace.html" title="Sketcher SwitchVirtualSpace/de">Switch Virtual Space</a></li></ul></div>
    </div></div>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><span typeof="mw:File"><a href="../index.php?title=User_hub.png&amp;filetimestamp=20190221145008&amp;.html" class="mw-file-description"><img src="../File/User_hub.png" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../de/User_hub.html" title="User hub/de">Anwenderdokumentation</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b><a href="../de/Getting_started.html" title="Getting started/de">Erste Schritte</a></b></li>
<li><b>Installation:</b> <a href="../de/Download.html" title="Download/de">Herunterladen</a>, <a href="../de/Installing_on_Windows.html" title="Installing on Windows/de">Windows</a>, <a href="../de/Installing_on_Linux.html" title="Installing on Linux/de">Linux</a>, <a href="../de/Installing_on_Mac.html" title="Installing on Mac/de">Mac</a>, <a href="../de/Installing_additional_components.html" title="Installing additional components/de">Zus&auml;tzliche Komponenten</a>, <a href="../de/Compile_on_Docker.html" title="Compile on Docker/de">Docker</a>, <a href="../de/AppImage.html" title="AppImage/de">AppImage</a>, <a href="../de/Ubuntu_Snap.html" title="Ubuntu Snap/de">Ubuntu Snap</a></li>
<li><b>Grundlagen:</b> <a href="../de/About_FreeCAD.html" title="About FreeCAD/de">&Uuml;ber FreeCAD</a>, <a href="../de/Interface.html" title="Interface/de">Graphische Oberfl&auml;che</a>, <a href="../de/Mouse_navigation.html" title="Mouse navigation/de">Mausbedienung</a>, <a href="../de/Selection_methods.html" title="Selection methods/de">Auswahlmethoden</a>, <a href="../de/Object_name.html" title="Object name/de">Objektname</a>, <a href="../de/Preferences_Editor.html" title="Preferences Editor/de">Voreinstellungseditor</a>, <a href="../de/Workbenches.html" title="Workbenches/de">Arbeitsbereiche</a>, <a href="../de/Document_structure.html" title="Document structure/de">Dokumentstruktur</a>, <a href="../de/Property.html" title="Property/de">Objekteigenschaften</a>, <a href="../de/Help_FreeCAD.html" title="Help FreeCAD/de">FreeCAD unterst&uuml;tzen</a>, <a href="../de/Donate.html" title="Donate/de">Spenden</a></li></ul>
<hr>
<ul><li><b>Hilfe:</b> <a href="../de/Tutorials.html" title="Tutorials/de">Anleitungen</a>, <a href="../de/Video_tutorials.html" title="Video tutorials/de">Videoanleitungen</a></li>
<li><b><a href="../de/Workbenches.html" title="Workbenches/de">Arbeitsbereiche</a>:</b> <a href="../de/Std_Base.html" title="Std Base/de">Std Base</a>, <a href="../de/Arch_Workbench.html" title="Arch Workbench/de">Arch</a>, <a href="../de/Assembly_Workbench.html" title="Assembly Workbench/de">Assembly</a>, <a href="../de/BIM_Workbench.html" title="BIM Workbench/de">BIM</a>, <a href="../de/CAM_Workbench.html" title="CAM Workbench/de">CAM</a>, <a href="../de/Draft_Workbench.html" title="Draft Workbench/de">Draft</a>, <a href="../de/FEM_Workbench.html" title="FEM Workbench/de">FEM</a>, <a href="../de/Inspection_Workbench.html" title="Inspection Workbench/de">Inspection</a>, <a href="../de/Material_Workbench.html" title="Material Workbench/de">Material</a>, <a href="../de/Mesh_Workbench.html" title="Mesh Workbench/de">Mesh</a>, <a href="../de/OpenSCAD_Workbench.html" title="OpenSCAD Workbench/de">OpenSCAD</a>, <a href="../de/Part_Workbench.html" title="Part Workbench/de">Part</a>, <a href="../de/PartDesign_Workbench.html" title="PartDesign Workbench/de">PartDesign</a>, <a href="../de/Points_Workbench.html" title="Points Workbench/de">Points</a>, <a href="../de/Reverse_Engineering_Workbench.html" title="Reverse Engineering Workbench/de">Reverse Engineering</a>, <a href="../de/Robot_Workbench.html" title="Robot Workbench/de">Robot</a>, <a href="../de/Sketcher_Workbench.html" title="Sketcher Workbench/de">Sketcher</a>, <a href="../de/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/de">Spreadsheet</a>, <a href="../de/Surface_Workbench.html" title="Surface Workbench/de">Surface</a>, <a href="../de/TechDraw_Workbench.html" title="TechDraw Workbench/de">TechDraw</a>, <a href="../de/Testing.html" title="Testing/de">Test Framework</a></li></ul>
<hr>
<ul><li><b><a href="../de/Addon.html" title="Addon/de">Addon</a>:</b> <a href="../de/Std_AddonMgr.html" title="Std AddonMgr/de">Addon-Manager</a>, <a href="../de/External_workbenches.html" title="External workbenches/de">Externe Arbeitsbereiche</a>, <a href="../de/Scripting_and_macros.html" title="Scripting and macros/de">Skripten und Makros</a></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="../de/User_hub.html" title="User hub/de">Anwenderzentrum</a>, <a href="../de/Power_users_hub.html" title="Power users hub/de">Hauptanwenderzentrum</a>, <a href="../de/Developer_hub.html" title="Developer hub/de">Entwicklerzentrum</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20251206161628
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.234 seconds
Real time usage: 0.878 seconds
Preprocessor visited node count: 168/1000000
Post&#8208;expand include size: 18319/2097152 bytes
Template argument size: 7033/2097152 bytes
Highest expansion depth: 4/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1716/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   33.949      1 -total
 35.68%   12.112      1 Template:Sketcher_Tools_navi/de
 23.14%    7.857      1 Template:TutorialInfo/de
 20.78%    7.054      1 Template:Userdocnavi/de
 19.93%    6.765      2 Template:Navigation_menu_2
 16.63%    5.646      1 Template:Prettytable
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:63452-0!canonical and timestamp 20251206161627 and revision id 1711706. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>