<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">The FreeCAD source code/de</span></h1><?xml encoding="UTF-8"><div class="mw-parser-output"><div class="mw-pt-languages noprint" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="de" dir="ltr">Deutsch</span></li>
<li><a href="../The_FreeCAD_source_code.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="The FreeCAD source code (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/The_FreeCAD_source_code.html" class="mw-pt-progress mw-pt-progress--low" title="El c&oacute;digo fuente de FreeCAD (38% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/The_FreeCAD_source_code.html" class="mw-pt-progress mw-pt-progress--complete" title="Code source de FreeCAD (92% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/The_FreeCAD_source_code.html" class="mw-pt-progress mw-pt-progress--complete" title="Il codice sorgente di FreeCAD (92% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/The_FreeCAD_source_code.html" class="mw-pt-progress mw-pt-progress--complete" title="Kod &#378;r&oacute;d&#322;owy FreeCAD (92% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt-br/The_FreeCAD_source_code.html" class="mw-pt-progress mw-pt-progress--complete" title="O c&oacute;digo-fonte do FreeCAD (92% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../ru/The_FreeCAD_source_code.html" class="mw-pt-progress mw-pt-progress--stub" title="&#1048;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076; FreeCAD (8% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li>
<li><a href="../zh-cn/The_FreeCAD_source_code.html" class="mw-pt-progress mw-pt-progress--med" title="FreeCAD&#30340;&#28304;&#20195;&#30721; (46% translated)" lang="zh-Hans-CN" dir="ltr">&#20013;&#25991;&#65288;&#20013;&#22269;&#22823;&#38470;&#65289;</a></li></ul></div>
<div class="mw-translate-fuzzy">
<p>Der <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD">FreeCAD Quellcode</a> wird mit git verwaltet, und ist &ouml;ffentlich, offen und unter der <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/GNU_Lesser_General_Public_License">LGPL Lizenz</a> verf&uuml;gbar. Er kann von jedem kopiert, heruntergeladen, gelesen, analysiert, weiterverbreitet und modifiziert werden. Wenn du planst, &Auml;nderungen vorzunehmen, die du im offiziellen Code selbst sehen m&ouml;chtest, denke daran, dass deine &Auml;nderungen von den FreeCAD Entwicklern genehmigt werden m&uuml;ssen. Daher ist es ratsam, deine Absichten und Ideen zuerst im <a rel="nofollow" class="external text" href="http://forum.freecadweb.org">Forum</a> zu diskutieren, um das Risiko zu vermeiden, dass deine &Auml;nderungen aus einem nicht vorhersehbaren Grund abgelehnt werden.
</p>
</div>
<p>Im Folgenden findest Du einige Hinweise und n&uuml;tzliche Informationen, um Dich auf den richtigen Weg zu bringen, wenn Du daran interessiert bist, den FreeCAD Code zu erforschen.
</p>
<ul><li>Der FreeCAD Code ist haupts&auml;chlich in <b>C++</b> programmiert, st&uuml;tzt sich aber stark auf <b>Python</b>. Ein sehr gro&szlig;er Teil seiner Funktionalit&auml;t bietet zugeh&ouml;rige Python Bindungen, und es ist Teil der Kernphilosophie der FreeCAD Entwicklung, stets Python Zugriff auf jede neue, in C++ implementierte Funktion zu bieten. Um dies zu erreichen, wird CPython (die von Python selbst zur Verf&uuml;gung gestellten C Schnittstellenwerkzeuge) und insbesondere <a rel="nofollow" class="external text" href="http://cxx.sourceforge.net/">PyCXX</a> in FreeCAD stark genutzt. Viele Vorlagen und benutzerdefinierte Werkzeuge werden auch im FreeCAD Code selbst zur Verf&uuml;gung gestellt, um das Erstellen der zugeh&ouml;rigen Python Bindungen sehr einfach zu machen. Einige weitere Spitzenbestandteile des FreeCAD Codes sind vollst&auml;ndig in Python geschrieben.</li></ul>
<ul><li>Der FreeCAD Quellcode ist vollst&auml;ndig '<i>plattform&uuml;bergreifend</i>, und es wird gro&szlig;e Sorgfalt darauf verwendet, die Anwendung auf einer gr&ouml;&szlig;tm&ouml;glichen Anzahl von Plattformen und Konfigurationen einsetzen zu k&ouml;nnen und bestehende Benutzer nicht in schwierige Situationen zu bringen. Daher werden neue Versionen der ben&ouml;tigten Komponenten so weit wie m&ouml;glich vermieden, solange sie nicht auf allen Plattformen allgemein und leicht verf&uuml;gbar sind, und die Abw&auml;rtskompatibilit&auml;t (die M&ouml;glichkeit, eine mit einer alten Version von FreeCAD erstellte Datei auf einer neueren Version zu &ouml;ffnen) ist eine wichtige Priorit&auml;t.</li></ul>
<ul><li>Fast die gesamte Funktionalit&auml;t von FreeCAD ist in zwei verschiedene Teile aufgeteilt, die <b>App</b> und <b>Gui</b> (Abk&uuml;rzung; engl.: Application and Graphical User Interface = Anwendung und Grafische Benutzeroberfl&auml;che) genannt werden.</li></ul>
<p>Abk. GUI von englisch graphical user interface
Diese Trennung spiegelt sich &uuml;berall in der Dateistruktur des Quellcodes wider. Die Anwendung enth&auml;lt die gesamte Funktionalit&auml;t, die im reinen Konsolenmodus (ohne Grafische Benutzeroberfl&auml;che) laufen muss. Da FreeCAD ohne seine grafische Benutzeroberfl&auml;che kompiliert und ausgef&uuml;hrt werden kann, ist der Code in der Anwendung unabh&auml;ngig von jeder GUI-bezogenen Bibliothek. Gui enth&auml;lt den gesamten Code, der f&uuml;r die Ausf&uuml;hrung im GUI Modus ben&ouml;tigt wird und ist um die App Funktionalit&auml;t herum aufgebaut.
</p>
<ul><li>Der Grossteil der FreeCAD Funktionalit&auml;t ist in <b>Modulen</b> umgesetzt. FreeCAD ohne seine Module ist ein einfaches Container Fenster, das einfach eine Datei &ouml;ffnen und speichern kann. Alle Geometriewerkzeuge und Arbeitsbereiche sind in Modulen umgesetzt. Module k&ouml;nnen in C++, in Python oder in einer Kombination aus dem Besten aus beiden Welten geschrieben werden. Es kann sich um hybride C++/Python Module handeln, bei denen die feste Kernfunktionalit&auml;t in C++ programmiert ist und die Endbenutzerwerkzeuge in Python geschrieben sind, so dass sie von FreeCAD Anwendern leichter erweitert und angepasst werden k&ouml;nnen. Jedes Modul definiert und erzeugt normalerweise eine <b>Arbeitsbereich</b> in der FreeCAD Oberfl&auml;che, wenn es im GUI Modus verwendet wird, normalerweise mit dem gleichen Namen, aber es ist nicht zwingend erforderlich, dass die Module einen Arbeitsbereich enthalten.</li></ul>
<ul><li>FreeCAD Module sind oft <b>abh&auml;ngig von anderen Modulen</b>. Die meisten Module, die Festk&ouml;rpergeometrie verwenden, h&auml;ngen von dem <b>Formteil</b> Modul ab, welches das grundlegendste Modul von FreeCAD ist und die meisten Schnittstellen mit OpenCascade umsetzt. Obwohl andere Module die OpenCascade Funktionalit&auml;t direkt nutzen k&ouml;nnen, verlassen sie sich oft auf &uuml;bergeordnete Funktionen, die von Part zur Verf&uuml;gung gestellt werden.</li></ul>
<ul><li>Module sind immer <b>initialisiert</b> durch Python. Auch wenn sie vollst&auml;ndig in C++ geschrieben sind, enthalten sie immer eine minimale Python/CPython-Struktur.</li></ul>
<ul><li>FreeCAD ist ein begeisterter Nutzer von <b>anderen Quelloffenen Bibliotheken</b>. Neben Python und Qt, die vom Kern und fast allen Modulen verwendet werden, sind die beiden schwergewichtigen Bibliotheken, die in den meisten Modulen verwendet werden, <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Open_Cascade_Technology">OpenCascade Technologie</a> (OCCT) und <a rel="nofollow" class="external text" href="http://www.coin3d.org/">Coin3D</a>. OpenCascade wird verwendet, um die gesamte Festk&ouml;rpergeometrie von FreeCAD zu erstellen und zu verwalten, w&auml;hrend Coin3D f&uuml;r die Verwaltung der 3D Ansicht verwendet wird. OpenCascade wird haupts&auml;chlich in der App Welt verwendet, und coin3D ausschlie&szlig;lich in der Gui Welt. Ein grunds&auml;tzliches Verst&auml;ndnis von OpenCascade ist wesentlich, um jede geometriebezogene Arbeit mit FreeCAD durchzuf&uuml;hren. Spezifischere Module nutzen spezifischere Bibliotheken, und da es in diesem Punkt normalerweise keine Einschr&auml;nkungen gibt, abgesehen davon, dass diese Bibliotheken auf allen Plattformen leicht verf&uuml;gbar sind, kann die Liste der Abh&auml;ngigkeiten einer vollst&auml;ndigen FreeCAD Installation mit all ihren Modulen ziemlich gro&szlig; sein.</li></ul>
<ul><li>FreeCADs <b>Dokument Objekte</b>, welche alle die Objekte sind, die in einem FreeCAD Dokument enthalten sind, sind das, was in der Baumansicht in der GUI und in FreeCAD.ActiveDocument.Objects() in Python erscheint. Sie k&ouml;nnen, m&uuml;ssen aber keine geometrischen Daten haben und k&ouml;nnen, m&uuml;ssen aber nicht, in der 3D Ansicht angezeigt werden. Sie sind immer in App  und Gui Teile getrennt. Der Gui Teil wird nicht geladen, wenn er im Konsolenmodus ausgef&uuml;hrt wird. Bei geometrischen Standardobjekten, wie z.B. in Part oder PartDesign, wird die OpenCascade basierte Geometrie in der App definiert, w&auml;hrend das Gui Gegenst&uuml;ck (auch "Ansichtslieferant" genannt) f&uuml;r die Erstellung einer Coin3D Repr&auml;sentation dieser Geometrie verantwortlich ist, die in den Haupt Coin3D Szenendiagramm der 3D Ansicht eingef&uuml;gt wird.</li></ul>
<ul><li>Die grundlegende Verzeichnisstruktur des Quellcodes ist wie folgt organisiert:
<ul><li><b>App</b>: enth&auml;lt die FreeCAD Konsolen Anwendung, definiert grundlegende Strukturen und Basisklassen f&uuml;r Dokumentobjekte, die von Modulen zur Erstellung eigener Objekte verwendet werden.</li>
<li><b>Basis</b>: enth&auml;lt die Kernfunktionalit&auml;t, die &uuml;blicherweise in FreeCAD verwendet wird: 3D Vektoren, Einheiten, Matrizen, Platzierungen, etc.</li>
<li><b>Gui</b>: enth&auml;lt die FreeCAD GUI Modus Anwendung, definiert die 3D Ansicht, enth&auml;lt viele Werkzeuge und Funktionen, die von den Arbeitsbereichen zur Interaktion mit der Schnittstelle und mit der 3D Ansicht verwendet werden k&ouml;nnen, definiert Basisklassen f&uuml;r Ansichtsanbieter.</li>
<li><b>Doc</b>: enth&auml;lt haupts&auml;chlich eine alles in einem Qt Hilfedatei, die aus diesem Wiki generiert wurde.</li>
<li><b>Mod</b>: enth&auml;lt alle Module, selbst weiter getrennt in App und Gui (au&szlig;er Python Module, die nicht immer so klar dieser Regel folgen).</li></ul></li></ul>
<h3><span class="mw-headline" id="Verwandtes">Verwandtes</span></h3>
<ul><li><a href="../de/Source_code_management.html" title="Source code management/de">Quellcodeverwaltung</a></li>
<li>Das <a href="../de/Power_users_hub.html" title="Power users hub/de">Hauptanwenderzentrum</a> enth&auml;lt eine Menge Dokumentation &uuml;ber Module, OpenCascade und Coin3D, haupts&auml;chlich f&uuml;r den Python Programmierer. Da die Funktionalit&auml;t jedoch &auml;hnlich ist, sind diese Seiten auch f&uuml;r den C++ Programmierer von Interesse.</li>
<li><a href="../File_Format_FCStd.html" title="File Format FCStd">FCStd</a> - Das FreeCAD-Dateiformat</li></ul>
<!-- 
NewPP limit report
Cached time: 20250705150259
Cache expiry: 86400
Reduced expiry: false
Complications: [no&#8208;toc&#8208;conversion]
CPU time usage: 0.041 seconds
Real time usage: 0.076 seconds
Preprocessor visited node count: 9/1000000
Post&#8208;expand include size: 3/2097152 bytes
Template argument size: 0/2097152 bytes
Highest expansion depth: 2/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1764/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    0.000      1 -total
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:174083-0!canonical and timestamp 20250705150259 and revision id 1603539. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>