<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Third Party Libraries/de</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="de" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Third+Party+Libraries&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="de" dir="ltr">Deutsch</span></li>
<li><a href="../Third_Party_Libraries.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Third Party Libraries (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../tr/Third_Party_Libraries.html" class="mw-pt-progress mw-pt-progress--low" title="Third Party Libraries (1% translated)" lang="tr" dir="ltr">T&uuml;rk&ccedil;e</a></li>
<li><a href="../es/Third_Party_Libraries.html" class="mw-pt-progress mw-pt-progress--med" title="Bibliotecas de terceros (55% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/Third_Party_Libraries.html" class="mw-pt-progress mw-pt-progress--high" title="Biblioth&egrave;ques tierces (97% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/Third_Party_Libraries.html" class="mw-pt-progress mw-pt-progress--high" title="Librerie di terze parti (88% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Third_Party_Libraries.html" class="mw-pt-progress mw-pt-progress--complete" title="Biblioteki zewn&#281;trzne (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt-br/Third_Party_Libraries.html" class="mw-pt-progress mw-pt-progress--low" title="Bibliotecas de terceiros (3% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../ro/Third_Party_Libraries.html" class="mw-pt-progress mw-pt-progress--low" title="Biblioteci de la ter&#539;i (4% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><a href="../sv/Third_Party_Libraries.html" class="mw-pt-progress mw-pt-progress--low" title="Third Party Libraries (5% translated)" lang="sv" dir="ltr">svenska</a></li>
<li><a href="../ru/Third_Party_Libraries.html" class="mw-pt-progress mw-pt-progress--high" title="&#1057;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1080;&#1077; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080; (97% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li>
<li><a href="../ja/Third_Party_Libraries.html" class="mw-pt-progress mw-pt-progress--low" title="Third Party Libraries (4% translated)" lang="ja" dir="ltr">&#26085;&#26412;&#35486;</a></li></ul></div>
<div class="docnav">
    <div><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-left.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span> <a href="../de/Compiling_(Speeding_up).html" title="Compiling (Speeding up)/de">Kompilieren (Beschleunigen)</a></div>
    <div><a href="../de/Third_Party_Tools.html" title="Third Party Tools/de">Drittanbieterwerkzeuge</a>
 <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-right.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span></div>
    <div><a href="../de/Online_Help_Toc.html" title="Online Help Toc/de">Index</a> <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Online_Help_Toc.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span></div>
</div>
<div style="clear:right; margin-bottom: .5em; float: right; padding: .5em 0 .8em 1.4em; background: none;"><meta property="mw:PageProp/toc"></div>
<p><span id="Overview"></span>
</p>
<h2><span id=".C3.9Cbersicht"></span><span class="mw-headline" id="&Uuml;bersicht">&Uuml;bersicht</span></h2>
<p>Dies sind Bibliotheken, die FreeCAD als Abh&auml;ngigkeiten von Dritten w&auml;hrend der Kompilierung verwendet. Sie sind normalerweise <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Dynamic_loading">dynamisch gelinkte Bibliotheken</a> und haben eine Erweiterung <code>.so</code> in Linux/MacOS und <code>.dll</code> in Windows, und werden von ihren Kopfdateien <code>.h</code> oder<code>.hpp</code> oder &auml;hnlichem begleitet. Wenn eine modifizierte Bibliothek oder eine H&uuml;lle erforderlich ist, muss der Code der modifizierten Bibliothek oder der H&uuml;lle Teil des FreeCAD Quellcodes werden und zusammen mit diesem kompiliert werden.
</p><p>Die Abh&auml;ngigkeiten m&uuml;ssen im System installiert werden, bevor Du mit der Kompilierung fortfahren kannst; siehe <a href="../de/Compile_on_Linux.html" title="Compile on Linux/de">Kompilieren unter Linux</a>,  <a href="../de/Compile_on_Windows.html" title="Compile on Windows/de">Kompilieren unter Windows</a>, und <a href="../de/Compile_on_MacOS.html" title="Compile on MacOS/de">Kompilieren unter MacOS</a> f&uuml;r weitere Informationen.
</p><p>Wenn du unter Windows kompilierst, ziehe es in Betracht, die <a href="#LibPack/de">LibPack</a> zu verwenden, anstatt zu versuchen, die Bibliotheken einzeln zu installieren.
</p><p><span id="Links"></span>
</p>
<h2><span class="mw-headline" id="Verweise">Verweise</span></h2>
<table class="wikitable" style="text-align:left">

<tbody><tr>
<th>Name der Bibliothek</th>
<th>Notwendige Version</th>
<th>Verweis f&uuml;r den Bezug
</th></tr>
<tr>
<td>Python</td>
<td>&gt;= 3.8</td>
<td><a rel="nofollow" class="external free" href="https://python.org/">https://python.org/</a>
</td></tr>
<tr>
<td>Boost</td>
<td>&gt;= 1.33</td>
<td><a rel="nofollow" class="external free" href="https://boost.org/">https://boost.org/</a>
</td></tr>
<tr>
<td>OpenCASCADE</td>
<td>&gt;= 7.3</td>
<td><a rel="nofollow" class="external free" href="https://opencascade.org">https://opencascade.org</a>
</td></tr>
<tr>
<td>Qt</td>
<td>&gt;= 5.4</td>
<td><a rel="nofollow" class="external free" href="https://www.qt.io/">https://www.qt.io/</a>
</td></tr>
<tr>
<td>Shiboken2</td>
<td><i>same as Qt</i></td>
<td><a rel="nofollow" class="external free" href="https://wiki.qt.io/Qt_for_Python/Shiboken">https://wiki.qt.io/Qt_for_Python/Shiboken</a>
</td></tr>
<tr>
<td>PySide2</td>
<td><i>same as Qt</i></td>
<td><a rel="nofollow" class="external free" href="https://wiki.qt.io/Qt_for_Python/Shiboken">https://wiki.qt.io/Qt_for_Python/Shiboken</a>
</td></tr>
<tr>
<td>Coin3D</td>
<td>&gt;= 3.x</td>
<td><a rel="nofollow" class="external free" href="https://github.com/coin3d/coin/coin/wiki/Home">https://github.com/coin3d/coin/coin/wiki/Home</a>
</td></tr>
<tr>
<td>SoQt (deprecated)</td>
<td>&gt;= 1.2</td>
<td><a rel="nofollow" class="external free" href="https://github.com/coin3d/soqt/">https://github.com/coin3d/soqt/</a>
</td></tr>
<tr>
<td>Quarter</td>
<td>&gt;= 1.0</td>
<td><a rel="nofollow" class="external free" href="https://github.com/coin3d/quarter">https://github.com/coin3d/quarter</a>
</td></tr>
<tr>
<td>Pivy</td>
<td>&gt;= 0.6.5</td>
<td><a rel="nofollow" class="external free" href="https://github.com/coin3d/pivy/">https://github.com/coin3d/pivy/</a>
</td></tr>
<tr>
<td>FreeType</td>
<td>&gt;= XXX</td>
<td>XXX
</td></tr>
<tr>
<td>PyCXX</td>
<td>&gt;= XXX</td>
<td>XXX
</td></tr>
<tr>
<td>KDL</td>
<td>&gt;= XXX</td>
<td><a rel="nofollow" class="external free" href="https://orocos.org/wiki/orocos/kdl-wiki.html">https://orocos.org/wiki/orocos/kdl-wiki.html</a>
</td></tr>
<tr>
<td>Point Cloud Library</td>
<td>&gt;= XXX</td>
<td>XXX
</td></tr>
<tr>
<td>Salome SMESH</td>
<td>&gt;= XXX</td>
<td>XXX
</td></tr>
<tr>
<td>VTK</td>
<td>&gt;= 9.1</td>
<td><a rel="nofollow" class="external free" href="https://gitlab.kitware.com/vtk/vtk">https://gitlab.kitware.com/vtk/vtk</a>
</td></tr>
<tr>
<td>Xerces-C++</td>
<td>&gt;= 3.0</td>
<td><a rel="nofollow" class="external free" href="https://xerces.apache.org/xerces-c/">https://xerces.apache.org/xerces-c/</a>
</td></tr>
<tr>
<td>Eigen3</td>
<td>&gt;= 3.0</td>
<td><a rel="nofollow" class="external free" href="https://eigen.tuxfamily.org/index.php?title=Main_Page">https://eigen.tuxfamily.org/index.php?title=Main_Page</a>
</td></tr>
<tr>
<td>Zipios++</td>
<td>&gt;= 0.1.5</td>
<td><a rel="nofollow" class="external free" href="https://snapwebsites.org/project/zipios">https://snapwebsites.org/project/zipios</a>, <a rel="nofollow" class="external free" href="https://github.com/Zipios/Zipios">https://github.com/Zipios/Zipios</a>
</td></tr>
<tr>
<td>Zlib</td>
<td>&gt;= 1.0</td>
<td><a rel="nofollow" class="external free" href="https://zlib.net/">https://zlib.net/</a>, <a rel="nofollow" class="external free" href="https://github.com/madler/zlib">https://github.com/madler/zlib</a>
</td></tr>
<tr>
<td>libarea</td>
<td>&gt;= 0.0.20140514-1</td>
<td><a rel="nofollow" class="external free" href="https://github.com/danielfalck/libarea">https://github.com/danielfalck/libarea</a>
</td></tr>
</tbody></table>
<h2><span class="mw-headline" id="Details">Details</span></h2>
<p><span id="Python"></span>
</p>
<h3><span class="mw-headline" id="Python">Python</span></h3>
<p><b>Version:</b> 3.8 oder h&ouml;her
</p><p><b>Lizenz:</b> Python 3.8 Lizenz
</p>
<div class="warning-box">Python 2 wurde 2019 nicht mehr gebr&auml;uchlich. Die weitere Entwicklung von FreeCAD wird ausschlie&szlig;lich mit Python 3 erfolgen; die Kompatibilit&auml;t mit Python 2 wird nicht getestet, so dass alte Arbeitsbereiche und Makros, die diese Version verwenden, aktualisiert werden m&uuml;ssen, da sie sonst m&ouml;glicherweise nicht mehr funktionieren. Bitte melde dich auf der <a rel="nofollow" class="external text" href="https://forum.freecad.org/">FreeCAD forum</a> wenn Du auf Probleme mit Python 3 st&ouml;sst.</div>
<p>Python ist eine beliebte Allzweck-Skriptsprache, die unter Linux und Open-Source-Software weit verbreitet ist. In FreeCAD wird Python w&auml;hrend der Kompilierung und auch zur Laufzeit auf unterschiedliche Weise verwendet. Es wird verwendet
</p>
<ul><li>um Testskripte zu schreiben, um auf verschiedene Bedingungen, wie z.B. Speicherlecks, zu testen, um die Funktionalit&auml;t der Software nach &Auml;nderungen sicherzustellen, f&uuml;r Pr&uuml;fungen nach Fertigstellung und Testabdeckungstests,</li>
<li>zum Schreiben von <a href="../de/Macros.html" title="Macros/de">Makros</a> und zur Makroaufnahme,</li>
<li>zur Implementierung von Anwendungslogik f&uuml;r Standardpakete,</li>
<li>um Hilfswerkzeuge wie den <a href="../de/Std_AddonMgr.html" title="Std AddonMgr/de">Addon-Manager</a> zu implementieren,</li>
<li>um ganze Arbeitsbereiche wie <a href="../de/Draft_Workbench.html" title="Draft Workbench/de">Draft</a> und <a href="../de/BIM_Workbench.html" title="BIM Workbench/de">BIM</a> zu implementieren,</li>
<li>um Pakete dynamisch zu laden,</li>
<li>die Regeln f&uuml;r Gestaltung umzusetzen (Wissensverarbeitung),</li>
<li>um ausgefallene Internet-Wechselwirkungen wie Arbeitsgruppen und PDM durchzuf&uuml;hren</li></ul>
<p>Unter Linux ist Python normalerweise bereits in deiner Distribution installiert. F&uuml;r Windows kannst Du eine vorkompilierte Bin&auml;rdatei von <a rel="nofollow" class="external text" href="https://python.org/">Python.org</a> beziehen oder <a rel="nofollow" class="external text" href="https://activestate.com/">ActiveState Python</a> verwenden, obwohl es schwieriger ist, die Fehlerdiagnosebibliotheken von letzterer zu bekommen.
</p><p>Python wurde aus verschiedenen Gr&uuml;nden als Skriptsprache f&uuml;r FreeCAD gew&auml;hlt:
</p>
<ul><li>Es ist mehr objektorientiert als Perl und Tcl.</li>
<li>Der Code ist lesbarer als Perl und Visual Basic.</li>
<li>Es ist einfacher in eine andere Anwendung einzubetten, im Gegensatz zu z.B. Java.</li></ul>
<p>Zusammenfassend kann man sagen, dass Python gut dokumentiert ist, und dass es einfach in eine C++ Anwendung eingebettet und erweitert werden kann. Es ist au&szlig;erdem gut getestet und wird von der Open Source Gemeinschaft stark unterst&uuml;tzt. Lies mehr &uuml;ber Python und durchsuche die offizielle Dokumentation unter <a rel="nofollow" class="external text" href="https://python.org">Python.org</a>.
</p>
<h3><span class="mw-headline" id="Boost">Boost</span></h3>
<p><b>Version:</b> 1.33 oder h&ouml;her
</p><p><b>Lizenz:</b> Boost Software Lizenz - Version 1.0
</p><p>Die Boost C++ Bibliotheken sind Sammlungen von Fachkollegen gepr&uuml;ften, Open Source Bibliotheken, die die Funktionalit&auml;t von C++ erweitern. Sie sind f&uuml;r ein breites Spektrum von Anwendungen gedacht und f&uuml;r eine gute Zusammenarbeit mit der C++ Standardbibliothek geeignet. Die Boost Lizenz soll ihre Verwendung sowohl in quelloffenen  als auch in quellgeschlossenen Projekte f&ouml;rdern.
</p><p>Aufgrund ihrer Popularit&auml;t und Stabilit&auml;t wurden viele Boost Bibliotheken f&uuml;r die Einbindung in den C++11 Standard akzeptiert, und weitere sind f&uuml;r die Aufnahme in nachfolgende C++ Standards geplant.
</p><p>Um Effizienz und Flexibilit&auml;t zu gew&auml;hrleisten, macht Boost umfangreichen Gebrauch von Vorlagen. Boost hat umfangreiche Arbeiten und Forschungen zur generischen Programmierung und Metaprogrammierung in C++ durchgef&uuml;hrt. Lies mehr &uuml;ber Boost, indem Du die <a rel="nofollow" class="external text" href="https://boost.org/">Boost Homepage</a> besuchst.
</p><p><span id="OpenCASCADE_Technology"></span>
</p>
<h3><span class="mw-headline" id="OpenCASCADE_Technologie">OpenCASCADE Technologie</span></h3>
<p><b>Version:</b> 6.7 oder h&ouml;her
</p><p><b>Lizenz:</b> Version 6.7.0 und sp&auml;ter unterliegen der <a rel="nofollow" class="external text" href="https://www.opencascade.com/content/licensing">GNU Lesser General Public License (LGPL) Version 2.1 mit zus&auml;tzlicher Ausnahme</a>. Fr&uuml;here Versionen verwenden die <a rel="nofollow" class="external text" href="https://www.opencascade.com/content/occt-public-license">Open CASCADE Technologie &Ouml;ffentliche Lizenz</a>.
</p><p>Die OpenCASCADE Technologie (OCCT) ist ein vollwertiger, professioneller CAD Kernel. Er wurde 1993 entwickelt und urspr&uuml;nglich unter dem Namen CAS.CADE von Matra Datavision in Frankreich f&uuml;r die Anwendungen Strim (Styler) und Euclid Quantum entwickelt. Im Jahr 1999 wurde es als Open Source Software ver&ouml;ffentlicht, und seitdem hei&szlig;t es OpenCASCADE.
</p><p>OCCT ist ein gro&szlig;er und komplexer Satz von C++ Bibliotheken, die die von einer CAD Anwendung ben&ouml;tigte Funktionalit&auml;t bereitstellen:
</p>
<ul><li>Ein kompletter STEP konformer Geometriekern.</li>
<li>Ein topologisches Datenmodell und die ben&ouml;tigten Funktionen zur Arbeit mit Formen (Schneiden, Verschmelzen, Extrudieren und viele andere).</li>
<li>Standardimport- und -exportprozessoren f&uuml;r Dateien wie STEP, IGES, VRML.</li>
<li>Ein 2D und 3D Betrachter mit Auswahlunterst&uuml;tzung.</li>
<li>Eine Dokumenten  und Projektdatenstruktur mit Unterst&uuml;tzung f&uuml;r Speichern und Wiederherstellen, externe Verkn&uuml;pfung von Dokumenten, Neuberechnung der Konstruktionshistorie (parametrische Modellierung) und die M&ouml;glichkeit, neue Datentypen als Erweiterungspaket dynamisch zu laden.</li></ul>
<p>Es gibt zwei Hauptversionen von OpenCASCADE, die in verschiedenen Linux-Distributionen existieren. Eine wird von den urspr&uuml;nglichen Entwicklern vertrieben; sie ist als OCCT bekannt und wird unter den Namen <code>occ</code> oder <code>occt</code> gepackt. Die andere Version ist die "Gemeinschafts Edition", abgek&uuml;rzt OCE, und wird normalerweise unter dem Namen <code>oce</code> gefunden. FreeCAD kann gegen beide Versionen kompilieren, seit 2016 empfiehlt FreeCAD jedoch, gegen die offiziellen OCCT Bibliotheken und nicht gegen die OCE-Bibliotheken zu kompilieren. Der Grund daf&uuml;r ist, dass der Gemeinschafts Edition wichtige Fehlerbehebungen und Funktionen fehlen, die die Benutzung von FreeCAD verbessern.
</p><p>Um mehr zu erfahren, besuche die <a rel="nofollow" class="external text" href="https://opencascade.org">OpenCASCADE Webseite</a>.
</p>
<h3><span class="mw-headline" id="Qt">Qt</span></h3>
<p><b>Version:</b> 4.1 oder h&ouml;her
</p><p><b>Lizenz:</b> GPL v2.0/v3.0 oder kommerziell; ab Version 4.5 auch LPGL v2.1.
</p><p>Qt ist eines der popul&auml;rsten Werkzeugs&auml;tze f&uuml;r grafische Benutzeroberfl&auml;chen (GUI), die in der Open Source Welt verf&uuml;gbar sind. FreeCAD verwendet diesen Werkzeugsatz um die Programmoberfl&auml;che zu zeichnen. Hierf&uuml;r ist die Qt Designer Anwendung sehr n&uuml;tzlich, da sie es Entwicklern erlaubt, die Dialoge und Fenster schnell zu zeichnen, sie als XML Ressource Dateien zu exportieren und diese Schnittstellen zur Laufzeit zu laden.
</p><p>Weitere Informationen zu den Qt-Bibliotheken und deren Programmierdokumentation findest Du unter <a rel="nofollow" class="external text" href="https://doc.qt.io/?hsCtaTracking=f641fd1a-772b-4957-964b-dad954b8d702%7C46c97dac-f1f6-49b3-ae46-8070fc35ea13">Qt-Dokumentation</a>.
</p><p><span id="Shiboken2_and_Pyside2"></span>
</p>
<h4><span class="mw-headline" id="Shiboken2_und_Pyside2">Shiboken2 und Pyside2</span></h4>
<p>Shiboken ist der Python-Bindungsgenerator, den Qt f&uuml;r Python zur Erstellung des PySide-Moduls verwendet, d.h. es ist das System, das verwendet wird, um die Qt C++ API der Sprache Python auszusetzen.
</p><p>Die urspr&uuml;nglichen Shiboken  und PySide Pakete waren f&uuml;r die Verwendung mit Python 2 und Qt4 gedacht; da diese beiden Versionen 2019 als veraltet gelten, verwende bitte Shiboken2 und PySide2, die mit Python 3 und Qt5 funktionieren. Die Neuentwicklung von FreeCAD erfolgt mit Python 3 und Qt5, daher ist die Kompatibilit&auml;t mit Python 2 und Qt4 nach FreeCAD 0.18 nicht mehr gew&auml;hrleistet.
</p><p>Lies mehr &uuml;ber Shiboken und Pyside auf <a rel="nofollow" class="external text" href="https://wiki.qt.io/Qt_for_Python/Shiboken">Qt f&uuml;r Python</a>.
</p>
<h3><span class="mw-headline" id="Coin3D">Coin3D</span></h3>
<p><b>Version:</b> 3.0 oder h&ouml;her
</p><p><b>Lizenz:</b> BSD 3-Klausel Lizenz
</p><p>Coin3D ist eine hochgradige 3D Grafikbibliothek mit einer C++ Programmierschnittstelle. Sie verwendet szenegraphische Datenstrukturen, um Echtzeit Grafiken f&uuml;r alle Arten von wissenschaftlichen und technischen Visualisierungsanwendungen zu erstellen.
</p><p>Coin3D basiert auf dem Industriestandard OpenGL Sofortmodus Wiedergabe Bibliothek und f&uuml;gt Abstraktionen f&uuml;r &uuml;bergeordnete Grundelemente hinzu, bietet 3D Interaktivit&auml;t und enth&auml;lt viele komplexe Optimierungsfunktionen f&uuml;r schnelle Wiedergabe, die f&uuml;r den Anwendungsprogrammierer transparent sind.
</p><p>Coin3D ist kompatibel mit der Open Inventor 2.1 API von SGI. Diese API hat sich zur De-facto Standard Grafikschnittstelle f&uuml;r die 3D Visualisierung in der wissenschaftlichen und technischen Gemeinschaft entwickelt. Sie hat sich seit dem Jahr 2000 als ein wichtiger Baustein in tausenden von Ingenieuranwendungen weltweit bew&auml;hrt.
</p><p>Coin3D (Open Inventor) wird als 3D Betrachter in FreeCAD verwendet, da der OpenCASCADE Betrachter (AIS und Graphics3D) insbesondere bei gro&szlig;fl&auml;chigem Ingenieurwissenschaftlichen Wiedergabe, Einschr&auml;nkungen und Leistungsengp&auml;sse aufweist; andere Dinge wie Texturen oder volumetrische Wiedergabe werden vom OpenCASCADE Betrachter nicht vollst&auml;ndig unterst&uuml;tzt.
</p><p>Coin3D ist &uuml;ber eine Vielzahl von Plattformen anwendbar: UNIX, Linux, BSD, macOS und Microsoft Windows Betriebssysteme. Um mehr &uuml;ber diese Bibliothek zu lesen, besuche <a rel="nofollow" class="external text" href="https://github.com/coin3d/coin">Coin3D homepage</a>.
</p><p><span id="SoQt_(deprecated)"></span>
</p>
<h4><span id="SoQt_.28veraltet.29"></span><span class="mw-headline" id="SoQt_(veraltet)">SoQt (veraltet)</span></h4>
<p><b>Version:</b> 1.2.0 oder h&ouml;her
</p><p><b>Lizenz:</b> BSD 3-Klausel Lizenz
</p><p>SoQt ist die Coin3D (Open Inventor) Anbindung an den Qt GUI Werkzeugkasten.
</p><p>SoQt wird in FreeCAD nicht mehr verwendet, es wurde durch Quarter ersetzt, welches eine neuere Qt Bindung ist.
</p><p><span id="Quarter"></span>
</p>
<h4><span class="mw-headline" id="Quarter">Quarter</span></h4>
<p><b>Version:</b> 1.0 oder h&ouml;her
</p><p><b>Lizenz:</b> BSD 3-Klausel Lizenz 
</p><p>Quarter ist eine neuere Coin3D Bindung an den Qt Werkzeugkasten. Eine Version davon ist im Quellcode von FreeCAD enthalten, so dass es zusammen mit diesem kompiliert wird.
</p>
<h4><span class="mw-headline" id="Pivy">Pivy</span></h4>
<p><b>Version:</b> 0.6.3 oder h&ouml;her
</p><p><b>Lizenz:</b> BSD 3-Klausel Lizenz 
</p><p><a href="../de/Pivy.html" title="Pivy/de">Pivy</a> ist eine Bibliothek, die die Coin3d-Bibliothek zur Verwendung in <a href="../de/Python.html" title="Python/de">Python</a> umh&uuml;llt. Sie wird nicht ben&ouml;tigt, um FreeCAD zu bauen oder zu starten, aber sie wird als Laufzeit-Abh&auml;ngigkeit vom Arbeitsbereich <a href="../de/Draft_Workbench.html" title="Draft Workbench/de">Draft</a> und von anderen Arbeitsbereichen, die sie intern verwenden, wie  <a href="../de/BIM_Workbench.html" title="BIM Workbench/de">BIM</a>, ben&ouml;tigt.
</p><p>Wenn du diese Arbeitsbereiche nicht benutzen willst, brauchst du Pivy nicht.
</p>
<h3><span class="mw-headline" id="Ply">Ply</span></h3>
<p><b>Version:</b> 3.11 oder h&ouml;her
</p><p><b>Lizenz:</b> BSD 3-Klausel Lizenz
</p><p>Ply ist der Python-Lex-Yacc Parser. Er wird als Laufzeitabh&auml;ngigkeit von der <a href="../de/OpenSCAD_Workbench.html" title="OpenSCAD Workbench/de">OpenSCAD Arbeitsbereich</a> verwendet. Wenn du diesen Arbeitsbereich nicht verwendest, ben&ouml;tigst du dieses Paket m&ouml;glicherweise nicht.
</p><p>F&uuml;r weitere Informationen siehe <a rel="nofollow" class="external text" href="https://www.dabeaz.com/ply/">Ply homepage</a>.
</p>
<h3><span id="Xerces-C.2B.2B"></span><span class="mw-headline" id="Xerces-C++">Xerces-C++</span></h3>
<p><b>Version:</b> 3.0 oder h&ouml;her
</p><p><b>Lizenz:</b> Apache Software Lizenz Version 2.0
</p><p>Xerces-C++ ist ein validierender XML Parser, der in einer portablen Untermenge von C++ geschrieben ist. Xerces-C++ macht es einfach, deiner Anwendung die M&ouml;glichkeit zu geben, XML Daten zu lesen und zu schreiben. Eine gemeinsame Bibliothek wird f&uuml;r das Parsen, Generieren, Manipulieren und Validieren von XML Dokumenten bereitgestellt. Xerces-C++ ist konform mit der XML 1.0 Empfehlung und den damit verbundenen Standards.
</p><p>The parser is used for saving and restoring parameters in FreeCAD. For more information see <a rel="nofollow" class="external text" href="https://xerces.apache.org/xerces-c/">Xerces-C++ homepage</a>.
</p>
<h3><span class="mw-headline" id="Eigen3">Eigen3</span></h3>
<p><b>Version:</b> 3.0 oder h&ouml;her
</p><p><b>Lizenz:</b> Ab der Version 3.1.1 ist sie unter der <a rel="nofollow" class="external text" href="https://mozilla.org/en-US/MPL/2.0">Mozilla Public License 2.0</a> lizenziert. Fr&uuml;here Versionen waren unter der <a rel="nofollow" class="external text" href="https://www.gnu.org/licenses/lgpl-3.0.en.html">GNU Lesser General Public License 3</a> lizenziert.
</p><p>Eigen ist eine C++ Vorlagenbibliothek f&uuml;r lineare Algebra: Matrizen, Vektoren, numerische L&ouml;ser und verwandte Algorithmen.
</p><p>Wenn Du nur Eigen verwenden m&ouml;chtest, kannst Du die Kopfzeilen Dateien sofort verwenden. Es gibt keine bin&auml;re Bibliothek zum Verkn&uuml;pfen und keine konfigurierte Kopfzeilen Datei. Eigen ist eine reine Vorlagen Bibliothek, die in den Kopfzeilen definiert ist.
</p><p>Eigen wird in FreeCAD f&uuml;r viele Vektoroperationen im 3D Raum verwendet. Um mehr zu erfahren, besuche <a rel="nofollow" class="external text" href="https://eigen.tuxfamily.org/index.php?title=Main_Page">Eigen Homepage</a>.
</p>
<h3><span id="Zipios.2B.2B"></span><span class="mw-headline" id="Zipios++">Zipios++</span></h3>
<p><b>Version:</b> 0.1.5 oder h&ouml;her
</p><p><b>Lizenz:</b> GNU Lesser General Public License 2.1
</p><p>Zipios++ ist eine C++ Bibliothek zum Lesen und Schreiben von <code>.zip</code> Dateien. Der Zugriff auf einzelne Eintr&auml;ge erfolgt &uuml;ber Standard C++ iostreams. Ein einfaches, schreibgesch&uuml;tztes virtuelles Dateisystem, das regul&auml;re Verzeichnisse und <code>.zip</code> Dateien einh&auml;ngt, wird ebenfalls zur Verf&uuml;gung gestellt. Die Struktur und die &ouml;ffentliche Schnittstelle von Zipios++ basiert lose auf dem <code>java.util.zip</code> Paket von Java.
</p><p>FreeCADs urspr&uuml;ngliches Dateiformat <code>.FCstd</code> ist in Wirklichkeit eine <code>.zip</code> Datei, die andere Datentypen darin speichert und komprimiert, wie z.B. BREP  und XML Dateien. Daher wird Zipios++ zum Speichern und &Ouml;ffnen von komprimierten Archiven, einschlie&szlig;lich FreeCAD Dateien, verwendet.
</p><p>Eine Kopie von Zipios++ ist im Quellcode von FreeCAD enthalten, so dass es zusammen mit diesem kompiliert wird. Wenn Du eine externe Zipios++-Bibliothek verwenden willst, die von deinem Betriebssystem zur Verf&uuml;gung gestellt wird, kannst Du <code>-DFREECAD_USE_EXTERNAL_ZIPIOS=ON</code> mit <code>cmake</code> setzen.
</p><p>Zipios++ verwendet die Zlib Bibliothek, um die eigentliche Dekomprimierung von Dateien durchzuf&uuml;hren.
</p>
<h4><span class="mw-headline" id="Zlib">Zlib</span></h4>
<p><b>Version:</b> 1.0 oder h&ouml;her
</p><p><b>Lizenz:</b> zlib lizenz
</p><p>Zlib ist als eine freie, verlustfreie, universell einsetzbare Datenkompressionsbibliothek f&uuml;r die Verwendung auf jeder Computer Hardware und jedem Betriebssystem konzipiert. Sie implementiert den <code>DEFLATE</code> Kompressionsalgorithmus, der &uuml;blicherweise in <code>.zip</code> und <code>.gzip</code> Dateien verwendet wird.
</p><p>A copy of this library is included in the source code of FreeCAD so it is compiled together with it.
</p>
<h3><span class="mw-headline" id="libarea">libarea</span></h3>
<p><b>Version:</b> 0.0.20140514-1 oder h&ouml;her
</p><p><b>Lizenz:</b> BSD 3-Klausel Lizenz
</p><p>Libarea ist eine Software Bibliothek zur Berechnung von Profil- und Taschenoperationen, die in der computerunterst&uuml;tzten Fertigung (CAM) eingesetzt werden. Sie wurde von Dan Heeks f&uuml;r sein HeeksCNC Projekt erstellt.
</p><p>Eine Kopie der Bibliothek ist im Quellcode des Arbeitsbereichs <a href="../CAM_Workbench.html" title="CAM Workbench">CAM</a> enthalten, so dass sie zusammen mit diesem kompiliert wird.
</p><p><span id="LibPack"></span>
</p>
<h3><span class="mw-headline" id="LibPack">LibPack</span></h3>
<p>LibPack ist ein praktisches Paket mit den gesammelten Bau-Abh&auml;ngigkeiten von FreeCAD. Es wird nur ben&ouml;tigt, wenn Du FreeCAD unter Windows mit Visual Studio 2015 und h&ouml;her kompilierst. Du kannst das aktuelle LibPack auf der <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/releases">Releases-Page</a> finden.
</p><p>Wenn du unter Linux arbeitest, brauchst du das LibPack nicht, da du die Abh&auml;ngigkeiten aus den Repositorien deiner Distribution beziehen kannst, wie auf der <a href="../de/Compile_on_Linux.html" title="Compile on Linux/de">Kompilieren unter Linux</a>-Seite erw&auml;hnt.
</p>
<h3><span class="mw-headline" id="FreeCAD_12.1.2">FreeCAD 12.1.2</span></h3>
<p>Siehe die Ank&uuml;ndigung im Forum: <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?f=4&amp;t=35789">Neue Libpacks f&uuml;r Windows mit Qt5.12, OCC7.3 und Python 3.6 von apeltauer</a>
</p><p>Siehe die Ank&uuml;ndigung im Forum: <a rel="nofollow" class="external text" href="https://forum.freecadweb.org/viewtopic.php?f=4&amp;t=35789">Neue Libpacks f&uuml;r Windows mit Qt5.12, OCC7.3 und Python 3.6 von apeltauer</a> Es enth&auml;lt unter anderem Boost 1.67, Coin3D 4.0.0a, Eigen3, Open CASCADE Technologie 7.3.0, Python 3.6.8, PySide2, Qt 5.12.1, Salome SMESH, Shiboken2, vtk7, Xerces-C, Zipios++, zlib 1.2.11
</p><p><br>
</p>
<div class="docnav">
    <div><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-left.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span> <a href="../de/Compiling_(Speeding_up).html" title="Compiling (Speeding up)/de">Kompilieren (Beschleunigen)</a></div>
    <div><a href="../de/Third_Party_Tools.html" title="Third Party Tools/de">Drittanbieterwerkzeuge</a>
 <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-right.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span></div>
    <div><a href="../de/Online_Help_Toc.html" title="Online Help Toc/de">Index</a> <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Online_Help_Toc.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span></div>
</div>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><span typeof="mw:File"><a href="../index.php?title=User_hub.png&amp;filetimestamp=20190221145008&amp;.html" class="mw-file-description"><img src="../File/User_hub.png" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../de/User_hub.html" title="User hub/de">Anwenderdokumentation</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b><a href="../de/Getting_started.html" title="Getting started/de">Erste Schritte</a></b></li>
<li><b>Installation:</b> <a href="../de/Download.html" title="Download/de">Herunterladen</a>, <a href="../de/Installing_on_Windows.html" title="Installing on Windows/de">Windows</a>, <a href="../de/Installing_on_Linux.html" title="Installing on Linux/de">Linux</a>, <a href="../de/Installing_on_Mac.html" title="Installing on Mac/de">Mac</a>, <a href="../de/Installing_additional_components.html" title="Installing additional components/de">Zus&auml;tzliche Komponenten</a>, <a href="../de/Compile_on_Docker.html" title="Compile on Docker/de">Docker</a>, <a href="../de/AppImage.html" title="AppImage/de">AppImage</a>, <a href="../de/Ubuntu_Snap.html" title="Ubuntu Snap/de">Ubuntu Snap</a></li>
<li><b>Grundlagen:</b> <a href="../de/About_FreeCAD.html" title="About FreeCAD/de">&Uuml;ber FreeCAD</a>, <a href="../de/Interface.html" title="Interface/de">Graphische Oberfl&auml;che</a>, <a href="../de/Mouse_navigation.html" title="Mouse navigation/de">Mausbedienung</a>, <a href="../de/Selection_methods.html" title="Selection methods/de">Auswahlmethoden</a>, <a href="../de/Object_name.html" title="Object name/de">Objektname</a>, <a href="../de/Preferences_Editor.html" title="Preferences Editor/de">Voreinstellungseditor</a>, <a href="../de/Workbenches.html" title="Workbenches/de">Arbeitsbereiche</a>, <a href="../de/Document_structure.html" title="Document structure/de">Dokumentstruktur</a>, <a href="../de/Property.html" title="Property/de">Objekteigenschaften</a>, <a href="../de/Help_FreeCAD.html" title="Help FreeCAD/de">FreeCAD unterst&uuml;tzen</a>, <a href="../de/Donate.html" title="Donate/de">Spenden</a></li></ul>
<hr>
<ul><li><b>Hilfe:</b> <a href="../de/Tutorials.html" title="Tutorials/de">Anleitungen</a>, <a href="../de/Video_tutorials.html" title="Video tutorials/de">Videoanleitungen</a></li>
<li><b><a href="../de/Workbenches.html" title="Workbenches/de">Arbeitsbereiche</a>:</b> <a href="../de/Std_Base.html" title="Std Base/de">Std Base</a>, <a href="../de/Arch_Workbench.html" title="Arch Workbench/de">Arch</a>, <a href="../de/Assembly_Workbench.html" title="Assembly Workbench/de">Assembly</a>, <a href="../de/BIM_Workbench.html" title="BIM Workbench/de">BIM</a>, <a href="../de/CAM_Workbench.html" title="CAM Workbench/de">CAM</a>, <a href="../de/Draft_Workbench.html" title="Draft Workbench/de">Draft</a>, <a href="../de/FEM_Workbench.html" title="FEM Workbench/de">FEM</a>, <a href="../de/Inspection_Workbench.html" title="Inspection Workbench/de">Inspection</a>, <a href="../de/Material_Workbench.html" title="Material Workbench/de">Material</a>, <a href="../de/Mesh_Workbench.html" title="Mesh Workbench/de">Mesh</a>, <a href="../de/OpenSCAD_Workbench.html" title="OpenSCAD Workbench/de">OpenSCAD</a>, <a href="../de/Part_Workbench.html" title="Part Workbench/de">Part</a>, <a href="../de/PartDesign_Workbench.html" title="PartDesign Workbench/de">PartDesign</a>, <a href="../de/Points_Workbench.html" title="Points Workbench/de">Points</a>, <a href="../de/Reverse_Engineering_Workbench.html" title="Reverse Engineering Workbench/de">Reverse Engineering</a>, <a href="../de/Robot_Workbench.html" title="Robot Workbench/de">Robot</a>, <a href="../de/Sketcher_Workbench.html" title="Sketcher Workbench/de">Sketcher</a>, <a href="../de/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/de">Spreadsheet</a>, <a href="../de/Surface_Workbench.html" title="Surface Workbench/de">Surface</a>, <a href="../de/TechDraw_Workbench.html" title="TechDraw Workbench/de">TechDraw</a>, <a href="../de/Testing.html" title="Testing/de">Test Framework</a></li></ul>
<hr>
<ul><li><b><a href="../de/Addon.html" title="Addon/de">Addon</a>:</b> <a href="../de/Std_AddonMgr.html" title="Std AddonMgr/de">Addon-Manager</a>, <a href="../de/External_workbenches.html" title="External workbenches/de">Externe Arbeitsbereiche</a>, <a href="../de/Scripting_and_macros.html" title="Scripting and macros/de">Skripten und Makros</a></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="../de/User_hub.html" title="User hub/de">Anwenderzentrum</a>, <a href="../de/Power_users_hub.html" title="Power users hub/de">Hauptanwenderzentrum</a>, <a href="../de/Developer_hub.html" title="Developer hub/de">Entwicklerzentrum</a></li></ul></div>
    </div></div>
<div style="clear:both"></div>
<!-- 
NewPP limit report
Cached time: 20251229094331
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.060 seconds
Real time usage: 0.085 seconds
Preprocessor visited node count: 272/1000000
Post&#8208;expand include size: 8149/2097152 bytes
Template argument size: 2977/2097152 bytes
Highest expansion depth: 5/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 2429/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   12.861      1 -total
 20.25%    2.604      1 Template:Userdocnavi/de
 16.94%    2.179      2 Template:Docnav/de
 14.62%    1.880      1 Template:TOCright
 11.82%    1.520     16 Template:Incode
  9.60%    1.235      1 Template:VeryImportantMessage
  8.33%    1.072      2 Template:Emphasis
  7.83%    1.007      1 Template:Navigation_menu_2
  7.35%    0.945      1 Template:Clear
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:56427-0!canonical and timestamp 20251229094331 and revision id 1722595. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>