<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Wikihouse porting tutorial/de</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="de" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Wikihouse+porting+tutorial&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--high" lang="de" dir="ltr">Deutsch</span></li>
<li><a href="../Wikihouse_porting_tutorial.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Wikihouse porting tutorial (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/Wikihouse_porting_tutorial.html" class="mw-pt-progress mw-pt-progress--low" title="Wikihouse porting tutorial/es (5% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/Wikihouse_porting_tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Tutoriel d'importation d'une Wikihouse de SketchUp (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/Wikihouse_porting_tutorial.html" class="mw-pt-progress mw-pt-progress--med" title="Tutorial Wikihouse portabile (50% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Wikihouse_porting_tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Poradnik przenoszenia Wikihouse (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../ro/Wikihouse_porting_tutorial.html" class="mw-pt-progress mw-pt-progress--med" title="Wikihouse porting tutorial (50% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><a href="../ru/Wikihouse_porting_tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="&#1056;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086; &#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1102; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; Wikihouse &#1074; FreeCAD (100% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li></ul></div>
<table class="fcinfobox wikitable ct" style="width: 230px; float: right; margin-left: 1em">
<tbody><tr>
<td class="ctTitle" style="font-weight: bold; font-size: 125%;"><span typeof="mw:File"><span><img src="../File/Freecad.svg" decoding="async" width="32" height="32" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span> Anleitung
</td></tr>
<tr>
<th class="ctOdd">Thema
</th></tr>
<tr>
<td class="ctEven">Tutorium Wikihouse-Migration
</td></tr>
<tr>
<th class="ctOdd">Niveau
</th></tr>
<tr>
<td class="ctEven">Fortgeschrittene/K&ouml;nner
</td></tr>
<tr>
<th class="ctOdd">Bearbeitungszeit
</th></tr>
<tr>
<td class="ctEven">60 Minuten
</td></tr>
<tr>
<th class="ctOdd">Autoren
</th></tr>
<tr>
<td class="ctEven">
</td></tr>
<tr>
<th class="ctOdd">FreeCAD-Version
</th></tr>
<tr>
<td class="ctEven">
</td></tr>
<tr>
<th class="ctOdd">Beispieldateien
</th></tr>
<tr>
<td class="ctEven">
</td></tr>
<tr>
<th class="ctOdd">Siehe auch
</th></tr>
<tr>
<td class="ctEven"><i>None</i>
</td></tr>
<tr>
<td class="ctToc"><br><meta property="mw:PageProp/toc">
</td></tr></tbody></table>
<p><span id="Introduction"></span>
</p>
<h2><span class="mw-headline" id="Einleitung">Einleitung</span></h2>
<p>Diese Anleitung zeigt dir, wie du <a rel="nofollow" class="external text" href="https://sketchup.com/">SketchUp</a>-Dateien, die vom <a rel="nofollow" class="external text" href="https://wikihouse.cc/">Wikihouse</a>-Projekt verwendet werden, in FreeCAD konvertieren kannst, indem du die <a href="../de/Arch_Panel.html" title="Arch Panel/de">Arch Tafel</a>-Werkzeuge in FreeCAD verwendest. Das Ergebnis ist eine vollst&auml;ndige Kopie der urspr&uuml;nglichen SketchUp-Datei, mit der Ausnahme, dass sie vollst&auml;ndig parametrisch geworden ist. Der Grad der Parametrisierung der endg&uuml;ltigen Datei h&auml;ngt von der Arbeit ab, die du daf&uuml;r aufwendest, wie weiter unten erl&auml;utert wird. Es ist jedoch durchaus m&ouml;glich, die Dinge Schritt f&uuml;r Schritt zu erledigen und die Wikihouse-Datei ziemlich schnell wieder aufzubauen und die langwierigere Konvertierung von Basisprofilen in Skizzen f&uuml;r sp&auml;ter zu &uuml;berlassen.
</p><p>Dieses Tutorial setzt mittlere Kenntnisse in FreeCAD voraus, d.h. du bist in der Lage, dich zwischen den verschiedenen Arbeitsbereichen und Werkzeugen zurechtzufinden, kannst bereits einfache Objekte modellieren und bist vor allem mit <a href="../de/Draft_Move.html" title="Draft Move/de">Draft Bewegen</a> und <a href="../de/Draft_Rotate.html" title="Draft Rotate/de">Draft Drehen</a> vertraut. Es werden haupts&auml;chlich <a href="../de/Draft_Workbench.html" title="Draft Workbench/de">Draft-</a> und <a href="../de/Arch_Workbench.html" title="Arch Workbench/de">Arch-</a> Werkzeuge verwendet, aber f&uuml;r die Umwandlung der Grundprofile in Skizzen werden Kenntnisse des Arbeitsbereiches <a href="../de/Sketcher_Workbench.html" title="Sketcher Workbench/de">Sketcher</a> erforderlich sein.
</p><p>Da das Wikihouse-Projekt von Natur aus offen ist, sind die Dateien leicht auf der Projektwebsite zu finden, aber auch im <a rel="nofollow" class="external text" href="https://3dwarehouse.sketchup.com/search.html?q=wikihouse&amp;backendClass=both">SketchUp 3D Warehouse</a> oder in den <a rel="nofollow" class="external text" href="https://github.com/wikihouseproject">GitHub-Repositorys</a> des Projekts. Das vom Projekt bevorzugte Format ist Sketchup, daher sind die meisten Dateien in diesem Format verf&uuml;gbar.
</p><p>Im folgenden Tutorial haben wir die Datei <a rel="nofollow" class="external text" href="https://github.com/wikihouseproject/Microhouse/blob/master/microhouse_0.5_chassis.skp">Chassis</a> aus dem Wikihouse-Teilprojekt Microhouse verwendet.
</p><p><span id="Preparing_the_Sketchup_file"></span>
</p>
<h2><span class="mw-headline" id="Vorbereiten_der_Sketchup_Datei">Vorbereiten der Sketchup Datei</span></h2>
<p>Als Erstes muss die Datei in SketchUp ge&ouml;ffnet werden und alles gel&ouml;scht werden, was nicht exportiert werden soll. Wir exportieren nur einen Teil des Microhouse, daher muss alles andere gel&ouml;scht werden.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_05.jpg&amp;filetimestamp=20161217190528&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_05.jpg" decoding="async" width="1380" height="920" class="mw-file-element" data-file-width="1380" data-file-height="920"></a></span>
</p><p>Die Wikihouse-Elemente in SketchUp werden auf eine bestimmte Weise hergestellt: Durch das Zusammenf&uuml;gen kleiner "Teile" werden die verschiedenen Komponenten erstellt:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_06.jpg&amp;filetimestamp=20161217190817&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_06.jpg" decoding="async" width="1418" height="907" class="mw-file-element" data-file-width="1418" data-file-height="907"></a></span>
</p><p>So werden wir in FreeCAD nicht vorgehen. Da eine der leistungsst&auml;rksten Funktionen von FreeCAD die <a href="../de/Sketcher_Workbench.html" title="Sketcher Workbench/de">beschr&auml;nkten Skizzen</a> sind, sollten wir diese besser nutzen und alle unsere Wikihouse-Elemente auf Skizzen basieren. Auf diese Weise kann jede &Auml;nderung im  <a href="../de/Sketcher_Workbench.html" title="Sketcher Workbench/de">Arbeitsbereich Sketcher</a> vorgenommen werden, was wesentlich komfortabler ist.
</p><p>Um unsere SketchUp-Objekte in FreeCAD-Skizzen umzuwandeln, die dann zur Erstellung von <a href="../de/Arch_Panel.html" title="Arch Panel/de">Arch Platte</a>-Objekten verwendet werden k&ouml;nnen, m&uuml;ssen wir aus jedem Wikihouse-Bauteil eine flache Fl&auml;che extrahieren. Die Dicke wird sp&auml;ter in FreeCAD direkt in den Arch Panel-Eigenschaften wieder hinzugef&uuml;gt. Auf diese Weise bleibt es auch parametrisch. Um jede Wikihouse-Komponente in eine einzelne, flache Fl&auml;che umzuwandeln, &ouml;ffnet man jede Komponente durch Doppelklick, w&auml;hlt dann jede Unterkomponente aus und klickt mit der rechten Maustaste &rarr; Explodieren, bis alle Unterkomponenten explodiert sind und die Komponente nur noch aus Fl&auml;chen und Kanten besteht:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_08.jpg&amp;filetimestamp=20161217192027&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_08.jpg" decoding="async" width="1398" height="927" class="mw-file-element" data-file-width="1398" data-file-height="927"></a></span>
</p><p>Sobald dies erledigt ist, w&auml;hlt man alles in der Komponente aus und hebt die Auswahl jeder Frontfl&auml;che Ihrer Komponente durch Umschalt + Doppelklick auf. Darauf achten, dass man doppelt klickt und nicht einfach nur einmal, da man sonst nur die Fl&auml;che und nicht deren Randkanten (die wir ebenfalls behalten m&uuml;ssen) abw&auml;hlt. Danach haben wir alles abgew&auml;hlt, was wir behalten m&ouml;chten, sodass wir nur noch die L&ouml;schtaste dr&uuml;cken m&uuml;ssen. Jetzt besteht unsere Komponente nur noch aus einer gro&szlig;en flachen Fl&auml;che.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_07.jpg&amp;filetimestamp=20161217192011&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_07.jpg" decoding="async" width="1410" height="899" class="mw-file-element" data-file-width="1410" data-file-height="899"></a></span>
</p><p>Dies wiederholt man f&uuml;r jede Komponente. Da viele davon doppelt vorhanden sind, ist dies keine so gro&szlig;e Aufgabe, wie es zun&auml;chst scheint. Au&szlig;erdem erh&auml;lt man durch diesen Schritt ein gutes Verst&auml;ndnis daf&uuml;r, wie das Wikihouse-System funktioniert, falls man damit noch nicht vertraut ist.
</p><p>Wenn unser Haus vollst&auml;ndig aus flachen Elementen besteht, k&ouml;nnen wir alles ausw&auml;hlen und in eine .dae-Datei exportieren, die wir dann in FreeCAD importieren k&ouml;nnen. Man achtet darauf, die Option "Alle triangulieren" zu aktivieren.
</p><p><span id="Solving_the_double_faces_bug"></span>
</p>
<h2><span id="L.C3.B6sung_des_Doppelfl.C3.A4chen_Fehlers"></span><span class="mw-headline" id="L&ouml;sung_des_Doppelfl&auml;chen_Fehlers">L&ouml;sung des Doppelfl&auml;chen Fehlers</span></h2>
<p>Es gibt ein unangenehmes Problem, f&uuml;r das ich noch keine bessere L&ouml;sung gefunden habe: Bei aus SketchUp in das .dae-Format exportierten Netzen werden die Fl&auml;chen dupliziert. Aus jeder Fl&auml;che werden tats&auml;chlich zwei Fl&auml;chen. Die einfachste L&ouml;sung, die ich bisher gefunden habe, besteht darin, die exportierte Datei in <a rel="nofollow" class="external text" href="https://blender.org">Blender</a> zu &ouml;ffnen und zu reparieren:
</p>
<ol><li>Die DAE-Datei in Blender &ouml;ffnen (<b>Datei &rarr; Importieren &rarr; Collada</b>).</li>
<li>Eine Komponente ausw&auml;hlen und <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">TAB</span> dr&uuml;cken, um den Bearbeitungsmodus aufzurufen.</li>
<li><span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">A</span> dr&uuml;cken, um die Auswahl aufzuheben, und dann erneut <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">A</span> dr&uuml;cken, um alles auszuw&auml;hlen.</li>
<li><span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">W</span> dr&uuml;cken &rarr; Duplikate entfernen.</li>
<li><span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">TAB</span> dr&uuml;cken, um den Bearbeitungsmodus zu verlassen.</li>
<li>Diesen Vorgang f&uuml;r alle Komponenten wiederholen.</li>
<li>Eine neue <a href="../de/Arch_DAE.html" title="Arch DAE/de">DAE</a>-Datei (<b>Datei &rarr; Exportieren &rarr; Collada</b>) speichern.</li></ol>
<p>Normalerweise sollte der oben beschriebene Vorgang den Ma&szlig;stab nicht ver&auml;ndern, aber es ist immer ratsam, mit den Messwerkzeugen zu &uuml;berpr&uuml;fen, ob die importierte Geometrie den richtigen Ma&szlig;stab hat, bevor man fortf&auml;hrt. Gegebenenfalls muss man die Collada-Exporteinstellungen von Blender anpassen.
</p><p><span id="Importing_and_converting_to_wires"></span>
</p>
<h2><span id="Importieren_und_Umwandeln_in_Dr.C3.A4hte"></span><span class="mw-headline" id="Importieren_und_Umwandeln_in_Dr&auml;hte">Importieren und Umwandeln in Dr&auml;hte</span></h2>
<p>Man beachte, dass es m&ouml;glicherweise einfacher ist, schrittweise vorzugehen und Objekte gruppenweise zu bearbeiten und zu exportieren, wie wir es unten getan haben. Wir haben nur die erste Ebene exportiert, die aus gelben Elementen in SketchUp besteht. Diese Elemente werden als <a href="../de/Mesh_Workbench.html" title="Mesh Workbench/de">Mesh</a>-Objekte in FreeCAD importiert:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_09.jpg&amp;filetimestamp=20161217193633&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_09.jpg" decoding="async" width="1569" height="893" class="mw-file-element" data-file-width="1569" data-file-height="893"></a></span>
</p><p>Der n&auml;chste Schritt besteht darin, aus jedem unserer Netze Linienz&uuml;ge zu erstellen. Dazu gibt es ein praktisches Makro namens <a href="../de/Macro_Extract_Wires_from_Mesh.html" title="Macro Extract Wires from Mesh/de">Makro Linienz&uuml;ge aus Netzen extrahieren</a>, das genau das tut. Man installiert es (Anweisungen findet man auf der Seite <a href="../de/Macros.html" title="Macros/de">Makros</a>), und konvertiert dann nacheinander (man kann auch alle auf einmal konvertieren, aber dieses Makro ben&ouml;tigt etwas Zeit) alle unsere Netze in Drahtmodelle:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_10.jpg&amp;filetimestamp=20161217202027&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_10.jpg" decoding="async" width="1348" height="875" class="mw-file-element" data-file-width="1348" data-file-height="875"></a></span>
</p><p>Wir k&ouml;nnten nun bereits <a href="../de/Arch_Panel.html" title="Arch Panel/de">Arch Platte</a>-Objekte aus jedem dieser drahtartigen Objekte erstellen, indem wir sie einfach ausw&auml;hlen und auf die Schaltfl&auml;che <a href="../de/Arch_Panel.html" title="Arch Panel/de">Arch Platte</a> klicken. Allerdings w&auml;re ihre Grundform nicht parametrisch. Wir haben nun mehrere M&ouml;glichkeiten: Wir k&ouml;nnten jede Komponente mit dem Werkzeug <a href="../de/Draft_Draft2Sketch.html" title="Draft Draft2Sketch/de">Draft ZeichnungZuSkizze</a> in eine Skizze umwandeln, aber das w&auml;ren ziemlich umfangreiche Skizzen, die auf einem langsamen Rechner m&ouml;glicherweise nicht sehr gut zu handhaben w&auml;ren, oder wir k&ouml;nnten jeden einzelnen Linienzug (die Umrisse und jedes Loch) der Skizze in eine separate Skizze umwandeln. Dies w&uuml;rde es uns beispielsweise erm&ouml;glichen, ein typisches Loch wiederzuverwenden, es nur einmal zu erstellen und es dann mit <a href="../de/Draft_Clone.html" title="Draft Clone/de">Draft Klonen</a> zu duplizieren, um die anderen L&ouml;cher zu erstellen. Auf diese Weise m&uuml;sste man nur eines bearbeiten, um alle zu bearbeiten.
</p><p>Das <a href="../de/Macro_Extract_Wires_from_Mesh.html" title="Macro Extract Wires from Mesh/de">Makro Linienz&uuml;ge aus Netzen extrahieren</a> findet manchmal auch keine geschlossenen Linienz&uuml;ge innerhalb eines Netzes, wodurch keine korrekten Platten erzeugt werden. Eine einfache Vorgehensweise zum Neuzusammensetzen der Linienz&uuml;ge einer Komponente ist folgende:
</p>
<ol><li>Die Komponente ausw&auml;hlen und optional alles andere ausblenden, um besser sehen zu k&ouml;nnen.</li>
<li><a href="../de/Draft_Downgrade.html" title="Draft Downgrade/de">Draft Herabstufen</a> ausw&auml;hlen. Die Komponente wird in eine Reihe einzelner Kanten zerlegt.</li>
<li>Mit der Auswahl der L&ouml;cher mit Strg oder mit Umschalt + B beginnen, um einen Auswahlrahmen zu erstellen.</li>
<li><a href="../de/Draft_Upgrade.html" title="Draft Upgrade/de">Draft Hochstufen</a> dr&uuml;cken, um jedes Loch wieder in einen einzelnen Linienzug umzuwandeln.</li>
<li>Schlie&szlig;lich alle verbleibenden einzelnen Kanten im Baum ausw&auml;hlen, die den Umriss bilden, und f&uuml;hren <a href="../de/Draft_Upgrade.html" title="Draft Upgrade/de">Draft Hochstufen</a> ausf&uuml;hren.</li>
<li><b>Part &rarr; Verbund erstellen</b> (Teil &rarr; Verbindung erstellen) ausw&auml;hlen, um alle diese Linienz&uuml;ge wieder zu einem Objekt zusammenzuf&uuml;gen.</li>
<li>Die Verbindung ausw&auml;hlen und die Taste <a href="../de/Arch_Panel.html" title="Arch Panel/de">Arch Platte</a> (Bogenfeld) dr&uuml;cken.</li></ol>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_11.jpg&amp;filetimestamp=20161217205016&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_11.jpg" decoding="async" width="1882" height="983" class="mw-file-element" data-file-width="1882" data-file-height="983"></a></span>
</p><p>Hier gibt es viele m&ouml;gliche Strategien, je nachdem, wie editierbar und pr&auml;zise das Ergebnis sein soll. Das Objekt <a href="../de/Arch_Panel.html" title="Arch Panel/de">Arch Platte</a> ben&ouml;tigt ein Basisobjekt aus Linienz&uuml;gen. Es spielt keine Rolle, wie dieses Objekt erstellt wird, ob es sich um eine einzelne Skizze handelt oder, wie im obigen Beispiel, um eine Zusammensetzung aus verschiedenen Skizzen oder einem Entwurfsobjekt.
</p><p><span id="Converting_to_Sketches"></span>
</p>
<h2><span class="mw-headline" id="Umwandlung_in_Skizzen">Umwandlung in Skizzen</span></h2>
<p>Es ist auch m&ouml;glich, diesen Teil sp&auml;ter zu erledigen. Man k&ouml;nnte bereits Platten aus jeder der Komponenten erstellen, aber schauen wir uns zun&auml;chst einmal an, wie man ein draht&auml;hnliches Objekt in eine Skizze umwandelt:
</p>
<ol><li>Eine Kopie Ihres drahtartigen Objekts mit <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">Strg</span>+<span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">C</span>, <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">Strg</span>+<span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">V</span> erstellen. So k&ouml;nnen wir es &auml;ndern, aber dennoch eines an der richtigen Stelle behalten.</li>
<li>Es mit <a href="../de/Draft_Move.html" title="Draft Move/de">Draft Bewegen</a> und <a href="../de/Draft_Rotate.html" title="Draft Rotate/de">Draft Rotate</a> so verschieben und drehen, dass es in der XY-Ebene liegt. Dies ist nicht unbedingt erforderlich, aber sonst schl&auml;gt der n&auml;chste Punkt manchmal fehl.</li>
<li><a href="../de/Draft_Draft2Sketch.html" title="Draft Draft2Sketch/de">Draft ZeichnungZuSkizze</a> verwenden, um den Linienzug in eine Skizze umzuwandeln. Man beachte, dass dies bei gro&szlig;en Linienz&uuml;gen fehlschlagen oder sehr lange dauern kann. Am besten zerlegt man das Objekt wie oben gezeigt in einzelne Linienz&uuml;ge.</li>
<li>Wenn der obige Befehl fehlschl&auml;gt, funktioniert es in der Regel besser, wenn man <a href="../de/Draft_Upgrade.html" title="Draft Upgrade/de">Draft Hochstufen</a> zweimal auf ein draht&auml;hnliches Objekt anwendet, um es in eine Fl&auml;che und dann in einen <a href="../de/Draft_Wire.html" title="Draft Wire/de">Draft Linienzug</a> umzuwandeln, bevor man <a href="../de/Draft_Draft2Sketch.html" title="Draft Draft2Sketch/de">Draft ZeichnungZuSkizze</a> verwendet, da der Draft Linienzug die Reihenfolge der Scheitelpunkte innerhalb eines Linienzuges besser verfolgt.</li>
<li>Kurven bestehen aus mehreren kleinen Segmenten. Sie k&ouml;nnen unver&auml;ndert bleiben, f&uuml;hren jedoch zu vielen Endpunktbeschr&auml;nkungen. Es ist besser, sie durch B&ouml;gen zu ersetzen. Dies ist relativ einfach: Man L&ouml;scht einfach die kleinen Segmente und man ersetzt sie durch einen Bogen. Der Bogen kann dann tangential zu den benachbarten Segmenten gemacht werden. Man stellt jedoch sicher, dass die Position dieser Segmente gesperrt ist, bevor man dies tut, da sie durch diesen Vorgang verschoben werden.</li>
<li>Wenn man mit mehreren Skizzen gearbeitet hat, erstellt man daraus einen <a href="../de/Part_Compound.html" title="Part Compound/de">Part Verbund</a>.</li>
<li>Daraus eine <a href="../de/Arch_Panel.html" title="Arch Panel/de">Arc Platte</a> erstellen.</li>
<li>Man dreht/verschiebt es mit <a href="../de/Draft_Move.html" title="Draft Move/de">Draft Bewegen</a> und <a href="../de/Draft_Rotate.html" title="Draft Rotate/de">Draft Verschieben</a> zur&uuml;ck in seine Position.</li></ol>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_12.jpg&amp;filetimestamp=20161218215657&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_12.jpg" decoding="async" width="1183" height="705" class="mw-file-element" data-file-width="1183" data-file-height="705"></a></span>
</p><p><span id="Rebuilding_the_Wikihouse_and_exporting_cut_sheets"></span>
</p>
<h2><span id="Neuaufbau_des_Wikihouse_und_Exportieren_der_Schnittmusterb.C3.B6gen"></span><span class="mw-headline" id="Neuaufbau_des_Wikihouse_und_Exportieren_der_Schnittmusterb&ouml;gen">Neuaufbau des Wikihouse und Exportieren der Schnittmusterb&ouml;gen</span></h2>
<p>Au&szlig;erdem darauf achten, keine doppelten Teile erneut zu erstellen. Stattdessen das Werkzeug <a href="../de/Draft_Clone.html" title="Draft Clone/de">Draft Klonen</a> ausw&auml;hlen, um Teile auf der Grundlage desselben Profils zu duplizieren, sodass sie alle dasselbe Profilobjekt gemeinsam haben. Da wir nun die Kontur an der richtigen Stelle als Orientierung haben, ist es relativ einfach, den Klon mit <a href="../de/Draft_Rotate.html" title="Draft Rotate/de">Draft Drehen</a> und <a href="../de/Draft_Move.html" title="Draft Move/de">Draft Bewegen</a> zu drehen und an die richtige Position zu verschieben.
</p><p>Nach einer Weile ist unser gesamter Microhouse-Bereich fertig.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_01.jpg&amp;filetimestamp=20161217165244&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_01.jpg" decoding="async" width="932" height="801" class="mw-file-element" data-file-width="932" data-file-height="801"></a></span>
</p><p>Wir k&ouml;nnen nun ganz einfach die Zuschnittbl&auml;tter erstellen, bei denen es sich um DXF-Dateien handelt, die an die Werkstatt gesendet werden, die die eigentlichen Platten zuschneidet. Am einfachsten geht dies, indem man mit <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">Strg</span>+<span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">A</span> alles im Dokument ausw&auml;hlt und dann das Werkzeug <a href="../de/Arch_Panel_Cut.html" title="Arch Panel Cut/de">Arch Plattenzuschnitt</a> verwendet. Dadurch wird f&uuml;r jedes in der Auswahl gefundene Panel-Objekt ein Panel-Cut-Objekt erstellt. Indem wir diese voneinander entfernen, erhalten wir eine klare &Uuml;bersicht &uuml;ber alle unsere Teile:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_02.jpg&amp;filetimestamp=20161217165259&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_02.jpg" decoding="async" width="1565" height="873" class="mw-file-element" data-file-width="1565" data-file-height="873"></a></span>
</p><p>Anschlie&szlig;end m&uuml;ssen wir unsere Teile "verschachteln", d. h. sie so verschieben und drehen, dass sie m&ouml;glichst viel Platz auf einer bestimmten Platte einnehmen, um m&ouml;glichst wenig Materialverlust zu verursachen. Dieser Vorgang muss leider von Hand durchgef&uuml;hrt werden, aber wenn man ein Wikihouse-Projekt verwendet, f&uuml;r das bereits Zuschnitte erstellt wurden, geht das Kopieren recht schnell:
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<ol><li>To make sure everything will stay in the XY plane, it is advised to set the <a href="../Draft_SelectPlane.html" title="Draft SelectPlane">Working Plane</a> to XY (top)</li>
<li>Create an <a href="../Arch_Panel_Sheet.html" title="Arch Panel Sheet">Arch Panel Sheet</a></li>
<li>Give it the desired width and height values (Wikihouses are typically printed on 122x244cm plywood sheets)</li>
<li>Move it to a convenient place with <a href="../Draft_Move.html" title="Draft Move">Draft Move</a></li>
<li>Optionally, set its margin values to help you position the cut pieces</li>
<li>Move and rotate the individual <a href="../Arch_Panel_Cut.html" title="Arch Panel Cut">Arch Panel Cut</a> objects so they fit inside the Panel Sheet</li>
<li>When you are more or less ready, select the Panel Sheet, and double click it in the <a href="../Tree_view.html" class="mw-redirect" title="Tree view">tree view</a> to enter Edit mode</li>
<li>Select all the Panel Cuts you wish to insert in it (you may want to switch the tree view to the "project" tab to select in the tree)</li>
<li>Select the "group" section in the Panel Sheet's Task view</li>
<li>Press the <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">Add</span> button</li>
<li>Press the <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">OK</span> button</li></ol>
</div>
<p>In der Aufgabenansicht des Platten-Blattes gibt es auch eine Schaltfl&auml;che, mit der man die einzelnen Platten-Schnitte verschieben kann, nachdem sie in das Blatt eingef&uuml;gt wurden. Nach einer Weile sind unsere Bl&auml;tter fertig:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_03.jpg&amp;filetimestamp=20161217165326&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_03.jpg" decoding="async" width="1496" height="719" class="mw-file-element" data-file-width="1496" data-file-height="719"></a></span>
</p><p>Der letzte Schritt besteht darin, einfach alle Bl&auml;tter auszuw&auml;hlen und sie dann &uuml;ber das Men&uuml; Datei &rarr; Exportieren in das DXF-Format zu exportieren. Der Inhalt der Bl&auml;tter wird in verschiedenen Ebenen exportiert, wobei die gleiche Farbcodierung verwendet wird, die auch im Wikihouse-Projekt &uuml;blich ist:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_04.jpg&amp;filetimestamp=20161217165748&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_04.jpg" decoding="async" width="1437" height="872" class="mw-file-element" data-file-width="1437" data-file-height="872"></a></span>
</p><p>Diese Dateien k&ouml;nnen nun an die Werkst&auml;tten gesendet werden, die den eigentlichen Schnitt durchf&uuml;hren. Es w&auml;re auch m&ouml;glich, den G-Code, der an die CNC-Maschine gesendet werden soll, direkt aus FreeCAD zu generieren, aber das ist Thema eines anderen Tutoriums.
</p>
<!-- 
NewPP limit report
Cached time: 20251115061504
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.074 seconds
Real time usage: 0.102 seconds
Preprocessor visited node count: 189/1000000
Post&#8208;expand include size: 5145/2097152 bytes
Template argument size: 157/2097152 bytes
Highest expansion depth: 3/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1913/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    7.097      1 -total
 42.62%    3.025      1 Template:TutorialInfo/de
 22.61%    1.605     13 Template:Button
 20.78%    1.475      2 Template:MenuCommand
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:215241-0!canonical and timestamp 20251115061504 and revision id 1690943. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>