<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">AppImage/ru</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="ru" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-AppImage&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/AppImage.html" class="mw-pt-progress mw-pt-progress--complete" title="AnwendungsAbbild (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../AppImage.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="AppImage (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/AppImage.html" class="mw-pt-progress mw-pt-progress--med" title="Im&aacute;genes de las aplicaciones (26% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/AppImage.html" class="mw-pt-progress mw-pt-progress--complete" title="AppImage (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/AppImage.html" class="mw-pt-progress mw-pt-progress--complete" title="AppImage (100% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/AppImage.html" class="mw-pt-progress mw-pt-progress--complete" title="AppImage (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt-br/AppImage.html" class="mw-pt-progress mw-pt-progress--low" title="AppImage (2% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--high" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</span></li>
<li><a href="../ja/AppImage.html" class="mw-pt-progress mw-pt-progress--low" title="AppImage (2% translated)" lang="ja" dir="ltr">&#26085;&#26412;&#35486;</a></li></ul></div>
<div style="clear:right; margin-bottom: .5em; float: right; padding: .5em 0 .8em 1.4em; background: none;"><meta property="mw:PageProp/toc"></div>
<p><span id="What_is_an_AppImage?"></span>
</p>
<h2><span id=".D0.A7.D1.82.D0.BE_.D1.82.D0.B0.D0.BA.D0.BE.D0.B5_AppImage.3F"></span><span class="mw-headline" id="&#1063;&#1090;&#1086;_&#1090;&#1072;&#1082;&#1086;&#1077;_AppImage?">&#1063;&#1090;&#1086; &#1090;&#1072;&#1082;&#1086;&#1077; AppImage?</span></h2>
<p><span class="mw-default-size" typeof="mw:File"><a href="https://appimage.org" rel="nofollow"><img src="../File/AppImage-logo.png" decoding="async" width="32" height="32" class="mw-file-element" data-file-width="32" data-file-height="32"></a></span> <i>&#1059;&#1087;&#1072;&#1082;&#1091;&#1081;&#1090;&#1077; &#1086;&#1076;&#1080;&#1085; &#1088;&#1072;&#1079; &#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1081;&#1090;&#1077; &#1074;&#1077;&#1079;&#1076;&#1077;. &#1054;&#1093;&#1074;&#1072;&#1090;&#1080;&#1090;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; &#1074;&#1089;&#1077;&#1093; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1093; &#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074;&#1086;&#1074; Linux &#1085;&#1072; &#1085;&#1072;&#1089;&#1090;&#1086;&#1083;&#1100;&#1085;&#1099;&#1093; &#1055;&#1050;.</i>
</p><p>AppImage &#1101;&#1090;&#1086; "&#1091;&#1085;&#1080;&#1074;&#1077;&#1088;&#1089;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1076;&#1074;&#1086;&#1080;&#1095;&#1085;&#1099;&#1081; &#1087;&#1072;&#1082;&#1077;&#1090;", &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1085;&#1099;&#1081; &#1076;&#1083;&#1103; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081; &#1085;&#1072; &#1083;&#1102;&#1073;&#1086;&#1081; &#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074; Linux. &#1063;&#1080;&#1090;&#1072;&#1081;&#1090;&#1077; &#1076;&#1072;&#1083;&#1100;&#1096;&#1077; &#1086; &#1085;&#1105;&#1084; &#1085;&#1072; <a rel="nofollow" class="external text" href="https://appimage.org">&#1076;&#1086;&#1084;&#1072;&#1096;&#1085;&#1077;&#1081; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; Appimage</a> &#1080; &#1074; <a rel="nofollow" class="external text" href="https://ru.wikipedia.org/wiki/AppImage">Wikipedia</a>.
</p><p>&#1063;&#1090;&#1086;&#1073;&#1099; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086;, &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1089;&#1076;&#1077;&#1083;&#1072;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1099;&#1084;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1074;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1080;&#1083;&#1080; &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1087;&#1091;&#1090;&#1100;.
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">chmod</span> <span class="o">+</span><span class="n">x</span> <span class="n">FreeCAD_xxx</span><span class="o">-</span><span class="n">x86_64</span><span class="o">.</span><span class="n">AppImage</span>
<span class="o">./</span><span class="n">FreeCAD_xxx</span><span class="o">-</span><span class="n">x86_64</span><span class="o">.</span><span class="n">AppImage</span>
</pre></div>
<p>&#1044;&#1083;&#1103; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1090;&#1080;&#1087;&#1086;&#1074; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; <a href="../ru/Download.html" title="Download/ru">Download</a>.
</p><p><span id="FreeCAD_AppImages"></span>
</p>
<h2><span id="AppImage.27.D0.B8_FreeCAD.27.D0.B0"></span><span class="mw-headline" id="AppImage'&#1080;_FreeCAD'&#1072;">AppImage'&#1080; FreeCAD'&#1072;</span></h2>
<table class="wikitable" style="margin-left: auto; margin-right: auto; border: none;">
<caption style="text-align: center; font-size: 150%;">Available FreeCAD AppImages
</caption>
<caption>
</caption>
<tbody><tr>
<th style="text-align: center; font-size: 200%;">Stable
</th>
<th style="text-align: center; font-size: 200%;">Development
</th></tr>
<tr>
<td style="text-align: center;"><span class="mw-default-size" typeof="mw:File"><a href="https://github.com/FreeCAD/FreeCAD-Bundle/releases/tag/1.0.2" rel="nofollow"><img src="../File/AppImage-logo.png" decoding="async" width="32" height="32" class="mw-file-element" data-file-width="32" data-file-height="32"></a></span> <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD-Bundle/releases/tag/1.0.2">v1.0.2</a>
</td>
<td style="text-align: center;"><span class="mw-default-size" typeof="mw:File"><a href="https://github.com/FreeCAD/FreeCAD-Bundle/releases/tag/weekly-builds" rel="nofollow"><img src="../File/AppImage-logo.png" decoding="async" width="32" height="32" class="mw-file-element" data-file-width="32" data-file-height="32"></a></span> <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD-Bundle/releases/tag/weekly-builds">Weekly build</a>
</td></tr></tbody></table>
<p><b>&#1042;&#1072;&#1078;&#1085;&#1099;&#1077; &#1079;&#1072;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1103;:</b>
</p>
<ul><li>&#1056;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1077;&#1078;&#1077;&#1076;&#1085;&#1077;&#1074;&#1085;&#1086; &#1080; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;.</li>
<li>&#1057;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1091; &#1074;&#1099;&#1096;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100; &#1072;&#1082;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1086;&#1085;&#1072; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1072;.</li>
<li>&#1052;&#1085;&#1086;&#1075;&#1080;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1080; &#1092;&#1086;&#1088;&#1091;&#1084;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090; &#1074;&#1077;&#1088;&#1089;&#1080;&#1102; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080;.</li>
<li>&#1045;&#1075;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1090;&#1100; &#1074; &#1090;&#1086;&#1081; &#1078;&#1077; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1087;&#1072;&#1088;&#1072;&#1083;&#1083;&#1077;&#1083;&#1100;&#1085;&#1086; &#1089; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1077;&#1081; FreeCAD.</li>
<li>&#1055;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090; &#1074;&#1077;&#1088;&#1089;&#1080;&#1102; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1086;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1084;&#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103;&#1084;&#1080; &#1080; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082; (&#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; FreeCAD &#1080;&#1084;&#1077;&#1077;&#1090; &#1076;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1094;&#1080;&#1082;&#1083; &#1074;&#1099;&#1087;&#1091;&#1089;&#1082;&#1072;). &#1054;&#1085;&#1080; &#1090;&#1072;&#1082;&#1078;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090; &#1077;&#1075;&#1086; &#1076;&#1083;&#1103; &#1090;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080; &#1087;&#1086;&#1080;&#1089;&#1082;&#1072; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1090;&#1080;&#1084;&#1091;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1091; &#1080; &#1091;&#1083;&#1091;&#1095;&#1096;&#1077;&#1085;&#1080;&#1077; FreeCAD.</li></ul>
<p><span id="Obligatory_Word_of_Caution"></span>
</p>
<h4><span id=".D0.9D.D0.B5.D0.BE.D0.B1.D1.85.D0.BE.D0.B4.D0.B8.D0.BC.D0.BE.D0.B5_.D0.BF.D1.80.D0.B5.D0.B4.D1.83.D0.BF.D1.80.D0.B5.D0.B6.D0.B4.D0.B5.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1053;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1077;_&#1087;&#1088;&#1077;&#1076;&#1091;&#1087;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077;">&#1053;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1077; &#1087;&#1088;&#1077;&#1076;&#1091;&#1087;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077;</span></h4>
<p>&#1055;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1077;&#1084;&#1072;&#1103; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103; &#1089;&#1090;&#1072;&#1073;&#1080;&#1083;&#1100;&#1085;&#1072;, &#1085;&#1086;, &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1074;&#1072;&#1078;&#1085;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1077; &#1079;&#1072;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1077;&#1105; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1077; &#1085;&#1072; &#1089;&#1074;&#1086;&#1081; &#1089;&#1090;&#1088;&#1072;&#1093; &#1080; &#1088;&#1080;&#1089;&#1082;. &#1061;&#1086;&#1090;&#1103; &#1091; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1072; &#1083;&#1102;&#1076;&#1077;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090; &#1088;&#1077;&#1079;&#1077;&#1088;&#1074;&#1085;&#1099;&#1077; &#1082;&#1086;&#1087;&#1080;&#1080; &#1080; '&#1095;&#1072;&#1089;&#1090;&#1086; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103;', &#1074;&#1089;&#1105; &#1076;&#1086;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086; &#1093;&#1086;&#1088;&#1086;&#1096;&#1086;.
</p><p><span id="Automatic_updating"></span>
</p>
<h2><span id=".D0.90.D0.B2.D1.82.D0.BE.D0.BE.D0.B1.D0.BD.D0.BE.D0.B2.D0.BB.D0.B5.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1040;&#1074;&#1090;&#1086;&#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;">&#1040;&#1074;&#1090;&#1086;&#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;</span></h2>
<p>AppImage &#1080;&#1084;&#1077;&#1077;&#1090; &#1091;&#1084;&#1085;&#1099;&#1081; &#1080; &#1101;&#1082;&#1086;&#1085;&#1086;&#1084;&#1080;&#1095;&#1085;&#1099;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;. &#1054;&#1085; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1090; &#1088;&#1072;&#1079;&#1085;&#1080;&#1094;&#1091; &#1084;&#1077;&#1078;&#1076;&#1091; &#1085;&#1086;&#1074;&#1099;&#1084; AppImage &#1080; &#1089;&#1090;&#1072;&#1088;&#1099;&#1084; &#1080; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1077;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1084;&#1077;&#1078;&#1076;&#1091; &#1080;&#1093; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103;&#1084;&#1080;. &#1058;&#1077;&#1086;&#1088;&#1077;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1088;&#1072;&#1079; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1077;&#1090; &#1086;&#1082;&#1086;&#1083;&#1086; 15% &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1089;&#1086;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1085;&#1086; &#1085;&#1086;&#1074;&#1086;&#1075;&#1086; AppImage.
</p><p>&#1040;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1084;&#1080; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1084;&#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;&#1084;&#1080;. &#1042; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1077;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; 4 &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;: 2 - &#1095;&#1077;&#1088;&#1077;&#1079; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089; (GUI) &#1080; 2 - &#1095;&#1077;&#1088;&#1077;&#1079; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;/&#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1072;&#1083;&#1072; (CLI).
</p><p><span id="Experimental_in-app_updating"></span>
</p>
<h3><span id=".D0.AD.D0.BA.D1.81.D0.BF.D0.B5.D1.80.D0.B8.D0.BC.D0.B5.D0.BD.D1.82.D0.B0.D0.BB.D1.8C.D0.BD.D0.BE.D0.B5_.D0.BE.D0.B1.D0.BD.D0.BE.D0.B2.D0.BB.D0.B5.D0.BD.D0.B8.D0.B5_.D0.B2_.D0.BF.D1.80.D0.B8.D0.BB.D0.BE.D0.B6.D0.B5.D0.BD.D0.B8.D0.B8"></span><span class="mw-headline" id="&#1069;&#1082;&#1089;&#1087;&#1077;&#1088;&#1080;&#1084;&#1077;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077;_&#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;_&#1074;_&#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1080;">&#1069;&#1082;&#1089;&#1087;&#1077;&#1088;&#1080;&#1084;&#1077;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1080;</span></h3>
<div class="mw-translate-fuzzy">
<p>&#1053;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1082;&#1083;&#1102;&#1095;&#1077;&#1074;&#1099;&#1093; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074; &#1087;&#1088;&#1080;&#1083;&#1072;&#1075;&#1072;&#1102;&#1090; <a rel="nofollow" class="external text" href="https://forum.freecadweb.org/viewtopic.php?f=8&amp;t=44324">&#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1099;&#1077; &#1091;&#1089;&#1080;&#1083;&#1080;&#1103;</a> &#1087;&#1086; &#1080;&#1085;&#1090;&#1077;&#1075;&#1088;&#1072;&#1094;&#1080;&#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; <b>&#1089;&#1072;&#1084;&#1086;&#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1103;&#1090;&#1100; AppImage &#1080;&#1079;&#1085;&#1091;&#1090;&#1088;&#1080; FreeCAD</b>. &#1053;&#1072;&#1095;&#1080;&#1085;&#1072;&#1103; &#1089; FC 0.19.21514 &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083; AppImage, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1081;&#1090;&#1080; &#1095;&#1077;&#1088;&#1077;&#1079; <b>&#1055;&#1088;&#1072;&#1074;&#1082;&#1072; &rarr; &#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &rarr; AppImage</b>. &#1055;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1100;&#1090;&#1077; &#1101;&#1090;&#1091; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1080; &#1089;&#1086;&#1086;&#1073;&#1097;&#1080;&#1090;&#1077; &#1086; &#1089;&#1074;&#1086;&#1077;&#1084; &#1086;&#1087;&#1099;&#1090;&#1077; &#1074; <a rel="nofollow" class="external text" href="https://forum.freecadweb.org/viewtopic.php?f=8&amp;t=44324">&#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1080; &#1085;&#1072; &#1092;&#1086;&#1088;&#1091;&#1084;&#1077;</a>.
</p>
</div>
<p><span id="GUI_method_1_(official)"></span>
</p>
<h3><span id=".D0.9C.D0.B5.D1.82.D0.BE.D0.B4_.D1.87.D0.B5.D1.80.D0.B5.D0.B7_GUI_.E2.84.961_.28.D0.BE.D1.84.D0.B8.D1.86.D0.B8.D0.B0.D0.BB.D1.8C.D0.BD.D1.8B.D0.B9.29"></span><span class="mw-headline" id="&#1052;&#1077;&#1090;&#1086;&#1076;_&#1095;&#1077;&#1088;&#1077;&#1079;_GUI_&#8470;1_(&#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081;)">&#1052;&#1077;&#1090;&#1086;&#1076; &#1095;&#1077;&#1088;&#1077;&#1079; GUI &#8470;1 (&#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081;)</span></h3>
<p>&#1069;&#1090;&#1086; &#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1089; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1086;&#1084; AppImageUpdate.
</p>
<ol><li>&#1047;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1100; <a rel="nofollow" class="external text" href="https://github.com/AppImage/AppImageUpdate/releases/download/continuous/AppImageUpdate-x86_64.AppImage">AppImageUpdate-x86_64.AppImage</a>.</li>
<li>&#1057;&#1076;&#1077;&#1083;&#1072;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1099;&#1084;, &#1097;&#1077;&#1083;&#1082;&#1085;&#1091;&#1074; &#1087;&#1088;&#1072;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; &#1084;&#1099;&#1096;&#1080; &#1087;&#1086; &#1092;&#1072;&#1081;&#1083;&#1091;, &#1074;&#1086;&#1081;&#1076;&#1103; &#1074; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1074; &laquo;&#1047;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1090;&#1100; &#1082;&#1072;&#1082; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083;&raquo;.</li>
<li>&#1044;&#1074;&#1072;&#1078;&#1076;&#1099; &#1097;&#1077;&#1083;&#1082;&#1085;&#1080;&#1090;&#1077; &#1079;&#1085;&#1072;&#1095;&#1086;&#1082; AppImage, &#1087;&#1086;&#1103;&#1074;&#1080;&#1090;&#1089;&#1103; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1074;&#1072;&#1084; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;, &#1082;&#1072;&#1082;&#1086;&#1081; AppImage &#1074;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1086;&#1073;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100;.</li>
<li>&#1059;&#1082;&#1072;&#1078;&#1080;&#1090;&#1077; &#1087;&#1091;&#1090;&#1100; &#1082; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1084;&#1091; AppImage.</li>
<li>&#1055;&#1086;&#1089;&#1083;&#1077; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; AppImage &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091;  <span style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.4em; padding: 0px 10px 1px 10px; font-weight:normal;color: #202122;">Run updated AppImage</span>.</li></ol>
<p><span id="GUI_method_2_(unofficial)"></span>
</p>
<h3><span id=".D0.9C.D0.B5.D1.82.D0.BE.D0.B4_.D1.87.D0.B5.D1.80.D0.B5.D0.B7_GUI_.E2.84.962_.28.D0.BD.D0.B5.D0.BE.D1.84.D0.B8.D1.86.D0.B8.D0.B0.D0.BB.D1.8C.D0.BD.D1.8B.D0.B9.29"></span><span class="mw-headline" id="&#1052;&#1077;&#1090;&#1086;&#1076;_&#1095;&#1077;&#1088;&#1077;&#1079;_GUI_&#8470;2_(&#1085;&#1077;&#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081;)">&#1052;&#1077;&#1090;&#1086;&#1076; &#1095;&#1077;&#1088;&#1077;&#1079; GUI &#8470;2 (&#1085;&#1077;&#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081;)</span></h3>
<p>&#1069;&#1090;&#1086; &#1073;&#1086;&#1083;&#1077;&#1077; &#1101;&#1083;&#1077;&#1075;&#1072;&#1085;&#1090;&#1085;&#1072;&#1103; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1103;&#1103; &#1085;&#1077;&#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103; AppImageUpdate &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; <b>AppImageUpdater</b>. &#1054;&#1085; &#1074;&#1089;&#1105; &#1077;&#1097;&#1105; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1077; (&#1085;&#1072; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1101;&#1090;&#1086;&#1075;&#1086; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074;&#1080;&#1082;&#1080;), &#1085;&#1086; &#1090;&#1077;&#1084; &#1085;&#1077; &#1084;&#1077;&#1085;&#1077;&#1077;, &#1076;&#1086;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086; &#1091;&#1076;&#1086;&#1073;&#1077;&#1085; &#1074; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080;.
</p>
<ol><li>&#1047;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1077; <a rel="nofollow" class="external text" href="https://github.com/antony-jr/AppImageUpdater/releases/tag/continuous">AppImageUpdater-*-x86_64.AppImage</a></li>
<li>&#1057;&#1076;&#1077;&#1083;&#1072;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1099;&#1084;: <div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">chmod</span> <span class="o">+</span><span class="n">x</span> <span class="n">AppImageUpdater</span><span class="o">*-</span><span class="n">x86_64</span><span class="o">.</span><span class="n">AppImage</span>
</pre></div></li>
<li>&#1047;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1077; &#1077;&#1075;&#1086;: <div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">source</span> <span class="n">AppImageUpdater</span><span class="o">*-</span><span class="n">x86_64</span><span class="o">.</span><span class="n">AppImage</span>
</pre></div></li>
<li>&#1053;&#1072;&#1081;&#1076;&#1080;&#1090;&#1077; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1081; &#1092;&#1072;&#1081;&#1083; FreeCAD AppImage &#1080; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1097;&#1080;&#1090;&#1077; &#1077;&#1075;&#1086; &#1074; AppImageUpdater</li></ol>
<p>&#1044;&#1072;&#1083;&#1077;&#1077;: &#1057;&#1083;&#1077;&#1076;&#1091;&#1081;&#1090;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1103;&#1084; AppImageUpdater
</p><p><span id="CLI_method_1_(official)"></span>
</p>
<h3><span id=".D0.9C.D0.B5.D1.82.D0.BE.D0.B4_.D1.87.D0.B5.D1.80.D0.B5.D0.B7_.D0.BA.D0.BE.D0.BC.D0.B0.D0.BD.D0.B4.D0.BD.D1.83.D1.8E_.D1.81.D1.82.D1.80.D0.BE.D0.BA.D1.83_.E2.84.961_.28.D0.BE.D1.84.D0.B8.D1.86.D0.B8.D0.B0.D0.BB.D1.8C.D0.BD.D1.8B.D0.B9.29"></span><span class="mw-headline" id="&#1052;&#1077;&#1090;&#1086;&#1076;_&#1095;&#1077;&#1088;&#1077;&#1079;_&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1091;&#1102;_&#1089;&#1090;&#1088;&#1086;&#1082;&#1091;_&#8470;1_(&#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081;)">&#1052;&#1077;&#1090;&#1086;&#1076; &#1095;&#1077;&#1088;&#1077;&#1079; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1091;&#1102; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091; &#8470;1 (&#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081;)</span></h3>
<p>&#1042;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080; &#1074; &#1089;&#1074;&#1086;&#1077;&#1084; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1072;&#1083;&#1077;
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">wget</span> <span class="n">https</span><span class="p">:</span><span class="o">//</span><span class="n">github</span><span class="o">.</span><span class="n">com</span><span class="o">/</span><span class="n">AppImage</span><span class="o">/</span><span class="n">AppImageUpdate</span><span class="o">/</span><span class="n">releases</span><span class="o">/</span><span class="n">download</span><span class="o">/</span><span class="n">continuous</span><span class="o">/</span><span class="n">appimageupdatetool</span><span class="o">-</span><span class="n">x86_64</span><span class="o">.</span><span class="n">AppImage</span>
<span class="n">chmod</span> <span class="o">+</span><span class="n">x</span> <span class="o">./</span><span class="n">appimageupdatetool</span><span class="o">-</span><span class="n">x86_64</span><span class="o">.</span><span class="n">AppImage</span>
<span class="o">./</span><span class="n">appimageupdatetool</span><span class="o">.</span><span class="n">AppImage</span> <span class="n">path</span><span class="o">/</span><span class="n">to</span><span class="o">/</span><span class="n">old</span><span class="o">/</span><span class="n">FreeCAD</span><span class="o">.</span><span class="n">AppImage</span>
<span class="n">chmod</span> <span class="o">+</span><span class="n">x</span> <span class="n">path</span><span class="o">/</span><span class="n">to</span><span class="o">/</span><span class="n">updated</span><span class="o">/</span><span class="n">FreeCAD</span><span class="o">.</span><span class="n">AppImage</span>
<span class="o">./</span><span class="n">path</span><span class="o">/</span><span class="n">to</span><span class="o">/</span><span class="n">updated</span><span class="o">/</span><span class="n">FreeCAD</span><span class="o">.</span><span class="n">AppImage</span>
</pre></div>
<p>&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1103;:
</p>
<ul><li>&#1048;&#1084;&#1077;&#1085;&#1072; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1073;&#1091;&#1076;&#1091;&#1090; &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1074; &#1085;&#1080;&#1093; &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1072; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1086; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080;. &#1055;&#1088;&#1080;&#1074;&#1077;&#1076;&#1105;&#1085;&#1085;&#1099;&#1077; &#1074;&#1099;&#1096;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080; &#1091;&#1087;&#1088;&#1086;&#1097;&#1077;&#1085;&#1099; &#1076;&#1083;&#1103; &#1091;&#1076;&#1086;&#1073;&#1089;&#1090;&#1074;&#1072;.</li>
<li>&#1047;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1077; <code>./appimageupdatetool-x86_64.AppImage --help</code>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1079;&#1085;&#1072;&#1090;&#1100; &#1086; &#1090;&#1072;&#1082;&#1080;&#1093; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103;&#1093;, &#1082;&#1072;&#1082; <code>--remove-old</code>, <code>--overwrite</code> &#1080; <code>--self-update</code>.</li>
<li>&#1058;&#1072;&#1082;&#1078;&#1077; &#1077;&#1089;&#1090;&#1100; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103; i386; &#1089;&#1084;. &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; <a rel="nofollow" class="external text" href="https://github.com/AppImage/AppImageUpdate/releases">AppImageUpdate release</a>.</li></ul>
<p>&#1063;&#1090;&#1086; &#1085;&#1091;&#1078;&#1085;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100;: &#1087;&#1086;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077;&#1089;&#1100; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1084;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1084;&#1086;&#1078;&#1085;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1072;&#1083;&#1080;&#1072;&#1089;&#1072; &#1080;&#1083;&#1080; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1103; <a rel="nofollow" class="external text" href="https://ru.wikipedia.org/wiki/Cron">cron</a>.
</p><p><span id="CLI_method_2_(unofficial)"></span>
</p>
<h3><span id=".D0.9C.D0.B5.D1.82.D0.BE.D0.B4_.D1.87.D0.B5.D1.80.D0.B5.D0.B7_.D0.BA.D0.BE.D0.BC.D0.B0.D0.BD.D0.B4.D0.BD.D1.83.D1.8E_.D1.81.D1.82.D1.80.D0.BE.D0.BA.D1.83_.E2.84.962_.28.D0.BD.D0.B5.D0.BE.D1.84.D0.B8.D1.86.D0.B8.D0.B0.D0.BB.D1.8C.D0.BD.D1.8B.D0.B9.29"></span><span class="mw-headline" id="&#1052;&#1077;&#1090;&#1086;&#1076;_&#1095;&#1077;&#1088;&#1077;&#1079;_&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1091;&#1102;_&#1089;&#1090;&#1088;&#1086;&#1082;&#1091;_&#8470;2_(&#1085;&#1077;&#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081;)">&#1052;&#1077;&#1090;&#1086;&#1076; &#1095;&#1077;&#1088;&#1077;&#1079; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1091;&#1102; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091; &#8470;2 (&#1085;&#1077;&#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081;)</span></h3>
<p>&#1040;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1086; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;&#1084;, &#1080;&#1084;&#1077;&#1102;&#1097;&#1080;&#1084; &#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1080; &#1085;&#1077;&#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1099; &#1082; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1077; AppImages, &#1090;&#1086; &#1078;&#1077; &#1089;&#1072;&#1084;&#1086;&#1077; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1089;&#1103; &#1080; &#1082; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077;. &#1069;&#1090;&#1086; &#1073;&#1086;&#1083;&#1077;&#1077; &#1101;&#1083;&#1077;&#1075;&#1072;&#1085;&#1090;&#1085;&#1099;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1080;&#1081; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090; &#1074; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077; &#1076;&#1083;&#1103; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080; AppImages.
</p>
<ol><li>&#1047;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1077; <a rel="nofollow" class="external text" href="https://github.com/antony-jr/AppImageUpdater/releases/tag/continuous-cli">appimageupdater-*-x86_64.AppImage</a></li>
<li>&#1057;&#1076;&#1077;&#1083;&#1072;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1099;&#1084;: <div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">chmod</span> <span class="o">+</span><span class="n">x</span> <span class="n">appimageupdater</span><span class="o">*-</span><span class="n">x86_64</span><span class="o">.</span><span class="n">AppImage</span>
</pre></div></li>
<li>&#1047;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1077; &#1077;&#1075;&#1086;: <div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">source</span> <span class="n">appimageupdater</span><span class="o">*-</span><span class="n">x86_64</span><span class="o">.</span><span class="n">AppImage</span> <span class="o">/</span><span class="n">path</span><span class="o">/</span><span class="n">to</span><span class="o">/</span><span class="n">old</span><span class="o">/</span><span class="n">FreeCAD</span><span class="o">-</span><span class="n">AppImage</span><span class="o">.</span><span class="n">AppImage</span>
</pre></div></li></ol>
<p><b>&#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;</b>: &#1054;&#1073;&#1085;&#1086;&#1074;&#1083;&#1103;&#1077;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; AppImage, &#1077;&#1089;&#1083;&#1080; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090;.
</p><p><br>
<span id="Experimental"></span>
</p>
<h1><span id=".D0.AD.D0.BA.D1.81.D0.BF.D0.B5.D1.80.D0.B8.D0.BC.D0.B5.D0.BD.D1.82.D0.B0.D0.BB.D1.8C.D0.BD.D1.8B.D0.B5_.D1.84.D1.83.D0.BD.D0.BA.D1.86.D0.B8.D0.B8"></span><span class="mw-headline" id="&#1069;&#1082;&#1089;&#1087;&#1077;&#1088;&#1080;&#1084;&#1077;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077;_&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;">&#1069;&#1082;&#1089;&#1087;&#1077;&#1088;&#1080;&#1084;&#1077;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;</span></h1>
<p><span id="Fixing_AppImage_zsync"></span>
</p>
<h2><span id=".D0.98.D1.81.D0.BF.D1.80.D0.B0.D0.B2.D0.BB.D0.B5.D0.BD.D0.B8.D0.B5_AppImage_.D1.87.D0.B5.D1.80.D0.B5.D0.B7_zsync"></span><span class="mw-headline" id="&#1048;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;_AppImage_&#1095;&#1077;&#1088;&#1077;&#1079;_zsync">&#1048;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; AppImage &#1095;&#1077;&#1088;&#1077;&#1079; zsync</span></h2>
<p>&#1052;&#1086;&#1078;&#1077;&#1090; &#1089;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100;&#1089;&#1103; &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086; AppImage &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1103;&#1090;&#1100;&#1089;&#1103;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1077;&#1075;&#1086; &#1094;&#1077;&#1083;&#1077;&#1074;&#1086;&#1081; &#1092;&#1072;&#1081;&#1083; &#1082;&#1072;&#1082;&#1080;&#1084;-&#1090;&#1086; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1083;&#1089;&#1103;. &#1042;&#1084;&#1077;&#1089;&#1090;&#1086; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1081; AppImage, &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1092;&#1072;&#1081;&#1083; zsync, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; AppImage &#1076;&#1083;&#1103; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080; &#1076;&#1077;&#1083;&#1100;&#1090;&#1099;. &#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1091;&#1102; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1081;&#1090;&#1080; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; <a rel="nofollow" class="external free" href="https://github.com/antony-jr/appimage-update-info-writer">https://github.com/antony-jr/appimage-update-info-writer</a>. 
</p><p>&#1069;&#1090;&#1086;&#1090; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090; &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;.
</p><p><span id="Downloading_via_Bittorrent"></span>
</p>
<h2><span id=".D0.97.D0.B0.D0.B3.D1.80.D1.83.D0.B7.D0.BA.D0.B0_.D1.87.D0.B5.D1.80.D0.B5.D0.B7_Bittorrent"></span><span class="mw-headline" id="&#1047;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072;_&#1095;&#1077;&#1088;&#1077;&#1079;_Bittorrent">&#1047;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072; &#1095;&#1077;&#1088;&#1077;&#1079; Bittorrent</span></h2>
<p>&#1069;&#1082;&#1089;&#1087;&#1077;&#1088;&#1080;&#1084;&#1077;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1080;&#1089;&#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074; &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074; FreeCAD (&#1073;&#1083;&#1072;&#1075;&#1086;&#1076;&#1072;&#1088;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077; Antony-jr), &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1100; &#1076;&#1077;&#1083;&#1100;&#1090;&#1091; AppImage FreeCAD &#1095;&#1077;&#1088;&#1077;&#1079; &#1073;&#1080;&#1090;&#1090;&#1086;&#1088;&#1088;&#1077;&#1085;&#1090;. &#1056;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1081; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1080;&#1082;&#1086;&#1074; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1087;&#1086; &#1072;&#1076;&#1088;&#1077;&#1089;&#1091; <a rel="nofollow" class="external free" href="https://github.com/FreeCAD/FreeCAD-Bundle/issues/49">https://github.com/FreeCAD/FreeCAD-Bundle/issues/49</a>.
</p><p><span id="Developer_Section"></span>
</p>
<h1><span id=".D0.A1.D0.B5.D0.BA.D1.86.D0.B8.D1.8F_.D1.80.D0.B0.D0.B7.D1.80.D0.B0.D0.B1.D0.BE.D1.82.D1.87.D0.B8.D0.BA.D0.B0"></span><span class="mw-headline" id="&#1057;&#1077;&#1082;&#1094;&#1080;&#1103;_&#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072;">&#1057;&#1077;&#1082;&#1094;&#1080;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072;</span></h1>
<p><i>&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;:</i> &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1072;&#1103; &#1089;&#1077;&#1082;&#1094;&#1080;&#1103; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1072; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074; 
</p><p><span id="Unpacking_AppImages"></span>
</p>
<h2><span id=".D0.A0.D0.B0.D1.81.D0.BF.D0.B0.D0.BA.D0.BE.D0.B2.D0.BA.D0.B0_AppImage"></span><span class="mw-headline" id="&#1056;&#1072;&#1089;&#1087;&#1072;&#1082;&#1086;&#1074;&#1082;&#1072;_AppImage">&#1056;&#1072;&#1089;&#1087;&#1072;&#1082;&#1086;&#1074;&#1082;&#1072; AppImage</span></h2>
<p>&#1054;&#1095;&#1077;&#1085;&#1100; &#1091;&#1076;&#1086;&#1073;&#1085;&#1099;&#1081; &#1072;&#1089;&#1087;&#1077;&#1082;&#1090; FreeCAD &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1072;&#1103; &#1077;&#1075;&#1086; &#1095;&#1072;&#1089;&#1090;&#1100; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1072; &#1085;&#1072; <a href="../ru/Python.html" title="Python/ru">Python</a>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1085;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102;, &#1082;&#1072;&#1082; C ++. &#1055;&#1086; &#1089;&#1091;&#1090;&#1080;, &#1092;&#1072;&#1081;&#1083; Python &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100;, &#1080; &#1087;&#1086;&#1089;&#1083;&#1077; &#1087;&#1077;&#1088;&#1077;&#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072; FreeCAD &#1101;&#1090;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1073;&#1091;&#1076;&#1091;&#1090; &#1080;&#1085;&#1090;&#1077;&#1075;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1099; &#1074; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;. &#1056;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1085;&#1072;&#1076; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1077;&#1081; FreeCAD, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1101;&#1090;&#1091; &#1090;&#1077;&#1093;&#1085;&#1080;&#1082;&#1091; &#1080; &#1074; AppImage. &#1041;&#1086;&#1083;&#1077;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; AppImage &#1085;&#1080;&#1082;&#1086;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1085;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1089;&#1088;&#1077;&#1076;&#1091; &#1074;&#1072;&#1096;&#1077;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;, &#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1085;&#1080;&#1095;&#1077;&#1075;&#1086; &#1085;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080; &#1085;&#1080;&#1082;&#1072;&#1082;&#1080;&#1077; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077; &#1089;&#1088;&#1077;&#1076;&#1099; &#1085;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103;.
</p><p><span id="Modifying_AppImages"></span>
</p>
<h3><span id=".D0.9C.D0.BE.D0.B4.D0.B8.D1.84.D0.B8.D0.BA.D0.B0.D1.86.D0.B8.D1.8F_AppImage"></span><span class="mw-headline" id="&#1052;&#1086;&#1076;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1103;_AppImage">&#1052;&#1086;&#1076;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1103; AppImage</span></h3>
<p>&#1042; AppImage &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1072; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;&#1072;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1089;&#1086; &#1074;&#1089;&#1077;&#1084;, &#1095;&#1090;&#1086; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086;, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1100; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;&#1091;&#1102; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091;.
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="o">./</span><span class="n">FreeCAD_xxx</span><span class="o">.</span><span class="n">AppImage</span> <span class="o">--</span><span class="n">appimage</span><span class="o">-</span><span class="n">extract</span>
<span class="n">cd</span> <span class="n">squashfs</span><span class="o">-</span><span class="n">root</span><span class="o">/</span>
</pre></div>
<p>&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1086;&#1090;&#1082;&#1088;&#1086;&#1081;&#1090;&#1077; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; Python &#1074; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1095;&#1080;&#1090;&#1072;&#1077;&#1084;&#1086;&#1084; &#1074;&#1072;&#1084;&#1080; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;&#1077; &#1082;&#1086;&#1076;&#1072;, &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1080;&#1093; &#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1077;. &#1047;&#1072;&#1090;&#1077;&#1084; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;.
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="o">./</span><span class="n">AppRun</span>
</pre></div>
<p><span id="Repackaging_AppImages"></span>
</p>
<h3><span id=".D0.9F.D0.B5.D1.80.D0.B5.D1.83.D0.BF.D0.B0.D0.BA.D0.BE.D0.B2.D0.BA.D0.B0_AppImage"></span><span class="mw-headline" id="&#1055;&#1077;&#1088;&#1077;&#1091;&#1087;&#1072;&#1082;&#1086;&#1074;&#1082;&#1072;_AppImage">&#1055;&#1077;&#1088;&#1077;&#1091;&#1087;&#1072;&#1082;&#1086;&#1074;&#1082;&#1072; AppImage</span></h3>
<p>&#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1083;&#1080; &#1082;&#1086;&#1076; &#1080; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1085;&#1086; &#1091;&#1087;&#1072;&#1082;&#1086;&#1074;&#1072;&#1090;&#1100; AppImage &#1089; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1084;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;, &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; <a rel="nofollow" class="external text" href="https://github.com/AppImage/AppImageKit/releases/download/continuous/appimagetool-x86_64.AppImage">appimagetool- x86_64</a> &#1082; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1085;&#1086;&#1081; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077;.
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">cd</span> <span class="o">..</span>
<span class="n">wget</span> <span class="s2">"https://github.com/AppImage/AppImageKit/releases/download/continuous/appimagetool-x86_64.AppImage"</span>
<span class="n">chmod</span> <span class="o">+</span><span class="n">x</span> <span class="n">appimagetool</span><span class="o">-</span><span class="n">x86_64</span><span class="o">.</span><span class="n">AppImage</span>
<span class="o">./</span><span class="n">appimagetool</span><span class="o">-</span><span class="n">x86_64</span><span class="o">.</span><span class="n">AppImage</span> <span class="n">squashfs</span><span class="o">-</span><span class="n">root</span>
</pre></div>
<p><span id="Personalized_AppImages"></span>
</p>
<h2><span id=".D0.9F.D0.B5.D1.80.D1.81.D0.BE.D0.BD.D0.B0.D0.BB.D0.B8.D0.B7.D0.B8.D1.80.D0.BE.D0.B2.D0.B0.D0.BD.D0.BD.D1.8B.D0.B5_AppImage"></span><span class="mw-headline" id="&#1055;&#1077;&#1088;&#1089;&#1086;&#1085;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077;_AppImage">&#1055;&#1077;&#1088;&#1089;&#1086;&#1085;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; AppImage</span></h2>
<p>&#1041;&#1083;&#1072;&#1075;&#1086;&#1076;&#1072;&#1088;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077; <i>realthunder</i>, &#1072;&#1074;&#1090;&#1086;&#1088;&#1072; <a href="../ru/App_Link.html" title="App Link/ru">App Link</a> &#1080; <a href="../ru/Assembly3_Workbench.html" title="Assembly3 Workbench/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; Assembly3</a>, &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1077; AppImage &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1085;&#1072;&#1073;&#1086;&#1088;&#1072; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1074;.
</p><p>&#1069;&#1090;&#1086; &#1076;&#1077;&#1083;&#1072;&#1077;&#1090; &#1086;&#1095;&#1077;&#1085;&#1100; &#1091;&#1076;&#1086;&#1073;&#1085;&#1099;&#1084; &#1074;&#1099;&#1087;&#1091;&#1089;&#1082; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1086;&#1081; &#1074;&#1077;&#1090;&#1074;&#1080; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072; &#1076;&#1083;&#1103; &#1090;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080;. &#1061;&#1086;&#1090;&#1103; AppImages &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; Linux, &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1099; realthunder'&#1072; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; AppImage &#1090;&#1072;&#1082;&#1078;&#1077; &#1074; Windows &#1080; MacOS.
</p><p>&#1056;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1081; &#1101;&#1090;&#1080;&#1093; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1074; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1087;&#1086; &#1072;&#1076;&#1088;&#1077;&#1089;&#1091; <a rel="nofollow" class="external text" href="https://github.com/realthunder/FreeCADMakeImage">realthunder/FreeCADMakeImage</a>. &#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1091;&#1102; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1089;&#1084;&#1086;&#1090;&#1088;&#1080; &#1074; <a rel="nofollow" class="external text" href="https://github.com/realthunder/FreeCADMakeImage/blob/master/Readme.md">Readme.md</a>.
</p><p><span id="Related"></span>
</p>
<h2><span id=".D0.A1.D0.B2.D1.8F.D0.B7.D0.B0.D0.BD.D0.BD.D1.8B.D0.B5_.D1.81.D1.81.D1.8B.D0.BB.D0.BA.D0.B8"></span><span class="mw-headline" id="&#1057;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1077;_&#1089;&#1089;&#1099;&#1083;&#1082;&#1080;">&#1057;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080;</span></h2>
<ul><li>&#1055;&#1072;&#1082;&#1077;&#1090;&#1099; <a href="../ru/Ubuntu_Snap.html" title="Ubuntu Snap/ru">Snap</a>.</li>
<li>&#1055;&#1072;&#1082;&#1077;&#1090;&#1099; <a href="../Flatpak.html" title="Flatpak">Flatpak</a>.</li></ul>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><span typeof="mw:File"><a href="../index.php?title=User_hub.png&amp;filetimestamp=20190221145008&amp;.html" class="mw-file-description"><img src="../File/User_hub.png" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/User_hub.html" title="User hub/ru">&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b><a href="../ru/Getting_started.html" title="Getting started/ru">&#1053;&#1072;&#1095;&#1080;&#1085;&#1072;&#1102;&#1097;&#1080;&#1084;</a></b></li>
<li><b>&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072;:</b> <a href="../ru/Download.html" title="Download/ru">&#1047;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072;</a>, <a href="../ru/Installing_on_Windows.html" title="Installing on Windows/ru">Windows</a>, <a href="../ru/Installing_on_Linux.html" title="Installing on Linux/ru">Linux</a>, <a href="../ru/Installing_on_Mac.html" title="Installing on Mac/ru">Mac</a>, <a href="../ru/Installing_additional_components.html" title="Installing additional components/ru">
&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074;</a>, <a href="../ru/Compile_on_Docker.html" title="Compile on Docker/ru">Docker</a>, <a class="mw-selflink selflink">AppImage</a>, <a href="../ru/Ubuntu_Snap.html" title="Ubuntu Snap/ru">Ubuntu Snap</a></li>
<li><b>&#1041;&#1072;&#1079;&#1086;&#1074;&#1072;&#1103;:</b> <a href="../ru/About_FreeCAD.html" title="About FreeCAD/ru">&#1054; FreeCAD</a>, <a href="../ru/Interface.html" title="Interface/ru">&#1048;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;</a>, <a href="../ru/Mouse_navigation.html" title="Mouse navigation/ru">&#1053;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1103; &#1084;&#1099;&#1096;&#1080;</a>, <a href="../ru/Selection_methods.html" title="Selection methods/ru">&#1052;&#1077;&#1090;&#1086;&#1076;&#1099; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103;</a>, <a href="../ru/Object_name.html" title="Object name/ru">&#1048;&#1084;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;</a>, <a href="../ru/Preferences_Editor.html" title="Preferences Editor/ru">&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;</a>, <a href="../ru/Workbenches.html" title="Workbenches/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>, <a href="../ru/Document_structure.html" title="Document structure/ru">&#1057;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;</a>, <a href="../ru/Property.html" title="Property/ru">&#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;</a>, <a href="../ru/Help_FreeCAD.html" title="Help FreeCAD/ru">&#1055;&#1086;&#1084;&#1086;&#1075;&#1080; FreeCAD</a>, <a href="../ru/Donate.html" title="Donate/ru">&#1055;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</a></li></ul>
<hr>
<ul><li><b>&#1055;&#1086;&#1084;&#1086;&#1097;&#1100;:</b> <a href="../ru/Tutorials.html" title="Tutorials/ru">&#1059;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082;&#1080;</a>, <a href="../ru/Video_tutorials.html" title="Video tutorials/ru">&#1042;&#1080;&#1076;&#1077;&#1086; &#1091;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082;&#1080;</a></li>
<li><b><a href="../ru/Workbenches.html" title="Workbenches/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>:</b> <a href="../ru/Std_Base.html" title="Std Base/ru">Std Base</a>, <a href="../ru/Arch_Workbench.html" title="Arch Workbench/ru">Arch</a>, <a href="../ru/Assembly_Workbench.html" title="Assembly Workbench/ru">Assembly</a>, <a href="../ru/CAM_Workbench.html" title="CAM Workbench/ru">CAM</a>, <a href="../ru/Draft_Workbench.html" title="Draft Workbench/ru">Draft</a>, <a href="../ru/FEM_Workbench.html" title="FEM Workbench/ru">FEM</a>, <a href="../ru/Inspection_Workbench.html" title="Inspection Workbench/ru">Inspection</a>, <a href="../ru/Mesh_Workbench.html" title="Mesh Workbench/ru">Mesh</a>, <a href="../ru/OpenSCAD_Workbench.html" title="OpenSCAD Workbench/ru">OpenSCAD</a>, <a href="../ru/Part_Workbench.html" title="Part Workbench/ru">Part</a>, <a href="../ru/PartDesign_Workbench.html" title="PartDesign Workbench/ru">PartDesign</a>, <a href="../ru/Points_Workbench.html" title="Points Workbench/ru">Points</a>, <a href="../ru/Reverse_Engineering_Workbench.html" title="Reverse Engineering Workbench/ru">Reverse Engineering</a>, <a href="../ru/Robot_Workbench.html" title="Robot Workbench/ru">Robot</a>, <a href="../ru/Sketcher_Workbench.html" title="Sketcher Workbench/ru">Sketcher</a>, <a href="../ru/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/ru">Spreadsheet</a>, <a href="../ru/Surface_Workbench.html" title="Surface Workbench/ru">Surface</a>, <a href="../ru/TechDraw_Workbench.html" title="TechDraw Workbench/ru">TechDraw</a>, <a href="../ru/Testing.html" title="Testing/ru">Test Framework</a></li></ul>
<hr>
<ul><li><b><a href="../ru/Addon.html" title="Addon/ru">Addons</a>:</b> <a href="../ru/Std_AddonMgr.html" title="Std AddonMgr/ru">&#1052;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1081;</a>, <a href="../ru/External_workbenches.html" title="External workbenches/ru">&#1042;&#1085;&#1077;&#1096;&#1085;&#1080;&#1077; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>, <a href="../ru/Scripting_and_macros.html" title="Scripting and macros/ru">C&#1082;&#1088;&#1080;&#1087;&#1090;&#1099; &#1080; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1099;</a></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="../ru/User_hub.html" title="User hub/ru">&#1059;&#1075;&#1086;&#1083;&#1086;&#1082; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;</a>, <a href="../ru/Power_users_hub.html" title="Power users hub/ru">&#1059;&#1075;&#1086;&#1083;&#1086;&#1082; &#1086;&#1087;&#1099;&#1090;&#1085;&#1099;&#1093; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;</a>, <a href="../ru/Developer_hub.html" title="Developer hub/ru">&#1059;&#1075;&#1086;&#1083;&#1086;&#1082; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20250806091548
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.074 seconds
Real time usage: 0.090 seconds
Preprocessor visited node count: 279/1000000
Post&#8208;expand include size: 7829/2097152 bytes
Template argument size: 3438/2097152 bytes
Highest expansion depth: 4/100
Expensive parser function count: 9/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 7554/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   11.278      1 -total
 27.90%    3.147      9 Template:Code
 21.44%    2.418      1 Template:Userdocnavi/ru
  9.36%    1.056      3 Template:Emphasis
  8.59%    0.969      1 Template:TOCright
  8.33%    0.940      4 Template:Incode
  8.13%    0.917      1 Template:Navigation_menu_2
  7.31%    0.824      1 Template:MenuCommand
  6.67%    0.752      1 Template:Button
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:196880-0!canonical and timestamp 20250806091548 and revision id 1624308. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>