<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">BIM ingame tutorial/ru</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="ru" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-BIM+ingame+tutorial&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/BIM_ingame_tutorial.html" class="mw-pt-progress mw-pt-progress--high" title="BIM  anwendungsbegleitende Anleitung (99% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../BIM_ingame_tutorial.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="BIM ingame tutorial (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../fr/BIM_ingame_tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="BIM Tutoriel (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/BIM_ingame_tutorial.html" class="mw-pt-progress mw-pt-progress--low" title="Tutorial divertente di BIM (1% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/BIM_ingame_tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Poradnik: Obs&#322;uga BIM (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--med" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</span></li></ul></div>
<div style="text-align:center; background:#FDE0A8;margin:1em 7em;padding:0.5em 2em;border:2px solid #FF5706;">
<p>&#1069;&#1090;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1085;&#1077; &#1079;&#1072;&#1082;&#1086;&#1085;&#1095;&#1077;&#1085;&#1072;. &#1055;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1087;&#1086;&#1084;&#1086;&#1075;&#1080;&#1090;&#1077; &#1080; &#1074;&#1085;&#1077;&#1089;&#1080;&#1090;&#1077; &#1089;&#1074;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076; &#1074; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1091; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080;.
</p><p><a href="../ru/GuiCommand_model.html" title="GuiCommand model/ru">&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; Gui</a> &#1086;&#1073;&#1098;&#1103;&#1089;&#1085;&#1103;&#1077;&#1090;, &#1082;&#1072;&#1082; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1079;&#1072;&#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1099; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;. &#1055;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; <a href="../ru/Category;UnfinishedDocu.html" title="Category:UnfinishedDocu/ru"> Category:UnfinishedDocu/ru</a>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1085;&#1077;&#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1105;&#1085;&#1085;&#1099;&#1093; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;, &#1087;&#1086;&#1076;&#1086;&#1073;&#1085;&#1099;&#1093; &#1101;&#1090;&#1086;&#1081;. &#1057;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; <a href="../ru/Category;Command_Reference.html" title="Category:Command Reference/ru"> Category:Command Reference/ru</a> &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;.
</p><p>&#1057;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; <a href="../ru/WikiPages.html" title="WikiPages/ru">Wiki &#1057;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;</a>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1079;&#1085;&#1072;&#1090;&#1100; &#1086; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1074;&#1080;&#1082;&#1080;-&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;, &#1080; &#1079;&#1072;&#1081;&#1076;&#1080;&#1090;&#1077; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; <a href="../ru/Help_FreeCAD.html" title="Help FreeCAD/ru">&#1055;&#1086;&#1084;&#1086;&#1075;&#1080; FreeCAD</a>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1079;&#1085;&#1072;&#1090;&#1100; &#1086; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1072;&#1093;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084;&#1080; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1074;&#1085;&#1077;&#1089;&#1090;&#1080; &#1089;&#1074;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076;.
</p>
</div>
<p><span typeof="mw:File"><a href="../index.php?title=BIM_tutorial_screenshot.png&amp;filetimestamp=20181120153101&amp;.html" class="mw-file-description"><img src="../File/BIM_tutorial_screenshot.png" decoding="async" width="800" height="440" class="mw-file-element" data-file-width="1912" data-file-height="1052"></a></span>
</p>
<div class="mw-translate-fuzzy">
<p><b>Tutorial steps</b>
</p>
<div class="infotext">&#1069;&#1090;&#1086; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1077;&#1077; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086; <a href="../ru/BIM_Workbench.html" title="BIM Workbench/ru">&#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1091; BIM</a>. &#1054;&#1085; &#1085;&#1077; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085; &#1076;&#1083;&#1103; &#1095;&#1090;&#1077;&#1085;&#1080;&#1103; &#1079;&#1076;&#1077;&#1089;&#1100;, &#1074; &#1074;&#1080;&#1082;&#1080;, &#1072; &#1089;&#1082;&#1086;&#1088;&#1077;&#1077; &#1076;&#1083;&#1103; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072; &#1080;&#1079; FreeCAD, &#1074; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1081; &#1089;&#1088;&#1077;&#1076;&#1077; BIM, &#1074; &#1084;&#1077;&#1085;&#1102; <b>&#1057;&#1087;&#1088;&#1072;&#1074;&#1082;&#1072; -&gt; &#1054;&#1073;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; BIM</b>. &#1054;&#1085; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090; &#1074; &#1089;&#1077;&#1073;&#1103; &#1088;&#1103;&#1076; &#1096;&#1072;&#1075;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;. &#1050;&#1072;&#1078;&#1076;&#1099;&#1081; &#1096;&#1072;&#1075; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1072;&#1077;&#1090;&#1089;&#1103; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1086;&#1084; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1072; <a href="../Template;BIMTutorialAction.html" title="Template:BIMTutorialAction">{{BIMTutorialAction|descr|goal1|test1|goal2|test2}}</a>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1080;&#1088;&#1091;&#1077;&#1090; &#1087;&#1086;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1093; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1081;. &#1048;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; 300 &#1087;&#1080;&#1082;&#1089;&#1077;&#1083;&#1077;&#1081; &#1074; &#1096;&#1080;&#1088;&#1080;&#1085;&#1091;. &#1053;&#1072; &#1101;&#1090;&#1086;&#1081; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; &#1085;&#1077;&#1083;&#1100;&#1079;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; SVG, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1086;&#1085;&#1080; &#1085;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074;&#1080;&#1076;&#1078;&#1077;&#1090;&#1086;&#1084; QTextBrowser.</div>
<i><div class="goal1"></div></i>
<div class="test1" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;"></div>
<i><div class="goal2"></div></i>
<div class="test2" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;"></div>
<p><br>
</p>
</div>
<p><span id="Welcome_to_the_BIM_Workbench!"></span>
</p>
<meta property="mw:PageProp/toc">
<h3><span id=".D0.94.D0.BE.D0.B1.D1.80.D0.BE_.D0.BF.D0.BE.D0.B6.D0.B0.D0.BB.D0.BE.D0.B2.D0.B0.D1.82.D1.8C_.D0.B2_.D0.B2.D0.B5.D1.80.D1.81.D1.82.D0.B0.D0.BA_BIM.21"></span><span class="mw-headline" id="&#1044;&#1086;&#1073;&#1088;&#1086;_&#1087;&#1086;&#1078;&#1072;&#1083;&#1086;&#1074;&#1072;&#1090;&#1100;_&#1074;_&#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;_BIM!">&#1044;&#1086;&#1073;&#1088;&#1086; &#1087;&#1086;&#1078;&#1072;&#1083;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; BIM!</span></h3>
<p><span typeof="mw:File"><a href="../index.php?title=BIM_Tutorial_title.jpg&amp;filetimestamp=20190304232244&amp;.html" class="mw-file-description"><img src="../File/BIM_Tutorial_title.jpg" decoding="async" width="300" height="173" class="mw-file-element" data-file-width="923" data-file-height="533"></a></span>
</p>
<div class="mw-translate-fuzzy">
<p>&#1069;&#1090;&#1086; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086;&#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1080;&#1090; &#1074;&#1072;&#1089; &#1089; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1084;&#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103;&#1084;&#1080; <a href="../ru/BIM_Workbench.html" title="BIM Workbench/ru">&#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; BIM</a> &#1080; &#1087;&#1086;&#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1072;&#1084; &#1074;&#1089;&#1090;&#1072;&#1090;&#1100; &#1085;&#1072; &#1087;&#1091;&#1090;&#1100;, &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1091;&#1103; &#1086;&#1095;&#1077;&#1085;&#1100; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1077; &#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1087;&#1072;&#1074;&#1080;&#1083;&#1100;&#1086;&#1085;&#1072;. &#1069;&#1090;&#1086; &#1079;&#1072;&#1081;&#1084;&#1077;&#1090; &#1086;&#1090; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1076;&#1086; &#1076;&#1074;&#1091;&#1093; &#1095;&#1072;&#1089;&#1086;&#1074;, &#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1077;&#1075;&#1086; &#1086;&#1087;&#1099;&#1090;&#1072; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; 3D-&#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;.
</p>
</div>
<div class="mw-translate-fuzzy">
<p>&#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1088;&#1077;&#1088;&#1074;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1074; &#1083;&#1102;&#1073;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1080; &#1074;&#1086;&#1079;&#1086;&#1073;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086; &#1087;&#1086;&#1079;&#1078;&#1077;, &#1074;&#1099;&#1073;&#1088;&#1072;&#1074; &#1084;&#1077;&#1085;&#1102; <b>&#1057;&#1087;&#1088;&#1072;&#1074;&#1082;&#1072; -&gt; &#1069;&#1082;&#1088;&#1072;&#1085; &#1087;&#1088;&#1080;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1103; BIM</b> &#1080; &#1089;&#1085;&#1086;&#1074;&#1072; &#1097;&#1077;&#1083;&#1082;&#1085;&#1091;&#1074; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; <b>&#1054;&#1073;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; BIM</b>.
</p>
</div>
<p>&#1053;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1096;&#1072;&#1075;&#1080; &#1101;&#1090;&#1086;&#1075;&#1086; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1072; &#1090;&#1088;&#1077;&#1073;&#1091;&#1102;&#1090; &#1086;&#1090; &#1074;&#1072;&#1089; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1081;. &#1054;&#1085;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1099; &#1087;&#1086;&#1076; &#1101;&#1090;&#1080;&#1084; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1099;&#1084; &#1087;&#1086;&#1083;&#1077;&#1084; &#1089;&#1086; &#1079;&#1085;&#1072;&#1095;&#1082;&#1086;&#1084;, &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1084;, &#1073;&#1099;&#1083;&#1072; &#1083;&#1080; &#1079;&#1072;&#1076;&#1072;&#1095;&#1072; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1072; &#1080;&#1083;&#1080; &#1085;&#1077;&#1090;. &#1053;&#1086; &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1084;&#1099; &#1079;&#1076;&#1077;&#1089;&#1100;, &#1074; FreeCAD, &#1093;&#1086;&#1088;&#1086;&#1096;&#1080;&#1077; &#1083;&#1102;&#1076;&#1080;, &#1085;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1076;&#1074;&#1080;&#1078;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086; &#1101;&#1090;&#1080;&#1084; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;&#1084;. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086; &#1080; &#1087;&#1088;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; &#1087;&#1086; &#1089;&#1074;&#1086;&#1077;&#1084;&#1091; &#1091;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1080;&#1102;.
</p><p><span id="About_FreeCAD_versions"></span>
</p>
<h4><span id=".D0.9E_.D0.B2.D0.B5.D1.80.D1.81.D0.B8.D1.8F.D1.85_FreeCAD"></span><span class="mw-headline" id="&#1054;_&#1074;&#1077;&#1088;&#1089;&#1080;&#1103;&#1093;_FreeCAD">&#1054; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103;&#1093; FreeCAD</span></h4>
<div class="mw-translate-fuzzy">
<p>&#1069;&#1090;&#1086; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1086; &#1076;&#1083;&#1103; <a href="../ru/Download.html" title="Download/ru">&#1089;&#1072;&#1084;&#1086;&#1081; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1081; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086;&#1081; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1077;&#1084;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; FreeCAD</a> (&#1074; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1077;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; 0.19). &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1072; BIM &#1089;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1080;&#1084;&#1099; &#1089; &#1083;&#1102;&#1073;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1077;&#1081; FreeCAD. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1077; &#1073;&#1086;&#1083;&#1077;&#1077; &#1089;&#1090;&#1072;&#1088;&#1091;&#1102; &#1074;&#1077;&#1088;&#1089;&#1080;&#1102; FreeCAD, &#1095;&#1077;&#1084; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1072;&#1103; &#1079;&#1076;&#1077;&#1089;&#1100;, &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; BIM &#1084;&#1086;&#1075;&#1091;&#1090; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1077;&#1090;&#1100; &#1080;&#1085;&#1072;&#1095;&#1077;, &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1087;&#1086;-&#1076;&#1088;&#1091;&#1075;&#1086;&#1084;&#1091; &#1080;&#1083;&#1080; &#1076;&#1072;&#1078;&#1077; &#1073;&#1099;&#1090;&#1100; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1084;&#1080;. &#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077;&#1089;&#1100; &#1082; <a href="../ru/BIM_Workbench.html" title="BIM Workbench/ru">&#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080;</a>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1079;&#1085;&#1072;&#1090;&#1100; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1089;&#1086;&#1084;&#1085;&#1077;&#1085;&#1080;&#1081;.
</p>
</div>
<p><span id="Note"></span>
</p>
<h4><span id=".D0.9F.D1.80.D0.B8.D0.BC.D0.B5.D1.87.D0.B0.D0.BD.D0.B8.D1.8F"></span><span class="mw-headline" id="&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1103;">&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1103;</span></h4>
<div class="mw-translate-fuzzy">
<p>&#1069;&#1090;&#1086; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086; &#1074;&#1089;&#1077; &#1077;&#1097;&#1077; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1089;&#1090;&#1072;&#1076;&#1080;&#1080; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1080; &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; <b>&#1085;&#1077;&#1087;&#1086;&#1083;&#1085;&#1099;&#1084;</b>! &#1045;&#1089;&#1083;&#1080; &#1091; &#1074;&#1072;&#1089; &#1077;&#1089;&#1090;&#1100; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080;&#1083;&#1080; &#1095;&#1090;&#1086;-&#1090;&#1086; &#1085;&#1077;&#1087;&#1086;&#1085;&#1103;&#1090;&#1085;&#1086;, &#1087;&#1086;&#1095;&#1077;&#1084;&#1091; &#1073;&#1099; &#1085;&#1077; &#1087;&#1086;&#1084;&#1086;&#1095;&#1100; &#1085;&#1072;&#1084; &#1091;&#1083;&#1091;&#1095;&#1096;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086; &#1085;&#1072; <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewforum.php?f=23">&#1092;&#1086;&#1088;&#1091;&#1084;&#1077; FreeCAD</a>!
</p>
</div>
<p><b>Tutorial steps</b>
</p>
<div class="infotext">&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1085;&#1077;&#1090; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1081;</div>
<i><div class="goal1"></div></i>
<div class="test1" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;"></div>
<i><div class="goal2"></div></i>
<div class="test2" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;"></div>
<p><br>
</p><p><br>
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span class="mw-headline" id="Set_FreeCAD_up">Set FreeCAD up</span></h3>
</div>
<div class="mw-translate-fuzzy">
<p>FreeCAD &#1080;&#1084;&#1077;&#1077;&#1090; &#1086;&#1073;&#1096;&#1080;&#1088;&#1085;&#1091;&#1102; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082; &#1089; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086;&#1084; &#1086;&#1087;&#1094;&#1080;&#1081; &#1076;&#1083;&#1103; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080;, &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1091;&#1102; &#1074; &#1084;&#1077;&#1085;&#1102; <b>&#1055;&#1088;&#1072;&#1074;&#1082;&#1072;-&gt; &#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;</b>. &#1050;&#1072;&#1078;&#1076;&#1072;&#1103; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1088;&#1072;&#1073;&#1086;&#1095;&#1072;&#1103; &#1089;&#1088;&#1077;&#1076;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082;, &#1095;&#1090;&#1086; &#1076;&#1077;&#1083;&#1072;&#1077;&#1090; &#1077;&#1077; &#1086;&#1095;&#1077;&#1085;&#1100; &#1089;&#1083;&#1086;&#1078;&#1085;&#1086;&#1081;.
</p>
</div>
<div class="mw-translate-fuzzy">
<p>&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1072; BIM &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; <a href="../ru/BIM_Setup.html" title="BIM Setup/ru">&#1091;&#1087;&#1088;&#1086;&#1097;&#1077;&#1085;&#1085;&#1099;&#1081; &#1101;&#1082;&#1088;&#1072;&#1085; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;</a>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1079; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1099;&#1093; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082; &#1076;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; BIM. &#1069;&#1082;&#1088;&#1072;&#1085; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082; BIM &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1084;&#1077;&#1085;&#1102; <b>Manage -&gt; &#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072; BIM</b> (&#1074;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1078;&#1072;&#1090;&#1100; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1091;&#1102; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;):
</p>
</div>
<p><span typeof="mw:File"><a href="../index.php?title=BIM_Tutorial_01.jpg&amp;filetimestamp=20180827165941&amp;.html" class="mw-file-description"><img src="../File/BIM_Tutorial_01.jpg" decoding="async" width="300" height="189" class="mw-file-element" data-file-width="380" data-file-height="240"></a></span>
</p>
<div class="mw-translate-fuzzy">
<p>&#1054;&#1090;&#1082;&#1088;&#1086;&#1081;&#1090;&#1077; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1091;&#1087;&#1088;&#1086;&#1097;&#1077;&#1085;&#1085;&#1099;&#1081; &#1101;&#1082;&#1088;&#1072;&#1085; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082; BIM &#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1087;&#1086; &#1089;&#1074;&#1086;&#1077;&#1084;&#1091; &#1074;&#1082;&#1091;&#1089;&#1091;.
</p>
</div>
<p>&#1042; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1085;&#1072;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1084;&#1099;&#1096;&#1080; &#1085;&#1072; &#1083;&#1102;&#1073;&#1086;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1080;&#1083;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1076;&#1083;&#1103; &#1095;&#1077;&#1075;&#1086; &#1086;&#1085; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103;:
</p><p><span typeof="mw:File"><a href="../index.php?title=BIM_Tutorial_02.jpg&amp;filetimestamp=20250814055659&amp;.html" class="mw-file-description"><img src="../File/BIM_Tutorial_02.jpg" decoding="async" width="300" height="189" class="mw-file-element" data-file-width="742" data-file-height="468"></a></span>
</p>
<div class="mw-translate-fuzzy">
<p>&#1042; &#1101;&#1090;&#1086;&#1084; &#1091;&#1088;&#1086;&#1082;&#1077; &#1084;&#1099; &#1073;&#1091;&#1076;&#1077;&#1084; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1074; &#1089;&#1072;&#1085;&#1090;&#1080;&#1084;&#1077;&#1090;&#1088;&#1072;&#1093;. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1084;&#1099; &#1087;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1077;&#1084; &#1074;&#1072;&#1084; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1095;&#1090;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;&#1099; &#1080;&#1079;&#1084;&#1077;&#1088;&#1077;&#1085;&#1080;&#1103; &#1082;&#1072;&#1082; &laquo;&#1089;&#1072;&#1085;&#1090;&#1080;&#1084;&#1077;&#1090;&#1088;&#1099;&raquo;, &#1072; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1082;&#1074;&#1072;&#1076;&#1088;&#1072;&#1090;&#1072; &#1089;&#1077;&#1090;&#1082;&#1080; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; - &laquo;10 &#1089;&#1084;&raquo;. &#1069;&#1090;&#1080; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1074; &#1083;&#1102;&#1073;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1081; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080;, &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1081; &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1093; &#1087;&#1072;&#1085;&#1077;&#1083;&#1103;&#1093; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1080; &#1080;&#1085;&#1076;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1072; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;, &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1074; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103; (&#1089;&#1087;&#1088;&#1072;&#1074;&#1072; &#1074;&#1085;&#1080;&#1079;&#1091;):
</p>
</div>
<p><span typeof="mw:File"><a href="../index.php?title=BIM_tutorial_14.jpg&amp;filetimestamp=20190108125259&amp;.html" class="mw-file-description"><img src="../File/BIM_tutorial_14.jpg" decoding="async" width="300" height="176" class="mw-file-element" data-file-width="310" data-file-height="182"></a></span>
</p>
<div class="mw-translate-fuzzy">
<p><b>Tutorial steps</b>
</p>
<div class="infotext"></div>
<i><div class="goal1">&#1054;&#1090;&#1082;&#1088;&#1099;&#1090;&#1100; &#1101;&#1082;&#1088;&#1072;&#1085; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; BIM</div></i>
<div class="test1" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;">True if hasattr(FreeCADGui,"BIMSetupDialog") else False</div>
<i><div class="goal2">&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;&#1099; &#1080;&#1079;&#1084;&#1077;&#1088;&#1077;&#1085;&#1080;&#1103; &#1074; &#1089;&#1072;&#1085;&#1090;&#1080;&#1084;&#1077;&#1090;&#1088;&#1099;, &#1072; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1089;&#1077;&#1090;&#1082;&#1080; - 10 &#1089;&#1084;.</div></i>
<div class="test2" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;">True if ((FreeCAD.ParamGet("User parameter:BaseApp/Preferences/Units").GetInt("UserSchema",0) == 4) and (FreeCAD.ParamGet("User parameter:BaseApp/Preferences/Mod/Draft").GetFloat("gridSpacing",10) == 100)) else False</div>
<p><br>
</p>
</div>
<p><span id="Create_a_new_document"></span>
</p>
<h3><span id=".D0.A1.D0.BE.D0.B7.D0.B4.D0.B0.D1.82.D1.8C_.D0.BD.D0.BE.D0.B2.D1.8B.D0.B9_.D0.B4.D0.BE.D0.BA.D1.83.D0.BC.D0.B5.D0.BD.D1.82"></span><span class="mw-headline" id="&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100;_&#1085;&#1086;&#1074;&#1099;&#1081;_&#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1081; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;</span></h3>
<p>&#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1095;&#1090;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1083;&#1080; FreeCAD, &#1074;&#1099;, &#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;, &#1089;&#1077;&#1081;&#1095;&#1072;&#1089; &#1087;&#1088;&#1086;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1077;&#1090;&#1077; <b>&#1057;&#1090;&#1072;&#1088;&#1090;&#1086;&#1074;&#1091;&#1102; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; FreeCAD</b>:
</p><p><span typeof="mw:File"><a href="../index.php?title=BIM_tutorial_13.jpg&amp;filetimestamp=20190108124038&amp;.html" class="mw-file-description"><img src="../File/BIM_tutorial_13.jpg" decoding="async" width="300" height="186" class="mw-file-element" data-file-width="300" data-file-height="186"></a></span>
</p>
<div class="mw-translate-fuzzy">
<p>&#1053;&#1072; &#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1099; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1077; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;, &#1089; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084;&#1080; &#1074;&#1099; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1083;&#1080;, &#1072; &#1085;&#1072; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1072;&#1093; &#1086;&#1073;&#1098;&#1103;&#1089;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103;, &#1082;&#1072;&#1082; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;. &#1053;&#1086; &#1076;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1085;&#1072;&#1095;&#1072;&#1090;&#1100; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091;, &#1085;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1081; &#1087;&#1091;&#1089;&#1090;&#1086;&#1081; <b>&#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;</b>. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1077;&#1097;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1085;&#1077; &#1089;&#1076;&#1077;&#1083;&#1072;&#1083;&#1080;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1085;&#1086;&#1074;&#1099;&#1081; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &laquo;&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1081; ...&raquo; &#1085;&#1072; &#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; &#1080;&#1083;&#1080; &#1087;&#1077;&#1088;&#1077;&#1081;&#1076;&#1103; &#1074; &#1084;&#1077;&#1085;&#1102; <b>&#1060;&#1072;&#1081;&#1083; -&gt; &#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100;</b>:
</p>
</div>
<p><span typeof="mw:File"><a href="../index.php?title=BIM_tutorial_09.jpg&amp;filetimestamp=20190107214641&amp;.html" class="mw-file-description"><img src="../File/BIM_tutorial_09.jpg" decoding="async" width="300" height="224" class="mw-file-element" data-file-width="380" data-file-height="284"></a></span>
</p><p>&#1055;&#1086;&#1089;&#1083;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1074;&#1099; &#1086;&#1082;&#1072;&#1078;&#1077;&#1090;&#1077;&#1089;&#1100; &#1074; &#1090;&#1088;&#1077;&#1093;&#1084;&#1077;&#1088;&#1085;&#1086;&#1084; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1077; FreeCAD &#1080; &#1073;&#1091;&#1076;&#1077;&#1090;&#1077; &#1075;&#1086;&#1090;&#1086;&#1074;&#1099; &#1082; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077;:
</p><p><span typeof="mw:File"><a href="../index.php?title=BIM_tutorial_10.jpg&amp;filetimestamp=20190107220643&amp;.html" class="mw-file-description"><img src="../File/BIM_tutorial_10.jpg" decoding="async" width="300" height="164" class="mw-file-element" data-file-width="300" data-file-height="164"></a></span>
</p><p><b>Tutorial steps</b>
</p>
<div class="infotext"></div>
<i><div class="goal1">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1081; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;</div></i>
<div class="test1" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;">True if FreeCAD.ActiveDocument else False</div>
<i><div class="goal2"></div></i>
<div class="test2" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;"></div>
<p><br>
</p><p><br>
<span id="Navigating_in_the_3D_View"></span>
</p>
<h3><span id=".D0.9D.D0.B0.D0.B2.D0.B8.D0.B3.D0.B0.D1.86.D0.B8.D1.8F_.D0.B2_.D0.BE.D0.BA.D0.BD.D0.B5_.D1.82.D1.80.D1.91.D1.85.D0.BC.D0.B5.D1.80.D0.BD.D0.BE.D0.B3.D0.BE_.D0.BF.D1.80.D0.BE.D1.81.D0.BC.D0.BE.D1.82.D1.80.D0.B0"></span><span class="mw-headline" id="&#1053;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1103;_&#1074;_&#1086;&#1082;&#1085;&#1077;_&#1090;&#1088;&#1105;&#1093;&#1084;&#1077;&#1088;&#1085;&#1086;&#1075;&#1086;_&#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1072;">&#1053;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1103; &#1074; &#1086;&#1082;&#1085;&#1077; &#1090;&#1088;&#1105;&#1093;&#1084;&#1077;&#1088;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1072;</span></h3>
<div class="mw-translate-fuzzy">
<p>&#1042; FreeCAD &#1077;&#1089;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1086;&#1074; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; &#1089; &#1084;&#1099;&#1096;&#1100;&#1102;. &#1054;&#1085;&#1080; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; <a href="../ru/Mouse_Model.html" class="mw-redirect" title="Mouse Model/ru">&#1089;&#1090;&#1080;&#1083;&#1080; &#1085;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1080;</a>. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1081; &#1089;&#1090;&#1080;&#1083;&#1100; &#1085;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1080; &#1074; &#1083;&#1102;&#1073;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103;, &#1085;&#1072;&#1078;&#1072;&#1074; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1089;&#1090;&#1080;&#1083;&#1103; &#1085;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1080; &#1074; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103;. &#1045;&#1089;&#1083;&#1080; &#1085;&#1072;&#1074;&#1077;&#1089;&#1090;&#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1084;&#1099;&#1096;&#1080; &#1085;&#1072; &#1101;&#1090;&#1091; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091;, &#1074;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1091;&#1074;&#1080;&#1076;&#1080;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1076;&#1077;&#1083;&#1072;&#1077;&#1090; &#1082;&#1072;&#1078;&#1076;&#1072;&#1103; &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; &#1084;&#1099;&#1096;&#1080;. &#1053;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1079; &#1085;&#1080;&#1093; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1099; &#1076;&#1083;&#1103; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1103; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084; &#1093;&#1086;&#1088;&#1086;&#1096;&#1086; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1099;&#1084; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084;. &#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1090;&#1086;&#1090;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1074;&#1072;&#1084; &#1091;&#1076;&#1086;&#1073;&#1077;&#1085;.
</p>
</div>
<p><span typeof="mw:File"><a href="../index.php?title=BIM_Tutorial_03.jpg&amp;filetimestamp=20181113203611&amp;.html" class="mw-file-description"><img src="../File/BIM_Tutorial_03.jpg" decoding="async" width="300" height="182" class="mw-file-element" data-file-width="712" data-file-height="433"></a></span>
</p><p>&#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1090;&#1086;&#1095;&#1082;&#1086;&#1081; &#1079;&#1088;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072; &#1074;&#1072;&#1096;&#1091; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100; &#1074; 3D-&#1074;&#1080;&#1076;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1084;&#1080; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1072;&#1084;&#1080;: &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <b>&#1084;&#1099;&#1096;&#1080;</b> (&#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1074;&#1072;&#1084;&#1080; &#1089;&#1090;&#1080;&#1083;&#1103; &#1085;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1080;), <b>&#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1099;</b> (&#1080;&#1079;&#1091;&#1095;&#1080;&#1090;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1084;&#1077;&#1085;&#1102; <b>&#1042;&#1080;&#1076;</b>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1079;&#1085;&#1072;&#1090;&#1100; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;), &#1080;&#1083;&#1080; <a href="../ru/Navigation_Cube.html" title="Navigation Cube/ru">&#1050;&#1091;&#1073;&#1072; &#1085;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1080;</a> (&#1097;&#1077;&#1083;&#1082;&#1072;&#1081;&#1090;&#1077; &#1088;&#1072;&#1079;&#1085;&#1099;&#1077; &#1089;&#1090;&#1088;&#1077;&#1083;&#1082;&#1080; &#1080; &#1075;&#1088;&#1072;&#1085;&#1080; &#1082;&#1091;&#1073;&#1072;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1099;&#1088;&#1086;&#1074;&#1085;&#1103;&#1090;&#1100; &#1074;&#1080;&#1076;).
</p><p><span typeof="mw:File"><a href="../index.php?title=BIM_Tutorial_04.jpg&amp;filetimestamp=20181113203633&amp;.html" class="mw-file-description"><img src="../File/BIM_Tutorial_04.jpg" decoding="async" width="300" height="239" class="mw-file-element" data-file-width="761" data-file-height="607"></a></span>
</p><p><b>Tutorial steps</b>
</p>
<div class="infotext"></div>
<i><div class="goal1">&#1042;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; &#1089;&#1090;&#1080;&#1083;&#1100; &#1085;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1080;</div></i>
<div class="test1" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;">True</div>
<i><div class="goal2">&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1074;&#1080;&#1076; &#1089;&#1074;&#1077;&#1088;&#1093;&#1091;</div></i>
<div class="test2" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;">True if FreeCADGui.ActiveDocument.ActiveView.getViewDirection().getAngle(FreeCAD.Vector(0,0,-1)) &lt; 0.01 else False</div>
<p><br>
</p><p><br>
<span id="Reorganize_the_interface"></span>
</p>
<h3><span id=".D0.A0.D0.B5.D0.BE.D1.80.D0.B3.D0.B0.D0.BD.D0.B8.D0.B7.D0.BE.D0.B2.D0.B0.D1.82.D1.8C_.D0.B8.D0.BD.D1.82.D0.B5.D1.80.D1.84.D0.B5.D0.B9.D1.81"></span><span class="mw-headline" id="&#1056;&#1077;&#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;_&#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;">&#1056;&#1077;&#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;</span></h3>
<p>&#1042;&#1089;&#1077; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; FreeCAD &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100; &#1080; &#1088;&#1077;&#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1086;&#1074;&#1099;&#1074;&#1072;&#1090;&#1100;. &#1055;&#1072;&#1085;&#1077;&#1083;&#1080; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;&#1075;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1080;&#1090;&#1100;, &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1097;&#1080;&#1074; &#1080;&#1093; &#1085;&#1072; &#1076;&#1088;&#1091;&#1075;&#1091;&#1102;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1072;&#1096; &#1101;&#1082;&#1088;&#1072;&#1085; &#1089;&#1083;&#1080;&#1096;&#1082;&#1086;&#1084; &#1084;&#1072;&#1083; &#1076;&#1083;&#1103; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1074;&#1089;&#1077;&#1093; &#1087;&#1072;&#1085;&#1077;&#1083;&#1077;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1080; &#1080;&#1093; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1075;&#1086; (&#1091;&#1089;&#1077;&#1095;&#1077;&#1085;&#1085;&#1099;&#1077; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1073;&#1091;&#1076;&#1091;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089;&#1086; &#1079;&#1085;&#1072;&#1082;&#1086;&#1084; &gt;&gt;), &#1073;&#1099;&#1083;&#1086; &#1073;&#1099; &#1085;&#1077;&#1087;&#1083;&#1086;&#1093;&#1086; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1080;&#1093; &#1074; &#1083;&#1091;&#1095;&#1096;&#1077;&#1077; &#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;.
</p><p><span typeof="mw:File"><a href="../index.php?title=BIM_Tutorial_05.jpg&amp;filetimestamp=20181114134442&amp;.html" class="mw-file-description"><img src="../File/BIM_Tutorial_05.jpg" decoding="async" width="300" height="178" class="mw-file-element" data-file-width="435" data-file-height="258"></a></span>
</p><p>&#1055;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1080; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1100; &#1080; &#1074;&#1099;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1100; &#1080;&#1079; &#1084;&#1077;&#1085;&#1102; <b>&#1042;&#1080;&#1076;</b>.
</p>
<div class="mw-translate-fuzzy">
<p>&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1072; BIM &#1090;&#1072;&#1082;&#1078;&#1077; &#1080;&#1084;&#1077;&#1102;&#1090; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1102;&#1090; &#1080; &#1074;&#1099;&#1082;&#1083;&#1102;&#1095;&#1072;&#1102;&#1090; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080;, &#1090;&#1072;&#1082;&#1080;&#1077; &#1082;&#1072;&#1082; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074;&#1099;&#1073;&#1086;&#1088;&#1072;, &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1090;&#1095;&#1077;&#1090;&#1072; &#1080; &#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1100; Python. &#1069;&#1090;&#1080; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1095;&#1072;&#1089;&#1090;&#1086; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1099; &#1087;&#1088;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077; &#1089; FreeCAD, &#1085;&#1086; &#1086;&#1085;&#1080; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1102;&#1090; &#1076;&#1088;&#1072;&#1075;&#1086;&#1094;&#1077;&#1085;&#1085;&#1086;&#1077; &#1084;&#1077;&#1089;&#1090;&#1086; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085;&#1077;. &#1054;&#1073;&#1099;&#1095;&#1085;&#1086; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1074;&#1099;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1074;&#1089;&#1077;, &#1087;&#1086;&#1082;&#1072; &#1086;&#1085;&#1080; &#1074;&#1072;&#1084; &#1085;&#1077; &#1087;&#1086;&#1085;&#1072;&#1076;&#1086;&#1073;&#1103;&#1090;&#1089;&#1103;. &#1055;&#1086;&#1084;&#1085;&#1080;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093; &#1087;&#1077;&#1095;&#1072;&#1090;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1086;&#1082;&#1085;&#1077; &#1086;&#1090;&#1095;&#1077;&#1090;&#1072;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091;, &#1077;&#1089;&#1083;&#1080; &#1095;&#1090;&#1086;-&#1090;&#1086; &#1087;&#1086;&#1081;&#1076;&#1077;&#1090; &#1085;&#1077; &#1090;&#1072;&#1082;, &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1079;&#1072;&#1075;&#1083;&#1103;&#1085;&#1080;&#1090;&#1077; &#1090;&#1091;&#1076;&#1072;.
</p>
</div>
<p><span typeof="mw:File"><a href="../index.php?title=BIM_tutorial_17.jpg&amp;filetimestamp=20190304170716&amp;.html" class="mw-file-description"><img src="../File/BIM_tutorial_17.jpg" decoding="async" width="300" height="177" class="mw-file-element" data-file-width="391" data-file-height="231"></a></span>
</p><p><b>Tutorial steps</b>
</p>
<div class="infotext">&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1085;&#1077;&#1090; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1081;</div>
<i><div class="goal1"></div></i>
<div class="test1" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;"></div>
<i><div class="goal2"></div></i>
<div class="test2" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;"></div>
<p><br>
</p><p><br>
<span id="The_BIM_Workbench_tools"></span>
</p>
<h3><span id=".D0.98.D0.BD.D1.81.D1.82.D1.80.D1.83.D0.BC.D0.B5.D0.BD.D1.82.D1.8B_.D0.B2.D0.B5.D1.80.D1.81.D1.82.D0.B0.D0.BA.D0.B0_BIM"></span><span class="mw-headline" id="&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;_&#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072;_BIM">&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; BIM</span></h3>
<div class="mw-translate-fuzzy">
<p><a href="../ru/BIM_Workbench.html" title="BIM Workbench/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; BIM</a> &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;, &#1079;&#1072;&#1080;&#1084;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1080;&#1079; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;, &#1090;&#1072;&#1082;&#1080;&#1093; &#1082;&#1072;&#1082; <a href="../ru/Arch_Workbench.html" title="Arch Workbench/ru">Arch</a>, <a href="../ru/Draft_Workbench.html" title="Draft Workbench/ru">Draft</a> &#1080;&#1083;&#1080; <a href="../ru/Part_Workbench.html" title="Part Workbench/ru">Part</a>, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1093; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1054;&#1085;&#1080; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1099; &#1085;&#1072; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1082;&#1072;&#1090;&#1077;&#1075;&#1086;&#1088;&#1080;&#1081;. &#1059; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1082;&#1072;&#1090;&#1077;&#1075;&#1086;&#1088;&#1080;&#1080; &#1077;&#1089;&#1090;&#1100; &#1084;&#1077;&#1085;&#1102; &#1080; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1053;&#1072;&#1081;&#1076;&#1080;&#1090;&#1077; &#1084;&#1080;&#1085;&#1091;&#1090;&#1082;&#1091;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1079;&#1091;&#1095;&#1080;&#1090;&#1100; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077; &#1084;&#1077;&#1085;&#1102;, &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1085;&#1080;&#1078;&#1077;.
</p>
</div>
<div class="mw-translate-fuzzy">
<p>&#1059; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1077;&#1075;&#1086;&#1089;&#1103; &#1074; &#1101;&#1090;&#1080;&#1093; &#1084;&#1077;&#1085;&#1102;, &#1077;&#1089;&#1090;&#1100; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1072;&#1103; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1086;, &#1082;&#1072;&#1082; &#1086;&#1085; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1080; &#1082;&#1072;&#1082;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;. &#1054;&#1085;&#1080; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1099; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; <a href="../BIM_Workbench.html" title="BIM Workbench">&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1087;&#1086; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1091; BIM</a>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1090;&#1072;&#1082;&#1078;&#1077; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072; &#1080;&#1079; &#1084;&#1077;&#1085;&#1102; <b>&#1057;&#1087;&#1088;&#1072;&#1074;&#1082;&#1072;</b> &#1080;&#1083;&#1080; &#1095;&#1077;&#1088;&#1077;&#1079; &#1084;&#1077;&#1085;&#1102; <b>&#1057;&#1087;&#1088;&#1072;&#1074;&#1082;&#1072; -&gt; &#1063;&#1090;&#1086; &#1101;&#1090;&#1086;?</b> &#1080; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077; &#1083;&#1102;&#1073;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Take a moment to explore the contents of the menus described below.
</p>
</div>
<p><span id="2D_Drafting"></span>
</p>
<h4><span id=".D0.94.D0.B2.D1.83.D0.BC.D0.B5.D1.80.D0.BD.D0.BE.D0.B5_.D1.87.D0.B5.D1.80.D1.87.D0.B5.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1044;&#1074;&#1091;&#1084;&#1077;&#1088;&#1085;&#1086;&#1077;_&#1095;&#1077;&#1088;&#1095;&#1077;&#1085;&#1080;&#1077;">&#1044;&#1074;&#1091;&#1084;&#1077;&#1088;&#1085;&#1086;&#1077; &#1095;&#1077;&#1088;&#1095;&#1077;&#1085;&#1080;&#1077;</span></h4>
<div class="mw-translate-fuzzy">
<p>&#1069;&#1090;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1083;&#1086;&#1089;&#1082;&#1080;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;, &#1090;&#1072;&#1082;&#1080;&#1077; &#1082;&#1072;&#1082; &#1083;&#1080;&#1085;&#1080;&#1080;, &#1087;&#1086;&#1083;&#1080;&#1083;&#1080;&#1085;&#1080;&#1080;, &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;&#1080;, &#1076;&#1091;&#1075;&#1080; &#1080; &#1090;.&#1076;., &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1089;&#1090;&#1072;&#1085;&#1091;&#1090; &#1086;&#1089;&#1085;&#1086;&#1074;&#1086;&#1081; &#1074;&#1072;&#1096;&#1080;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; BIM. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1086;&#1083;&#1080;&#1083;&#1080;&#1085;&#1080;&#1102;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1073;&#1072;&#1079;&#1086;&#1074;&#1091;&#1102; &#1083;&#1080;&#1085;&#1080;&#1102; &#1089;&#1090;&#1077;&#1085;&#1099;, &#1080;&#1083;&#1080; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082; &#1082;&#1072;&#1082; &#1087;&#1088;&#1086;&#1092;&#1080;&#1083;&#1100; &#1073;&#1072;&#1083;&#1082;&#1080;. &#1042;&#1089;&#1077; &#1076;&#1074;&#1091;&#1084;&#1077;&#1088;&#1085;&#1099;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1081; <a href="../ru/Draft_SelectPlane.html" title="Draft SelectPlane/ru">&#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1081; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080;</a>.
</p>
</div>
<p><span typeof="mw:File"><a href="../index.php?title=BIM_Tutorial_35.jpg&amp;filetimestamp=20200409110235&amp;.html" class="mw-file-description"><img src="../File/BIM_Tutorial_35.jpg" decoding="async" width="300" height="205" class="mw-file-element" data-file-width="300" data-file-height="205"></a></span>
</p><p><span id="3D/BIM"></span>
</p>
<div class="mw-translate-fuzzy">
<h4><span id=".D0.A2.D1.80.D1.91.D1.85.D0.BC.D0.B5.D1.80.D0.BD.D0.BE.D0.B5_.D0.BC.D0.BE.D0.B4.D0.B5.D0.BB.D0.B8.D1.80.D0.BE.D0.B2.D0.B0.D0.BD.D0.B8.D0.B5_.D0.B8_BIM"></span><span class="mw-headline" id="&#1058;&#1088;&#1105;&#1093;&#1084;&#1077;&#1088;&#1085;&#1086;&#1077;_&#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;_&#1080;_BIM">&#1058;&#1088;&#1105;&#1093;&#1084;&#1077;&#1088;&#1085;&#1086;&#1077; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1080; BIM</span></h4>
</div>
<p>&#1069;&#1090;&#1072; &#1082;&#1072;&#1090;&#1077;&#1075;&#1086;&#1088;&#1080;&#1103; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; BIM, &#1090;&#1072;&#1082;&#1080;&#1093; &#1082;&#1072;&#1082; <a href="../ru/Arch_Wall.html" title="Arch Wall/ru">&#1089;&#1090;&#1077;&#1085;&#1099;</a> &#1080;&#1083;&#1080; <a href="../ru/Arch_Window.html" title="Arch Window/ru">&#1086;&#1082;&#1085;&#1072;</a>, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1086;&#1073;&#1097;&#1080;&#1077;, &#1085;&#1077;-BIM &#1090;&#1088;&#1105;&#1093;&#1084;&#1077;&#1088;&#1085;&#1099;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;, &#1090;&#1072;&#1082;&#1080;&#1077; &#1082;&#1072;&#1082; <a href="../ru/BIM_Box.html" title="BIM Box/ru">&#1082;&#1091;&#1073;&#1099;</a>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1088;&#1077;&#1074;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100; &#1074; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; BIM &#1087;&#1086;&#1079;&#1078;&#1077;. &#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1073;&#1091;&#1076;&#1077;&#1090; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1077; &#1083;&#1080; &#1042;&#1099; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1089; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1084; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1084; &#1080;&#1083;&#1080; &#1085;&#1077;&#1090;. &#1045;&#1089;&#1083;&#1080; &#1085;&#1077;&#1090;, &#1042;&#1072;&#1084; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1074;&#1099;&#1073;&#1088;&#1072;&#1083;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1087;&#1077;&#1088;&#1077;&#1076; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1086;&#1084; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;, &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1090;&#1080;&#1087;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1086;&#1089;&#1085;&#1086;&#1074;&#1099;.
</p><p><span typeof="mw:File"><a href="../index.php?title=BIM_Tutorial_33.jpg&amp;filetimestamp=20200409110109&amp;.html" class="mw-file-description"><img src="../File/BIM_Tutorial_33.jpg" decoding="async" width="300" height="228" class="mw-file-element" data-file-width="300" data-file-height="228"></a></span>
</p><p>&#1058;&#1080;&#1087;&#1080;&#1095;&#1085;&#1099;&#1081; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; - &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; <a href="../ru/Arch_Wall.html" title="Arch Wall/ru">&#1089;&#1090;&#1077;&#1085;&#1072;</a> &#1089; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1081; <a href="../ru/Draft_Line.html" title="Draft Line/ru">&#1083;&#1080;&#1085;&#1077;&#1081;</a> &#1080;&#1083;&#1080; <a href="../ru/Draft_Wire.html" title="Draft Wire/ru">&#1087;&#1086;&#1083;&#1080;&#1083;&#1080;&#1085;&#1080;&#1103;</a>. &#1057;&#1090;&#1077;&#1085;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1072; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1083;&#1080;&#1085;&#1080;&#1080; &#1080;&#1083;&#1080; &#1087;&#1086;&#1083;&#1080;&#1083;&#1080;&#1085;&#1080;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1073;&#1072;&#1079;&#1086;&#1074;&#1086;&#1081; &#1083;&#1080;&#1085;&#1080;&#1080;.
</p><p>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;, &#1085;&#1077; &#1086;&#1090;&#1085;&#1086;&#1089;&#1103;&#1097;&#1080;&#1077;&#1089;&#1103; &#1082; BIM, &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1074; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1072;&#1093;, &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1088;&#1077;&#1074;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100; &#1074; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; BIM, &#1074;&#1099;&#1073;&#1088;&#1072;&#1074; &#1080;&#1093; &#1080; &#1085;&#1072;&#1078;&#1072;&#1074; &#1083;&#1102;&#1073;&#1091;&#1102; &#1080;&#1079; &#1082;&#1085;&#1086;&#1087;&#1086;&#1082; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; BIM.
</p><p><span id="Annotation"></span>
</p>
<h4><span id=".D0.90.D0.BD.D0.BD.D0.BE.D1.82.D0.B0.D1.86.D0.B8.D0.B8"></span><span class="mw-headline" id="&#1040;&#1085;&#1085;&#1086;&#1090;&#1072;&#1094;&#1080;&#1080;">&#1040;&#1085;&#1085;&#1086;&#1090;&#1072;&#1094;&#1080;&#1080;</span></h4>
<p>&#1069;&#1090;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1102;&#1090; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1072;&#1085;&#1085;&#1086;&#1090;&#1072;&#1094;&#1080;&#1080;, &#1090;&#1072;&#1082;&#1080;&#1077; &#1082;&#1072;&#1082; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099;, &#1090;&#1077;&#1082;&#1089;&#1090;, &#1084;&#1077;&#1090;&#1082;&#1080; &#1080;&#1083;&#1080; &#1089;&#1077;&#1090;&#1082;&#1080;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1077; &#1085;&#1077; &#1076;&#1083;&#1103; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1072; &#1076;&#1083;&#1103; &#1072;&#1085;&#1085;&#1086;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074;&#1072;&#1096;&#1080;&#1093; &#1084;&#1086;&#1076;&#1077;&#1083;&#1077;&#1081; &#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1087;&#1086;&#1085;&#1103;&#1090;&#1085;&#1099;&#1093; &#1095;&#1077;&#1088;&#1090;&#1077;&#1078;&#1077;&#1081;.
</p><p><span typeof="mw:File"><a href="../index.php?title=BIM_Tutorial_34.jpg&amp;filetimestamp=20200409110145&amp;.html" class="mw-file-description"><img src="../File/BIM_Tutorial_34.jpg" decoding="async" width="300" height="183" class="mw-file-element" data-file-width="300" data-file-height="183"></a></span>
</p><p><span id="Snapping"></span>
</p>
<h4><span id=".D0.9F.D1.80.D0.B8.D0.B2.D1.8F.D0.B7.D0.BA.D0.B8"></span><span class="mw-headline" id="&#1055;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1080;">&#1055;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1080;</span></h4>
<p>&#1069;&#1090;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1102;&#1090;/&#1074;&#1099;&#1082;&#1083;&#1102;&#1095;&#1072;&#1102;&#1090; <a href="../ru/Draft_Snap.html" title="Draft Snap/ru">&#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1091;</a> &#1082; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1080;. &#1050;&#1072;&#1082; &#1080; &#1074; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081; BIM, &#1082;&#1072;&#1078;&#1076;&#1072;&#1103; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1103; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1080; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090; &#1074;&#1088;&#1077;&#1084;&#1103; &#1088;&#1072;&#1089;&#1095;&#1077;&#1090;&#1072; &#1087;&#1088;&#1080; &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1083;&#1091;&#1095;&#1096;&#1077; &#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1090;&#1077;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1099;.
</p><p><span id="Modify"></span>
</p>
<h4><span id=".D0.9C.D0.BE.D0.B4.D0.B8.D1.84.D0.B8.D0.BA.D0.B0.D1.86.D0.B8.D1.8F"></span><span class="mw-headline" id="&#1052;&#1086;&#1076;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1103;">&#1052;&#1086;&#1076;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1103;</span></h4>
<p>&#1069;&#1090;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1102;&#1090; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;. &#1054;&#1085;&#1080; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090; &#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1090;&#1072;&#1082;&#1080;&#1077; &#1082;&#1072;&#1082; &laquo;&#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077;&raquo; &#1080;&#1083;&#1080; &laquo;&#1055;&#1086;&#1074;&#1086;&#1088;&#1086;&#1090;&raquo;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1088;&#1103;&#1076; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1090;&#1080;&#1087;&#1086;&#1074; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;.
</p><p><span id="Manage"></span>
</p>
<h4><span id=".D0.A3.D0.BF.D1.80.D0.B0.D0.B2.D0.BB.D0.B5.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;">&#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;</span></h4>
<p>&#1069;&#1090;&#1072; &#1082;&#1072;&#1090;&#1077;&#1075;&#1086;&#1088;&#1080;&#1103; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1086;&#1073;&#1097;&#1080;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;. &#1041;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1080;&#1079; &#1085;&#1080;&#1093; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; BIM-&#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;, &#1073;&#1077;&#1079; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1080;&#1093; &#1074;&#1099;&#1073;&#1086;&#1088;&#1072;.
</p><p><b>Tutorial steps</b>
</p>
<div class="infotext">&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1085;&#1077;&#1090; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1081;</div>
<i><div class="goal1"></div></i>
<div class="test1" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;"></div>
<i><div class="goal2"></div></i>
<div class="test2" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;"></div>
<p><br>
</p><p><br>
<span id="Prepare_your_working_space"></span>
</p>
<h3><span id=".D0.9F.D0.BE.D0.B4.D0.B3.D0.BE.D1.82.D0.BE.D0.B2.D0.BA.D0.B0_.D1.80.D0.B0.D0.B1.D0.BE.D1.87.D0.B5.D0.B3.D0.BE_.D0.BC.D0.B5.D1.81.D1.82.D0.B0"></span><span class="mw-headline" id="&#1055;&#1086;&#1076;&#1075;&#1086;&#1090;&#1086;&#1074;&#1082;&#1072;_&#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1075;&#1086;_&#1084;&#1077;&#1089;&#1090;&#1072;">&#1055;&#1086;&#1076;&#1075;&#1086;&#1090;&#1086;&#1074;&#1082;&#1072; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1075;&#1086; &#1084;&#1077;&#1089;&#1090;&#1072;</span></h3>
<div class="mw-translate-fuzzy">
<p>&#1042; FreeCAD &#1077;&#1089;&#1090;&#1100; &#1084;&#1085;&#1086;&#1075;&#1086; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1086;&#1074; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; BIM. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; <a href="../ru/BIM_Workbench.html" title="BIM Workbench/ru">&#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; BIM</a> &#1080;&#1083;&#1080; &#1083;&#1102;&#1073;&#1086;&#1081; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; FreeCAD &#1080;&#1079; &#1076;&#1088;&#1091;&#1075;&#1086;&#1075;&#1086; <a href="../ru/Workbenches.html" title="Workbenches/ru">&#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072;</a>. &#1042;&#1089;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; BIM, &#1082;&#1072;&#1082; &#1076;&#1074;&#1091;&#1084;&#1077;&#1088;&#1085;&#1086;&#1075;&#1086; &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1090;&#1072;&#1082; &#1080; &#1090;&#1088;&#1105;&#1093;&#1084;&#1077;&#1088;&#1085;&#1099;&#1077;, &#1074; &#1086;&#1090;&#1083;&#1080;&#1095;&#1080;&#1077; &#1086;&#1090; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1086;&#1074;, &#1090;&#1072;&#1082;&#1080;&#1093; &#1082;&#1072;&#1082; Part Design, &#1096;&#1080;&#1088;&#1086;&#1082;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090; <b>&#1088;&#1072;&#1073;&#1086;&#1095;&#1080;&#1077; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080;</b> &#1080; <b>&#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1091;</b>.
</p>
</div>
<div class="mw-translate-fuzzy">
<p><a href="../ru/Draft_SelectPlane.html" title="Draft SelectPlane/ru">&#1056;&#1072;&#1073;&#1086;&#1095;&#1072;&#1103; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1100;</a> - &#1101;&#1090;&#1086; &#1084;&#1077;&#1089;&#1090;&#1086;, &#1075;&#1076;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1099; &#1074;&#1072;&#1096;&#1080; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086; &#1085;&#1072; &#1086;&#1076;&#1085;&#1091; &#1080;&#1079; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1093; &#1086;&#1088;&#1090;&#1086;&#1075;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1077;&#1081; (&#1079;&#1077;&#1084;&#1083;&#1103;, &#1092;&#1088;&#1086;&#1085;&#1090;, &#1073;&#1086;&#1082;) &#1080;&#1083;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1083;&#1102;&#1073;&#1091;&#1102; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1091;&#1102; &#1075;&#1088;&#1072;&#1085;&#1100; &#1076;&#1083;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1081; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1081; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080;. &#1042;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; <a href="../ru/Draft_SetWorkingPlaneProxy.html" class="mw-redirect" title="Draft SetWorkingPlaneProxy/ru">&#1055;&#1088;&#1086;&#1082;&#1089;&#1080; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1081; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080;</a> &#1080;&#1079; &#1084;&#1077;&#1085;&#1102; <b>&#1059;&#1090;&#1080;&#1083;&#1080;&#1090;&#1099;</b>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1077; &#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1081; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1074;&#1072;&#1096;&#1077;&#1081; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;. <a href="../ru/Arch_BuildingPart.html" title="Arch BuildingPart/ru">&#1057;&#1090;&#1088;&#1086;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080;</a> &#1090;&#1072;&#1082;&#1078;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090; &#1085;&#1077;&#1103;&#1074;&#1085;&#1086;&#1077; &#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1081; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080;. &#1048;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1081; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1081; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077;&#1084; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1081; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080; &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; BIM. <b>&#1057;&#1077;&#1090;&#1082;&#1072;</b> &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;, &#1075;&#1076;&#1077; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1088;&#1072;&#1073;&#1086;&#1095;&#1072;&#1103; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1100;.
</p>
</div>
<p>&#1050;&#1072;&#1082; &#1074;&#1099; &#1079;&#1072;&#1084;&#1077;&#1090;&#1080;&#1083;&#1080;, &#1091;&#1075;&#1086;&#1083; &#1086;&#1073;&#1079;&#1086;&#1088;&#1072; &#1080; &#1088;&#1072;&#1073;&#1086;&#1095;&#1072;&#1103; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1100; &#1085;&#1077; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1099; &#1076;&#1088;&#1091;&#1075; &#1089; &#1076;&#1088;&#1091;&#1075;&#1086;&#1084;. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1085;&#1072; &#1089;&#1074;&#1086;&#1077;&#1081; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1081; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080; &#1087;&#1086;&#1076; &#1083;&#1102;&#1073;&#1099;&#1084; &#1091;&#1075;&#1083;&#1086;&#1084; &#1086;&#1073;&#1079;&#1086;&#1088;&#1072;.
</p><p>&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1088;&#1072;&#1073;&#1086;&#1095;&#1091;&#1102; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1100; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084; &laquo;&#1057;&#1074;&#1077;&#1088;&#1093;&#1091;&raquo;:
</p><p><span typeof="mw:File"><a href="../index.php?title=BIM_Tutorial_06.jpg&amp;filetimestamp=20181114134457&amp;.html" class="mw-file-description"><img src="../File/BIM_Tutorial_06.jpg" decoding="async" width="300" height="232" class="mw-file-element" data-file-width="495" data-file-height="383"></a></span>
</p><p><a href="../ru/Draft_Snap.html" title="Draft Snap/ru">&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1080;</a> &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1080; &#1090;&#1086;&#1095;&#1082;&#1080; &#1090;&#1086;&#1095;&#1085;&#1086; &#1074; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1080; &#1089; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1081; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1077;&#1081;. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; &#1084;&#1085;&#1086;&#1075;&#1080;&#1093; &#1084;&#1077;&#1089;&#1090; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1079;&#1072;&#1084;&#1077;&#1076;&#1083;&#1080;&#1090;&#1100; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1088;&#1072;&#1079;&#1091;&#1084;&#1085;&#1086; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1090;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1099; &#1089;&#1086;&#1073;&#1080;&#1088;&#1072;&#1077;&#1090;&#1077;&#1089;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;. &#1053;&#1072;&#1081;&#1076;&#1080;&#1090;&#1077; &#1084;&#1080;&#1085;&#1091;&#1090;&#1082;&#1091;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1076;&#1077;&#1083;&#1072;&#1077;&#1090; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1080;&#1079; &#1085;&#1080;&#1093;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1088;&#1080; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1074;&#1099; &#1079;&#1085;&#1072;&#1083;&#1080;, &#1082;&#1072;&#1082;&#1080;&#1077; &#1080;&#1079; &#1085;&#1080;&#1093; &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100;.
</p><p><span typeof="mw:File"><a href="../index.php?title=BIM_Tutorial_07.jpg&amp;filetimestamp=20181114134520&amp;.html" class="mw-file-description"><img src="../File/BIM_Tutorial_07.jpg" decoding="async" width="300" height="136" class="mw-file-element" data-file-width="469" data-file-height="213"></a></span>
</p><p>&#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1086;&#1089;&#1086;&#1073;&#1086;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077; &#1085;&#1072; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;, &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &laquo;&#1055;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1072; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1081; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080;&raquo;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1086;&#1085; &#1079;&#1072;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1090;&#1086;&#1095;&#1082;&#1080; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1080; &#1083;&#1086;&#1078;&#1080;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1100; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080;, &#1090;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1087;&#1088;&#1077;&#1076;&#1086;&#1090;&#1074;&#1088;&#1072;&#1097;&#1072;&#1103; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1091; &#1085;&#1072;&#1076; &#1080;&#1083;&#1080; &#1087;&#1086;&#1076; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1100;&#1102; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080;. &#1042;&#1072;&#1084; &#1095;&#1072;&#1089;&#1090;&#1086; &#1087;&#1088;&#1080;&#1076;&#1077;&#1090;&#1089;&#1103; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1100; &#1080;&#1083;&#1080; &#1074;&#1099;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086;, &#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1086;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080;.
</p><p><b>Tutorial steps</b>
</p>
<div class="infotext"></div>
<i><div class="goal1">&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1088;&#1072;&#1073;&#1086;&#1095;&#1091;&#1102; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1100; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084; &laquo;&#1057;&#1074;&#1077;&#1088;&#1093;&#1091;&raquo; (XY).</div></i>
<div class="test1" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;">True if ((FreeCAD.DraftWorkingPlane.axis.getAngle(FreeCAD.Vector(0,0,1)) &lt; 0.01) and (FreeCAD.DraftWorkingPlane.weak == False)) else False</div>
<i><div class="goal2">&#1054;&#1073;&#1079;&#1086;&#1088; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1080;</div></i>
<div class="test2" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;">True</div>
<p><br>
</p><p><br>
<span id="Draw_a_first_wall"></span>
</p>
<h3><span id=".D0.9F.D1.80.D0.BE.D0.B2.D0.B5.D0.B4.D1.91.D0.BC_.D0.BF.D0.B5.D1.80.D0.B2.D1.83.D1.8E_.D1.81.D1.82.D0.B5.D0.BD.D1.83"></span><span class="mw-headline" id="&#1055;&#1088;&#1086;&#1074;&#1077;&#1076;&#1105;&#1084;_&#1087;&#1077;&#1088;&#1074;&#1091;&#1102;_&#1089;&#1090;&#1077;&#1085;&#1091;">&#1055;&#1088;&#1086;&#1074;&#1077;&#1076;&#1105;&#1084; &#1087;&#1077;&#1088;&#1074;&#1091;&#1102; &#1089;&#1090;&#1077;&#1085;&#1091;</span></h3>
<div class="mw-translate-fuzzy">
<p>&#1053;&#1072;&#1095;&#1085;&#1077;&#1084; &#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1087;&#1072;&#1074;&#1080;&#1083;&#1100;&#1086;&#1085; &#1089;&#1086; &#1089;&#1090;&#1077;&#1085;. &#1057;&#1090;&#1077;&#1085;&#1099; &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1090;&#1100; &#1083;&#1080;&#1073;&#1086; &#1085;&#1072;&#1087;&#1088;&#1103;&#1084;&#1091;&#1102; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; <a href="../ru/Arch_Wall.html" title="Arch Wall/ru">&#1089;&#1090;&#1077;&#1085;&#1072;</a>, &#1083;&#1080;&#1073;&#1086; &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1085;&#1072;&#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1074; 2D-&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;, &#1090;&#1072;&#1082;&#1080;&#1077; &#1082;&#1072;&#1082; <a href="../ru/Draft_Line.html" title="Draft Line/ru">&#1083;&#1080;&#1085;&#1080;&#1080;</a>, <a href="../ru/Draft_Wire.html" title="Draft Wire/ru">&#1087;&#1086;&#1083;&#1080;&#1083;&#1080;&#1085;&#1080;&#1080;</a> &#1080;&#1083;&#1080; [[Sketcher_NewSketch/ru|&#1101;&#1089;&#1082;&#1080;&#1079;&#1099;] ], &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1090;&#1100; &#1073;&#1072;&#1079;&#1086;&#1074;&#1091;&#1102; &#1083;&#1080;&#1085;&#1080;&#1102; &#1085;&#1072;&#1096;&#1080;&#1093; &#1089;&#1090;&#1077;&#1085;. &#1050;&#1086;&#1075;&#1076;&#1072; &#1091; &#1074;&#1072;&#1089; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085; &#1090;&#1072;&#1082;&#1086;&#1081; &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;, &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &laquo;&#1057;&#1090;&#1077;&#1085;&#1072;&raquo; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1091;&#1077;&#1090; &#1077;&#1075;&#1086; &#1074; &#1089;&#1090;&#1077;&#1085;&#1091;.
</p>
</div>
<p>&#1057;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077;, &#1087;&#1086;&#1082;&#1072; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1080;&#1076;&#1085;&#1072; &#1073;&#1086;&#1083;&#1100;&#1096;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; &#1080;&#1083;&#1080; &#1074;&#1089;&#1103; &#1089;&#1077;&#1090;&#1082;&#1072;. &#1058;&#1072;&#1082; &#1073;&#1091;&#1076;&#1077;&#1090; &#1083;&#1077;&#1075;&#1095;&#1077; &#1074;&#1080;&#1076;&#1077;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1084;&#1099; &#1076;&#1077;&#1083;&#1072;&#1077;&#1084;:
</p><p><span typeof="mw:File"><a href="../index.php?title=BIM_tutorial_15.jpg&amp;filetimestamp=20190108132707&amp;.html" class="mw-file-description"><img src="../File/BIM_tutorial_15.jpg" decoding="async" width="300" height="229" class="mw-file-element" data-file-width="300" data-file-height="229"></a></span>
</p>
<div class="mw-translate-fuzzy">
<p>&#1047;&#1072;&#1090;&#1077;&#1084; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <span typeof="mw:File"><a href="../index.php?title=Arch_Wall.png&amp;filetimestamp=20170117125727&amp;.html" class="mw-file-description"><img src="../File/Arch_Wall.png" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b>&#1057;&#1090;&#1077;&#1085;&#1072;</b> (&#1080;&#1083;&#1080; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1087;&#1091;&#1085;&#1082;&#1090; &#1084;&#1077;&#1085;&#1102; <b>3D/BIM -&gt; &#1057;&#1090;&#1077;&#1085;&#1072;</b>). &#1065;&#1077;&#1083;&#1082;&#1085;&#1080;&#1090;&#1077; &#1076;&#1074;&#1077; &#1090;&#1086;&#1095;&#1082;&#1080; &#1085;&#1072; &#1089;&#1077;&#1090;&#1082;&#1077;, &#1074;&#1099;&#1088;&#1086;&#1074;&#1085;&#1077;&#1085;&#1085;&#1099;&#1077; &#1087;&#1086; &#1074;&#1077;&#1088;&#1090;&#1080;&#1082;&#1072;&#1083;&#1080;, &#1085;&#1072; &#1088;&#1072;&#1089;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1080; 300 &#1089;&#1084; &#1076;&#1088;&#1091;&#1075; &#1086;&#1090; &#1076;&#1088;&#1091;&#1075;&#1072;. &#1053;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077; SHIFT &#1087;&#1086;&#1089;&#1083;&#1077; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1103; &#1087;&#1077;&#1088;&#1074;&#1086;&#1081; &#1090;&#1086;&#1095;&#1082;&#1080; &#1087;&#1086;&#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1072;&#1084; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1089;&#1090;&#1077;&#1085;&#1091; &#1074; &#1075;&#1086;&#1088;&#1080;&#1079;&#1086;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; &#1080;&#1083;&#1080; &#1074;&#1077;&#1088;&#1090;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; &#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1080;. &#1041;&#1086;&#1082;&#1086;&#1074;&#1072;&#1103; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1089;&#1086;&#1086;&#1073;&#1097;&#1080;&#1090; &#1074;&#1072;&#1084; &#1076;&#1083;&#1080;&#1085;&#1091; &#1089;&#1090;&#1077;&#1085;&#1099; &#1074;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;.
</p>
</div>
<p><span typeof="mw:File"><a href="../index.php?title=BIM_tutorial_16.jpg&amp;filetimestamp=20190108133026&amp;.html" class="mw-file-description"><img src="../File/BIM_tutorial_16.jpg" decoding="async" width="300" height="230" class="mw-file-element" data-file-width="300" data-file-height="230"></a></span>
</p>
<div class="mw-translate-fuzzy">
<p>&#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1083;&#1080; &#1085;&#1077; &#1090;&#1091; &#1089;&#1090;&#1077;&#1085;&#1091;, &#1085;&#1077; &#1073;&#1077;&#1089;&#1087;&#1086;&#1082;&#1086;&#1081;&#1090;&#1077;&#1089;&#1100;! &#1055;&#1088;&#1086;&#1089;&#1090;&#1086; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1077; &#1080;&#1083;&#1080; &#1086;&#1090;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1077;&#1075;&#1086; (&#1084;&#1077;&#1085;&#1102; <b>&#1055;&#1088;&#1072;&#1074;&#1082;&#1072; -&gt; &#1054;&#1090;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100;</b>) &#1080; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1080;&#1090;&#1077; &#1087;&#1086;&#1087;&#1099;&#1090;&#1082;&#1091;.
</p>
</div>
<p><b>Tutorial steps</b>
</p>
<div class="infotext"></div>
<i><div class="goal1">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1089;&#1090;&#1077;&#1085;&#1091;</div></i>
<div class="test1" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;">bool(len([o for o in FreeCAD.ActiveDocument.Objects if "MakeBlocks" in o.PropertiesList]) == 1)</div>
<i><div class="goal2"></div></i>
<div class="test2" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;"></div>
<p><br>
</p><p><br>
<span id="Draw_a_second_wall"></span>
</p>
<h3><span id=".D0.9F.D1.80.D0.BE.D0.B2.D0.B5.D0.B4.D1.91.D0.BC_.D0.B2.D1.82.D0.BE.D1.80.D1.83.D1.8E_.D1.81.D1.82.D0.B5.D0.BD.D1.83"></span><span class="mw-headline" id="&#1055;&#1088;&#1086;&#1074;&#1077;&#1076;&#1105;&#1084;_&#1074;&#1090;&#1086;&#1088;&#1091;&#1102;_&#1089;&#1090;&#1077;&#1085;&#1091;">&#1055;&#1088;&#1086;&#1074;&#1077;&#1076;&#1105;&#1084; &#1074;&#1090;&#1086;&#1088;&#1091;&#1102; &#1089;&#1090;&#1077;&#1085;&#1091;</span></h3>
<p>&#1057;&#1076;&#1077;&#1083;&#1072;&#1081;&#1090;&#1077; &#1074;&#1090;&#1086;&#1088;&#1091;&#1102; &#1075;&#1086;&#1088;&#1080;&#1079;&#1086;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1089;&#1090;&#1077;&#1085;&#1091; &#1076;&#1083;&#1080;&#1085;&#1086;&#1081; 4 &#1084;&#1077;&#1090;&#1088;&#1072; (&#1080;&#1083;&#1080; 400 &#1089;&#1072;&#1085;&#1090;&#1080;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074;). &#1057;&#1085;&#1086;&#1074;&#1072; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; <span typeof="mw:File"><a href="../index.php?title=Arch_Wall.png&amp;filetimestamp=20170117125727&amp;.html" class="mw-file-description"><img src="../File/Arch_Wall.png" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b>&#1057;&#1090;&#1077;&#1085;&#1072;</b>, &#1087;&#1072;&#1085;&#1086;&#1088;&#1072;&#1084;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; &#1080; &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077;, &#1087;&#1086;&#1082;&#1072; &#1085;&#1077; &#1091;&#1074;&#1080;&#1076;&#1080;&#1090;&#1077; &#1085;&#1091;&#1078;&#1085;&#1091;&#1102; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1089;&#1077;&#1090;&#1082;&#1080;, &#1080; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1076;&#1074;&#1077; &#1090;&#1086;&#1095;&#1082;&#1080; &#1080;&#1079; &#1089;&#1077;&#1090;&#1082;&#1080;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1085;&#1072;&#1095;&#1072;&#1083;&#1086; &#1080; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1099;&#1077; &#1090;&#1086;&#1095;&#1082;&#1080; &#1085;&#1086;&#1074;&#1086;&#1081; &#1089;&#1090;&#1077;&#1085;&#1099;:
</p><p><span typeof="mw:File"><a href="../index.php?title=BIM_tutorial_11.jpg&amp;filetimestamp=20190107224329&amp;.html" class="mw-file-description"><img src="../File/BIM_tutorial_11.jpg" decoding="async" width="300" height="188" class="mw-file-element" data-file-width="300" data-file-height="188"></a></span>
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>After they are created, select both walls by pressing CTRL and clicking them both in the 3D View or in the <a href="../Document_structure.html" title="Document structure">Tree View</a>, and adjust their <b>height</b> property to 2.5 meters and their <b>width</b> to 20 centimeters (or any other measurement you are comfortable with, if working in another unit), so they look like this (Use the mouse to rotate the view, according to the navigation style you choose):
</p>
</div>
<p><span typeof="mw:File"><a href="../index.php?title=BIM_tutorial_08.jpg&amp;filetimestamp=20181120210217&amp;.html" class="mw-file-description"><img src="../File/BIM_tutorial_08.jpg" decoding="async" width="300" height="203" class="mw-file-element" data-file-width="1111" data-file-height="753"></a></span>
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>You can always correct or change properties after a wall or any other BIM object has been created. By expanding the wall object in the Tree View, then double-clicking the baseline of the wall, you can also modify its base 2D object. Most BIM objects in FreeCAD are based on another object, such as a baseline or a profile.
</p>
</div>
<p><span typeof="mw:File"><a href="../index.php?title=BIM_tutorial_12.jpg&amp;filetimestamp=20190107225336&amp;.html" class="mw-file-description"><img src="../File/BIM_tutorial_12.jpg" decoding="async" width="300" height="230" class="mw-file-element" data-file-width="338" data-file-height="259"></a></span>
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h4><span class="mw-headline" id="Important_note">Important note</span></h4>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>You will notice that some property changes, in FreeCAD, don't reflect immediately on the object in the 3D View. Instead, the object is marked with a "to be recomputed" blue mark in the tree:
</p>
</div>
<p><span typeof="mw:File"><a href="../index.php?title=BIM_Tutorial_20.jpg&amp;filetimestamp=20190304194924&amp;.html" class="mw-file-description"><img src="../File/BIM_Tutorial_20.jpg" decoding="async" width="300" height="211" class="mw-file-element" data-file-width="464" data-file-height="327"></a></span>
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>The reason for this is that a FreeCAD document can be a very complex chain of inter-dependent objects. Updating one can trigger an update on many others, and therefore take a long time. To avoid this, some operations simply mark the object to be recomputed, and you trigger the recomputation yourself by using menu <b>Edit &rarr; Refresh</b> or pressing <b>Ctrl+R</b>.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p><b>Tutorial steps</b>
</p>
<div class="infotext"></div>
<i><div class="goal1">Create two orthogonal wall objects</div></i>
<div class="test1" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;">bool(len([o for o in FreeCAD.ActiveDocument.Objects if "MakeBlocks" in o.PropertiesList]) == 2)</div>
<i><div class="goal2">Set their height to 2.50 meters and width to 20 centimeters</div></i>
<div class="test2" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;">bool(len([o for o in FreeCAD.ActiveDocument.Objects if "MakeBlocks" in o.PropertiesList and o.Height.Value == 2500 and o.Width.Value == 200]) == 2)</div>
<p><br>
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span id="Don.27t_forget_to_save_the_file_regularly.21"></span><span class="mw-headline" id="Don't_forget_to_save_the_file_regularly!">Don't forget to save the file regularly!</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Like any other computer application, FreeCAD is subject to failing or crashing, specially when we have little experience with it. Saving your file often is a very good habit to take in these early moments. FreeCAD also has an auto-saving mechanism, that you can set up under menu <b>Edit &rarr; Preferences &rarr; General &rarr; Document</b>.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Save your file now by using menu <b>File &rarr; Save</b>.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p><b>Tutorial steps</b>
</p>
<div class="infotext"></div>
<i><div class="goal1">Save your file</div></i>
<div class="test1" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;">bool(FreeCAD.ActiveDocument.FileName)</div>
<i><div class="goal2"></div></i>
<div class="test2" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;"></div>
<p><br>
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span class="mw-headline" id="Draw_a_roof_slab">Draw a roof slab</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>We will now place a roof slab on top of our walls. Instead of drawing the slab directly, like we did with the walls, we will here first draw a rectangle, then turn the rectangle into a slab. We will now explore two methods to do so, both are useful to know, so we suggest you to try one first, then undo it (or reload the file), and try the other method.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h4><span id="Method_1:_Draw_the_slab_on_the_ground.2C_then_move_it_into_position"></span><span class="mw-headline" id="Method_1:_Draw_the_slab_on_the_ground,_then_move_it_into_position">Method 1: Draw the slab on the ground, then move it into position</span></h4>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>It is often convenient to consider the top XY-plane (the ground plane) as a kind of "drawing board", where we will be building our objects, and move them next to their correct position. There is an additional advantage here, our working plane is already in "Top" mode, so we don't need to change it.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Set yourself in top view, zoom out a bit until you see both walls, and draw a rectangle encompassing them both. Press the <span typeof="mw:File"><a href="../index.php?title=Draft_Rectangle.png&amp;filetimestamp=20170117141653&amp;.html" class="mw-file-description"><img src="../File/Draft_Rectangle.png" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b>Rectangle</b> button from the toolbar (or choose menu item <b>2D Drafting &rarr; Rectangle</b>):
</p>
</div>
<p><span typeof="mw:File"><a href="../index.php?title=BIM_Tutorial_18.jpg&amp;filetimestamp=20190304193739&amp;.html" class="mw-file-description"><img src="../File/BIM_Tutorial_18.jpg" decoding="async" width="300" height="222" class="mw-file-element" data-file-width="451" data-file-height="334"></a></span>
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Rotate your view to inspect the results. By default, the rectangle is filled with a face. This can be changed by changing the <b>Make Face</b> property of our rectangle to False. For the slab we are going to build, this has no impact, for other types of objects, however, the base object being a polyline or a face can make a difference.
</p>
</div>
<p><span typeof="mw:File"><a href="../index.php?title=BIM_Tutorial_19.jpg&amp;filetimestamp=20190304193924&amp;.html" class="mw-file-description"><img src="../File/BIM_Tutorial_19.jpg" decoding="async" width="300" height="220" class="mw-file-element" data-file-width="486" data-file-height="356"></a></span>
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>The next step is to build a slab by <i>extruding</i> it with our rectangle as its base <i>profile</i>. In FreeCAD, structural objects such as columns, beams, or slabs are all created using the same object called a <b>Structure</b>. After a structural object is created, setting its <b>IFC Type</b> property to the desired type (column, slab, etc&hellip;) is all that is needed to change its type.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Make sure our rectangle is selected, then press the <span typeof="mw:File"><a href="../index.php?title=BIM_Slab.png&amp;filetimestamp=20260219102736&amp;.html" class="mw-file-description"><img src="../File/BIM_Slab.png" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b>Slab</b> button from the toolbar (or choose menu item <b>3D/BIM &rarr; Slab</b>). As stated above, this can also be done with the Column or Beam tools, as they all produce the same type of object. After our object is created, we need to make the following changes to its properties:
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<ul><li>Set its <b>Height</b> to <b>20 cm</b></li>
<li>In the Model panel, the <a href="../Property_View.html" title="Property View">Property View</a>'s Data tab should show the <b>Ifc Type</b> is set to <b>Slab</b></li></ul>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Now we need to move our new roof slab to its correct position, that is, above the walls. So we need to move it upwards, in the Z-direction, by a distance of 250 cm, which is the height of our walls. We can simply edit the <b>Placement</b> property of our slab, expand its <b>Position</b> attribute, and set the value of <b>z</b> to 250 cm. Our slab is now well in place:
</p>
</div>
<p><span typeof="mw:File"><a href="../index.php?title=BIM_Tutorial_21.jpg&amp;filetimestamp=20190304195729&amp;.html" class="mw-file-description"><img src="../File/BIM_Tutorial_21.jpg" decoding="async" width="300" height="173" class="mw-file-element" data-file-width="645" data-file-height="372"></a></span>
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Another way to move our slab to its correct position, is to use the <span typeof="mw:File"><a href="../index.php?title=Draft_Move.png&amp;filetimestamp=20170117142503&amp;.html" class="mw-file-description"><img src="../File/Draft_Move.png" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b>Move</b> tool from the <b>Modify</b> menu. For that, we need to set our working plane in a vertical plane first, by pressing the <span typeof="mw:File"><a href="../index.php?title=Draft_SelectPlane.png&amp;filetimestamp=20170117143205&amp;.html" class="mw-file-description"><img src="../File/Draft_SelectPlane.png" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../Draft_SelectPlane.html" title="Draft SelectPlane"><b>working plane</b></a> button on the <a href="../Draft_Tray.html" title="Draft Tray">Draft Tray</a> (make sure you don't have any face selected), and setting it to <b>XZ (Front)</b>. By setting ourselves in front view (press key <b>1</b>), we can now select the slab, press the <span typeof="mw:File"><a href="../index.php?title=Draft_Move.png&amp;filetimestamp=20170117142503&amp;.html" class="mw-file-description"><img src="../File/Draft_Move.png" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b>Move</b> button, and move our slab by clicking one of its base points, and, with <b>Shift</b> pressed to restrict the movement vertically, click one point on top of the walls:
</p>
</div>
<p><span typeof="mw:File"><a href="../index.php?title=BIM_Tutorial_23.jpg&amp;filetimestamp=20190304202303&amp;.html" class="mw-file-description"><img src="../File/BIM_Tutorial_23.jpg" decoding="async" width="300" height="199" class="mw-file-element" data-file-width="554" data-file-height="367"></a></span>
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h4><span class="mw-headline" id="Method_2:_Draw_the_slab_directly_on_the_correct_plane">Method 2: Draw the slab directly on the correct plane</span></h4>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Another useful method is directly working on the intended plane. We can easily set the working plane to the top surface of the walls, which is where we want our slab. Selecting a face and pressing the <span typeof="mw:File"><a href="../index.php?title=Draft_SelectPlane.png&amp;filetimestamp=20170117143205&amp;.html" class="mw-file-description"><img src="../File/Draft_SelectPlane.png" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b>working plane</b> button sets the working plane to coincide with the selected face. Select the top face of the wall and set it as the current working plane. The placement of the grid moves to show the current working plane.
</p>
</div>
<p><span typeof="mw:File"><a href="../index.php?title=BIM_Tutorial_22.jpg&amp;filetimestamp=20190304200556&amp;.html" class="mw-file-description"><img src="../File/BIM_Tutorial_22.jpg" decoding="async" width="300" height="222" class="mw-file-element" data-file-width="551" data-file-height="407"></a></span>
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Everything we draw from now on will happen on that plane. If you like, you can now set yourself in top view, but this is not necessary. Once your working plane is set, and if <b>working plane snapping</b> is enabled, you can draw directly in any type of 3D View.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Once our rectangular <i>profile</i> is drawn, we can follow the same method as in method one to create a slab (select it, press the <b>Structure</b> button, adjust its properties).
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p><b>Tutorial steps</b>
</p>
<div class="infotext"></div>
<i><div class="goal1">Create a rectangle</div></i>
<div class="test1" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;">bool(len([o for o in FreeCAD.ActiveDocument.Objects if "Rectangle" in o.Name]) == 1)</div>
<i><div class="goal2">Create a 20 cm thick slab</div></i>
<div class="test2" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;">bool(len([o for o in FreeCAD.ActiveDocument.Objects if "IfcType" in o.PropertiesList and o.IfcType == "Slab" and o.Height.Value == 200]) == 1)</div>
<p><br>
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span class="mw-headline" id="Create_a_metal_column">Create a metal column</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Let's add a metal column to give better support to our slab. Make sure the working plane is in <i>Top</i> mode, let's start by putting ourselves in top view (press key <b>2</b>), and turn the slab off, so we see better what's underneath. Select the slab, and press the <b>Space</b> key to turn its display off.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>In FreeCAD, it is very easy to turn objects or groups on and off, and the tree shows you clearly what is shown and what is hidden. Be sure to use that often!
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>The <b>Column</b> tool (as well as the Beam tool) has some built-in profiles that we will use now. Make sure nothing is selected, then press the <span typeof="mw:File"><a href="../index.php?title=BIM_Column.png&amp;filetimestamp=20260219102512&amp;.html" class="mw-file-description"><img src="../File/BIM_Column.png" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b><a href="../BIM_Column.html" title="BIM Column">BIM Column</a></b> button. In the <b>Structure Options</b>, select the category <b>CHS</b> (for "Circular Hollow Section"; RHS stands for "Rectangular Hollow Section", HEA, HEB, etc. are various "H" sections, etc.):
</p>
</div>
<p><span typeof="mw:File"><a href="../index.php?title=BIM_Tutorial_24.jpg&amp;filetimestamp=20190304215603&amp;.html" class="mw-file-description"><img src="../File/BIM_Tutorial_24.jpg" decoding="async" width="300" height="217" class="mw-file-element" data-file-width="414" data-file-height="299"></a></span>
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>And click a point to place your column, more or less at this position. Make sure the new column has an IFC Type of "Column" and give it a Height of 250 cm to make it the same height as our walls.
</p>
</div>
<p><span typeof="mw:File"><a href="../index.php?title=BIM_Tutorial_25.jpg&amp;filetimestamp=20190304215925&amp;.html" class="mw-file-description"><img src="../File/BIM_Tutorial_25.jpg" decoding="async" width="300" height="186" class="mw-file-element" data-file-width="382" data-file-height="237"></a></span>
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>The default CHS preset has a diameter option of 21.3 mm, which is too thin to support our concrete roof slab. Fortunately, as everything is parametric, it is easy to change the diameter. Expand the new structural object in the Tree View, and you will find its profile object, named CHS21.3x2.6_. Change its diameter to 12 cm and its thickness to 8 mm. Now we have a strong enough column. Notice that you can specify units on the fly and switch between 0.8 cm and 8 mm without issue. FreeCAD will take care of conversion.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h4><span class="mw-headline" id="Add_a_support_plate">Add a support plate</span></h4>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>We need a way to attach our metal column to the concrete slab. So let's add a plate to its top, which can be bolted to the concrete slab. This will illustrate how you can easily modify BIM objects and create the very precise ones you need.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Let's start by changing the height of our column from 250 cm to 249 cm, to give it a space for a 1 cm-thick plate. Then use the <span typeof="mw:File"><a href="../index.php?title=Draft_Rectangle.png&amp;filetimestamp=20170117141653&amp;.html" class="mw-file-description"><img src="../File/Draft_Rectangle.png" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b>Rectangle</b> tool to draw a 20 cm x 20 cm rectangle, either on the ground plane or by selecting the top of the column and setting it as the <span typeof="mw:File"><a href="../index.php?title=Draft_SelectPlane.png&amp;filetimestamp=20170117143205&amp;.html" class="mw-file-description"><img src="../File/Draft_SelectPlane.png" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> working plane, as we learned in the previous step. Use the <span typeof="mw:File"><a href="../index.php?title=Draft_Move.png&amp;filetimestamp=20170117142503&amp;.html" class="mw-file-description"><img src="../File/Draft_Move.png" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b>Move</b> tool, with <span typeof="mw:File"><a href="../index.php?title=Draft_Snap_Midpoint.png&amp;filetimestamp=20260219103139&amp;.html" class="mw-file-description"><img src="../File/Draft_Snap_Midpoint.png" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b>Midpoint</b> and <span typeof="mw:File"><a href="../index.php?title=Draft_Snap_Center.png&amp;filetimestamp=20260219103049&amp;.html" class="mw-file-description"><img src="../File/Draft_Snap_Center.png" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b>Snap Center</b> turned on, if needed, to center the rectangle over the column center.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Using the <span typeof="mw:File"><a href="../index.php?title=BIM_Slab.png&amp;filetimestamp=20260219102736&amp;.html" class="mw-file-description"><img src="../File/BIM_Slab.png" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b><a href="../BIM_Slab.html" title="BIM Slab">Slab</a></b> tool again, create a structural object from the rectangle, give it a height of 1 cm, and move it to a height of 249 cm:
</p>
</div>
<p><span typeof="mw:File"><a href="../index.php?title=BIM_Tutorial_26.jpg&amp;filetimestamp=20190304221738&amp;.html" class="mw-file-description"><img src="../File/BIM_Tutorial_26.jpg" decoding="async" width="300" height="192" class="mw-file-element" data-file-width="554" data-file-height="354"></a></span>
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Now let's add our plate to the column. BIM objects in FreeCAD have two properties named <b>Additions</b> and <b>Subtractions</b> that can receive objects that need to be unioned or subtracted to/from them. To add the plate to our column, select the plate, then, with <b>Ctrl</b> pressed, select the <span typeof="mw:File"><a href="../index.php?title=BIM_Column.png&amp;filetimestamp=20260219102512&amp;.html" class="mw-file-description"><img src="../File/BIM_Column.png" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b><a href="../BIM_Column.html" title="BIM Column">BIM Column</a></b> and use the <span typeof="mw:File"><a href="../index.php?title=Arch_Add.png&amp;filetimestamp=20170117132250&amp;.html" class="mw-file-description"><img src="../File/Arch_Add.png" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b><a href="../Arch_Add.html" title="Arch Add">Add Component</a></b> tool from the <b>Modify</b> menu. Our top-plate is now part of the <b><a href="../BIM_Column.html" title="BIM Column">BIM Column</a></b>. Verify this by checking the value of the <span style="font-size:60%; padding-right:0.8em;">&#1044;&#1072;&#1085;&#1085;&#1099;&#1077;</span><b>Addition</b> property where the <b><a href="../BIM_Slab.html" title="BIM Slab">Slab</a></b> should be listed.
</p>
</div>
<p><span typeof="mw:File"><a href="../index.php?title=BIM_Tutorial_27.jpg&amp;filetimestamp=20190304224533&amp;.html" class="mw-file-description"><img src="../File/BIM_Tutorial_27.jpg" decoding="async" width="300" height="220" class="mw-file-element" data-file-width="576" data-file-height="422"></a></span>
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>By starting from simple shapes as <i>profiles</i>, and adding or subtracting objects, we can quickly create very complex BIM objects. Note that the Additions and Subtractions of a given BIM object can easily be changed by double-clicking them in the Tree View and using the Add and Remove buttons there. The same object can be used as an addition or subtraction for several other objects.
</p>
</div>
<p><span typeof="mw:File"><a href="../index.php?title=BIM_Tutorial_28.jpg&amp;filetimestamp=20190304225533&amp;.html" class="mw-file-description"><img src="../File/BIM_Tutorial_28.jpg" decoding="async" width="300" height="224" class="mw-file-element" data-file-width="739" data-file-height="551"></a></span>
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p><b>Tutorial steps</b>
</p>
<div class="infotext"></div>
<i><div class="goal1">Create a CHS tubular column</div></i>
<div class="test1" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;">bool(len([o for o in FreeCAD.ActiveDocument.Objects if "CHS" in o.Label]) == 1)</div>
<i><div class="goal2">Add a 20 cm x 20 cm plate to the column</div></i>
<div class="test2" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;">bool(len([o for o in FreeCAD.ActiveDocument.Objects if "Shape" in o.PropertiesList and (FreeCAD.Units.Quantity("300 cm^3") &lt; o.Shape.Volume &lt; FreeCAD.Units.Quantity("500 cm^3"))]) == 1)</div>
<p><br>
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span class="mw-headline" id="Add_a_door">Add a door</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Like columns and beams, doors and windows are created from the same <a href="../Arch_Window.html" title="Arch Window">Window</a> object in FreeCAD. Only their IFC type changes. They can be independent or, if an object is selected when running the tool, inserted in another BIM object, in which case they will automatically create a hole through it.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Let's insert a 80 cm x 210 cm glass door in one of our walls. Start by placing the working plane on a face of a wall, which will make it easier to precisely place our door:
</p>
</div>
<p><span typeof="mw:File"><a href="../index.php?title=BIM_Tutorial_29.jpg&amp;filetimestamp=20190304230644&amp;.html" class="mw-file-description"><img src="../File/BIM_Tutorial_29.jpg" decoding="async" width="300" height="212" class="mw-file-element" data-file-width="610" data-file-height="432"></a></span>
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Then, with the wall selected, select <span typeof="mw:File"><a href="../index.php?title=BIM_Door.png&amp;filetimestamp=20260219102552&amp;.html" class="mw-file-description"><img src="../File/BIM_Door.png" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b>Door</b> from the <b>BIM</b> menu. In the <b>Window options</b> select the <b>Glass door</b> preset, and set the <b>Width</b> to 80 cm and <b>Height</b> to 210 cm. You can set the other values as you like:
</p>
</div>
<p><span typeof="mw:File"><a href="../index.php?title=BIM_Tutorial_30.jpg&amp;filetimestamp=20190304230933&amp;.html" class="mw-file-description"><img src="../File/BIM_Tutorial_30.jpg" decoding="async" width="300" height="247" class="mw-file-element" data-file-width="416" data-file-height="343"></a></span>
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Click a point on the base of the wall where you wish to place the door. This can be difficult, as the grid lines don't necessarily correspond to the wall edges. Press the <b>Q</b> key while you have an active snap at a grid intersection, and press it again with an active snap on the bottom of the wall. FreeCAD will create a new snap point where their horizontal/vertical axis intersect. Use this to find a suitable point:
</p>
</div>
<p><span typeof="mw:File"><a href="../index.php?title=BIM_Tutorial_31.jpg&amp;filetimestamp=20190304231135&amp;.html" class="mw-file-description"><img src="../File/BIM_Tutorial_31.jpg" decoding="async" width="300" height="255" class="mw-file-element" data-file-width="332" data-file-height="282"></a></span>
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>If your door didn't get placed correctly, try the <span typeof="mw:File"><a href="../index.php?title=Draft_Move.png&amp;filetimestamp=20170117142503&amp;.html" class="mw-file-description"><img src="../File/Draft_Move.png" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b>Move</b> tool to move it to its correct position. Otherwise use undo or delete it from the Tree View and try again.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>When everything is done, you should obtain a door properly inserted into its wall:
</p>
</div>
<p><span typeof="mw:File"><a href="../index.php?title=BIM_Tutorial_32.jpg&amp;filetimestamp=20190304231646&amp;.html" class="mw-file-description"><img src="../File/BIM_Tutorial_32.jpg" decoding="async" width="300" height="193" class="mw-file-element" data-file-width="1262" data-file-height="811"></a></span>
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p><b>Tutorial steps</b>
</p>
<div class="infotext"></div>
<i><div class="goal1">Create a glass door</div></i>
<div class="test1" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;">bool(len([o for o in FreeCAD.ActiveDocument.Objects if "Window" in o.Name]) == 1)</div>
<i><div class="goal2"></div></i>
<div class="test2" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;"></div>
<p><br>
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span class="mw-headline" id="Organizing_our_model">Organizing our model</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>We now have in our model a growing collection of BIM objects. It is time to tidy things up. Creating well organized models, easily understandable by others, is a very important part of building quality BIM models.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>It is good practice to give meaningful and easily recognisable <b>names</b> to our objects. To rename an object, right-click it in the Tree View and choose <b>Rename</b>.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p><span typeof="mw:File"><a href="../index.php?title=Std_Group.png&amp;filetimestamp=20260219103155&amp;.html" class="mw-file-description"><img src="../File/Std_Group.png" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b><a href="../Std_Group.html" title="Std Group">Groups</a></b> allow you to organize your objects in the <a href="../Tree_View.html" title="Tree View">Tree View</a>, like files in folders. Groups are created by right-clicking the document root or any other group in the Tree View, and selecting <b>Create group</b>. You can then drag objects in and out of groups in the <a href="../Tree_View.html" title="Tree View">Tree View</a>.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p><span typeof="mw:File"><a href="../index.php?title=BIM_Layers.png&amp;filetimestamp=20260219102621&amp;.html" class="mw-file-description"><img src="../File/BIM_Layers.png" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b><a href="../BIM_Layers.html" title="BIM Layers">Layers</a></b> is an independent but similar way to organize objects. Layers allow you to override visual settings such as color and line width. Organise your layers under <b>Manage &rarr; Manage Layers</b>. Any new object will automatically be placed in the active layer.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p><span typeof="mw:File"><a href="../index.php?title=Arch_Building.png&amp;filetimestamp=20260219102315&amp;.html" class="mw-file-description"><img src="../File/Arch_Building.png" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b><a href="../Arch_Building.html" title="Arch Building">Buildings</a></b> and <span typeof="mw:File"><a href="../index.php?title=Arch_Floor.png&amp;filetimestamp=20260219102444&amp;.html" class="mw-file-description"><img src="../File/Arch_Floor.png" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b><a href="../Arch_Floor.html" title="Arch Floor">Levels</a></b> are typically used to organize BIM models. FreeCAD offers these tools under the <b>3D/BIM</b> menu. Levels and buildings use the same object type called <a href="../Arch_BuildingPart.html" title="Arch BuildingPart">Building Part</a> with a different IFC type. They work the same way as groups, once created, you can drag and drop any object in and out of them. Building Parts are compatible with groups, so you can also place groups inside them.
</p>
</div>
<p><span typeof="mw:File"><a href="../index.php?title=BIM_Tutorial_36.jpg&amp;filetimestamp=20200409151837&amp;.html" class="mw-file-description"><img src="../File/BIM_Tutorial_36.jpg" decoding="async" width="300" height="183" class="mw-file-element" data-file-width="300" data-file-height="183"></a></span>
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p><a href="../Arch_BuildingPart.html" title="Arch BuildingPart">Building Parts</a> have many uses for representing objects, concepts, annotations, resources and more. Refer to their <a href="../Arch_BuildingPart.html" title="Arch BuildingPart">documentation</a> to know more.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Create a Building Part now by selecting <b>Level</b> from the <b>3D/BIM</b> menu. Make sure its IFC type is set to <b>Building Storey</b>. Select all root BIM objects (the <b><a href="../Arch_Wall.html" title="Arch Wall">Walls</a></b>, <b><a href="../Arch_Roof.html" title="Arch Roof">Roof</a></b> and <b><a href="../BIM_Column.html" title="BIM Column">Column</a></b>) and drag them to your <b><a href="../Arch_Floor.html" title="Arch Floor">Level</a></b>. The <b><a href="../BIM_Door.html" title="BIM Door">Door</a></b> follows as part of the host <b><a href="../Arch_Wall.html" title="Arch Wall">Wall</a></b> and the column top-plate follows the <b><a href="../BIM_Column.html" title="BIM Column">Column</a></b> as an <span style="font-size:60%; padding-right:0.8em;">&#1044;&#1072;&#1085;&#1085;&#1099;&#1077;</span><b>Addition</b> to its own geometry.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Organizing your BIM model by <b><a href="../Arch_Floor.html" title="Arch Floor">Levels</a></b> is good practice, but not required. <a href="../NativeIFC.html" class="mw-redirect" title="NativeIFC">NativeIFC</a> however assumes objects will be associated to <b><a href="../Arch_Floor.html" title="Arch Floor">Levels</a></b>.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p><b>Tutorial steps</b>
</p>
<div class="infotext"></div>
<i><div class="goal1">Create a level</div></i>
<div class="test1" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;">bool(len([o for o in FreeCAD.ActiveDocument.Objects if "BuildingPart" in o.Name]) == 1)</div>
<i><div class="goal2">Add the four other root BIM objects to it</div></i>
<div class="test2" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;">bool(len([o for o in FreeCAD.ActiveDocument.Objects if "BuildingPart" in o.Name and (len(o.Group) == 4)]) == 1)</div>
<p><br>
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span class="mw-headline" id="Adding_section_planes">Adding section planes</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>One of the most common operations performed on a BIM model is to extract 2D drawings from it, such as plans and elevations. There are several ways to do that in FreeCAD, depending on the result you wish to obtain. Basically, you have two choices:
</p>
<ul><li>Producing the 2D result inside the 3D space. This is useful if you wish to rework it there, build further on it or better control how it is exported to formats like <a href="../Draft_DXF.html" title="Draft DXF">DXF</a> or <a href="../FreeCAD_and_DWG_Import.html" title="FreeCAD and DWG Import">DWG</a>.</li>
<li>Creating 2D views on a <a href="../TechDraw_Workbench.html" title="TechDraw Workbench">TechDraw sheet</a> that is better suited for impression or export to PDF.</li></ul>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>In both cases, it starts with placing a <a href="../Arch_SectionPlane.html" title="Arch SectionPlane">Section Plane</a> in your model:
</p>
</div>
<p><span typeof="mw:File"><a href="../index.php?title=BIM_Tutorial_37.jpg&amp;filetimestamp=20200409152334&amp;.html" class="mw-file-description"><img src="../File/BIM_Tutorial_37.jpg" decoding="async" width="300" height="141" class="mw-file-element" data-file-width="300" data-file-height="141"></a></span>
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<ol><li>Select the Level object that contains your objects, that we created in the last step</li>
<li>Add a Section Plane from menu <b>Annotations &rarr; Section Plane</b></li></ol>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Section planes don't cut through the whole model, but only through objects in their <b>Objects</b> property. You can select the Section Plane to check and change the contents of this property anytime.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>By default, the new section plane will be placed in the middle of the selected object or its contents, and will look downwards, as to create a floor plan view. But the section plane is an object like any other and can be moved and rotated to do what you need. Place it horizontally to create a plan view, vertically inside your model to create a section, or outside the model to create an elevation.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p><b>Tutorial steps</b>
</p>
<div class="infotext"></div>
<i><div class="goal1">Select the main Building Part</div></i>
<div class="test1" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;">bool(len([o for o in FreeCADGui.Selection.getSelection() if "BuildingPart" in o.Name]) == 1)</div>
<i><div class="goal2">Create a section plane</div></i>
<div class="test2" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;">bool(len([o for o in FreeCAD.ActiveDocument.Objects if "Section" in o.Name and (len(o.Objects) == 1) and ("BuildingPart" in o.Objects[0].Name)]) == 1)</div>
<p><br>
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span class="mw-headline" id="Extracting_2D_views_as_geometry">Extracting 2D views as geometry</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Once your section plane is in place we can create 2D geometry from what it sees using the <span typeof="mw:File"><a href="../index.php?title=BIM_Shape2DView.png&amp;filetimestamp=20260219102707&amp;.html" class="mw-file-description"><img src="../File/BIM_Shape2DView.png" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../BIM_Shape2DView.html" title="BIM Shape2DView">BIM Shape2DView</a> tool:
</p>
</div>
<p><span typeof="mw:File"><a href="../index.php?title=BIM_Tutorial_38.jpg&amp;filetimestamp=20200409153252&amp;.html" class="mw-file-description"><img src="../File/BIM_Tutorial_38.jpg" decoding="async" width="300" height="179" class="mw-file-element" data-file-width="300" data-file-height="179"></a></span>
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<ol><li>Select the section plane</li>
<li>Create a <span typeof="mw:File"><a href="../index.php?title=BIM_Shape2DView.png&amp;filetimestamp=20260219102707&amp;.html" class="mw-file-description"><img src="../File/BIM_Shape2DView.png" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../BIM_Shape2DView.html" title="BIM Shape2DView">2D Section View</a> from <b>Annotation &rarr; Create 2D Views &rarr; Section View [V, V]</b>. Check that the <span style="font-size:60%; padding-right:0.8em;">&#1044;&#1072;&#1085;&#1085;&#1099;&#1077;</span><b>Projection Mode</b> is set to <code>Solid</code></li>
<li>Our <a href="../BIM_Shape2DView.html" title="BIM Shape2DView">2D Section View</a> object is hidden under the walls. Hide the level and the <a href="../BIM_Shape2DView.html" title="BIM Shape2DView">2D Section View</a> by selecting them both in the Tree View and pressing the space bar, so we can see our result better:</li></ol>
</div>
<p><span typeof="mw:File"><a href="../index.php?title=BIM_Tutorial_39.jpg&amp;filetimestamp=20200409153327&amp;.html" class="mw-file-description"><img src="../File/BIM_Tutorial_39.jpg" decoding="async" width="300" height="186" class="mw-file-element" data-file-width="300" data-file-height="186"></a></span>
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>The 2D projection we created is an all-in-one 2D object and will be located on the (0,0) ground plane in the model. It can be moved around, and will be recalculated if the model changes.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>To create a projection with thicker lines and solid cut areas, you can instead create a <span typeof="mw:File"><a href="../index.php?title=BIM_Shape2DCut.png&amp;filetimestamp=20260219102650&amp;.html" class="mw-file-description"><img src="../File/BIM_Shape2DCut.png" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b><a href="../BIM_Shape2DCut.html" title="BIM Shape2DCut">2D Cut View</a></b> from <b>Annotation &rarr; Create 2D Views &rarr; Section Cut [V, C]</b>. It performs the same initial action as a <span typeof="mw:File"><a href="../index.php?title=BIM_Shape2DView.png&amp;filetimestamp=20260219102707&amp;.html" class="mw-file-description"><img src="../File/BIM_Shape2DView.png" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b><a href="../BIM_Shape2DView.html" title="BIM Shape2DView">2D Section View</a></b> but sets the resulting object's <span style="font-size:60%; padding-right:0.8em;">&#1044;&#1072;&#1085;&#1085;&#1099;&#1077;</span><b>Projection Mode</b> to <code>Cutfaces</code>. Place your two <b>2D View</b> objects on separate new <b><a href="../BIM_Layers.html" title="BIM Layers">layers</a></b> and assigning each an <span typeof="mw:File"><a href="../index.php?title=Std_SetAppearance.png&amp;filetimestamp=20260219103225&amp;.html" class="mw-file-description"><img src="../File/Std_SetAppearance.png" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span><b><a href="../Std_SetAppearance.html" title="Std SetAppearance">Appearance</a></b> with a different <span style="font-size:60%; padding-right:0.8em;">&#1042;&#1080;&#1076;</span><b>Line Width</b>.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p><b>Tutorial steps</b>
</p>
<div class="infotext"></div>
<i><div class="goal1">Select the section plane</div></i>
<div class="test1" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;">bool(len([o for o in FreeCADGui.Selection.getSelection() if "Section" in o.Name]) == 1)</div>
<i><div class="goal2">Create a Shape 2D View</div></i>
<div class="test2" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;">bool(len([o for o in FreeCAD.ActiveDocument.Objects if "Shape2DView" in o.Name]) == 1)</div>
<p><br>
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span class="mw-headline" id="Annotating_and_exporting_to_2D_CAD_formats">Annotating and exporting to 2D CAD formats</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>You can place <a href="../Draft_Text.html" title="Draft Text">Texts</a>, <a href="../Draft_Label.html" title="Draft Label">Labels</a> (text with line and arrow), <a href="../BIM_Leader.html" title="BIM Leader">Leaders</a> and <a href="../Draft_Dimension.html" title="Draft Dimension">Dimensions</a> on anything in the model space: Either directly on the 3D model, or on the 2D view that we created in the step above. The choice is yours, depending on what you wish to achieve. If you leave the 2D view exactly under the 3D model, you might also want to do both in one go.
</p>
</div>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=BIM_Tutorial_34.jpg&amp;filetimestamp=20200409110145&amp;.html" class="mw-file-description"><img src="../File/BIM_Tutorial_34.jpg" decoding="async" width="300" height="183" class="mw-file-element" data-file-width="300" data-file-height="183"></a></span>
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Annotations (texts, labels, dimensions) will be placed on the current <b>Working Plane</b>. Be sure to place your working plane where you want your annotations. You can this way place annotations in any plane of the 3D space: Horizontally or vertically. You can also move or rotate them after creation.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Let's place a horizontal dimension between the extremities of our two walls:
</p>
</div>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=BIM_Tutorial_40.jpg&amp;filetimestamp=20200410110609&amp;.html" class="mw-file-description"><img src="../File/BIM_Tutorial_40.jpg" decoding="async" width="300" height="184" class="mw-file-element" data-file-width="300" data-file-height="184"></a></span>
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<ol><li>Set the <b><a href="../Draft_SelectPlane.html" title="Draft SelectPlane">working plane</a></b> to the <span typeof="mw:Error mw:File"><a href="../index.php?title=Special;Upload&amp;wpDestFile=View-top.png.html" class="new" title="File:View-top.png"><span class="mw-file-element mw-broken-media" data-width="16">File:View-top.png</span></a></span> Top (XY) position</li>
<li>Orient your view so the bases of both walls are visible</li>
<li>Select the <b>Annotation &rarr; <span typeof="mw:File"><a href="../index.php?title=BIM_DimensionHorizontal.png&amp;filetimestamp=20260219102531&amp;.html" class="mw-file-description"><img src="../File/BIM_DimensionHorizontal.png" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> Horizontal Dimension</b> option from the menu.</li>
<li>Activate the <span typeof="mw:File"><a href="../index.php?title=Draft_Snap_Endpoint.png&amp;filetimestamp=20260219103117&amp;.html" class="mw-file-description"><img src="../File/Draft_Snap_Endpoint.png" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../Draft_Snap_Endpoint.html" title="Draft Snap Endpoint">Snap Endpoint</a> button in the Draft Snap toolbar.</li>
<li>Select your first point at the far end of the left wall</li>
<li>Select your second point at the far end of the right wall</li>
<li>Click a third point to indicate where to place the dimension line</li></ol>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p><b><a href="../Draft_Dimension.html" title="Draft Dimension">Dimensions</a></b> have a lot of settings to tweak their aspect and the size and type of the text and arrow. You can set your preferred defaults under menu
<b>Edit &rarr; Preferences &rarr; Draft &rarr; <a href="../Draft_Preferences.html#Texts_and_Dimensions" title="Draft Preferences">Texts and Dimensions</a></b>
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Now let's add a text:
</p>
</div>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=BIM_Tutorial_41.jpg&amp;filetimestamp=20200410110623&amp;.html" class="mw-file-description"><img src="../File/BIM_Tutorial_41.jpg" decoding="async" width="300" height="195" class="mw-file-element" data-file-width="300" data-file-height="195"></a></span>
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<ol><li>Select the <b>Annotation &rarr; <span typeof="mw:File"><a href="../index.php?title=BIM_Text.png&amp;filetimestamp=20260219102758&amp;.html" class="mw-file-description"><img src="../File/BIM_Text.png" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> Text</b> option from the menu.</li>
<li>Click a location in the 3D View to place the text.</li>
<li>Write the text you wish, for example <b>Pavilion</b>, then click the <b>Create Text</b> button or press Enter twice.</li></ol>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>A good idea is to create <b><a href="../Std_Group.html" title="Std Group">Groups</a></b> for the different sets of annotations (plan, section, different scales, etc&hellip;):
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<ol><li>Right-click the document in the <a href="../Tree_View.html" title="Tree View">Tree View</a> and select the <b>Create Group</b> option from the context menu.</li>
<li>Name your new group <i>Annotations</i>.</li>
<li>Select the annotations and drag them into the <i>Annotations</i> group.</li></ol>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h4><span class="mw-headline" id="Exporting_to_DXF">Exporting to DXF</span></h4>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>2D objects such as lines or circles or 2D views as we created above or annotations are very suited to export to traditional 2D CAD formats such as <a href="../Draft_DXF.html" title="Draft DXF">DXF or DWG</a>. The DWG format requires an additional piece of software to be installed on your system, check the <a href="../Draft_DXF.html" title="Draft DXF">instructions</a> to do that if needed.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Let's try to export our 2D work to DXF:
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<ol><li>Select the 2D view, the dimension and the text</li>
<li>Select menu <b>File &rarr; Export</b>, choose the <b>Autodesk DXF 2D</b> format, a file name, and press <b>Export</b></li></ol>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>If you don't use any 2D CAD program, there are several free and open-source applications that can open DXF files (apart from FreeCAD itself, of course!) such as <a rel="nofollow" class="external text" href="https://librecad.org/">LibreCAD</a> and <a rel="nofollow" class="external text" href="https://qcad.org/">QCAD CE</a>.
</p>
</div>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=BIM_Tutorial_42.jpg&amp;filetimestamp=20200410111716&amp;.html" class="mw-file-description"><img src="../File/BIM_Tutorial_42.jpg" decoding="async" width="300" height="198" class="mw-file-element" data-file-width="300" data-file-height="198"></a></span>
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p><b>Tutorial steps</b>
</p>
<div class="infotext"></div>
<i><div class="goal1">Create a dimension</div></i>
<div class="test1" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;">bool(len([obj for obj in FreeCAD.ActiveDocument.Objects if "Dimension" in obj.Name]))</div>
<i><div class="goal2">Create a text</div></i>
<div class="test2" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;">bool(len([obj for obj in FreeCAD.ActiveDocument.Objects if "Text" in obj.Name]))</div>
<p><br>
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span class="mw-headline" id="Creating_2D_geometry_on_a_printable_sheet">Creating 2D geometry on a printable sheet</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Printable sheets are created and managed with the <a href="../TechDraw_Workbench.html" title="TechDraw Workbench">TechDraw Workbench</a>. Let's create a new sheet and place a view of our model on it:
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<ol><li>Switch to the <b>TechDraw Workbench</b></li>
<li>Create a new empty sheet using the default template from menu <b>TechDraw &rarr; Page &rarr; Insert Default Page</b></li>
<li>Select the section plane and create a view on the page using <b>TechDraw &rarr; Views From Other Workbenches &rarr; Insert BIM Workbench Object</b></li>
<li>Change the <b>Scale</b> property of your Arch View.</li></ol>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>&hellip; To be continued
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p><b>Tutorial steps</b>
</p>
<div class="infotext">No action to perform for this step</div>
<i><div class="goal1"></div></i>
<div class="test1" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;"></div>
<i><div class="goal2"></div></i>
<div class="test2" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;"></div>
<p><br>
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span class="mw-headline" id="Exporting_an_IFC_file">Exporting an IFC file</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p><a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Industry_Foundation_Classes">IFC, or Industry Foundation Classes</a>, is a protocol and file format for exchanging BIM models between applications. By saving your model as an IFC file, you will be able to open it in most or all other open-source or proprietary BIM applications out there.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>IFC import/export operations in FreeCAD are performed by an external piece of software called <a rel="nofollow" class="external text" href="https://ifcopenshell.org">IfcOpenShell</a>. Read the <a href="../Arch_IFC.html" title="Arch IFC">Arch IFC</a> page to learn more about how to install it.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Once IfcOpenShell is installed, exporting your model as an IFC file is as simple as selecting the objects you wish to export, or just the top container (group or Building Part) that contains all other objects you wish to export, and use menu <b>File &rarr; Export</b> and choose the IFC file format.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Finally, once you have exported an IFC file, it is always a good idea to inspect it before sending it to other people, to make sure the model looks good and no object is missing. There are many free IFC viewer applications available on the internet for many platforms. A good, open-source viewer that works on all platforms is <a rel="nofollow" class="external text" href="http://ifcquery.com/">IFC++</a>. If you want to use the IFC file for further editing <a rel="nofollow" class="external text" href="https://bonsaibim.org">Bonsai</a> might be useful.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>To test the structure and validity of your model for IFC export run the <b>Manage &rarr; Preflight Checks</b> tool. This will be discussed in the next section.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p><b>Tutorial steps</b>
</p>
<div class="infotext"></div>
<i><div class="goal1">Open the BIM preflight tool and run all the tests</div></i>
<div class="test1" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;">True if (hasattr(FreeCADGui,"BIMPreflightDone") and (FreeCADGui.BIMPreflightDone == True)) else False</div>
<i><div class="goal2"></div></i>
<div class="test2" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;"></div>
<p><br>
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span class="mw-headline" id="Managing_BIM_properties">Managing BIM properties</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>A huge part of what makes a good BIM model are the non-geometry properties that you can give to your objects, such as type, material, or properties specific to a certain type. For example, a wall can be marked as load-bearing or not. Or as exterior or interior. The <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Industry_Foundation_Classes">IFC format</a> is very rich in that regard. The amount of specifications and properties you want to give your objects depends mostly on your needs and how you work with others and what they expect your BIM model to contain.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>One thing is important to keep in mind: all BIM/Arch objects in FreeCAD support the full set of IFC properties. Other FreeCAD objects, such as those modeled with other workbenches, will also be exported to IFC but you cannot change any of their IFC properties. You can however convert any FreeCAD object to a BIM object by selecting the object and using <b>3D/BIM &rarr; Create Component</b>.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>The main pieces of information you can give your objects are:
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h4><span class="mw-headline" id="Name_and_description">Name and description</span></h4>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>This seems obvious, but the simplest way to make your model more understandable to others is to properly name each of your objects, and, if relevant, add a description. This is done simply by selecting an object, and pressing <b>F2</b>, or change its <b>Label</b> property to rename it. The Description will be found among the object properties.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h4><span id="The_BIM.2FIFC_type"></span><span class="mw-headline" id="The_BIM/IFC_type">The BIM/IFC type</span></h4>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>This is the most fundamental piece of information. In FreeCAD, an object created with the wall tool will have its IFC type set to "Wall" by default. But you can change this anytime. So you can use the wall tool to model a beam for example. You only need to change its IFC type after creating it. To change the IFC type of an object, select it, find its <b>IFC Type</b> in its properties, and change to another type from the drop-down list.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>You can also bulk-manage names, types and materials of several objects at a time using the IFC elements manager found under menu <b>Manage &rarr; Manage IFC Elements</b>.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h4><span class="mw-headline" id="Materials">Materials</span></h4>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Each object of a construction has a material. So it makes sense to give each object of your model a proper material, such as concrete or wood. To attribute a material to an object, select the object, and use the <a href="../Arch_SetMaterial.html" title="Arch SetMaterial">materials manager</a> from menu <b>Manage &rarr; Material</b>.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h4><span class="mw-headline" id="Properties">Properties</span></h4>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Each BIM object can also receive additional properties, for example to indicate that a wall is load-bearing or not. IFC allows you to add custom properties to just anything, but most types such as Wall or Beam also have special, predefined sets of properties, usually named Pset_WallCommon or Pset_BeamCommon. You can choose to add these sets to your objects, modify the value of the properties contained in the set, or add your custom properties. Managing the IFC properties for a selected object or bulk edit the properties of several objects at a time is done using the properties manager under menu <b>Manage &rarr; Manage IFC Properties</b>.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h4><span class="mw-headline" id="Quantities">Quantities</span></h4>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Quantities such as length or width or height of a wall can also be specifically written to an IFC file. They are not linked to the geometry of the object, so when meeting such quantities in an IFC file there is no guarantee that they reflect the actual object geometry. However, these quantities allow applications that are not able to process the geometry, such as spreadsheet applications, to know the principal dimensions of objects. You can check which quantities will be exported to IFC using the quantities manager found under menu <b>Manage &rarr; Manage IFC Quantities</b>.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h4><span class="mw-headline" id="BIM_Preflight_tool">BIM Preflight tool</span></h4>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>The IFC format has many particularities and sometimes the application you will be opening your IFC file with or the person who will receive your IFC file will have further requirements. Becoming a fluent BIM modeller often means to get familiar with all these particularities and what needs to be added or specified to your BIM model. The BIM Workbench of FreeCAD provides a <a href="../BIM_Preflight.html" title="BIM Preflight">BIM Preflight</a> tool that allows you to check your model for several of these particularities and most common requirements, and help you decide what to include in your model or not.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p><b>Tutorial steps</b>
</p>
<div class="infotext">No action to perform for this step</div>
<i><div class="goal1"></div></i>
<div class="test1" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;"></div>
<i><div class="goal2"></div></i>
<div class="test2" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;"></div>
<p><br>
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span class="mw-headline" id="Explore_other_BIM_tools_and_other_workbenches">Explore other BIM tools and other workbenches</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Take a moment to explore the other available BIM tools. Remeber that some are still not finished, and might not do everything you expect from them. Use the "What's This?" button found in menu <b>Help</b> to open the help page of any tool. The <a rel="nofollow" class="external text" href="https://forum.freecad.org">FreeCAD forum</a> is also always a good place to search or ask when encountering a specific problem you cannot solve.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>FreeCAD is a big family of workbenches, and tools from other workbenches often come in handy. As we saw above, almost any object created from other workbenches can be turned into a valid BIM object, simply using the <b>3D/BIM &rarr; Generic 3D Tools &rarr; Component</b> tool and giving it the correct IFC type.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>There are more tutorials about BIM and other workbenches in the <a href="../Tutorials.html" title="Tutorials">Tutorials</a> section of the <a href="../Main_Page.html" title="Main Page">FreeCAD documentation</a>, and a complete video series of <a rel="nofollow" class="external text" href="https://www.youtube.com/playlist?list=PLmKdGVtV5Vnt2cj4IZIv9FM39QHaE1ZaU">BIM tutorials</a> on YouTube.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p><b>Tutorial steps</b>
</p>
<div class="infotext">No action to perform for this step</div>
<i><div class="goal1"></div></i>
<div class="test1" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;"></div>
<i><div class="goal2"></div></i>
<div class="test2" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;"></div>
<p><br>
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span id="Help_FreeCAD_to_become_a_better_tool.21"></span><span class="mw-headline" id="Help_FreeCAD_to_become_a_better_tool!">Help FreeCAD to become a better tool!</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>FreeCAD is free software developed by an enthusiastic community of users, some of whom develop code, and many others who contribute in one form or another to make the software better by writing documentation, finding and reporting bugs, submitting ideas, writing tutorials, and many other things. The more and more active we are, the faster the software gets developed further. Why not join us? A good place to start is the <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewforum.php?f=23">BIM section on the FreeCAD forum</a>. See you there!
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p><b>Tutorial steps</b>
</p>
<div class="infotext">No action to perform for this step</div>
<i><div class="goal1"></div></i>
<div class="test1" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;"></div>
<i><div class="goal2"></div></i>
<div class="test2" style="display: block; unicode-bidi: embed; font-family: monospace; white-space: pre;"></div>
<p><br>
</p>
</div>
<!-- 
NewPP limit report
Cached time: 20260223082447
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.234 seconds
Real time usage: 0.316 seconds
Preprocessor visited node count: 1034/1000000
Post&#8208;expand include size: 15067/2097152 bytes
Template argument size: 4819/2097152 bytes
Highest expansion depth: 7/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1426/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   23.431      1 -total
 28.13%    6.592      4 Template:PropertyData
 22.54%    5.281      2 Template:Value
 18.97%    4.444      5 Template:Variable
 14.92%    3.495     23 Template:BIMTutorialAction
 14.60%    3.422      2 Template:Incode
 12.92%    3.027      1 Template:PropertyView
 12.13%    2.843      1 Template:UnfinishedDocu/ru
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:225191-0!canonical and timestamp 20260223082447 and revision id 1758673. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>