<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Command/ru</span></h1><?xml encoding="UTF-8"><div class="mw-parser-output"><div class="mw-pt-languages noprint" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../de/Command.html" class="mw-pt-progress mw-pt-progress--complete" title="Befehl (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Command.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Command (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../tr/Command.html" class="mw-pt-progress mw-pt-progress--stub" title="Komutlar (14% translated)" lang="tr" dir="ltr">T&uuml;rk&ccedil;e</a></li>
<li><a href="../es/Command.html" class="mw-pt-progress mw-pt-progress--stub" title="Command (7% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/Command.html" class="mw-pt-progress mw-pt-progress--complete" title="Les commandes (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/Command.html" class="mw-pt-progress mw-pt-progress--complete" title="Comando (100% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Command.html" class="mw-pt-progress mw-pt-progress--complete" title="Polecenia (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt-br/Command.html" class="mw-pt-progress mw-pt-progress--stub" title="Comandos (14% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../ro/Command.html" class="mw-pt-progress mw-pt-progress--stub" title="Comanda (14% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</span></li>
<li><a href="../zh-cn/Command.html" class="mw-pt-progress mw-pt-progress--stub" title="&#21629;&#20196; (14% translated)" lang="zh-Hans-CN" dir="ltr">&#20013;&#25991;&#65288;&#20013;&#22269;&#22823;&#38470;&#65289;</a></li></ul></div>
<p><span id="Introduction"></span>
</p>
<h2><span id=".D0.92.D1.81.D1.82.D1.83.D0.BF.D0.BB.D0.B5.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1042;&#1089;&#1090;&#1091;&#1087;&#1083;&#1077;&#1085;&#1080;&#1077;">&#1042;&#1089;&#1090;&#1091;&#1087;&#1083;&#1077;&#1085;&#1080;&#1077;</span></h2>
<div style="clear:right; margin-bottom: .5em; float: right; padding: .5em 0 .8em 1.4em; background: none;"><meta property="mw:PageProp/toc"></div>
<p>&#1055;&#1086;&#1076; <a class="mw-selflink selflink">&#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1086;&#1081;</a> &#1087;&#1086;&#1076;&#1088;&#1072;&#1079;&#1091;&#1084;&#1077;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1081; (&#1082;&#1086;&#1076;&#1072;), &#1074; &#1089;&#1083;&#1077;&#1076;&#1089;&#1090;&#1074;&#1080;&#1080; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1103; &#1082;&#1072;&#1082;&#1086;&#1081;-&#1083;&#1080;&#1073;&#1086; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1080;&#1083;&#1080; &#1087;&#1088;&#1080; &#1085;&#1072;&#1073;&#1086;&#1088;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1081; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096; &#1085;&#1072; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1077;. &#1069;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1082;&#1072;&#1082; &#1086;&#1095;&#1077;&#1085;&#1100; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1077; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077;, &#1082;&#1072;&#1082; &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103; &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; <a href="../ru/3D_view.html" title="3D view/ru">&#1090;&#1088;&#1105;&#1093;&#1084;&#1077;&#1088;&#1085;&#1086;&#1075;&#1086; &#1074;&#1080;&#1076;&#1072;</a> &#1080;&#1083;&#1080; &#1087;&#1086;&#1074;&#1086;&#1088;&#1086;&#1090; &#1090;&#1086;&#1095;&#1082;&#1080; &#1086;&#1073;&#1079;&#1086;&#1088;&#1072;, &#1090;&#1072;&#1082; &#1080; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1089;&#1085;&#1086;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1099;&#1077; &#1086;&#1082;&#1085;&#1072; &#1080; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1078;&#1080;&#1076;&#1072;&#1090;&#1100;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103;.
</p>
<div class="mw-translate-fuzzy">
<p>&#1050;&#1072;&#1078;&#1076;&#1072;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; FreeCAD &#1080;&#1084;&#1077;&#1077;&#1090; &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1080;&#1084;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1074;&#1085;&#1077;&#1089;&#1077;&#1085;&#1086; &#1074; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; <a href="../ru/Category;Command_Reference.html" title="Category:Command Reference/ru">:Category:Command_Reference/ru</a>. &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1084;&#1086;&#1075;&#1091;&#1090; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1080;&#1083;&#1080; &#1080;&#1079; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1084;&#1077;&#1085;&#1102;, &#1072; &#1090;&#1072;&#1082; &#1078;&#1077; &#1080;&#1079; <a href="../ru/Python.html" title="Python/ru">python</a> &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1072; &#1080;&#1083;&#1080; <a href="../ru/Python_console.html" title="Python console/ru">&#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1080; Python</a>, &#1087;&#1086; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1086;&#1084; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1081; &#1082;&#1086;&#1084;&#1084;&#1072;&#1085;&#1076;&#1099;:
</p>
</div>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">FreeCADGui</span><span class="o">.</span><span class="n">runCommand</span><span class="p">(</span><span class="s2">"my_Command_Name"</span><span class="p">)</span>
</pre></div>
<p><span id="Background"></span>
</p>
<h2><span id=".D0.9E.D1.81.D0.BD.D0.BE.D0.B2.D1.8B"></span><span class="mw-headline" id="&#1054;&#1089;&#1085;&#1086;&#1074;&#1099;">&#1054;&#1089;&#1085;&#1086;&#1074;&#1099;</span></h2>
<p>&#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; FreeCAD &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086; &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072;. &#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1089;&#1074;&#1086;&#1080; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1074;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072; FreeCAD, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1080; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072; &#1089;&#1088;&#1072;&#1079;&#1091; &#1087;&#1086;&#1089;&#1083;&#1077; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072; FreeCAD, &#1085;&#1077;&#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086; &#1086;&#1090; &#1090;&#1086;&#1075;&#1086;, &#1073;&#1099;&#1083; &#1083;&#1080; &#1072;&#1082;&#1090;&#1080;&#1074;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1081; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; &#1080;&#1083;&#1080; &#1085;&#1077;&#1090;. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1074; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093; &#1072;&#1074;&#1090;&#1086;&#1088; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1081; &#1089;&#1088;&#1077;&#1076;&#1099;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1088;&#1077;&#1096;&#1080;&#1083; &#1085;&#1077; &#1087;&#1077;&#1088;&#1077;&#1075;&#1088;&#1091;&#1078;&#1072;&#1090;&#1100;/&#1085;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072; FreeCAD &#1080; &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1083; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1088;&#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1077; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1081; &#1089;&#1088;&#1077;&#1076;&#1099;. &#1042; &#1101;&#1090;&#1080;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077; &#1072;&#1082;&#1090;&#1080;&#1074;&#1072;&#1094;&#1080;&#1080; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1075;&#1086; &#1089;&#1090;&#1086;&#1083;&#1072; (&#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1080;&#1083;&#1080;&#1089;&#1100; &#1085;&#1072; &#1085;&#1077;&#1075;&#1086; &#1087;&#1086; &#1082;&#1088;&#1072;&#1081;&#1085;&#1077;&#1081; &#1084;&#1077;&#1088;&#1077; &#1086;&#1076;&#1080;&#1085; &#1088;&#1072;&#1079; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1077;&#1083;&#1103; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072;).
</p><p>&#1055;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1080;&#1079; &#1085;&#1080;&#1093; &#1090;&#1088;&#1077;&#1073;&#1091;&#1102;&#1090; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; &#1089; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084;, &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; FreeCAD &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072;, &#1072; &#1085;&#1077; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; &#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1080;. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1076;&#1083;&#1103; &#1091;&#1076;&#1086;&#1073;&#1089;&#1090;&#1074;&#1072; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; FreeCAD &#1083;&#1080;&#1073;&#1086; &#1073;&#1091;&#1076;&#1091;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1091;&#1102; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102; python (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, <code>Part.makeBox</code> &#1080;&#1083;&#1080; <code>Draft.makeLine</code>), &#1083;&#1080;&#1073;&#1086; &#1073;&#1091;&#1076;&#1091;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100; &#1082;&#1086;&#1076;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1086;&#1095;&#1077;&#1085;&#1100; &#1083;&#1077;&#1075;&#1082;&#1086; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1080; &#1074; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1077; python &#1080;/&#1080;&#1083;&#1080; <a href="../ru/Macros.html" title="Macros/ru">&#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1077;</a>.
</p><p>&#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1099; &#1082;&#1072;&#1082; &#1085;&#1072; &#1103;&#1079;&#1099;&#1082;&#1077; C++, &#1090;&#1072;&#1082; &#1080; &#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1086;&#1084; Python.
</p><p><span id="Commands_defined_in_C++"></span>
</p>
<h2><span id=".D0.9D.D0.B0.D0.B7.D0.BD.D0.B0.D1.87.D0.B5.D0.BD.D0.B8.D0.B5_.D0.BA.D0.BE.D0.BC.D0.B0.D0.BD.D0.B4_.D0.B2_C.2B.2B"></span><span class="mw-headline" id="&#1053;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;_&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;_&#1074;_C++">&#1053;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1074; C++</span></h2>
<p>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1085;&#1072; &#1103;&#1079;&#1099;&#1082;&#1077; C++, &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1087;&#1086; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1081; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1088;&#1077; <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">Mod/ModuleName/Gui/Command.cpp</span>.
</p>
<div class="mw-highlight mw-highlight-lang-cpp mw-content-ltr" dir="ltr"><pre><span></span><span class="n">DEF_STD_CMD_A</span><span class="p">(</span><span class="n">StdCmdMyCommand</span><span class="p">);</span><span class="w"></span>

<span class="n">StdCmdMyCommand</span><span class="o">::</span><span class="n">StdCmdMyCommand</span><span class="p">()</span><span class="w"></span>
<span class="w">  </span><span class="o">:</span><span class="w"> </span><span class="n">Command</span><span class="p">(</span><span class="s">"Std_My_Command"</span><span class="p">)</span><span class="w"></span>
<span class="p">{</span><span class="w"></span>
<span class="w">    </span><span class="n">sGroup</span><span class="w">        </span><span class="o">=</span><span class="w"> </span><span class="n">QT_TR_NOOP</span><span class="p">(</span><span class="s">"File"</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">sMenuText</span><span class="w">     </span><span class="o">=</span><span class="w"> </span><span class="n">QT_TR_NOOP</span><span class="p">(</span><span class="s">"My Command"</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">sToolTipText</span><span class="w">  </span><span class="o">=</span><span class="w"> </span><span class="n">QT_TR_NOOP</span><span class="p">(</span><span class="s">"Runs my command in the active document"</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">sWhatsThis</span><span class="w">    </span><span class="o">=</span><span class="w"> </span><span class="s">"Std_MyCommand"</span><span class="p">;</span><span class="w"></span>
<span class="w">    </span><span class="n">sStatusTip</span><span class="w">    </span><span class="o">=</span><span class="w"> </span><span class="n">QT_TR_NOOP</span><span class="p">(</span><span class="s">"Runs my command in the active document"</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">sPixmap</span><span class="w">       </span><span class="o">=</span><span class="w"> </span><span class="s">"MyCommand.svg"</span><span class="p">;</span><span class="w"></span>
<span class="w">    </span><span class="n">sAccel</span><span class="w">        </span><span class="o">=</span><span class="w"> </span><span class="s">"Ctrl+A"</span><span class="p">;</span><span class="w"></span>
<span class="p">}</span><span class="w"></span>

<span class="kt">void</span><span class="w"> </span><span class="n">StdCmdExport</span><span class="o">::</span><span class="n">activated</span><span class="p">(</span><span class="kt">int</span><span class="w"> </span><span class="n">iMsg</span><span class="p">)</span><span class="w"></span>
<span class="p">{</span><span class="w"></span>
<span class="w">    </span><span class="c1">// place here the code to be executed when the command is ran</span>
<span class="p">}</span><span class="w"></span>

<span class="kt">bool</span><span class="w"> </span><span class="n">StdCmdMyCommand</span><span class="o">::</span><span class="n">isActive</span><span class="p">(</span><span class="kt">void</span><span class="p">)</span><span class="w"></span>
<span class="p">{</span><span class="w"></span>
<span class="w">    </span><span class="c1">// here you have a chance to return true or false depending if your command must be shown as active or inactive (greyed).</span>
<span class="p">}</span><span class="w"></span>

<span class="c1">// the command must be "registered" in FreeCAD's command system</span>
<span class="n">CommandManager</span><span class="w"> </span><span class="o">&amp;</span><span class="n">rcCmdMgr</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">Application</span><span class="o">::</span><span class="n">Instance</span><span class="o">-&gt;</span><span class="n">commandManager</span><span class="p">();</span><span class="w"></span>
<span class="n">rcCmdMgr</span><span class="p">.</span><span class="n">addCommand</span><span class="p">(</span><span class="k">new</span><span class="w"> </span><span class="n">StdCmdMyCommand</span><span class="p">());</span><span class="w"></span>
</pre></div>
<p><span id="Commands_defined_in_Python"></span>
</p>
<h2><span id=".D0.9D.D0.B0.D0.B7.D0.BD.D0.B0.D1.87.D0.B5.D0.BD.D0.B8.D0.B5_.D0.BA.D0.BE.D0.BC.D0.B0.D0.BD.D0.B4_.D0.B2_Python"></span><span class="mw-headline" id="&#1053;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;_&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;_&#1074;_Python">&#1053;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1074; Python</span></h2>
<p>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1085;&#1072; &#1103;&#1079;&#1099;&#1082;&#1077; Python. &#1044;&#1072;&#1085;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085; &#1074; &#1087;&#1072;&#1087;&#1082;&#1077; &#1087;&#1086; &#1072;&#1076;&#1088;&#1077;&#1089;&#1089;&#1091; &#1074;&#1088;&#1086;&#1076;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086;: <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">Mod/ModuleName/tools/commands.py</span>.
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="kn">from</span> <span class="nn">PySide.QtCore</span> <span class="kn">import</span> <span class="n">QT_TRANSLATE_NOOP</span>


<span class="k">class</span> <span class="nc">MyCommand</span><span class="p">:</span>
    <span class="sd">"""Explanation of the command."""</span>

    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
        <span class="sd">"""Initialize variables for the command that must exist at all times."""</span>
        <span class="k">pass</span>

    <span class="k">def</span> <span class="nf">GetResources</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
        <span class="sd">"""Return a dictionary with data that will be used by the button or menu item."""</span>
        <span class="k">return</span> <span class="p">{</span><span class="s1">'Pixmap'</span><span class="p">:</span> <span class="s1">'MyCommand.svg'</span><span class="p">,</span>
                <span class="s1">'Accel'</span><span class="p">:</span> <span class="s2">"Ctrl+A"</span><span class="p">,</span>
                <span class="s1">'MenuText'</span><span class="p">:</span> <span class="n">QT_TRANSLATE_NOOP</span><span class="p">(</span><span class="s2">"My_Command"</span><span class="p">,</span> <span class="s2">"My Command"</span><span class="p">),</span>
                <span class="s1">'ToolTip'</span><span class="p">:</span> <span class="n">QT_TRANSLATE_NOOP</span><span class="p">(</span><span class="s2">"My_Command"</span><span class="p">,</span> <span class="s2">"Runs my command in the active document"</span><span class="p">)}</span>

    <span class="k">def</span> <span class="nf">Activated</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
        <span class="sd">"""Run the following code when the command is activated (button press)."""</span>
        <span class="nb">print</span><span class="p">(</span><span class="s2">"Activated"</span><span class="p">)</span>

    <span class="k">def</span> <span class="nf">IsActive</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
        <span class="sd">"""Return True when the command should be active or False when it should be disabled (greyed)."""</span>
        <span class="k">return</span> <span class="kc">True</span>

<span class="c1"># The command must be "registered" with a unique name by calling its class.</span>
<span class="n">FreeCADGui</span><span class="o">.</span><span class="n">addCommand</span><span class="p">(</span><span class="s1">'My_Command'</span><span class="p">,</span> <span class="n">MyCommand</span><span class="p">())</span>
</pre></div>
<p><span id="Examples"></span>
</p>
<h2><span id=".D0.9F.D1.80.D0.B8.D0.BC.D0.B5.D1.80.D1.8B"></span><span class="mw-headline" id="&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099;">&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099;</span></h2>
<p>&#1057;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; <a href="../ru/Line_drawing_function.html" title="Line drawing function/ru">&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102; &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1083;&#1080;&#1085;&#1080;&#1080;</a>.
</p>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: #fefefe;"><span typeof="mw:File"><a href="../index.php?title=Power_user_hub.png&amp;filetimestamp=20200511213015&amp;.html" class="mw-file-description"><img src="../File/Power_user_hub.png" decoding="async" width="24" height="24"></a></span> <a href="../ru/Power_users_hub.html" title="Power users hub/ru">Power user documentation</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid #aaaaaa; text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: #fefefe;">
<ul><li><b>FreeCAD scripting:</b> <a href="../ru/Python.html" title="Python/ru">Python</a>, <a href="../ru/Introduction_to_Python.html" title="Introduction to Python/ru">Introduction to Python</a>, <a href="../ru/Python_scripting_tutorial.html" title="Python scripting tutorial/ru">Python scripting tutorial</a>, <a href="../ru/FreeCAD_Scripting_Basics.html" title="FreeCAD Scripting Basics/ru">FreeCAD Scripting Basics</a></li></ul>
<hr>
<ul><li><b>Modules:</b> <a href="../ru/Builtin_modules.html" title="Builtin modules/ru">Builtin modules</a>, <a href="../ru/Units.html" title="Units/ru">Units</a>, <a href="../index.php?title=Quantity/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Quantity/ru (page does not exist)">Quantity</a></li>
<li><b>Workbenches:</b> <a href="../ru/Workbench_creation.html" title="Workbench creation/ru">Workbench creation</a>, <a href="../ru/Gui_Command.html" title="Gui Command/ru">Gui Commands</a>, <a class="mw-selflink selflink">Commands</a>, <a href="../ru/Installing_more_workbenches.html" title="Installing more workbenches/ru">Installing more workbenches</a></li>
<li><b>Meshes and Parts:</b> <a href="../ru/Mesh_Scripting.html" title="Mesh Scripting/ru">Mesh Scripting</a>, <a href="../ru/Topological_data_scripting.html" title="Topological data scripting/ru">Topological data scripting</a>, <a href="../ru/Mesh_to_Part.html" title="Mesh to Part/ru">Mesh to Part</a>, <a href="../ru/PythonOCC.html" title="PythonOCC/ru">PythonOCC</a></li></ul>
<hr>
<ul><li><b>Parametric objects:</b> <a href="../ru/Scripted_objects.html" title="Scripted objects/ru">Scripted objects</a>, <a href="../ru/Viewprovider.html" title="Viewprovider/ru">Viewproviders</a> <small>(<a href="../index.php?title=Custom_icon_in_tree_view/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Custom icon in tree view/ru (page does not exist)">Custom icon in tree view</a>)</small></li>
<li><b>Scenegraph:</b> <a href="../ru/Scenegraph.html" title="Scenegraph/ru">Coin (Inventor) scenegraph</a>, <a href="../ru/Pivy.html" title="Pivy/ru">Pivy</a></li>
<li><b>Graphical interface:</b> <a href="../ru/Interface_creation.html" title="Interface creation/ru">Interface creation</a>, <a href="../ru/Dialog_creation.html" title="Dialog creation/ru">Interface creation completely in Python</a> <small>(<a href="../index.php?title=Dialog_creation_with_various_widgets/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation with various widgets/ru (page does not exist)">1</a>, <a href="../index.php?title=Dialog_creation_reading_and_writing_files/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation reading and writing files/ru (page does not exist)">2</a>, <a href="../index.php?title=Dialog_creation_setting_colors/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation setting colors/ru (page does not exist)">3</a>, <a href="../index.php?title=Dialog_creation_image_and_animated_GIF/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation image and animated GIF/ru (page does not exist)">4</a>, <a href="../index.php?title=PySide_usage_snippets/ru&amp;action=edit&amp;redlink=1.html" class="new" title="PySide usage snippets/ru (page does not exist)">5</a>)</small>, <a href="../ru/PySide.html" title="PySide/ru">PySide</a>, PySide examples <a href="../ru/PySide_Beginner_Examples.html" title="PySide Beginner Examples/ru">beginner</a>, <a href="../ru/PySide_Intermediate_Examples.html" title="PySide Intermediate Examples/ru">intermediate</a>, <a href="../ru/PySide_Advanced_Examples.html" title="PySide Advanced Examples/ru">advanced</a></li>
<li><b>Macros:</b> <a href="../ru/Macros.html" title="Macros/ru">Macros</a>, <a href="../ru/How_to_install_macros.html" title="How to install macros/ru">How to install macros</a></li>
<li><b>Embedding:</b> <a href="../ru/Embedding_FreeCAD.html" title="Embedding FreeCAD/ru">Embedding FreeCAD</a>, <a href="../ru/Embedding_FreeCADGui.html" title="Embedding FreeCADGui/ru">Embedding FreeCADGui</a></li></ul>
<hr>
<ul><li><b>Other:</b> <a href="../ru/Expressions.html" title="Expressions/ru">Expressions</a>, <a href="../ru/Code_snippets.html" title="Code snippets/ru">Code snippets</a>, <a href="../ru/Line_drawing_function.html" title="Line drawing function/ru">Line drawing function</a>, <a href="../ru/FreeCAD_vector_math_library.html" title="FreeCAD vector math library/ru">FreeCAD vector math library</a> <small>(deprecated)</small></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="../ru/User_hub.html" title="User hub/ru">User hub</a>, <a href="../ru/Power_users_hub.html" title="Power users hub/ru">Power users hub</a>, <a href="../ru/Developer_hub.html" title="Developer hub/ru">Developer hub</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20250621231718
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc, no&#8208;toc&#8208;conversion]
CPU time usage: 0.148 seconds
Real time usage: 0.748 seconds
Preprocessor visited node count: 163/1000000
Post&#8208;expand include size: 6611/2097152 bytes
Template argument size: 4186/2097152 bytes
Highest expansion depth: 5/100
Expensive parser function count: 3/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 9714/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%  470.100      1 -total
 94.21%  442.864      3 Template:Code
  1.89%    8.892      1 Template:Powerdocnavi/ru
  1.60%    7.535      1 Template:TOCright
  1.13%    5.324      2 Template:Incode
  0.95%    4.474      2 Template:FileName
  0.67%    3.129      1 Template:Navigation_menu_2
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:117181-0!canonical and timestamp 20250621231717 and revision id 1594872. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>