<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Compile on Linux/ru</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="ru" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Compile+on+Linux&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/Compile_on_Linux.html" class="mw-pt-progress mw-pt-progress--complete" title="Kompilieren unter Linux (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Compile_on_Linux.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Compile on Linux (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/Compile_on_Linux.html" class="mw-pt-progress mw-pt-progress--med" title="Compilar en Linux (69% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/Compile_on_Linux.html" class="mw-pt-progress mw-pt-progress--complete" title="Compiler sous Linux (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/Compile_on_Linux.html" class="mw-pt-progress mw-pt-progress--high" title="Compilazione in Linux (96% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Compile_on_Linux.html" class="mw-pt-progress mw-pt-progress--complete" title="Kompilacja w systemie Linux (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt/Compile_on_Linux.html" class="mw-pt-progress mw-pt-progress--low" title="Compile on Linux/pt (0% translated)" lang="pt" dir="ltr">portugu&ecirc;s</a></li>
<li><a href="../pt-br/Compile_on_Linux.html" class="mw-pt-progress mw-pt-progress--high" title="Compilar no Linux (76% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../ro/Compile_on_Linux.html" class="mw-pt-progress mw-pt-progress--low" title="Compile on Linux/ro (0% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><a href="../cs/Compile_on_Linux.html" class="mw-pt-progress mw-pt-progress--low" title="Compile on Linux/cs (0% translated)" lang="cs" dir="ltr">&#269;e&scaron;tina</a></li>
<li><a href="../bg/Compile_on_Linux.html" class="mw-pt-progress mw-pt-progress--low" title="Compile on Linux/bg (0% translated)" lang="bg" dir="ltr">&#1073;&#1098;&#1083;&#1075;&#1072;&#1088;&#1089;&#1082;&#1080;</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--med" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</span></li>
<li><a href="../ja/Compile_on_Linux.html" class="mw-pt-progress mw-pt-progress--low" title="Linux&#12391;&#12398;&#12467;&#12531;&#12497;&#12452;&#12523; (0% translated)" lang="ja" dir="ltr">&#26085;&#26412;&#35486;</a></li>
<li><a href="../ko/Compile_on_Linux.html" class="mw-pt-progress mw-pt-progress--low" title="Compile on Linux/ko (0% translated)" lang="ko" dir="ltr">&#54620;&#44397;&#50612;</a></li></ul></div>
<div class="docnav">
    <div><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-left.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span> <a href="../ru/Compile_on_Windows.html" title="Compile on Windows/ru">&#1050;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1103; &#1074; Windows</a></div>
    <div><a href="../ru/Compile_on_MacOS.html" title="Compile on MacOS/ru">&#1050;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1103; &#1074; MacOS</a>
 <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-right.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span></div>
    <div><a href="../ru/Online_Help_Toc.html" title="Online Help Toc/ru">&#1054;&#1075;&#1083;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;</a> <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Online_Help_Toc.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span></div>
</div>
<div class="warning-box">&#1057;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1101;&#1082;&#1089;&#1087;&#1077;&#1088;&#1080;&#1084;&#1077;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088; FreeCAD Docker, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1088;&#1086;&#1090;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; FreeCAD. &#1055;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1077;&#1077; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; <a href="../ru/Compile_on_Docker.html" title="Compile on Docker/ru">&#1050;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1103; &#1074; Docker</a></div>
<div style="clear:right; margin-bottom: .5em; float: right; padding: .5em 0 .8em 1.4em; background: none;"><meta property="mw:PageProp/toc"></div>
<p><span id="Overview"></span>
</p>
<h2><span id=".D0.9E.D0.B1.D0.B7.D0.BE.D1.80"></span><span class="mw-headline" id="&#1054;&#1073;&#1079;&#1086;&#1088;">&#1054;&#1073;&#1079;&#1086;&#1088;</span></h2>
<div class="mw-translate-fuzzy">
<p>&#1042; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1093; &#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074;&#1072;&#1093; Linux, FreeCAD, &#1082;&#1072;&#1082; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1086;, &#1089;&#1086;&#1073;&#1080;&#1088;&#1072;&#1077;&#1090;&#1089;&#1103; &#1083;&#1077;&#1075;&#1082;&#1086;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1074;&#1089;&#1077; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1084;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088;&#1086;&#1084; &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074;. &#1042; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1084; &#1089;&#1073;&#1086;&#1088;&#1082;&#1072; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090; 3 &#1101;&#1090;&#1072;&#1087;&#1072;:
</p>
<ol><li>&#1055;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072; FreeCAD.</li>
<li>&#1055;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1077;&#1081;, &#1080;&#1083;&#1080; &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074;, &#1086;&#1090; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1090; FreeCAD</li>
<li>&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <code>cmake</code> &#1080; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <code>make</code>.</li></ol>
</div>
<p>&#1053;&#1080;&#1078;&#1077; &#1074;&#1099; &#1085;&#1072;&#1081;&#1076;&#1077;&#1090;&#1077; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086;&#1077; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1072; &#1089;&#1073;&#1086;&#1088;&#1082;&#1080;, &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; <a href="#Automatic_build_scripts">&#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1074; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080;</a> &#1080; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081;, &#1089; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084;&#1080; &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1089;&#1090;&#1086;&#1083;&#1082;&#1085;&#1091;&#1090;&#1100;&#1089;&#1103;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1085;&#1072;&#1081;&#1076;&#1077;&#1090;&#1077; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080;, &#1091;&#1089;&#1090;&#1072;&#1088;&#1077;&#1074;&#1096;&#1080;&#1077; &#1089;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; (&#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074;&#1099; Linux &#1084;&#1077;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;), &#1080;&#1083;&#1080; &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1077; &#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1085;&#1077;&#1090; &#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077;, &#1086;&#1073;&#1089;&#1091;&#1076;&#1080;&#1090;&#1077; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089; &#1085;&#1072; <a rel="nofollow" class="external text" href="https://forum.freecad.org/index.php">&#1092;&#1086;&#1088;&#1091;&#1084;&#1077;</a>, &#1080; &#1087;&#1086;&#1084;&#1086;&#1075;&#1080;&#1090;&#1077; &#1085;&#1072;&#1084; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1080;&#1090;&#1100; &#1101;&#1090;&#1086;.
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p><span typeof="mw:File"><a href="../index.php?title=FreeCAD_source_compilation_workflow.svg&amp;filetimestamp=20200225195107&amp;.html" class="mw-file-description"><img src="../File/FreeCAD_source_compilation_workflow.svg" decoding="async" width="800" height="386" class="mw-file-element" data-file-width="1065" data-file-height="514"></a></span>
</p>
</div>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">&#1054;&#1073;&#1097;&#1080;&#1081; &#1088;&#1072;&#1073;&#1086;&#1095;&#1080;&#1081; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089; &#1076;&#1083;&#1103; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080; FreeCAD &#1080;&#1079; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1080;&#1082;&#1086;&#1074;. &#1042; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1082;&#1072;&#1082; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1080;&#1077; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080;, &#1090;&#1072;&#1082; &#1080; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077; &#1082;&#1086;&#1076;&#1099; &#1089;&#1072;&#1084;&#1086;&#1075;&#1086; FreeCAD. CMake &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091; &#1090;&#1072;&#1082; &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1077;&#1089;&#1100; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1089;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1083;&#1089;&#1103; &#1086;&#1076;&#1085;&#1086;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1077;&#1081; make.</p>
<p><span id="Getting_the_source"></span>
</p>
<h2><span id=".D0.9F.D0.BE.D0.BB.D1.83.D1.87.D0.B5.D0.BD.D0.B8.D0.B5_.D0.B8.D1.81.D1.85.D0.BE.D0.B4.D0.BD.D1.8B.D1.85_.D0.BA.D0.BE.D0.B4.D0.BE.D0.B2"></span><span class="mw-headline" id="&#1055;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077;_&#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1093;_&#1082;&#1086;&#1076;&#1086;&#1074;">&#1055;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1093; &#1082;&#1086;&#1076;&#1086;&#1074;</span></h2>
<h3><span class="mw-headline" id="Git">Git</span></h3>
<div class="mw-translate-fuzzy">
<p>&#1051;&#1091;&#1095;&#1096;&#1080;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1082;&#1086;&#1076; &#1101;&#1090;&#1086; &#1082;&#1083;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD">Git &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1081; Git</a> &#1090;&#1086;&#1083;&#1100;&#1082;&#1086;-&#1076;&#1083;&#1103;-&#1095;&#1090;&#1077;&#1085;&#1080;&#1103;. &#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1074;&#1072;&#1084; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; <code>git</code>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1083;&#1077;&#1075;&#1082;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1074; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074;&#1086;&#1074; Linux. &#1057;&#1082;&#1072;&#1095;&#1072;&#1090;&#1100; &#1077;&#1105; &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072; <a rel="nofollow" class="external text" href="http://git-scm.com/">&#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; &#1074;&#1077;&#1073;-&#1089;&#1072;&#1081;&#1090;&#1077;</a>.
</p>
</div>
<div class="mw-translate-fuzzy">
<p>Git &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1081; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1086;&#1081;:
</p>
</div>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span>sudo<span class="w"> </span>apt<span class="w"> </span>install<span class="w"> </span>git
</pre></div>
<p>&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1072;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072;, &#1082;&#1086;&#1087;&#1080;&#1088;&#1091;&#1077;&#1090; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1102;&#1102; &#1074;&#1077;&#1088;&#1089;&#1080;&#1102; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072; FreeCAD &#1074; &#1087;&#1072;&#1087;&#1082;&#1091;  <code>freecad-source</code>.
</p>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span>git<span class="w"> </span>clone<span class="w"> </span>--recurse-submodules<span class="w"> </span>https://github.com/FreeCAD/FreeCAD.git<span class="w"> </span>freecad-source
</pre></div>
<p>&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1086; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1080; Git &#1080; &#1074;&#1085;&#1077;&#1089;&#1077;&#1085;&#1080;&#1080; &#1082;&#1086;&#1076;&#1072; &#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1080;&#1079;&#1083;&#1086;&#1078;&#1077;&#1085;&#1072; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; <a href="../ru/Source_code_management.html" title="Source code management/ru">&#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084; &#1082;&#1086;&#1076;&#1086;&#1084;</a>.
</p><p><span id="Getting_the_dependencies"></span>
</p>
<h2><span id=".D0.A3.D1.81.D1.82.D0.B0.D0.BD.D0.BE.D0.B2.D0.BA.D0.B0_.D0.B7.D0.B0.D0.B2.D0.B8.D1.81.D0.B8.D0.BC.D0.BE.D1.81.D1.82.D0.B5.D0.B9_.28Dependencies.29"></span><span class="mw-headline" id="&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072;_&#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1077;&#1081;_(Dependencies)">&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1077;&#1081; (Dependencies)</span></h2>
<div class="mw-translate-fuzzy">
<p>&#1044;&#1083;&#1103; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080; FreeCAD &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1084;&#1099;&#1077; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; (dependencies), &#1091;&#1087;&#1086;&#1084;&#1103;&#1085;&#1091;&#1090;&#1099;&#1077; &#1074; <a href="../ru/Third_Party_Libraries.html" title="Third Party Libraries/ru">&#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1080;&#1093; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072;&#1093;</a>; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1080;&#1077; &#1101;&#1090;&#1080; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074;&#1086;&#1074; Linux, &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1099; &#1085;&#1080;&#1078;&#1077;. &#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1080;&#1084;&#1077;&#1085;&#1072; &#1080; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086;&#1089;&#1090;&#1100; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082; &#1073;&#1091;&#1076;&#1091;&#1090; &#1079;&#1072;&#1074;&#1080;&#1089;&#1077;&#1090;&#1100; &#1086;&#1090; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086;&#1075;&#1086; &#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074;&#1072;; &#1077;&#1089;&#1083;&#1080; &#1074;&#1072;&#1096; &#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074; &#1091;&#1089;&#1090;&#1072;&#1088;&#1077;&#1083;, &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099; &#1080;&#1083;&#1080; &#1080;&#1084;&#1077;&#1090;&#1100; &#1076;&#1088;&#1091;&#1075;&#1086;&#1077; &#1080;&#1084;&#1103;. &#1042; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1087;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083; <a href="#Older_and_non-conventional_distributions">&darr; &#1089;&#1090;&#1072;&#1088;&#1099;&#1077; &#1080; &#1085;&#1077;&#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1077; &#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074;&#1099;</a> &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1081; &#1085;&#1080;&#1078;&#1077;.
</p>
</div>
<p>&#1050;&#1072;&#1082; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1091; &#1074;&#1072;&#1089; &#1073;&#1091;&#1076;&#1091;&#1090; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1099; &#1074;&#1089;&#1077; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080;, &#1087;&#1088;&#1080;&#1089;&#1090;&#1091;&#1087;&#1072;&#1081;&#1090;&#1077; &#1082; <a href="#%D0%A1%D0%B1%D0%BE%D1%80%D0%BA%D0%B0_FreeCAD">&#1089;&#1073;&#1086;&#1088;&#1082;&#1077; FreeCAD</a>.
</p><p>&#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072; FreeCAD &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1086;&#1082;&#1086;&#1083;&#1086; 500 &#1052;&#1041;; &#1086;&#1085; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074; &#1090;&#1088;&#1080; &#1088;&#1072;&#1079;&#1072; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1082;&#1083;&#1086;&#1085;&#1080;&#1088;&#1091;&#1077;&#1090;&#1077; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1081; Git &#1089;&#1086; &#1074;&#1089;&#1077;&#1081; &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1077;&#1081; &#1077;&#1075;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081;. &#1044;&#1083;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074;&#1089;&#1077;&#1093; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1077;&#1081; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072; 500 &#1052;&#1041; &#1080;&#1083;&#1080; &#1073;&#1086;&#1083;&#1077;&#1077; &#1085;&#1086;&#1074;&#1099;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;; &#1087;&#1088;&#1080; &#1088;&#1072;&#1089;&#1087;&#1072;&#1082;&#1086;&#1074;&#1082;&#1077; &#1101;&#1090;&#1080;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; 1500 &#1052;&#1041; &#1080;&#1083;&#1080; &#1073;&#1086;&#1083;&#1077;&#1077; &#1084;&#1077;&#1089;&#1090;&#1072;. &#1058;&#1072;&#1082;&#1078;&#1077; &#1080;&#1084;&#1077;&#1081;&#1090;&#1077; &#1074; &#1074;&#1080;&#1076;&#1091;, &#1095;&#1090;&#1086; &#1074; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1077; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1086; &#1076;&#1086; 1500 &#1052;&#1041; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1082;&#1086;&#1087;&#1080;&#1088;&#1091;&#1077;&#1090; &#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1074;&#1077;&#1089;&#1100; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076;. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1087;&#1088;&#1080; &#1087;&#1086;&#1087;&#1099;&#1090;&#1082;&#1077; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080; &#1091;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1085;&#1072; &#1074;&#1072;&#1096;&#1077;&#1084; &#1078;&#1077;&#1089;&#1090;&#1082;&#1086;&#1084; &#1076;&#1080;&#1089;&#1082;&#1077; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1084;&#1077;&#1089;&#1090;&#1072;, &#1087;&#1086; &#1082;&#1088;&#1072;&#1081;&#1085;&#1077;&#1081; &#1084;&#1077;&#1088;&#1077;, &#1085;&#1077; &#1084;&#1077;&#1085;&#1077;&#1077; 4 &#1043;&#1041;.
</p>
<div class="mw-collapsible mw-collapsed toccolours">
<p><span id="Debian_and_Ubuntu"></span>
</p>
<h3><span id="Debian_.D0.B8_Ubuntu"></span><span class="mw-headline" id="Debian_&#1080;_Ubuntu">Debian &#1080; Ubuntu</span></h3>
<div class="mw-collapsible-content">
<p>&#1042; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1093; &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1085;&#1072; Debian (Debian, Ubuntu, Mint, &#1080; &#1090;.&#1087;.) &#1076;&#1086;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086; &#1083;&#1077;&#1075;&#1082;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1074;&#1089;&#1077; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080;. &#1041;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099; &#1095;&#1077;&#1088;&#1077;&#1079; <code>apt</code> &#1080;&#1083;&#1080; &#1084;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088; &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074; Synaptic.
</p><p>&#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1091;&#1078;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1083;&#1080; FreeCAD &#1080;&#1079; &#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1077;&#1074;, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; (dependencies) &#1076;&#1083;&#1103; &#1077;&#1075;&#1086; &#1089;&#1073;&#1086;&#1088;&#1082;&#1080; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1101;&#1090;&#1086;&#1081; &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1082;&#1086;&#1076;&#1072; &#1074; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1072;&#1083;&#1077;:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">sudo</span> <span class="n">apt</span> <span class="n">build</span><span class="o">-</span><span class="n">dep</span> <span class="n">freecad</span>
</pre></div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Alternatively, replace <code>freecad</code> with <code>freecad-daily</code> to install the build dependencies for the main development branch. You'll need to have the <a href="../Installing_on_Linux.html#Development_PPA_(Daily)" title="Installing on Linux">freecad-stable/freecad-daily PPAs</a> added to your software sources.
</p>
</div>
<p>&#1054;&#1076;&#1085;&#1072;&#1082;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103; FreeCAD &#1074; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1103;&#1093; &#1089;&#1090;&#1072;&#1088;&#1072;&#1103;, &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; (dependencies) &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1078;&#1077; &#1091;&#1089;&#1090;&#1072;&#1088;&#1077;&#1074;&#1096;&#1080;&#1084;&#1080; &#1076;&#1083;&#1103; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; FreeCAD. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091;, &#1087;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, <b>&#1091;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1083;&#1080; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099;</b>.
</p><p>&#1069;&#1090;&#1080; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099; &#1076;&#1083;&#1103; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086;&#1081; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080; &#1074; &#1094;&#1077;&#1083;&#1086;&#1084;:
</p>
<ul><li><code>build-essential</code>, &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1090;&#1086;&#1088;&#1099; C &#1080; C++ , &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; C &#1080; <code>make</code> &#1091;&#1090;&#1080;&#1083;&#1080;&#1090;&#1091;.</li>
<li><code>cmake</code>, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1076;&#1083;&#1103; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1080;&#1082;&#1086;&#1074; FreeCAD. &#1042;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; <code>cmake-gui</code> &#1080; <code>cmake-curses-gui</code> &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1084;&#1077;&#1090;&#1100; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089; &#1076;&#1083;&#1103; &#1076;&#1072;&#1085;&#1085;&#1086;&#1081; &#1091;&#1090;&#1080;&#1083;&#1080;&#1090;&#1099;.</li>
<li><code>libtool</code>, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; shared &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;.</li>
<li><code>lsb-release</code>, &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1072;&#1103; &#1091;&#1090;&#1080;&#1083;&#1080;&#1090;&#1072; &#1073;&#1072;&#1079;&#1086;&#1074;&#1086;&#1081; &#1086;&#1090;&#1095;&#1077;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1091;&#1078;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1072; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; Debian &#1080; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1072;&#1090;&#1100; &#1095;&#1080;&#1089;&#1090;&#1091;&#1102; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1091; Debian &#1080;&#1083;&#1080; &#1077;&#1077; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;, &#1090;&#1072;&#1082;&#1086;&#1081; &#1082;&#1072;&#1082; Ubuntu &#1080;&#1083;&#1080; Linux Mint. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1103;&#1081;&#1090;&#1077; &#1101;&#1090;&#1086;&#1090; &#1087;&#1072;&#1082;&#1077;&#1090;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1086;&#1090; &#1085;&#1077;&#1075;&#1086; &#1084;&#1086;&#1075;&#1091;&#1090; &#1079;&#1072;&#1074;&#1080;&#1089;&#1077;&#1090;&#1100; &#1084;&#1085;&#1086;&#1075;&#1080;&#1077; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1099;&#1077; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099;.</li></ul>
<p>&#1055;&#1088;&#1080; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080; FreeCAD &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1103;&#1079;&#1099;&#1082; Python, &#1080; &#1086;&#1085; &#1090;&#1072;&#1082;&#1078;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074; runtime &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1103;&#1079;&#1099;&#1082;&#1072; &#1089;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1077;&#1074;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1077; &#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074; &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077; Debian, &#1080;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1077;&#1090;&#1072;&#1090;&#1086;&#1088; Python &#1082;&#1072;&#1082; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1086; &#1091;&#1078;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085; &#1074; &#1085;&#1077;&#1084;.
</p>
<ul><li><code>python3</code></li>
<li><code>swig</code>, &#1101;&#1090;&#1086; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1099; &#1084;&#1077;&#1078;&#1076;&#1091; &#1082;&#1086;&#1076;&#1086;&#1084; C++ &#1080; Python.</li></ul>
<p>Boost &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1099;:
</p>
<ul><li><code>libboost-dev</code></li>
<li><code>libboost-date-time-dev</code></li>
<li><code>libboost-filesystem-dev</code></li>
<li><code>libboost-graph-dev</code></li>
<li><code>libboost-iostreams-dev</code></li>
<li><code>libboost-program-options-dev</code></li>
<li><code>libboost-python-dev</code></li>
<li><code>libboost-regex-dev</code></li>
<li><code>libboost-serialization-dev</code></li>
<li><code>libboost-thread-dev</code></li></ul>
<div class="mw-translate-fuzzy">
<p>&#1044;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1099; Coin &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080;:
</p>
<ul><li><code>libcoin80-dev</code>, &#1076;&#1083;&#1103; Debian Jessie, Stretch, Ubuntu &#1089; 16.04 &#1076;&#1086; 18.10, &#1080;&#1083;&#1080;</li>
<li><code>libcoin-dev</code>, &#1076;&#1083;&#1103; Debian Buster, Ubuntu 19.04 &#1080; &#1074;&#1099;&#1096;&#1077;, &#1072; &#1090;&#1072;&#1082; &#1078;&#1077; Ubuntu 18.04/18.10 &#1074;&#1084;&#1077;&#1089;&#1090;&#1077; &#1089; <a href="../Installing_on_Linux.html#Official_Ubuntu_repository" title="Installing on Linux">freecad-stable/freecad-daily PPAs</a> &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1099; &#1074; &#1080;&#1093;&#1086;&#1076;&#1085;&#1080;&#1082;&#1080;.</li></ul>
</div>
<div class="mw-translate-fuzzy">
<p>&#1053;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;, &#1090;&#1088;&#1080;&#1072;&#1085;&#1075;&#1091;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1103;&#1084;&#1080;, &#1089;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1082;&#1086;&#1081;, &#1084;&#1077;&#1096;&#1072;&#1084;&#1080; (meshes), &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1085;&#1099;&#1084; &#1079;&#1088;&#1077;&#1085;&#1080;&#1077;&#1084;, &#1082;&#1072;&#1088;&#1090;&#1086;&#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1094;&#1080;&#1103;&#1084;&#1080;, 3D-&#1074;&#1080;&#1079;&#1091;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1077;&#1081;, &#1086;&#1082;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1086;&#1081; X11, &#1087;&#1072;&#1088;&#1089;&#1080;&#1085;&#1075;&#1086;&#1084; XML &#1080; &#1095;&#1090;&#1077;&#1085;&#1080;&#1077;&#1084; Zip-&#1092;&#1072;&#1081;&#1083;&#1086;&#1074;:
</p>
</div>
<ul><li><code>libeigen3-dev</code></li>
<li><code>libgts-bin</code></li>
<li><code>libgts-dev</code></li>
<li><code>libkdtree++-dev</code></li>
<li><code>libmedc-dev</code></li>
<li><code>libopencv-dev</code> or <code>libcv-dev</code></li>
<li><code>libproj-dev</code></li>
<li><code>libvtk9-dev</code>, <code>libvtk8-dev</code>, <code>libvtk7-dev</code> or <code>libvtk6-dev</code></li>
<li><code>libx11-dev</code></li>
<li><code>libxerces-c-dev</code></li>
<li><code>libyaml-cpp-dev</code></li>
<li><code>libzipios++-dev</code></li>
<li><code>libpcl-dev</code></li></ul>
<p><br>
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h4><span class="mw-headline" id="Python_3_and_Qt6">Python 3 and Qt6</span></h4>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>To compile FreeCAD for Debian Trixie install the following dependencies.
</p>
</div>
<ul><li><code>pybind11-dev</code></li>
<li><code>qt6-base-dev</code></li>
<li><code>qt6-svg-dev</code></li>
<li><code>qt6-tools-dev</code></li>
<li><code>qt6-webengine-dev</code></li>
<li><code>libpyside6-dev</code></li>
<li><code>libshiboken6-dev</code></li>
<li><code>pyside6-tools</code></li>
<li><code>pyqt6-dev-tools</code></li>
<li><code>python3-dev</code></li>
<li><code>python3-lark</code></li>
<li><code>python3-matplotlib</code></li>
<li><code>python3-packaging</code></li>
<li><code>python3-pivy</code></li>
<li><code>python3-ply</code></li>
<li><code>python3-pyside6.qtcore</code></li>
<li><code>python3-pyside6.qtgui</code></li>
<li><code>python3-pyside6.qtnetwork</code></li>
<li><code>python3-pyside6.qtsvg</code></li>
<li><code>python3-pyside6.qtwebchannel</code></li>
<li><code>python3-pyside6.qtwebenginecore</code></li>
<li><code>python3-pyside6.qtwebenginequick</code></li>
<li><code>python3-pyside6.qtwebenginewidgets</code></li>
<li><code>python3-pyside6.qtwidgets</code></li></ul>
<p><span id="Python_3_and_Qt5"></span>
</p>
<h4><span id="Python_3_.D0.B8_Qt5"></span><span class="mw-headline" id="Python_3_&#1080;_Qt5">Python 3 &#1080; Qt5</span></h4>
<div class="mw-translate-fuzzy">
<p>&#1055;&#1088;&#1080; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080; FreeCAD &#1074; <b>Debian Buster, Ubuntu 19.04 &#1080; &#1074;&#1099;&#1096;&#1077;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; Ubuntu 18.04/18.10</b> &#1089; <a href="../Installing_on_Linux.html#Official_Ubuntu_repository" title="Installing on Linux">freecad-stable/freecad-daily PPAs</a> &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084; &#1074; &#1074;&#1072;&#1096; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076;, &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080;.
</p>
</div>
<ul><li><code>qtbase5-dev</code></li>
<li><code>qttools5-dev</code></li>
<li><code>qt5-default</code> (if compiling 0.20 on a machine that still has Qt4)</li>
<li><code>libqt5opengl5-dev</code></li>
<li><code>libqt5svg5-dev</code></li>
<li><code>qtwebengine5-dev</code></li>
<li><code>libqt5xmlpatterns5-dev</code></li>
<li><code>libqt5x11extras5-dev</code></li>
<li><code>libpyside2-dev</code></li>
<li><code>libshiboken2-dev</code></li>
<li><code>pyside2-tools</code></li>
<li><code>pyqt5-dev-tools</code></li>
<li><code>python3-dev</code></li>
<li><code>python3-matplotlib</code></li>
<li><code>python3-packaging</code></li>
<li><code>python3-pivy</code></li>
<li><code>python3-ply</code></li>
<li><code>python3-pyside2.qtcore</code></li>
<li><code>python3-pyside2.qtgui</code></li>
<li><code>python3-pyside2.qtsvg</code></li>
<li><code>python3-pyside2.qtwidgets</code></li>
<li><code>python3-pyside2.qtnetwork</code></li>
<li><code>python3-pyside2.qtwebengine</code></li>
<li><code>python3-pyside2.qtwebenginecore</code></li>
<li><code>python3-pyside2.qtwebenginewidgets</code></li>
<li><code>python3-pyside2.qtwebchannel</code></li>
<li><code>python3-pyside2uic</code> (not required on Ubuntu 20.04 and later)</li></ul>
<p><span id="OpenCascade_kernel"></span>
</p>
<h4><span id=".D0.AF.D0.B4.D1.80.D0.BE_OpenCascade"></span><span class="mw-headline" id="&#1071;&#1076;&#1088;&#1086;_OpenCascade">&#1071;&#1076;&#1088;&#1086; OpenCascade</span></h4>
<p>&#1071;&#1076;&#1088;&#1086; OpenCascade - &#1101;&#1090;&#1086; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; 3D-&#1092;&#1080;&#1075;&#1091;&#1088;. &#1054;&#1085;&#1072; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1074; &#1074;&#1080;&#1076;&#1077; &#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; OCCT &#1080; &#1074;&#1080;&#1076;&#1077; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; &#1076;&#1083;&#1103; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1072; OCE. &#1042;&#1077;&#1088;&#1089;&#1080;&#1103; &#1076;&#1083;&#1103; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1072; &#1082; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1102; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1085;&#1077; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1090;&#1089;&#1103;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1086;&#1085;&#1072; &#1091;&#1089;&#1090;&#1072;&#1088;&#1077;&#1083;&#1072;.
</p>
<div class="mw-translate-fuzzy">
<p>&#1044;&#1083;&#1103; Debian Buster &#1080; Ubuntu 18.10 &#1080; &#1074;&#1099;&#1096;&#1077;, &#1072; &#1090;&#1072;&#1082; &#1078;&#1077; &#1076;&#1083;&#1103; Ubuntu 18.04 &#1089; <a href="../Installing_on_Linux.html#Official_Ubuntu_repository" title="Installing on Linux">freecad-stable/freecad-daily PPAs</a> &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1099;&#1084;&#1080; &#1074; &#1074;&#1072;&#1096;&#1080; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1080;&#1082;&#1080;, &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099;.
</p>
</div>
<ul><li><code>libocct*-dev</code>
<ul><li><code>libocct-data-exchange-dev</code></li>
<li><code>libocct-draw-dev</code></li>
<li><code>libocct-foundation-dev</code></li>
<li><code>libocct-modeling-algorithms-dev</code></li>
<li><code>libocct-modeling-data-dev</code></li>
<li><code>libocct-ocaf-dev</code></li>
<li><code>libocct-visualization-dev</code></li></ul></li>
<li><code>occt-draw</code></li></ul>
<p>&#1044;&#1083;&#1103; Debian Jessie, Stretch, Ubuntu 16.04 &#1080; &#1074;&#1099;&#1096;&#1077;, &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; community edition &#1087;&#1072;&#1082;&#1077;&#1090;&#1099;.
</p>
<ul><li><code>liboce*-dev</code>
<ul><li><code>liboce-foundation-dev</code></li>
<li><code>liboce-modeling-dev</code></li>
<li><code>liboce-ocaf-dev</code></li>
<li><code>liboce-ocaf-lite-dev</code></li>
<li><code>liboce-visualization-dev</code></li></ul></li>
<li><code>oce-draw</code></li></ul>
<p>&#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080; &#1087;&#1086; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1080;&#1083;&#1080; &#1089;&#1088;&#1072;&#1079;&#1091; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089; &#1087;&#1086;&#1093;&#1086;&#1078;&#1080;&#1084; &#1080;&#1084;&#1077;&#1085;&#1072;&#1084;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083; &#1079;&#1074;&#1077;&#1079;&#1076;&#1086;&#1095;&#1082;&#1091; '*'. &#1047;&#1072;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; <code>occ</code> &#1085;&#1072; <code>oce</code> &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; community &#1088;&#1077;&#1076;&#1072;&#1082;&#1094;&#1080;&#1102; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;.
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">sudo</span> <span class="n">apt</span> <span class="n">install</span> <span class="n">libocct</span><span class="o">*-</span><span class="n">dev</span>
</pre></div>
<p><span id="Optional_packages"></span>
</p>
<h4><span id=".D0.9D.D0.B5.D0.BE.D0.B1.D1.8F.D0.B7.D0.B0.D1.82.D0.B5.D0.BB.D1.8C.D0.BD.D1.8B.D0.B5_.D0.BA_.D1.83.D1.81.D1.82.D0.B0.D0.BD.D0.BE.D0.B2.D0.BA.D0.B5_.D0.BF.D0.B0.D0.BA.D0.B5.D1.82.D1.8B"></span><span class="mw-headline" id="&#1053;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077;_&#1082;_&#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1077;_&#1087;&#1072;&#1082;&#1077;&#1090;&#1099;">&#1053;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1077; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099;</span></h4>
<div class="mw-translate-fuzzy">
<p>&#1055;&#1088;&#1080; &#1078;&#1077;&#1083;&#1072;&#1085;&#1080;&#1080; &#1074;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1101;&#1090;&#1080; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099;:
</p>
<ul><li><code>libsimage-dev</code>, &#1095;&#1090;&#1086;&#1073;&#1099; Coin &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1083; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1081;.</li>
<li><code>doxygen</code> &#1080; <code>libcoin-doc</code> (&#1080;&#1083;&#1080; <code>libcoin80-doc</code> &#1076;&#1083;&#1103; &#1089;&#1090;&#1072;&#1088;&#1099;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;), &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1102; &#1082; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1084;&#1091; &#1082;&#1086;&#1076;&#1091;.</li>
<li><code>libspnav-dev</code>, &#1076;&#1083;&#1103; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1080; <a href="../ru/3D_input_devices.html" title="3D input devices/ru">&#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074; 3D &#1074;&#1074;&#1086;&#1076;&#1072;</a>, &#1090;&#1072;&#1082;&#1080;&#1093; &#1082;&#1072;&#1082; 3Dconnexion "Space Navigator" &#1080;&#1083;&#1080; "Space Pilot".</li>
<li><code>checkinstall</code>, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1079;&#1072;&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; &#1074; &#1076;&#1080;&#1089;&#1087;&#1077;&#1090;&#1095;&#1077;&#1088;&#1077; &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074; &#1074;&#1072;&#1096;&#1077;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1099; &#1084;&#1086;&#1075;&#1083;&#1080; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1080;&#1093; &#1087;&#1086;&#1079;&#1078;&#1077;.</li></ul>
</div>
<p><span id="Single_command_for_Python_3_and_Qt5"></span>
</p>
<h4><span id=".D0.A3.D1.81.D1.82.D0.B0.D0.BE.D0.B2.D0.BA.D0.B0_Python_3_.D0.B8_Qt5_.D0.BE.D0.B4.D0.BD.D0.BE.D0.B9_.D0.BA.D0.BE.D0.BC.D0.B0.D0.BD.D0.B4.D0.BE.D0.B9"></span><span class="mw-headline" id="&#1059;&#1089;&#1090;&#1072;&#1086;&#1074;&#1082;&#1072;_Python_3_&#1080;_Qt5_&#1086;&#1076;&#1085;&#1086;&#1081;_&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1086;&#1081;">&#1059;&#1089;&#1090;&#1072;&#1086;&#1074;&#1082;&#1072; Python 3 &#1080; Qt5 &#1086;&#1076;&#1085;&#1086;&#1081; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1086;&#1081;</span></h4>
<p>&#1058;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103;, &#1095;&#1090;&#1086;&#1073;&#1099; Pyside2 &#1073;&#1099;&#1083; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1074; Debian buster &#1080; <a href="../Installing_on_Linux.html#Official_Ubuntu_repository" title="Installing on Linux">freecad-stable/freecad-daily PPAs</a>.
</p>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span>sudo<span class="w"> </span>apt<span class="w"> </span>install<span class="w"> </span>cmake<span class="w"> </span>cmake-gui<span class="w"> </span>libboost-date-time-dev<span class="w"> </span>libboost-dev<span class="w"> </span>libboost-filesystem-dev<span class="w"> </span>libboost-graph-dev<span class="w"> </span>libboost-iostreams-dev<span class="w"> </span>libboost-program-options-dev<span class="w"> </span>libboost-python-dev<span class="w"> </span>libboost-regex-dev<span class="w"> </span>libboost-serialization-dev<span class="w"> </span>libboost-thread-dev<span class="w"> </span>libcoin-dev<span class="w"> </span>libeigen3-dev<span class="w"> </span>libgts-bin<span class="w"> </span>libgts-dev<span class="w"> </span>libkdtree++-dev<span class="w"> </span>libmedc-dev<span class="w"> </span>libocct-data-exchange-dev<span class="w"> </span>libocct-ocaf-dev<span class="w"> </span>libocct-visualization-dev<span class="w"> </span>libopencv-dev<span class="w"> </span>libproj-dev<span class="w"> </span>libpyside2-dev<span class="w"> </span>libqt5opengl5-dev<span class="w"> </span>libqt5svg5-dev<span class="w"> </span>qtwebengine5-dev<span class="w"> </span>libqt5x11extras5-dev<span class="w"> </span>libqt5xmlpatterns5-dev<span class="w"> </span>libshiboken2-dev<span class="w"> </span>libspnav-dev<span class="w"> </span>libvtk7-dev<span class="w"> </span>libx11-dev<span class="w"> </span>libxerces-c-dev<span class="w"> </span>libzipios++-dev<span class="w"> </span>occt-draw<span class="w"> </span>pyside2-tools<span class="w"> </span>python3-dev<span class="w"> </span>python3-lark<span class="w"> </span>python3-matplotlib<span class="w"> </span>python3-packaging<span class="w"> </span>python3-pivy<span class="w"> </span>python3-ply<span class="w"> </span>python3-pyside2.qtcore<span class="w"> </span>python3-pyside2.qtgui<span class="w"> </span>python3-pyside2.qtsvg<span class="w"> </span>python3-pyside2.qtwidgets<span class="w"> </span>python3-pyside2.qtnetwork<span class="w"> </span>python3-pyside2.qtwebengine<span class="w"> </span>python3-pyside2.qtwebenginecore<span class="w"> </span>python3-pyside2.qtwebenginewidgets<span class="w"> </span>python3-pyside2.qtwebchannel<span class="w"> </span>python3-markdown<span class="w"> </span>python3-git<span class="w"> </span>python3-pyside2uic<span class="w"> </span>qtbase5-dev<span class="w"> </span>qttools5-dev<span class="w"> </span>swig<span class="w"> </span>libyaml-cpp-dev
</pre></div>
<p>&#1055;&#1056;&#1048;&#1052;&#1045;&#1063;&#1040;&#1053;&#1048;&#1045;: &#1042; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103;&#1093; Ubuntu &#1080; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103;&#1093; Qt &#1074;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1077;, &#1095;&#1090;&#1086; python3-pyside2uic &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;-&#1074; &#1101;&#1090;&#1080;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1093; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086; &#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086;. &#1042; Ubuntu 20.04 &#1074;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; <code>pyqt5-dev-tools</code>. &#1041;&#1086;&#1083;&#1077;&#1077; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1091;&#1102; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1081;&#1090;&#1080; &#1074; <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=51324">&#1101;&#1090;&#1086; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072; &#1092;&#1086;&#1088;&#1091;&#1084;&#1077;</a>.
</p>
<div class="mw-collapsible mw-collapsed" style="background-color:#e0e0e0">
<div class="mw-collapsible-content">
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span>sudo<span class="w"> </span>apt<span class="w"> </span>install<span class="w"> </span>cmake<span class="w"> </span>debhelper<span class="w"> </span>dh-exec<span class="w"> </span>dh-python<span class="w"> </span>libboost-date-time-dev<span class="w"> </span>libboost-dev<span class="w"> </span>libboost-filesystem-dev<span class="w"> </span>libboost-graph-dev<span class="w"> </span>libboost-iostreams-dev<span class="w"> </span>libboost-program-options-dev<span class="w"> </span>libboost-python-dev<span class="w"> </span>libboost-regex-dev<span class="w"> </span>libboost-serialization-dev<span class="w"> </span>libboost-thread-dev<span class="w"> </span>libcoin80-dev<span class="w"> </span>libeigen3-dev<span class="w"> </span>libgts-bin<span class="w"> </span>libgts-dev<span class="w"> </span>libkdtree++-dev<span class="w"> </span>libmedc-dev<span class="w"> </span>libocct-data-exchange-dev<span class="w"> </span>libocct-ocaf-dev<span class="w"> </span>libocct-visualization-dev<span class="w"> </span>libopencv-dev<span class="w"> </span>libproj-dev<span class="w"> </span>libpyside-dev<span class="w"> </span>libqt4-dev<span class="w"> </span>libqt4-opengl-dev<span class="w"> </span>libqtwebkit-dev<span class="w"> </span>libshiboken-dev<span class="w"> </span>libspnav-dev<span class="w"> </span>libvtk6-dev<span class="w"> </span>libx11-dev<span class="w"> </span>libxerces-c-dev<span class="w"> </span>libzipios++-dev<span class="w"> </span>lsb-release<span class="w"> </span>occt-draw<span class="w"> </span>pyside-tools<span class="w"> </span>python-dev<span class="w"> </span>python-matplotlib<span class="w"> </span>python-pivy<span class="w"> </span>python-ply<span class="w"> </span>swig
</pre></div>
<p>&#1055;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1080; Ubuntu 16.04, &#1087;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1086;&#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1100;&#1090;&#1077;&#1089;&#1100; &#1090;&#1072;&#1082;&#1078;&#1077; &#1089; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077;&#1084; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080; &#1085;&#1072; &#1092;&#1086;&#1088;&#1091;&#1084;&#1077;: <a rel="nofollow" class="external text" href="http://forum.freecad.org/viewtopic.php?f=4&amp;t=16292">&#1050;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1103; &#1074; Linux (Kubuntu): CMake &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1085;&#1072;&#1081;&#1090;&#1080; VTK</a>.
</p>
</div>
</div>
</div>
</div>
<div class="mw-collapsible mw-collapsed toccolours">
<h3><span class="mw-headline" id="Raspberry_Pi">Raspberry Pi</span></h3>
<div class="mw-collapsible-content">
<p>&#1042;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077; &#1090;&#1077; &#1078;&#1077; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103;, &#1095;&#1090;&#1086; &#1080; &#1074; Debian &#1080; Ubuntu.
</p>
<div class="mw-translate-fuzzy">
<p>&#1057;&#1086;&#1086;&#1073;&#1097;&#1072;&#1083;&#1086;&#1089;&#1100; &#1086; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072;&#1093; &#1087;&#1088;&#1080; &#1087;&#1086;&#1087;&#1099;&#1090;&#1082;&#1077; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080; &#1074; Raspbian &#1089; Python 3 &#1080; Qt5, &#1085;&#1086; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1103; Python 3 &#1080; Qt4, &#1087;&#1086;&#1093;&#1086;&#1078;&#1077;, &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1076;&#1083;&#1103; &#1073;&#1086;&#1083;&#1077;&#1077; &#1089;&#1090;&#1072;&#1088;&#1099;&#1093; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081; FreeCAD.
</p>
</div>
<div class="mw-translate-fuzzy">
<p>&#1044;&#1083;&#1103; &#1073;&#1086;&#1083;&#1077;&#1077; &#1085;&#1086;&#1074;&#1099;&#1093; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081; FreeCAD &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1103; &#1089; Py3/Qt5 &#1087;&#1088;&#1086;&#1093;&#1086;&#1076;&#1080;&#1090; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1072; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1072;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; Ubuntu 20.04.
</p>
</div>
<div class="mw-translate-fuzzy">
<p>&#1048;&#1079;-&#1079;&#1072; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; &#1089; Qt &#1074; &#1101;&#1090;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; &#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1077; PySide tools &#1085;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;&#1099;.
</p>
</div>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span>E:<span class="w"> </span>Unable<span class="w"> </span>to<span class="w"> </span>locate<span class="w"> </span>package<span class="w"> </span>python3-pyside2uic
</pre></div>
<p>&#1042; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099; &#1080;&#1079; PyQt &#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1085;&#1072; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;.
</p>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span>sudo<span class="w"> </span>apt-get<span class="w"> </span>install<span class="w"> </span>pyqt5-dev
sudo<span class="w"> </span>apt-get<span class="w"> </span>install<span class="w"> </span>pyqt5-dev-tools
<span class="nb">cd</span><span class="w"> </span>/usr/bin/
ln<span class="w"> </span>-s<span class="w"> </span>pyrcc5<span class="w"> </span>pyside2-rcc
ln<span class="w"> </span>-s<span class="w"> </span>pyuic5<span class="w"> </span>pyside2-uic
</pre></div>
<p>&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1103; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1077;&#1085;&#1072;.
</p>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span><span class="nb">cd</span><span class="w"> </span>build/
cmake<span class="w"> </span>../<span class="w"> </span>-DBUILD_QT5<span class="o">=</span>ON<span class="w"> </span>-DPYTHON_EXECUTABLE<span class="o">=</span>/usr/bin/python3<span class="w"> </span>-DUSE_PYBIND11<span class="o">=</span>ON
make<span class="w"> </span>-j2
</pre></div>
<p>&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <code>-j</code> &#1076;&#1083;&#1103; <code>make</code> &#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1087;&#1088;&#1077;&#1074;&#1099;&#1096;&#1072;&#1090;&#1100; 3, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; Raspberry Pi &#1080;&#1084;&#1077;&#1077;&#1090; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1085;&#1091;&#1102; &#1087;&#1072;&#1084;&#1103;&#1090;&#1100;. &#1053;&#1072; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1102; &#1091;&#1081;&#1076;&#1077;&#1090; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1095;&#1072;&#1089;&#1086;&#1074;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1083;&#1091;&#1095;&#1096;&#1077; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086; &#1079;&#1072; &#1085;&#1086;&#1095;&#1100;.
</p><p>&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;, <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?f=42&amp;t=37458&amp;start=160#p396652">FreeCAD &#1080; Raspberry Pi 4</a>.
</p>
</div>
</div>
<div class="mw-collapsible mw-collapsed toccolours">
<h3><span class="mw-headline" id="Fedora">Fedora</span></h3>
<div class="mw-collapsible-content">
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>There is a bug in opencascade cmake files which results in cmake failing to find the opencascade libraries on Fedora. This can easily be fixed by making one minor change to the top level cmake file of opencascade installed on Fedora. Details here:
<a rel="nofollow" class="external free" href="https://bugzilla.redhat.com/show_bug.cgi?id=2083568">https://bugzilla.redhat.com/show_bug.cgi?id=2083568</a>.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Near the top of the file OpenCASCADEConfig.cmake, change the following line to use <code>REAL_PATH()</code>. This fixes a bug triggered by the use of a symlink from <code>/lib</code> to <code>/usr/lib</code> of Fedora, which cmake script fails to handle correctly. This is due to making narrow assumptions about where the include files are usually found on Linux and not testing for a valid result.
</p>
</div> 
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>This file is usually installed in <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">/usr/lib64/cmake/opencascade/OpenCASCADEConfig.cmake</span>.
</p>
</div>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span>get_filename_component<span class="w"> </span><span class="o">(</span>OpenCASCADE_INSTALL_PREFIX<span class="w"> </span><span class="s2">"</span><span class="si">${</span><span class="nv">OpenCASCADE_INSTALL_PREFIX</span><span class="si">}</span><span class="s2">"</span><span class="w"> </span>PATH<span class="o">)</span>
</pre></div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>change this to:
</p>
</div>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span>file<span class="w"> </span><span class="o">(</span>REAL_PATH<span class="w"> </span><span class="si">${</span><span class="nv">OpenCASCADE_INSTALL_PREFIX</span><span class="si">}</span><span class="w"> </span>OpenCASCADE_INSTALL_PREFIX<span class="o">)</span>
</pre></div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>This trivial change needs to be made inside the build directory once cmake has been run and failed. Re-running cmake will then correctly detect the OCCT libraries in the normal way.
</p>
</div> 
<div lang="en" dir="ltr" class="mw-content-ltr">
<h4><span class="mw-headline" id="Fedora40">Fedora40</span></h4>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Fedora allows concurrent installation of Qt5 and Qt6 libraries. Adding the Qt6 libraries relevant to FreeCAD can be done using dnf:
</p>
</div>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span>dnf<span class="w"> </span>install<span class="w"> </span>python3-shiboken6<span class="w"> </span>python3-shiboken6-devel<span class="w"> </span>python3-pyside6<span class="w"> </span>python3-pyside6-devel<span class="se">\</span>
<span class="w"> </span>pyside6-tools<span class="w"> </span>qt6-qtsvg<span class="w"> </span>qt6-qtsvg-devel<span class="w"> </span>qt6-qttools-devel<span class="w"> </span>python3-pyqt6-devel
</pre></div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p><b>BEWARE:</b> A new feature, PCL, was introduced in March 2025. This requires two additional packages: pcl and pcl-devel. However, it fails to build on Fedora when using Qt6 libraries. Add the following to the cmake command line to disable this code.
</p>
</div>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span>-DFREECAD_USE_PCL<span class="o">=</span>Off
</pre></div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Some remote Google code for automatic testing of coding practice is now included by default. If you do not want to include this external code, which is subject to change without notice, use the cmake option:
</p>
</div>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span>-DENABLE_DEVELOPER_TESTS<span class="o">=</span>Off
</pre></div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>The following cmake command should be suitable for Fedora 40 with Qt6:
</p>
</div>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span>cmake<span class="w"> </span>-DCMAKE_BUILD_TYPE<span class="o">=</span>Release<span class="w"> </span>-DFREECAD_QT_VERSION<span class="o">=</span><span class="m">6</span><span class="w"> </span>-Wno-dev<span class="w"> </span>-DENABLE_DEVELOPER_TESTS<span class="o">=</span>Off<span class="w"> </span>-DFREECAD_USE_PCL<span class="o">=</span>Off<span class="w">  </span>../FreeCAD
</pre></div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Adjust the final directory to point to the FreeCAD source code directory.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h4><span id="Fedora38.2F39"></span><span class="mw-headline" id="Fedora38/39">Fedora38/39</span></h4>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Now install Python 3.11. This includes a notable change in how Python initializes when running a program. As a result FreeCAD fails to find OpenCamLib, meaning <a href="../CAM_Surface.html" title="CAM Surface">3D Surface</a> and <a href="../CAM_Waterline.html" title="CAM Waterline">Waterline</a> are not available in the <a href="../CAM_Workbench.html" title="CAM Workbench">CAM Workbench</a>. This was fixed in the master branch on 20th Mar 2024 (<a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/pull/13059">Pull request #13059</a>).
</p>
</div>
<div class="mw-translate-fuzzy">
<p>&#1042;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099;&nbsp;:
</p>
</div>
<ul><li><code>gcc-c++</code> (or possibly another C++ compiler?)</li>
<li><code>cmake</code></li>
<li><code>doxygen</code></li>
<li><code>swig</code></li>
<li><code>gettext</code></li>
<li><code>dos2unix</code></li>
<li><code>desktop-file-utils</code></li>
<li><code>libXmu-devel</code></li>
<li><code>freeimage-devel</code></li>
<li><code>mesa-libGLU-devel</code></li>
<li><code>opencascade-devel</code></li>
<li><code>openmpi-devel</code></li>
<li><code>python3</code></li>
<li><code>python3-devel</code></li>
<li><code>python3-pyside2</code></li>
<li><code>python3-pyside2-devel</code></li>
<li><code>pyside2-tools</code></li>
<li><code>boost-devel</code></li>
<li><code>tbb-devel</code></li>
<li><code>eigen3-devel</code></li>
<li><code>qt-devel</code></li>
<li><code>qt5-qtwebengine-devel</code></li>
<li><code>qt5-qtxmlpatterns</code></li>
<li><code>qt5-qtxmlpatterns-devel</code></li>
<li><code>qt5-qtsvg-devel</code></li>
<li><code>qt5-qttools-static</code></li>
<li><code>ode-devel</code></li>
<li><code>xerces-c</code></li>
<li><code>xerces-c-devel</code></li>
<li><code>opencv-devel</code></li>
<li><code>smesh-devel</code></li>
<li><code>Coin3</code></li>
<li><code>Coin3-devel</code></li>
<li><code>yaml-cpp</code></li></ul>
<p>(&#1053;&#1077; &#1087;&#1077;&#1088;&#1077;&#1087;&#1091;&#1090;&#1072;&#1081;&#1090;&#1077; "Coin" &#1089; "coin" - &#1090;&#1086;&#1090; &#1095;&#1090;&#1086; &#1089; &#1084;&#1072;&#1083;&#1077;&#1085;&#1100;&#1082;&#1086;&#1081; &#1073;&#1091;&#1082;&#1074;&#1099; &#1101;&#1090;&#1086; &#1092;&#1080;&#1085;&#1072;&#1085;&#1089;&#1086;&#1074;&#1099;&#1081; &#1087;&#1072;&#1082;&#1077;&#1090;. &#1040;&#1087;&#1088;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1077; Coin4 &#1080; Coin4-devel 2021 &#1091;&#1078;&#1077; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;)
(&#1077;&#1089;&#1083;&#1080; coin2 &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1081; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1077;&#1081; &#1076;&#1083;&#1103; &#1074;&#1072;&#1096;&#1077;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; Fedora, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099; &#1080;&#1079; <a rel="nofollow" class="external free" href="http://www.zultron.com/rpm-repo/">http://www.zultron.com/rpm-repo/</a>)
</p>
<ul><li><code>SoQt-devel</code></li>
<li><code>freetype</code></li>
<li><code>freetype-devel</code></li>
<li><code>vtk</code></li>
<li><code>vtk-devel</code></li>
<li><code>med</code></li>
<li><code>med-devel</code></li></ul>
<div class="mw-translate-fuzzy">
<p>&#1052;&#1086;&#1078;&#1077;&#1090;&#1077; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100;, &#1077;&#1089;&#1083;&#1080; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103;:
</p>
</div> 
<div class="mw-translate-fuzzy">
<ul><li>libspnav-devel (&#1076;&#1083;&#1103; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1080; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074; 3Dconnexion, &#1074;&#1088;&#1086;&#1076;&#1077; Space Navigator &#1080;&#1083;&#1080; Space Pilot)</li>
<li>pivy ( <a rel="nofollow" class="external free" href="https://bugzilla.redhat.com/show_bug.cgi?id=458975">https://bugzilla.redhat.com/show_bug.cgi?id=458975</a> Pivy &#1085;&#1077; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1077;&#1085;, &#1085;&#1086; &#1085;&#1091;&#1078;&#1077;&#1085; &#1076;&#1083;&#1103; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; Draft)</li></ul>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>To install all dependencies at once (tested on fedora 36 and 37):
</p>
</div>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span>sudo<span class="w"> </span>dnf<span class="w"> </span>install<span class="w"> </span>gcc-c++<span class="w"> </span>cmake<span class="w"> </span>doxygen<span class="w"> </span>swig<span class="w"> </span>gettext<span class="w"> </span>dos2unix<span class="w"> </span>desktop-file-utils<span class="w"> </span>libXmu-devel<span class="w"> </span>freeimage-devel<span class="w"> </span>mesa-libGLU-devel<span class="w"> </span>opencascade-devel<span class="w"> </span>openmpi-devel<span class="w"> </span>python3<span class="w"> </span>python3-devel<span class="w"> </span>python3-pyside2<span class="w"> </span>python3-pyside2-devel<span class="w"> </span>pyside2-tools<span class="w"> </span>boost-devel<span class="w"> </span>tbb-devel<span class="w"> </span>eigen3-devel<span class="w"> </span>qt-devel<span class="w"> </span>qt5-qtwebengine-devel<span class="w"> </span>qt5-qtxmlpatterns<span class="w"> </span>qt5-qtxmlpatterns-devel<span class="w"> </span>qt5-qtsvg-devel<span class="w"> </span>qt5-qttools-static<span class="w"> </span>ode-devel<span class="w"> </span>xerces-c<span class="w"> </span>xerces-c-devel<span class="w"> </span>opencv-devel<span class="w"> </span>smesh-devel<span class="w"> </span>Coin3<span class="w"> </span>Coin3-devel<span class="w"> </span>SoQt-devel<span class="w"> </span>freetype<span class="w"> </span>freetype-devel<span class="w"> </span>vtk<span class="w"> </span>vtk-devel<span class="w"> </span>med<span class="w"> </span>med-devel<span class="w"> </span>libspnav-devel<span class="w"> </span>python3-pivy<span class="w"> </span>python3-markdown<span class="w"> </span>python3-GitPython<span class="w"> </span>yaml-cpp
</pre></div>
</div>
</div>
<div class="mw-collapsible mw-collapsed toccolours">
<h3><span class="mw-headline" id="Gentoo">Gentoo</span></h3>
<div class="mw-collapsible-content">
<p>&#1055;&#1088;&#1086;&#1089;&#1090;&#1077;&#1081;&#1096;&#1080;&#1081; &#1087;&#1091;&#1090;&#1100; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100;, &#1082;&#1072;&#1082;&#1080;&#1077; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099; &#1085;&#1091;&#1078;&#1085;&#1099; &#1076;&#1083;&#1103; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080; FreeCAD &#1101;&#1090;&#1086; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100; &#1095;&#1077;&#1088;&#1077;&#1079; portage:
</p><p><tt>emerge -pv freecad</tt>
</p><p>&#1042;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1077; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1085;&#1072; &#1042;&#1072;&#1096;&#1077;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077;.
</p><p>&#1045;&#1089;&#1083;&#1080; FreeCAD &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1074; portage, &#1086;&#1085; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1074; &#1086;&#1074;&#1077;&#1088;&#1083;&#1077;&#1077; <a rel="nofollow" class="external text" href="https://github.com/waebbl/waebbl-gentoo">waebbl</a>. &#1057;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1086;&#1090;&#1089;&#1083;&#1077;&#1078;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082; &#1085;&#1072; &#1086;&#1074;&#1077;&#1088;&#1083;&#1077;&#1077; waebbl Github &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1084;&#1086;&#1095;&#1100; &#1088;&#1077;&#1096;&#1080;&#1090;&#1100; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;, &#1089; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084;&#1080; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1089;&#1090;&#1086;&#1083;&#1082;&#1085;&#1091;&#1090;&#1100;&#1089;&#1103;. &#1054;&#1074;&#1077;&#1088;&#1083;&#1077;&#1081; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; <tt>freecad-9999</tt>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; &#1076;&#1083;&#1103; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080; &#1080;&#1083;&#1080; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1083;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1077;&#1081;.
</p><p><tt>layman -a waebbl</tt>
</p>
</div>
</div>
<div class="mw-collapsible mw-collapsed toccolours">
<h3><span class="mw-headline" id="openSUSE">openSUSE</span></h3>
<div class="mw-collapsible-content">
<h4><span class="mw-headline" id="Tumbleweed">Tumbleweed</span></h4>
<p>&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1103;&#1090; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099;, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; FreeCAD &#1089; Qt5 &#1080; Python 3.
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">zypper</span> <span class="ow">in</span> <span class="o">--</span><span class="n">no</span><span class="o">-</span><span class="n">recommends</span> <span class="o">-</span><span class="n">t</span> <span class="n">pattern</span> <span class="n">devel_C_C</span><span class="o">++</span> <span class="n">devel_qt5</span>

<span class="n">zypper</span> <span class="ow">in</span> <span class="n">libqt5</span><span class="o">-</span><span class="n">qtbase</span><span class="o">-</span><span class="n">devel</span> <span class="n">libqt5</span><span class="o">-</span><span class="n">qtsvg</span><span class="o">-</span><span class="n">devel</span> <span class="n">libqt5</span><span class="o">-</span><span class="n">qttools</span><span class="o">-</span><span class="n">devel</span> <span class="n">boost</span><span class="o">-</span><span class="n">devel</span> <span class="n">swig</span> <span class="n">libboost_program_options</span><span class="o">-</span><span class="n">devel</span> <span class="n">libboost_mpi_python3</span><span class="o">-</span><span class="n">devel</span> <span class="n">libboost_system</span><span class="o">-</span><span class="n">devel</span> <span class="n">libboost_program_options</span><span class="o">-</span><span class="n">devel</span> <span class="n">libboost_regex</span><span class="o">-</span><span class="n">devel</span> <span class="n">libboost_python3</span><span class="o">-</span><span class="n">devel</span> <span class="n">libboost_thread</span><span class="o">-</span><span class="n">devel</span> <span class="n">libboost_system</span><span class="o">-</span><span class="n">devel</span> <span class="n">libboost_headers</span><span class="o">-</span><span class="n">devel</span> <span class="n">libboost_graph</span><span class="o">-</span><span class="n">devel</span> <span class="n">python3</span> <span class="n">python3</span><span class="o">-</span><span class="n">devel</span> <span class="n">python3</span><span class="o">-</span><span class="n">matplotlib</span> <span class="n">python3</span><span class="o">-</span><span class="n">matplotlib</span><span class="o">-</span><span class="n">qt5</span> <span class="n">python3</span><span class="o">-</span><span class="n">pyside2</span> <span class="n">python3</span><span class="o">-</span><span class="n">pyside2</span><span class="o">-</span><span class="n">devel</span> <span class="n">python3</span><span class="o">-</span><span class="n">pivy</span> <span class="n">gcc</span> <span class="n">gcc</span><span class="o">-</span><span class="n">fortran</span> <span class="n">cmake</span> <span class="n">occt</span><span class="o">-</span><span class="n">devel</span> <span class="n">libXi</span><span class="o">-</span><span class="n">devel</span> <span class="n">opencv</span><span class="o">-</span><span class="n">devel</span> <span class="n">libxerces</span><span class="o">-</span><span class="n">c</span><span class="o">-</span><span class="n">devel</span> <span class="n">Coin</span><span class="o">-</span><span class="n">devel</span> <span class="n">SoQt</span><span class="o">-</span><span class="n">devel</span> <span class="n">freetype2</span><span class="o">-</span><span class="n">devel</span> <span class="n">eigen3</span><span class="o">-</span><span class="n">devel</span> <span class="n">libode6</span> <span class="n">vtk</span><span class="o">-</span><span class="n">devel</span> <span class="n">libmed</span><span class="o">-</span><span class="n">devel</span> <span class="n">hdf5</span><span class="o">-</span><span class="n">openmpi</span><span class="o">-</span><span class="n">devel</span> <span class="n">openmpi2</span><span class="o">-</span><span class="n">devel</span> <span class="n">netgen</span><span class="o">-</span><span class="n">devel</span> <span class="n">freeglut</span><span class="o">-</span><span class="n">devel</span> <span class="n">libspnav</span><span class="o">-</span><span class="n">devel</span> <span class="n">f2c</span> <span class="n">doxygen</span> <span class="n">dos2unix</span> <span class="n">glew</span><span class="o">-</span><span class="n">devel</span> <span class="n">yaml</span><span class="o">-</span><span class="n">cpp</span>
</pre></div>
<p>&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1072;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090; Qt Creator &#1080; &#1086;&#1090;&#1083;&#1072;&#1076;&#1095;&#1080;&#1082; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; GNU.
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">zypper</span> <span class="ow">in</span> <span class="n">libqt5</span><span class="o">-</span><span class="n">creator</span> <span class="n">gdb</span>
</pre></div>
<p>&#1045;&#1089;&#1083;&#1080; &#1082;&#1072;&#1082;&#1080;&#1077;-&#1083;&#1080;&#1073;&#1086; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090;, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100; Tumbleweed <a rel="nofollow" class="external autonumber" href="https://build.opensuse.org/package/view_file/openSUSE:Factory/FreeCAD/FreeCAD.spec">[1]</a> "FreeCAD.spec" &#1092;&#1072;&#1081;&#1083; &#1085;&#1072; <a rel="nofollow" class="external autonumber" href="https://build.opensuse.org/package/show/openSUSE:Factory/FreeCAD">[2]</a> &#1054;&#1090;&#1082;&#1088;&#1086;&#1081;&#1090;&#1077; &#1057;&#1083;&#1091;&#1078;&#1073;&#1091; &#1089;&#1073;&#1086;&#1088;&#1082;&#1080;.
</p><p>&#1058;&#1072;&#1082;&#1078;&#1077;, &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1100;&#1090;&#1077;, &#1077;&#1089;&#1090;&#1100; &#1083;&#1080; &#1082;&#1072;&#1082;&#1080;&#1077;-&#1083;&#1080;&#1073;&#1086; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1072;&#1084; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; <a rel="nofollow" class="external text" href="https://build.opensuse.org/package/view_file/openSUSE:Factory/FreeCAD/0001-find-openmpi2-include-files.patch">0001-find-openmpi2-include-files.patch</a>).
</p>
<h4><span class="mw-headline" id="Leap">Leap</span></h4>
<p>&#1045;&#1089;&#1083;&#1080; &#1077;&#1089;&#1090;&#1100; &#1088;&#1072;&#1079;&#1085;&#1080;&#1094;&#1072; &#1084;&#1077;&#1078;&#1076;&#1091; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1084;&#1080; &#1087;&#1072;&#1082;&#1077;&#1090;&#1072;&#1084;&#1080; &#1085;&#1072; Tumbleweed &#1080; Leap, &#1090;&#1086; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100; Leap <a rel="nofollow" class="external autonumber" href="https://build.opensuse.org/package/view_file/openSUSE:Leap:15.0/FreeCAD/FreeCAD.spec">[3]</a> &#1092;&#1072;&#1081;&#1083; "FreeCAD.spec" &#1085;&#1072; <a rel="nofollow" class="external autonumber" href="https://build.opensuse.org/">[4]</a> &#1054;&#1090;&#1082;&#1088;&#1086;&#1081;&#1090;&#1077; &#1089;&#1083;&#1091;&#1078;&#1073;&#1091; &#1089;&#1073;&#1086;&#1088;&#1082;&#1080;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099;.
</p><p>&#1057;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?f=4&amp;t=49726">piano_jonas unofficial "Compile On openSUSE" guide</a>.
</p>
</div>
</div>
<div class="mw-collapsible mw-collapsed toccolours">
<h3><span class="mw-headline" id="Arch_Linux">Arch Linux</span></h3>
<div class="mw-collapsible-content">
<p>&#1042;&#1072;&#1084; &#1087;&#1086;&#1085;&#1072;&#1076;&#1086;&#1073;&#1103;&#1090;&#1089;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080; &#1080;&#1079; &#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1072;&#1088;&#1093;&#1080;&#1074;&#1086;&#1074;:
</p>
<ul><li><code>blosc</code></li>
<li><code>boost</code></li>
<li><code>boost-libs</code></li>
<li><code>cmake</code></li>
<li><code>coin</code></li>
<li><code>curl</code></li>
<li><code>desktop-file-utils</code></li>
<li><code>eigen</code></li>
<li><code>fmt</code></li>
<li><code>git</code></li>
<li><code>glew</code></li>
<li><code>hicolor-icon-theme</code></li>
<li><code>jsoncpp</code></li>
<li><code>libspnav</code></li>
<li><code>med</code></li>
<li><code>netcdf</code></li>
<li><code>ninja</code></li>
<li><code>nlohmann-json</code></li>
<li><code>opencascade</code></li>
<li><code>pybind11</code></li>
<li><code>pyside6</code></li>
<li><code>pyside6-tools</code></li>
<li><code>python-lark-parser</code></li>
<li><code>python-matplotlib</code></li>
<li><code>python-packaging</code></li>
<li><code>python-pivy</code></li>
<li><code>python-ply</code></li>
<li><code>qt6-svg</code></li>
<li><code>qt6-tools</code></li>
<li><code>qt6-base</code></li>
<li><code>qt6-5compat</code></li>
<li><code>shared-mime-info</code></li>
<li><code>shiboken6</code></li>
<li><code>swig</code></li>
<li><code>vtk</code></li>
<li><code>verdict</code></li>
<li><code>xerces-c</code></li>
<li><code>yaml-cpp</code></li></ul>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">sudo</span> <span class="n">pacman</span> <span class="o">-</span><span class="n">S</span> <span class="o">--</span><span class="n">needed</span> <span class="o">--</span><span class="n">asdeps</span> <span class="n">blosc</span> <span class="n">boost</span> <span class="n">boost</span><span class="o">-</span><span class="n">libs</span> <span class="n">cmake</span> <span class="n">coin</span> <span class="n">curl</span> <span class="n">desktop</span><span class="o">-</span><span class="n">file</span><span class="o">-</span><span class="n">utils</span> <span class="n">eigen</span> <span class="n">fmt</span> <span class="n">git</span> <span class="n">glew</span> <span class="n">hicolor</span><span class="o">-</span><span class="n">icon</span><span class="o">-</span><span class="n">theme</span> <span class="n">jsoncpp</span> <span class="n">libspnav</span> <span class="n">med</span> <span class="n">netcdf</span> <span class="n">ninja</span> <span class="n">nlohmann</span><span class="o">-</span><span class="n">json</span> <span class="n">opencascade</span> <span class="n">pybind11</span> <span class="n">pyside6</span> <span class="n">pyside6</span><span class="o">-</span><span class="n">tools</span> <span class="n">python</span><span class="o">-</span><span class="n">lark</span><span class="o">-</span><span class="n">parser</span> <span class="n">python</span><span class="o">-</span><span class="n">matplotlib</span>  <span class="n">python</span><span class="o">-</span><span class="n">packaging</span> <span class="n">python</span><span class="o">-</span><span class="n">pivy</span> <span class="n">python</span><span class="o">-</span><span class="n">ply</span> <span class="n">qt6</span><span class="o">-</span><span class="n">svg</span> <span class="n">qt6</span><span class="o">-</span><span class="n">tools</span> <span class="n">qt6</span><span class="o">-</span><span class="n">base</span> <span class="n">qt6</span><span class="o">-</span><span class="mi">5</span><span class="n">compat</span> <span class="n">shared</span><span class="o">-</span><span class="n">mime</span><span class="o">-</span><span class="n">info</span> <span class="n">shiboken6</span> <span class="n">swig</span> <span class="n">vtk</span> <span class="n">xerces</span><span class="o">-</span><span class="n">c</span> <span class="n">yaml</span><span class="o">-</span><span class="n">cpp</span>
</pre></div>
</div>
</div>
<div class="mw-collapsible mw-collapsed toccolours">
<p><span id="Older_and_non-conventional_distributions"></span>
</p>
<h3><span id=".D0.91.D0.BE.D0.BB.D0.B5.D0.B5_.D1.81.D1.82.D0.B0.D1.80.D1.8B.D0.B5_.D0.B8_.D0.BD.D0.B5.D1.82.D1.80.D0.B0.D0.B4.D0.B8.D1.86.D0.B8.D0.BE.D0.BD.D0.BD.D1.8B.D0.B5_.D0.B4.D0.B8.D1.81.D1.82.D1.80.D0.B8.D0.B1.D1.83.D1.82.D0.B8.D0.B2.D1.8B"></span><span class="mw-headline" id="&#1041;&#1086;&#1083;&#1077;&#1077;_&#1089;&#1090;&#1072;&#1088;&#1099;&#1077;_&#1080;_&#1085;&#1077;&#1090;&#1088;&#1072;&#1076;&#1080;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1077;_&#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074;&#1099;">&#1041;&#1086;&#1083;&#1077;&#1077; &#1089;&#1090;&#1072;&#1088;&#1099;&#1077; &#1080; &#1085;&#1077;&#1090;&#1088;&#1072;&#1076;&#1080;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1077; &#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074;&#1099;</span></h3>
<div class="mw-collapsible-content">
<p>&#1042; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074;&#1072;&#1093; &#1091; &#1085;&#1072;&#1089; &#1086;&#1095;&#1077;&#1085;&#1100; &#1084;&#1072;&#1083;&#1086; &#1086;&#1090;&#1079;&#1099;&#1074;&#1086;&#1074; &#1086;&#1090; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1089;&#1083;&#1086;&#1078;&#1085;&#1077;&#1077; &#1085;&#1072;&#1081;&#1090;&#1080; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099;.
</p><p>&#1057;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1091;&#1081;&#1090;&#1077; &#1085;&#1072;&#1081;&#1090;&#1080; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080;, &#1091;&#1087;&#1086;&#1084;&#1103;&#1085;&#1091;&#1090;&#1099;&#1077; &#1074; <a href="../Third_Party_Libraries.html" title="Third Party Libraries">&#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1080;&#1077; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080;</a> &#1074; &#1076;&#1080;&#1089;&#1087;&#1077;&#1090;&#1095;&#1077;&#1088;&#1077; &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074;. &#1054;&#1089;&#1090;&#1077;&#1088;&#1077;&#1075;&#1072;&#1081;&#1090;&#1077;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1091; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1080;&#1079; &#1085;&#1080;&#1093; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1085;&#1077;&#1084;&#1085;&#1086;&#1075;&#1086; &#1076;&#1088;&#1091;&#1075;&#1086;&#1077; &#1080;&#1084;&#1103; &#1087;&#1072;&#1082;&#1077;&#1090;&#1072;; &#1080;&#1097;&#1080;&#1090;&#1077; <code>name</code>, &#1085;&#1086; &#1090;&#1072;&#1082;&#1078;&#1077; <code>libname</code>, <code>name-dev</code>, <code>name-devel</code> &#1080; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1099;&#1077;. &#1045;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1091;&#1081;&#1090;&#1077; &#1089;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1101;&#1090;&#1080; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080; &#1089;&#1072;&#1084;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;.
</p><p>&#1044;&#1083;&#1103; FreeCAD &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1090;&#1086;&#1088;&#1072; GNU g++, &#1088;&#1072;&#1074;&#1085;&#1072;&#1103; &#1080;&#1083;&#1080; &#1074;&#1099;&#1096;&#1077; 3.0.0, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; FreeCAD &#1074; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1084; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085; &#1085;&#1072; C++. &#1042;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1089;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1080; Python, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1080;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1077;&#1090;&#1072;&#1090;&#1086;&#1088; Python &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1080;&#1079;&#1073;&#1077;&#1078;&#1072;&#1090;&#1100; &#1082;&#1072;&#1082;&#1080;&#1093;-&#1083;&#1080;&#1073;&#1086; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; &#1089; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1086;&#1074;&#1097;&#1080;&#1082;&#1086;&#1084;, &#1090;&#1072;&#1082;&#1078;&#1077; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1090;&#1089;&#1103; &#1080;&#1084;&#1077;&#1090;&#1100; &#1087;&#1091;&#1090;&#1080; &#1082; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1077; &#1074; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081; <code>LD_LIBRARY_PATH</code> &#1080;&#1083;&#1080; &#1074; &#1092;&#1072;&#1081;&#1083;&#1077; <code>ld.so.conf</code>. &#1069;&#1090;&#1086; &#1091;&#1078;&#1077; &#1089;&#1076;&#1077;&#1083;&#1072;&#1085;&#1086; &#1074; &#1089;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093; &#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074;&#1072;&#1093; Linux, &#1085;&#1086;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1074; &#1073;&#1086;&#1083;&#1077;&#1077; &#1089;&#1090;&#1072;&#1088;&#1099;&#1093;.
</p>
</div>
</div>
<h3><span class="mw-headline" id="Pivy">Pivy</span></h3>
<div class="mw-translate-fuzzy">
<p><a href="../ru/Pivy.html" title="Pivy/ru">Pivy</a> (&#1086;&#1073;&#1077;&#1088;&#1090;&#1082;&#1080; Python &#1076;&#1083;&#1103; Coin3d) &#1085;&#1077; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1089;&#1073;&#1086;&#1088;&#1082;&#1080; FreeCAD &#1080;&#1083;&#1080; &#1077;&#1075;&#1086; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;, &#1085;&#1086; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1089;&#1088;&#1077;&#1076;&#1099; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; <a href="../ru/Draft_Workbench.html" title="Draft Workbench/ru">Draft Workbench</a>. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1085;&#1077; &#1089;&#1086;&#1073;&#1080;&#1088;&#1072;&#1077;&#1090;&#1077;&#1089;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1101;&#1090;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1072;, &#1074;&#1072;&#1084; &#1085;&#1077; &#1087;&#1086;&#1085;&#1072;&#1076;&#1086;&#1073;&#1080;&#1090;&#1089;&#1103; Pivy. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; Draft &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1088;&#1072;&#1073;&#1086;&#1095;&#1080;&#1093; &#1089;&#1090;&#1086;&#1083;&#1086;&#1074;, &#1090;&#1072;&#1082;&#1080;&#1093; &#1082;&#1072;&#1082; <a href="../ru/Arch_Workbench.html" title="Arch Workbench/ru">Arch</a> &#1080; <a href="../ru/BIM_Workbench.html" title="BIM Workbench/ru">BIM</a>, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1076;&#1083;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1101;&#1090;&#1080;&#1093; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074; &#1090;&#1072;&#1082;&#1078;&#1077; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; Pivy.
</p>
</div>
<p>&#1050; &#1085;&#1086;&#1103;&#1073;&#1088;&#1102; 2015 &#1075;&#1086;&#1076;&#1072; &#1091;&#1089;&#1090;&#1072;&#1088;&#1077;&#1074;&#1096;&#1072;&#1103; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103; Pivy, &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1085;&#1072;&#1103; &#1074; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076; FreeCAD, &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074;&#1086; &#1084;&#1085;&#1086;&#1075;&#1080;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1093;. &#1069;&#1090;&#1086; &#1085;&#1077; &#1073;&#1086;&#1083;&#1100;&#1096;&#1072;&#1103; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; Pivy &#1086;&#1090; &#1084;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088;&#1072; &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086; &#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074;&#1072;; &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1081;&#1090;&#1080; Pivy, &#1074;&#1072;&#1084;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1087;&#1088;&#1080;&#1076;&#1077;&#1090;&#1089;&#1103; &#1089;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1089;&#1072;&#1084;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;, &#1089;&#1084;. &#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080; &#1087;&#1086; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080; Pivy.
</p><p><span id="Debug_symbols"></span>
</p>
<h3><span id=".D0.9E.D1.82.D0.BB.D0.B0.D0.B4.D0.BE.D1.87.D0.BD.D1.8B.D0.B5_.D1.81.D0.B8.D0.BC.D0.B2.D0.BE.D0.BB.D1.8B"></span><span class="mw-headline" id="&#1054;&#1090;&#1083;&#1072;&#1076;&#1086;&#1095;&#1085;&#1099;&#1077;_&#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1099;">&#1054;&#1090;&#1083;&#1072;&#1076;&#1086;&#1095;&#1085;&#1099;&#1077; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1099;</span></h3>
<p>&#1044;&#1083;&#1103; &#1091;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077;&#1087;&#1086;&#1083;&#1072;&#1076;&#1086;&#1082; &#1074; FreeCAD &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086; &#1080;&#1084;&#1077;&#1090;&#1100; &#1086;&#1090;&#1083;&#1072;&#1076;&#1086;&#1095;&#1085;&#1099;&#1077; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1099; &#1074;&#1072;&#1078;&#1085;&#1099;&#1093; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1077;&#1081;, &#1090;&#1072;&#1082;&#1080;&#1093; &#1082;&#1072;&#1082; Qt. &#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1091;&#1081;&#1090;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1077;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1079;&#1072;&#1082;&#1072;&#1085;&#1095;&#1080;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1085;&#1072; <code>-dbg</code>, <code>-dbgsym</code>, <code>-debuginfo</code> &#1080;&#1083;&#1080; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1099;&#1077;, &#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086; &#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074;&#1072; Linux.
</p><p>&#1044;&#1083;&#1103; Ubuntu &#1074;&#1072;&#1084;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1080;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1084;&#1077;&#1090;&#1100; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1088;&#1086;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1090;&#1100; &#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1090;&#1100; &#1101;&#1090;&#1080; &#1086;&#1090;&#1083;&#1072;&#1076;&#1086;&#1095;&#1085;&#1099;&#1077; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1076;&#1080;&#1089;&#1087;&#1077;&#1090;&#1095;&#1077;&#1088;&#1072; &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074;. &#1057;&#1084;.<a rel="nofollow" class="external text" href="https://wiki.ubuntu.com/Debug_Symbol_Packages">Debug Symbol Packages</a> &#1076;&#1083;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;.
</p><p><span id="Compile_FreeCAD"></span>
</p>
<h2><span id=".D0.A1.D0.B1.D0.BE.D1.80.D0.BA.D0.B0_FreeCAD"></span><span class="mw-headline" id="&#1057;&#1073;&#1086;&#1088;&#1082;&#1072;_FreeCAD">&#1057;&#1073;&#1086;&#1088;&#1082;&#1072; FreeCAD</span></h2>
<div class="mw-translate-fuzzy">
<div class="warning-box">Python 2 &#1080; Qt4 &#1087;&#1088;&#1080; &#1089;&#1073;&#1086;&#1088;&#1082;&#1077; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1085;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1072; &#1074; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 0.20 &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1085;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;&#1086;&#1086;&#1073;&#1097;&#1077;. &#1044;&#1086;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1103; &#1089; Python 3 &#1080; Qt5. &#1040; &#1076;&#1083;&#1103; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 0.20 &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1082;&#1072;&#1082; &#1084;&#1080;&#1085;&#1080;&#1084;&#1091;&#1084; Python3.6 &#1080; Qt 5.9.</div>
</div>
<p>FreeCAD &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; CMake &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1089;&#1073;&#1086;&#1088;&#1082;&#1080;, &#1086;&#1085;&#1072; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072; &#1074;&#1086; &#1074;&#1089;&#1077;&#1093; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1093;. &#1050;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; CMake &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1086;&#1095;&#1077;&#1085;&#1100; &#1087;&#1088;&#1086;&#1089;&#1090;&#1072; &#1080; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1074; &#1076;&#1074;&#1072; &#1101;&#1090;&#1072;&#1087;&#1072;.
</p>
<ol><li>CMake &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1103;&#1077;&#1090; &#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1077; &#1074; &#1074;&#1072;&#1096;&#1077;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1074;&#1089;&#1077;&#1093; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1093; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084; &#1080; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082; &#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; <code>Makefile</code>, &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1099;&#1081; &#1076;&#1083;&#1103; &#1074;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1096;&#1072;&#1075;&#1072;. FreeCAD &#1080;&#1084;&#1077;&#1077;&#1090; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1086;&#1074; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080; &#1085;&#1072; &#1074;&#1099;&#1073;&#1086;&#1088;, &#1085;&#1086; &#1086;&#1085; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089; &#1088;&#1072;&#1079;&#1091;&#1084;&#1085;&#1099;&#1084;&#1080; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072;&#1084;&#1080; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;. &#1053;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1072;&#1083;&#1100;&#1090;&#1077;&#1088;&#1085;&#1072;&#1090;&#1080;&#1074;&#1099; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1099; &#1085;&#1080;&#1078;&#1077;.</li>
<li>&#1057;&#1072;&#1084;&#1072; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; <code>make</code>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1099;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; FreeCAD.</li></ol>
<p>&#1055;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; FreeCAD - &#1101;&#1090;&#1086; &#1082;&#1088;&#1091;&#1087;&#1085;&#1086;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;, &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1103; &#1074;&#1089;&#1077;&#1075;&#1086; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1079;&#1072;&#1085;&#1103;&#1090;&#1100; &#1086;&#1090; 10 &#1084;&#1080;&#1085;&#1091;&#1090; &#1076;&#1086; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1095;&#1072;&#1089;&#1072;, &#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072; &#1080; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1072; &#1103;&#1076;&#1077;&#1088; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1093; &#1076;&#1083;&#1103; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080;.
</p><p><span id="Building"></span>
</p>
<div class="mw-translate-fuzzy">
<h3><span id=".D0.A1.D0.B1.D0.BE.D1.80.D0.BA.D0.B0_.D0.B2.D0.BD.D0.B5_.D0.BF.D0.B0.D0.BF.D0.BA.D0.B8_.D0.B8.D1.81.D1.85.D0.BE.D0.B4.D0.BD.D0.B8.D0.BA.D0.BE.D0.B2"></span><span class="mw-headline" id="&#1057;&#1073;&#1086;&#1088;&#1082;&#1072;_&#1074;&#1085;&#1077;_&#1087;&#1072;&#1087;&#1082;&#1080;_&#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1080;&#1082;&#1086;&#1074;">&#1057;&#1073;&#1086;&#1088;&#1082;&#1072; &#1074;&#1085;&#1077; &#1087;&#1072;&#1087;&#1082;&#1080; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1080;&#1082;&#1086;&#1074;</span></h3>
</div>
<div class="mw-translate-fuzzy">
<p>&#1044;&#1083;&#1103; &#1089;&#1073;&#1086;&#1088;&#1082;&#1080; &#1080;&#1079; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075; &#1089;&#1073;&#1086;&#1088;&#1082;&#1080; <code>freecad-build</code>, &#1086;&#1090;&#1083;&#1080;&#1095;&#1085;&#1099;&#1081; &#1086;&#1090; &#1074;&#1072;&#1096;&#1077;&#1081; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1081; &#1087;&#1072;&#1087;&#1082;&#1080; FreeCAD, <code>freecad-source</code>; &#1079;&#1072;&#1090;&#1077;&#1084; &#1080;&#1079; &#1101;&#1090;&#1086;&#1081; &#1090;&#1086;&#1095;&#1082;&#1080; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1072; &#1089;&#1073;&#1086;&#1088;&#1082;&#1080; <code>cmake</code> &#1074; &#1085;&#1091;&#1078;&#1085;&#1091;&#1102; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1091;&#1102; &#1087;&#1072;&#1087;&#1082;&#1091;. &#1042;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; <code>cmake-gui</code> &#1080;&#1083;&#1080; <code>ccmake</code> &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; <code>cmake</code> &#1074; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1099;&#1093; &#1085;&#1080;&#1078;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1103;&#1093;. &#1050;&#1072;&#1082; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; <code>cmake</code> &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1080;&#1090; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1102; &#1089;&#1088;&#1077;&#1076;&#1099;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; <code>make</code> &#1076;&#1083;&#1103; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072; &#1072;&#1082;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080;.
</p>
</div>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span><span class="c1"># from your freecad-source folder:</span>
mkdir<span class="w"> </span>build
<span class="nb">cd</span><span class="w"> </span>build
cmake<span class="w"> </span>../
make<span class="w"> </span>-j<span class="k">$(</span>nproc<span class="w"> </span>--ignore<span class="o">=</span><span class="m">2</span><span class="k">)</span>
</pre></div>
<div class="mw-translate-fuzzy">
<p>&#1054;&#1087;&#1094;&#1080;&#1103; <code>-j</code> <code>make</code> &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;, &#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1079;&#1072;&#1076;&#1072;&#1095; (&#1092;&#1072;&#1081;&#1083;&#1086;&#1074;) &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1072;&#1088;&#1072;&#1083;&#1083;&#1077;&#1083;&#1100;&#1085;&#1086;. &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; <code>nproc</code> &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1103;&#1076;&#1077;&#1088; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072; &#1074; &#1074;&#1072;&#1096;&#1077;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077;; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1077;&#1077; &#1074;&#1084;&#1077;&#1089;&#1090;&#1077; &#1089; &#1086;&#1087;&#1094;&#1080;&#1077;&#1081; <code>-j</code>, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1089;&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;, &#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1091; &#1074;&#1072;&#1089; &#1103;&#1076;&#1077;&#1088;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1089;&#1082;&#1086;&#1088;&#1080;&#1090;&#1100; &#1086;&#1073;&#1097;&#1091;&#1102; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1102; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;. &#1042; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1086;&#1084; &#1074;&#1099;&#1096;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; &#1086;&#1085; &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1089;&#1077; &#1103;&#1076;&#1088;&#1072; &#1074;&#1072;&#1096;&#1077;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;, &#1082;&#1088;&#1086;&#1084;&#1077; &#1076;&#1074;&#1091;&#1093;; &#1101;&#1090;&#1086; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1080;&#1090; &#1074;&#1072;&#1096;&#1077;&#1084;&#1091; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1091; &#1088;&#1077;&#1072;&#1075;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1085;&#1072; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1074;&#1080;&#1076;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1087;&#1086;&#1082;&#1072; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074; &#1092;&#1086;&#1085;&#1086;&#1074;&#1086;&#1084; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077;. &#1048;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; FreeCAD &#1074; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;&#1084; &#1080;&#1090;&#1086;&#1075;&#1077; &#1087;&#1086;&#1103;&#1074;&#1080;&#1090;&#1089;&#1103; &#1074; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1077; <code>freecad-build/bin</code>. &#1057;&#1084;. &#1090;&#1072;&#1082;&#1078;&#1077; <a href="../Compiling_(Speeding_up).html" title="Compiling (Speeding up)">Compiling (speeding up)</a> &#1076;&#1083;&#1103; &#1087;&#1086;&#1074;&#1099;&#1096;&#1077;&#1085;&#1080;&#1103; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1080; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080;.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span class="mw-headline" id="Resolving_cmake_issues">Resolving cmake issues</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>If you have done a build before and get stuck on a dependency that is not recognized or can't seem to be resolved, try the following:
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<ul><li>Delete the contents of the build directory before running cmake again. FreeCAD is a rapidly moving target, you may be tripping over cached cmake information that points at an older version than the new repository head can use. Clearing the cache may allow cmake to recover and recognize the version you actually need.</li></ul>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<ul><li>If cmake complains about missing a specific file, use a tool such as "apt-file search", or its equivalent in other package systems, to discover what package that file belongs to and install it. Bear in mind that you are likely to need the -dev version of the package that carries header or config files files required for FreeCAD to use the package.</li></ul>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span class="mw-headline" id="Compiling_against_GNU_libc_2.34_and_later">Compiling against GNU libc 2.34 and later</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>GNU libc 2.34 introduces a change to the library that can cause builds on some Linux systems to fail with an error like:
</p>
</div>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span>No<span class="w"> </span>rule<span class="w"> </span>to<span class="w"> </span>make<span class="w"> </span>target<span class="w"> </span><span class="err">'</span>/usr/lib/x86_64-linux-gnu/libdl.so
</pre></div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>To resolve this, a symbolic link must be manually created from the (now empty) system-installed libdl.so.* to the location your compiler says it is looking for the file. For example (if the actual installed copy of libdl.so on your system is /usr/lib/x86_64-linux-gnu/libdl.so.2):
</p>
</div>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span>sudo<span class="w"> </span>ln<span class="w"> </span>-s<span class="w"> </span>/usr/lib/x86_64-linux-gnu/libdl.so.2<span class="w"> </span>/usr/lib/x86_64-linux-gnu/libdl.so
</pre></div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Adapt the command for the structure of your system by searching for libdl.so* and linking it to the appropriate location.
</p>
</div>
<p><span id="How_to_repair_your_source_code_directory"></span>
</p>
<h3><span id=".D0.9A.D0.B0.D0.BA_.D0.B2.D0.BE.D1.81.D1.81.D1.82.D0.B0.D0.BD.D0.BE.D0.B2.D0.B8.D1.82.D1.8C_.D0.BF.D0.B0.D0.BF.D0.BA.D1.83_.D1.81_.D0.B8.D1.81.D1.85.D0.BE.D0.B4.D0.BD.D1.8B.D0.BC.D0.B8_.D0.BA.D0.BE.D0.B4.D0.B0.D0.BC.D0.B8"></span><span class="mw-headline" id="&#1050;&#1072;&#1082;_&#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100;_&#1087;&#1072;&#1087;&#1082;&#1091;_&#1089;_&#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084;&#1080;_&#1082;&#1086;&#1076;&#1072;&#1084;&#1080;">&#1050;&#1072;&#1082; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1087;&#1072;&#1087;&#1082;&#1091; &#1089; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084;&#1080; &#1082;&#1086;&#1076;&#1072;&#1084;&#1080;</span></h3>
<p>&#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081;&#1085;&#1086; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1083;&#1080; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1102; &#1074; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1077; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072; &#1080;&#1083;&#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1083;&#1080; &#1089;&#1090;&#1088;&#1072;&#1085;&#1085;&#1099;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; &#1080; &#1093;&#1086;&#1090;&#1077;&#1083;&#1080; &#1073;&#1099; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1084; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1084; &#1082;&#1086;&#1076;&#1077;, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103;.
</p>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span>&gt;<span class="w"> </span>.gitignore
git<span class="w"> </span>clean<span class="w"> </span>-df
git<span class="w"> </span>reset<span class="w"> </span>--hard<span class="w"> </span>HEAD
</pre></div>
<p>&#1055;&#1077;&#1088;&#1074;&#1072;&#1103; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072; &#1086;&#1095;&#1080;&#1097;&#1072;&#1077;&#1090; &#1092;&#1072;&#1081;&#1083; <code>.gitignore</code>. &#1069;&#1090;&#1086; &#1075;&#1072;&#1088;&#1072;&#1085;&#1090;&#1080;&#1088;&#1091;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; clean &#1080; reset &#1073;&#1091;&#1076;&#1091;&#1090; &#1074;&#1083;&#1080;&#1103;&#1090;&#1100; &#1085;&#1072; &#1074;&#1089;&#1077; &#1074; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1077; &#1080; &#1085;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1080;&#1075;&#1085;&#1086;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099;, &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084; &#1074; <code>.gitignore</code>. &#1042;&#1090;&#1086;&#1088;&#1072;&#1103; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072; &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090; &#1074;&#1089;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; &#1080; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1077; &#1086;&#1090;&#1089;&#1083;&#1077;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1077;&#1084; git, &#1079;&#1072;&#1090;&#1077;&#1084; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1103;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1089;&#1073;&#1088;&#1072;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090; &#1074;&#1089;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1074; &#1086;&#1090;&#1089;&#1083;&#1077;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093; &#1092;&#1072;&#1081;&#1083;&#1072;&#1093;, &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1103; &#1087;&#1077;&#1088;&#1074;&#1091;&#1102; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1091;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1086;&#1095;&#1080;&#1089;&#1090;&#1080;&#1083;&#1072; &#1092;&#1072;&#1081;&#1083; <code>.gitignore</code>.
</p><p>&#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1085;&#1077; &#1086;&#1095;&#1080;&#1089;&#1090;&#1080;&#1090;&#1077; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;, &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1080; <code>cmake</code> &#1084;&#1086;&#1075;&#1091;&#1090; &#1085;&#1077; &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091;, &#1077;&#1089;&#1083;&#1080; &#1082;&#1086;&#1076; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1089;&#1103;.
</p><p><span id="Configuration"></span>
</p>
<h3><span id=".D0.9A.D0.BE.D0.BD.D1.84.D0.B8.D0.B3.D1.83.D1.80.D0.B8.D1.80.D0.BE.D0.B2.D0.B0.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1050;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;">&#1050;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;</span></h3>
<p>&#1055;&#1077;&#1088;&#1077;&#1076;&#1072;&#1074;&#1072;&#1103; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1074; <code>cmake</code>, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080; FreeCAD. &#1057;&#1080;&#1085;&#1090;&#1072;&#1082;&#1089;&#1080;&#1089; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1080;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;.
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">cmake</span> <span class="o">-</span><span class="n">D</span> <span class="o">&lt;</span><span class="n">var</span><span class="o">&gt;</span><span class="p">:</span><span class="o">&lt;</span><span class="nb">type</span><span class="o">&gt;=&lt;</span><span class="n">value</span><span class="o">&gt;</span> <span class="err">$</span><span class="n">SOURCE_DIR</span>
</pre></div>
<p>&#1043;&#1076;&#1077; <code>$SOURCE_DIR</code> - &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1080;&#1081; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076;. <code>&lt;type&gt;</code> &#1074; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;&#1074; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1086;&#1087;&#1091;&#1097;&#1077;&#1085;. &#1055;&#1088;&#1086;&#1073;&#1077;&#1083; &#1087;&#1086;&#1089;&#1083;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; <code>-D</code> &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1086;&#1087;&#1091;&#1097;&#1077;&#1085;.
</p><p>&#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1079;&#1073;&#1077;&#1078;&#1072;&#1090;&#1100; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; <a href="../FEM_Workbench.html" title="FEM Workbench">FEM Workbench</a>:
</p>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span>cmake<span class="w"> </span>-D<span class="w"> </span>BUILD_FEM:BOOL<span class="o">=</span>OFF<span class="w"> </span>../
cmake<span class="w"> </span>-DBUILD_FEM<span class="o">=</span>OFF<span class="w"> </span>../
</pre></div>
<p>&#1042;&#1089;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1077; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1099; &#1074; &#1092;&#1072;&#1081;&#1083;&#1077; <code>InitializeFreeCADBuildOptions.cmake</code>, &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1084; &#1074; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1077; <code>CMake/FreeCAD_Helpers</code>. &#1042; &#1101;&#1090;&#1086;&#1084; &#1092;&#1072;&#1081;&#1083;&#1077; &#1085;&#1072;&#1081;&#1076;&#1105;&#1090;&#1077; &#1089;&#1083;&#1086;&#1074;&#1086; <code>option</code>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1077;&#1088;&#1077;&#1081;&#1090;&#1080; &#1082; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1084;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100;, &#1080; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1080;&#1093; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;.
</p>
<pre># ==============================================================================
# =================   All the options for the build process    =================
# ==============================================================================

option(BUILD_FORCE_DIRECTORY "The build directory must be different to the source directory." OFF)
option(BUILD_GUI "Build FreeCAD Gui. Otherwise you have only the command line and the Python import module." ON)
option(FREECAD_USE_EXTERNAL_ZIPIOS "Use system installed zipios++ instead of the bundled." OFF)
option(FREECAD_USE_EXTERNAL_SMESH "Use system installed smesh instead of the bundled." OFF)
...
</pre>
<p>&#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1072;&#1083;&#1100;&#1090;&#1077;&#1088;&#1085;&#1072;&#1090;&#1080;&#1074;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1091; <code>cmake-LH</code> &#1076;&#1083;&#1103; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1081; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080; &#1080;, &#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;, &#1074;&#1089;&#1077;&#1093; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100;. &#1042;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; <code>cmake-gui</code> &#1076;&#1083;&#1103; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072;, &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1102;&#1097;&#1077;&#1075;&#1086; &#1074;&#1089;&#1077; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100;. &#1042; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1072;&#1093; &#1084;&#1099; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1080;&#1084; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1079; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1074;&#1072;&#1078;&#1085;&#1099;&#1093; &#1086;&#1087;&#1094;&#1080;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1099;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1079;&#1072;&#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;.
</p><p><span id="For_a_Debug_build"></span>
</p>
<h4><span id=".D0.94.D0.BB.D1.8F_Debug_.D1.81.D0.B1.D0.BE.D1.80.D0.BA.D0.B8"></span><span class="mw-headline" id="&#1044;&#1083;&#1103;_Debug_&#1089;&#1073;&#1086;&#1088;&#1082;&#1080;">&#1044;&#1083;&#1103; Debug &#1089;&#1073;&#1086;&#1088;&#1082;&#1080;</span></h4>
<p>&#1057;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1089;&#1073;&#1086;&#1088;&#1082;&#1091; <code>Debug</code> &#1076;&#1083;&#1103; &#1091;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077;&#1087;&#1086;&#1083;&#1072;&#1076;&#1086;&#1082; &#1074; FreeCAD. &#1048;&#1084;&#1077;&#1081;&#1090;&#1077; &#1074; &#1074;&#1080;&#1076;&#1091;, &#1095;&#1090;&#1086; &#1087;&#1088;&#1080; &#1090;&#1072;&#1082;&#1086;&#1081; &#1089;&#1073;&#1086;&#1088;&#1082;&#1077; <a href="../Sketcher_Workbench.html" title="Sketcher Workbench">Sketcher</a> &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1089;&#1103; &#1086;&#1095;&#1077;&#1085;&#1100; &#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084; &#1087;&#1088;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077; &#1089;&#1086; &#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1084;&#1080; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072;&#1084;&#1080;.
</p>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span>cmake<span class="w"> </span>-DPYTHON_EXECUTABLE<span class="o">=</span>/usr/bin/python3<span class="w"> </span>-DCMAKE_BUILD_TYPE<span class="o">=</span>Debug<span class="w"> </span>../
</pre></div>
<p><span id="For_a_Release_build"></span>
</p>
<h4><span id=".D0.94.D0.BB.D1.8F_Release_.D1.81.D0.B1.D0.BE.D1.80.D0.BA.D0.B8"></span><span class="mw-headline" id="&#1044;&#1083;&#1103;_Release_&#1089;&#1073;&#1086;&#1088;&#1082;&#1080;">&#1044;&#1083;&#1103; Release &#1089;&#1073;&#1086;&#1088;&#1082;&#1080;</span></h4>
<p>&#1057;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1089;&#1073;&#1086;&#1088;&#1082;&#1091; <code>Release</code> &#1076;&#1083;&#1103; &#1090;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1082;&#1086;&#1076;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1085;&#1077; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1073;&#1086;&#1077;&#1084;. &#1057;&#1073;&#1086;&#1088;&#1082;&#1072; <code>Release</code> &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072;&#1084;&#1085;&#1086;&#1075;&#1086; &#1073;&#1099;&#1089;&#1090;&#1088;&#1077;&#1077;, &#1095;&#1077;&#1084; &#1089;&#1073;&#1086;&#1088;&#1082;&#1072; <code>Debug</code>.
</p>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span>cmake<span class="w"> </span>-DPYTHON_EXECUTABLE<span class="o">=</span>/usr/bin/python3<span class="w"> </span>-DCMAKE_BUILD_TYPE<span class="o">=</span>Release<span class="w"> </span>../
</pre></div>
<p><span id="Building_against_Python_3_and_Qt5"></span>
</p>
<h4><span id=".D0.A1.D0.B1.D0.BE.D1.80.D0.BA.D0.B0_.D0.BD.D0.B0_.D0.BE.D1.81.D0.BD.D0.BE.D0.B2.D0.B5_Python_3_.D0.B8_Qt5"></span><span class="mw-headline" id="&#1057;&#1073;&#1086;&#1088;&#1082;&#1072;_&#1085;&#1072;_&#1086;&#1089;&#1085;&#1086;&#1074;&#1077;_Python_3_&#1080;_Qt5">&#1057;&#1073;&#1086;&#1088;&#1082;&#1072; &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077; Python 3 &#1080; Qt5</span></h4>
<div class="mw-translate-fuzzy">
<p>&#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; FreeCAD 0.19 &#1080; &#1073;&#1086;&#1083;&#1077;&#1077; &#1088;&#1072;&#1085;&#1085;&#1080;&#1077; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1099; &#1076;&#1083;&#1103; Python 2 &#1080; Qt4. &#1055;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1101;&#1090;&#1080; &#1076;&#1074;&#1072; &#1087;&#1072;&#1082;&#1077;&#1090;&#1072; &#1091;&#1089;&#1090;&#1072;&#1088;&#1077;&#1083;&#1080;, &#1083;&#1091;&#1095;&#1096;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1076;&#1083;&#1103; Python 3 &#1080; Qt5. &#1055;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1072; Python 2 &#1080; Qt4 &#1073;&#1099;&#1083;&#1072; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1072; &#1074; FreeCAD 0.20, &#1080; &#1085;&#1077;&#1090; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1103;&#1074;&#1085;&#1086; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1100; Qt5 &#1080; Python 3 &#1087;&#1088;&#1080; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1093; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080;.
</p>
</div>
<div class="mw-translate-fuzzy">
<p>&#1044;&#1083;&#1103; 0.20_dev:
</p>
</div>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span>cmake<span class="w"> </span>../
</pre></div>
<div class="mw-translate-fuzzy">
<p>&#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1087;&#1088;&#1080; &#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1080; &#1084;&#1077;&#1078;&#1076;&#1091; &#1089;&#1073;&#1086;&#1088;&#1082;&#1072;&#1084;&#1080; 0.19 &#1080; 0.20 &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; CMakeCache.txt &#1076;&#1086; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072; cmake.
</p>
</div>
<p><span id="Building_for_a_specific_Python_version"></span>
</p>
<h4><span id=".D0.A1.D0.B1.D0.BE.D1.80.D0.BA.D0.B0_.D1.81_.D0.BF.D1.80.D0.B8.D0.BC.D0.B5.D0.BD.D0.B5.D0.BD.D0.B8.D0.B5.D0.BC_.D0.BE.D1.81.D0.BE.D0.B1.D1.8B.D1.85_.D0.B2.D0.B5.D1.80.D1.81.D0.B8.D0.B9_Python"></span><span class="mw-headline" id="&#1057;&#1073;&#1086;&#1088;&#1082;&#1072;_&#1089;_&#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084;_&#1086;&#1089;&#1086;&#1073;&#1099;&#1093;_&#1074;&#1077;&#1088;&#1089;&#1080;&#1081;_Python">&#1057;&#1073;&#1086;&#1088;&#1082;&#1072; &#1089; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084; &#1086;&#1089;&#1086;&#1073;&#1099;&#1093; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081; Python</span></h4>
<div class="mw-translate-fuzzy">
<p>&#1045;&#1089;&#1083;&#1080; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; <code>python</code> &#1074; &#1074;&#1072;&#1096;&#1077;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1089;&#1089;&#1099;&#1083;&#1082;&#1086;&#1081; &#1085;&#1072; Python 2, <code>cmake</code> &#1087;&#1086;&#1087;&#1099;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; FreeCAD &#1076;&#1083;&#1103; &#1101;&#1090;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080;. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; &#1076;&#1088;&#1091;&#1075;&#1091;&#1102; &#1074;&#1077;&#1088;&#1089;&#1080;&#1102; Python, &#1091;&#1082;&#1072;&#1079;&#1072;&#1074; &#1087;&#1091;&#1090;&#1100; &#1082; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1084;&#1091; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1086;&#1084;&#1091; &#1092;&#1072;&#1081;&#1083;&#1091;:
</p>
</div>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span>cmake<span class="w"> </span>-DPYTHON_EXECUTABLE<span class="o">=</span>/usr/bin/python3<span class="w"> </span>../
</pre></div>
<p>&#1045;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086; &#1085;&#1077; &#1089;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090;, &#1074;&#1072;&#1084;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1087;&#1088;&#1080;&#1076;&#1077;&#1090;&#1089;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077;, &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1077; &#1085;&#1072; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1084;&#1099;&#1077; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080; Python, &#1080; &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1080;:
</p>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span>cmake<span class="w"> </span>-DPYTHON_EXECUTABLE<span class="o">=</span>/usr/bin/python3.6<span class="w"> </span><span class="se">\</span>
<span class="w">    </span>-DPYTHON_INCLUDE_DIR<span class="o">=</span>/usr/include/python3.6m<span class="w"> </span><span class="se">\</span>
<span class="w">    </span>-DPYTHON_LIBRARY<span class="o">=</span>/usr/lib/x86_64-linux-gnu/libpython3.6m.so<span class="w"> </span><span class="se">\</span>
<span class="w">    </span>-DPYTHON_PACKAGES_PATH<span class="o">=</span>/usr/lib/python3.6/site-packages/<span class="w"> </span><span class="se">\</span>
<span class="w">    </span>../
</pre></div>
<p>&#1042; &#1086;&#1076;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1080;&#1084;&#1077;&#1077;&#1090; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1077;&#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1099;&#1093; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081; Python, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1080; &#1085;&#1086;&#1084;&#1077;&#1088;&#1072; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081; &#1074;&#1072;&#1096;&#1080;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; Python &#1073;&#1091;&#1076;&#1091;&#1090; &#1079;&#1072;&#1074;&#1080;&#1089;&#1077;&#1090;&#1100; &#1086;&#1090; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086;&#1075;&#1086; &#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074;&#1072; Linux. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; <code>python3-V</code> &#1076;&#1083;&#1103; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; Python, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1074;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1077; &#1074; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1077;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103;; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1077;&#1088;&#1074;&#1099;&#1077; &#1076;&#1074;&#1072; &#1095;&#1080;&#1089;&#1083;&#1072;; &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1077;&#1089;&#1083;&#1080; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1086;&#1084; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; <code>Python 3.6.8</code>, &#1074;&#1072;&#1084; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1080;, &#1086;&#1090;&#1085;&#1086;&#1089;&#1103;&#1097;&#1080;&#1077;&#1089;&#1103; &#1082; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 3.6. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1085;&#1077; &#1079;&#1085;&#1072;&#1077;&#1090;&#1077; &#1085;&#1091;&#1078;&#1085;&#1099;&#1093; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;, &#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1091;&#1081;&#1090;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1080;&#1093; &#1087;&#1086;&#1080;&#1089;&#1082; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; <code>locate</code>.
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">locate</span> <span class="n">python3</span><span class="mf">.6</span>
</pre></div>
<p>&#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; <code>python3 -m site</code> &#1074; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1072;&#1083;&#1077; &#1076;&#1083;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1072; <code>site-packages</code> &#1080;&#1083;&#1080; <code>dist-packages</code> &#1076;&#1083;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084; Debian.
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Some components of FreeCAD, such as PySide, try to autodetect the most recent Python version installed on your system, which might fail if it is different from what you entered above. Adding the following cMake option might solve the issue:
</p>
</div>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span>-DPython3_FIND_STRATEGY<span class="o">=</span>LOCATION
</pre></div>
<p><span id="Building_with_Qt_Creator_against_Python_3_and_Qt5"></span>
</p>
<h4><span id=".D0.A1.D0.B1.D0.BE.D1.80.D0.BA.D0.B0_.D0.B2_Qt_Creator_.D0.BD.D0.B0_.D0.BE.D1.81.D0.BD.D0.BE.D0.B2.D0.B5_Python_3_.D0.B8_Qt5"></span><span class="mw-headline" id="&#1057;&#1073;&#1086;&#1088;&#1082;&#1072;_&#1074;_Qt_Creator_&#1085;&#1072;_&#1086;&#1089;&#1085;&#1086;&#1074;&#1077;_Python_3_&#1080;_Qt5">&#1057;&#1073;&#1086;&#1088;&#1082;&#1072; &#1074; Qt Creator &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077; Python 3 &#1080; Qt5</span></h4>
<p>1. &#1047;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1077; Qt Creator.
</p><p>2. &#1050;&#1083;&#1080;&#1082;&#1085;&#1080;&#1090;&#1077; &#1085;&#1072; <b>Open Project</b>.
</p><p>3. &#1055;&#1077;&#1088;&#1077;&#1081;&#1076;&#1080;&#1090;&#1077; &#1074; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076;, <code>freecad-source/</code>, &#1080; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1089;&#1072;&#1084;&#1099;&#1081; &#1074;&#1077;&#1088;&#1093;&#1085;&#1080;&#1081; &#1092;&#1072;&#1081;&#1083; <code>CMakeLists.txt</code>.
</p><p>4. &#1042;&#1099;&#1073;&#1088;&#1072;&#1074; &#1092;&#1072;&#1081;&#1083;, &#1086;&#1085; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090; <code>cmake</code> &#1085;&#1072; &#1085;&#1077;&#1084;, &#1085;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1099;&#1081;&#1090;&#1080; &#1080;&#1079; &#1089;&#1090;&#1088;&#1086;&#1103;, &#1077;&#1089;&#1083;&#1080; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1099; &#1085;&#1077;&#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;.
</p>
<div class="mw-translate-fuzzy">
<p>5. &#1055;&#1077;&#1088;&#1077;&#1081;&#1076;&#1080;&#1090;&#1077; &#1074; <b>Projects &rarr; Build &amp; Run &rarr; Imported Kit &rarr; Build &rarr; Build Settings &rarr; CMake</b>. &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1081; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075; &#1089;&#1073;&#1086;&#1088;&#1082;&#1080;, <code>freecad-build/</code>.
</p>
</div>
<p>6. &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077; &#1074; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1084; &#1086;&#1082;&#1085;&#1077; Key-Value &#1090;&#1080;&#1087;&#1086;&#1074; <code>String</code> &#1080; <code>Bool</code>.
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">PYTHON_EXECUTABLE</span><span class="o">=/</span><span class="n">usr</span><span class="o">/</span><span class="nb">bin</span><span class="o">/</span><span class="n">python3</span>
</pre></div>
<p>7. &#1045;&#1089;&#1083;&#1080; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1102;&#1090; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1085;&#1077;&#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1074;&#1072;&#1084; &#1087;&#1088;&#1080;&#1076;&#1077;&#1090;&#1089;&#1103; &#1087;&#1077;&#1088;&#1077;&#1081;&#1090;&#1080; &#1082; <b>Projects &rarr; Manage Kits &rarr; Kits &rarr; Default (or Imported Kit or similar) &rarr; CMake Configuration</b>. 
&#1047;&#1072;&#1090;&#1077;&#1084; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">Change</span>, &#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1100;&#1090;&#1077; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1091;&#1102; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1102;, &#1082;&#1072;&#1082; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1086; &#1074;&#1099;&#1096;&#1077;. &#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1074;&#1072;&#1084; &#1087;&#1088;&#1080;&#1076;&#1077;&#1090;&#1089;&#1103; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077; &#1086; &#1087;&#1091;&#1090;&#1103;&#1093; Python, &#1077;&#1089;&#1083;&#1080; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1099;&#1081; Python &#1085;&#1077; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;.
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">PYTHON_EXECUTABLE</span><span class="p">:</span><span class="n">STRING</span><span class="o">=/</span><span class="n">usr</span><span class="o">/</span><span class="nb">bin</span><span class="o">/</span><span class="n">python3</span><span class="mf">.7</span>
<span class="n">PYTHON_INCLUDE_DIR</span><span class="p">:</span><span class="n">STRING</span><span class="o">=/</span><span class="n">usr</span><span class="o">/</span><span class="n">include</span><span class="o">/</span><span class="n">python3</span><span class="mf">.7</span><span class="n">m</span>
<span class="n">PYTHON_LIBRARY</span><span class="p">:</span><span class="n">STRING</span><span class="o">=/</span><span class="n">usr</span><span class="o">/</span><span class="n">lib</span><span class="o">/</span><span class="n">x86_64</span><span class="o">-</span><span class="n">linux</span><span class="o">-</span><span class="n">gnu</span><span class="o">/</span><span class="n">libpython3</span><span class="mf">.7</span><span class="n">m</span><span class="o">.</span><span class="n">so</span>
<span class="n">PYTHON_PACKAGES_PATH</span><span class="p">:</span><span class="n">STRING</span><span class="o">=/</span><span class="n">usr</span><span class="o">/</span><span class="n">lib</span><span class="o">/</span><span class="n">python3</span><span class="mf">.7</span><span class="o">/</span><span class="n">site</span><span class="o">-</span><span class="n">packages</span>
</pre></div>
<p>7.1. &#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">Apply</span>, &#1079;&#1072;&#1090;&#1077;&#1084; <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">OK</span>.
</p><p>7.2. &#1059;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1079;&#1072;&#1076;&#1072;&#1085;&#1099; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, <b>Qt version</b> &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1077;&#1081;, &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1086;&#1081; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077;, &#1082;&#1072;&#1082; <code>Qt 5.9.5 in PATH (qt5)</code>.
</p><p>&#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">Apply</span>, &#1079;&#1072;&#1090;&#1077;&#1084; <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">OK</span>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1100; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1102;.
</p><p>&#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; <code>cmake</code> &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1089;&#1085;&#1086;&#1074;&#1072; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100;&#1089;&#1103; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;, &#1080; &#1086;&#1085;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1079;&#1072;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1074;&#1077;&#1089;&#1100; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075; Key-Value &#1074;&#1089;&#1077;&#1084;&#1080; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100;.
</p><p>8. &#1055;&#1077;&#1088;&#1077;&#1081;&#1076;&#1080;&#1090;&#1077; &#1074; <b>Projects &rarr; Build &amp; Run &rarr; Imported Kit &rarr; Run &rarr; Run Settings &rarr; Run &rarr; Run Configuration</b> &#1080; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; <code>FreeCADMain</code> &#1076;&#1083;&#1103; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; FreeCAD &#1080;&#1083;&#1080; <code>FreeCADMainCMD</code> &#1076;&#1083;&#1103; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;.
</p><p>9. &#1053;&#1072;&#1082;&#1086;&#1085;&#1077;&#1094;, &#1087;&#1077;&#1088;&#1077;&#1081;&#1076;&#1080;&#1090;&#1077; &#1074; &#1084;&#1077;&#1085;&#1102; <b>&#1057;&#1073;&#1086;&#1088;&#1082;&#1072; &rarr; &#1055;&#1088;&#1086;&#1077;&#1082;&#1090; &#1089;&#1073;&#1086;&#1088;&#1082;&#1080; "FreeCAD"</b>. &#1045;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086; &#1085;&#1086;&#1074;&#1072;&#1103; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1103;, &#1086;&#1085;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1079;&#1072;&#1085;&#1103;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1084;&#1080;&#1085;&#1091;&#1090;, &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1095;&#1072;&#1089;&#1086;&#1074;, &#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1072; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1086;&#1074;.
</p><p><span id="Qt_designer_plugin"></span>
</p>
<h4><span id=".D0.9F.D0.BB.D0.B0.D0.B3.D0.B8.D0.BD_Qt_designer"></span><span class="mw-headline" id="&#1055;&#1083;&#1072;&#1075;&#1080;&#1085;_Qt_designer">&#1055;&#1083;&#1072;&#1075;&#1080;&#1085; Qt designer</span></h4>
<p>&#1045;&#1089;&#1083;&#1080; &#1042;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1090;&#1100; Qt-&#1082;&#1086;&#1076; &#1076;&#1083;&#1103; FreeCAD, &#1042;&#1072;&#1084; &#1087;&#1086;&#1085;&#1072;&#1076;&#1086;&#1073;&#1080;&#1090;&#1089;&#1103; &#1087;&#1083;&#1072;&#1075;&#1080;&#1085; &#1082; Qt Designer, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090; &#1074;&#1089;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1077; &#1074;&#1080;&#1076;&#1078;&#1077;&#1090;&#1099; FreeCAD.
</p><p>&#1055;&#1077;&#1088;&#1077;&#1081;&#1076;&#1080;&#1090;&#1077; &#1074; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072;, &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1077; <code>qmake</code> &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084; &#1092;&#1072;&#1081;&#1083;&#1086;&#1084; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; <code>Makefile</code>; &#1079;&#1072;&#1090;&#1077;&#1084; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1077; <code>make</code> &#1076;&#1083;&#1103; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080; &#1087;&#1083;&#1072;&#1075;&#1080;&#1085;&#1072;.
</p>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span><span class="nb">cd</span><span class="w"> </span>freecad-source/src/Tools/plugins/widget
qmake<span class="w"> </span>plugin.pro
make
</pre></div>
<p>&#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1091;&#1077;&#1090;&#1077; &#1076;&#1083;&#1103; Qt5, &#1091;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1076;&#1074;&#1086;&#1080;&#1095;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; <code>qmake</code> &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085; &#1076;&#1083;&#1103; &#1101;&#1090;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1080;&#1088;&#1091;&#1102;&#1097;&#1080;&#1081; <code>Makefile</code> &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1083; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1091;&#1102; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1076;&#1083;&#1103; Qt5.
</p>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span><span class="nb">cd</span><span class="w"> </span>freecad-source/src/Tools/plugins/widget
<span class="nv">$QT_DIR</span>/bin/qmake<span class="w"> </span>plugin.pro
make
</pre></div>
<p>&#1075;&#1076;&#1077; <code>$QT_DIR</code> - &#1101;&#1090;&#1086; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1089;&#1103; &#1076;&#1074;&#1086;&#1080;&#1095;&#1085;&#1099;&#1077; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080; Qt, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, <code>/usr/lib/x86_64-linux-gnu/qt5</code>.
</p><p>&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1072;&#1103; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; <code>libFreeCAD_widgets.so</code>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1089;&#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; <code>$QT_DIR/&#1087;&#1083;&#1072;&#1075;&#1080;&#1085;&#1099;/&#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;</code>.
</p>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span>sudo<span class="w"> </span>cp<span class="w"> </span>libFreeCAD_widgets.so<span class="w"> </span><span class="nv">$QT_DIR</span>/plugins/designer
</pre></div>
<p><span id="External_or_internal_Pivy"></span>
</p>
<h4><span id=".D0.92.D0.BD.D0.B5.D1.88.D0.BD.D0.B8.D0.B9_.D0.B8.D0.BB.D0.B8_.D0.B2.D1.81.D1.82.D1.80.D0.BE.D0.B5.D0.BD.D0.BD.D1.8B.D0.B9_Pivy"></span><span class="mw-headline" id="&#1042;&#1085;&#1077;&#1096;&#1085;&#1080;&#1081;_&#1080;&#1083;&#1080;_&#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1099;&#1081;_Pivy">&#1042;&#1085;&#1077;&#1096;&#1085;&#1080;&#1081; &#1080;&#1083;&#1080; &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1099;&#1081; Pivy</span></h4>
<div class="mw-translate-fuzzy">
<p>&#1042; &#1087;&#1088;&#1086;&#1096;&#1083;&#1086;&#1084;, &#1074;&#1077;&#1088;&#1089;&#1080;&#1103; Pivy &#1073;&#1099;&#1083;&#1072; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1072; &#1074; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076; FreeCAD (internal). &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1093;&#1086;&#1090;&#1077;&#1083;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1091;&#1102; &#1082;&#1086;&#1087;&#1080;&#1102; Pivy (external),  &#1074;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; <code>-DFREECAD_USE_EXTERNAL_PIVY=1</code>.
</p>
</div>
<p>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1075;&#1086; Pivy &#1089;&#1090;&#1072;&#1083;&#1086; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1074;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; FreeCAD 0.16, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1101;&#1090;&#1091; &#1086;&#1087;&#1094;&#1080;&#1102; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1085;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1090;&#1100; &#1074;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102;.
</p><p><span id="Doxygen_documentation"></span>
</p>
<h4><span id=".D0.94.D0.BE.D0.BA.D1.83.D0.BC.D0.B5.D0.BD.D1.82.D0.B8.D1.80.D0.BE.D0.B2.D0.B0.D0.BD.D0.B8.D0.B5_.D0.BF.D0.BE.D1.81.D1.80.D0.B5.D0.B4.D1.81.D1.82.D0.B2.D0.BE.D0.BC_Doxygen"></span><span class="mw-headline" id="&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;_&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1086;&#1084;_Doxygen">&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1086;&#1084; Doxygen</span></h4>
<p>&#1045;&#1089;&#1083;&#1080; &#1091; &#1074;&#1072;&#1089; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085; Doxygen, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1102; &#1087;&#1086; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1084;&#1091; &#1082;&#1086;&#1076;&#1091;. &#1057;&#1084;. &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080; &#1074; <a href="../Source_documentation.html" title="Source documentation">source documentation</a>.
</p><p><span id="Additional_documentation"></span>
</p>
<h3><span id=".D0.94.D0.BE.D0.BF.D0.BE.D0.BB.D0.BD.D0.B8.D1.82.D0.B5.D0.BB.D1.8C.D0.BD.D0.B0.D1.8F_.D0.B4.D0.BE.D0.BA.D1.83.D0.BC.D0.B5.D0.BD.D1.82.D0.B0.D1.86.D0.B8.D1.8F"></span><span class="mw-headline" id="&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103;_&#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103;">&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103;</span></h3>
<p>&#1048;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076; FreeCAD &#1086;&#1095;&#1077;&#1085;&#1100; &#1086;&#1073;&#1096;&#1080;&#1088;&#1077;&#1085;, &#1080; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; CMake &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074;. &#1054;&#1073;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1083;&#1085;&#1086;&#1084;&#1091; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1102; CMake &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086; &#1076;&#1083;&#1103; &#1074;&#1099;&#1073;&#1086;&#1088;&#1072; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1099;&#1093; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1086;&#1074; &#1076;&#1083;&#1103; &#1074;&#1072;&#1096;&#1080;&#1093; &#1086;&#1089;&#1086;&#1073;&#1099;&#1093; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081;. 
</p>
<ul><li><a rel="nofollow" class="external text" href="https://cmake.org/documentation/">CMake Reference Documentation</a></li></ul>
<p>&#1086;&#1090; Kitware.
</p>
<ul><li><a rel="nofollow" class="external text" href="https://preshing.com/20170511/how-to-build-a-cmake-based-project/">How to Build a CMake-Based Project</a></li></ul>
<p>(&#1073;&#1083;&#1086;&#1075;), &#1087;&#1088;&#1077;&#1076;&#1074;&#1072;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1080;&#1079;&#1091;&#1095;&#1080;&#1074; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;.
</p>
<ul><li><a rel="nofollow" class="external text" href="https://preshing.com/20170522/learn-cmakes-scripting-language-in-15-minutes/">Learn CMake's Scripting Language in 15 Minutes</a></li></ul>
<p>(&#1073;&#1083;&#1086;&#1075;) , &#1087;&#1088;&#1077;&#1076;&#1074;&#1072;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1080;&#1079;&#1091;&#1095;&#1080;&#1074; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;.
</p><p><span id="Making_a_debian_package"></span>
</p>
<h3><span id=".D0.A1.D0.BE.D0.B7.D0.B4.D0.B0.D0.BD.D0.B8.D0.B5_.D0.BF.D0.B0.D0.BA.D0.B5.D1.82.D0.B0_debian"></span><span class="mw-headline" id="&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077;_&#1087;&#1072;&#1082;&#1077;&#1090;&#1072;_debian">&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1087;&#1072;&#1082;&#1077;&#1090;&#1072; debian</span></h3>
<p>&#1045;&#1089;&#1083;&#1080; &#1042;&#1099; &#1087;&#1083;&#1072;&#1085;&#1080;&#1088;&#1091;&#1077;&#1090;&#1077; &#1089;&#1086;&#1073;&#1088;&#1072;&#1090;&#1100; &#1087;&#1072;&#1082;&#1077;&#1090; Debian &#1074;&#1085;&#1077; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1080;&#1082;&#1086;&#1074;, &#1074;&#1072;&#1084; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099;:
</p>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span>sudo<span class="w"> </span>apt<span class="w"> </span>install<span class="w"> </span>dh-make<span class="w"> </span>devscripts<span class="w"> </span>lintian
</pre></div>
<p>&#1055;&#1077;&#1088;&#1077;&#1081;&#1076;&#1080;&#1090;&#1077; &#1074; &#1087;&#1072;&#1087;&#1082;&#1091; FreeCAD &#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;
</p>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span>debuild
</pre></div>
<p>&#1050;&#1086;&#1075;&#1076;&#1072; &#1087;&#1072;&#1082;&#1077;&#1090; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;, &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; <code>lintian</code> &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1080;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1083;&#1080; &#1087;&#1072;&#1082;&#1077;&#1090; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080;
</p>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span>lintian<span class="w"> </span>freecad-package.deb
</pre></div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h4><span id=".2A.deb_package_with_checkinstall"></span><span class="mw-headline" id="*.deb_package_with_checkinstall">*.deb package with checkinstall</span></h4>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>The Debian script <code>checkinstall</code> allows to create a *.deb package that can be installed and removed with the standard <code>dpkg</code> commands. It may need to be installed first (on Ubuntu use <code>sudo apt install checkinstall</code>). It's interactive and asks for the required information providing helpful defaults. During the process the package is installed and a *.deb file and a backup archive are created.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>It's a good idea to define a name and a short description for the package. The name must be entered to uninstall it again and the desription will be listed by <code>dpkg -l</code>. The default name "build" is not very informative.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Example:
</p>
</div>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span><span class="nb">cd</span><span class="w"> </span>freecad-source/build
cmake<span class="w"> </span>..
make
sudo<span class="w"> </span>checkinstall<span class="w">                                  </span><span class="c1"># e.g. name=freecad-test1</span>
</pre></div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>The result is a *.deb file in the build folder. <code>checkinstall</code> will install the build by default. This is how you can install or uninstall it:
</p>
</div>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span><span class="nb">cd</span><span class="w"> </span>freecad-source/build
ls<span class="w"> </span><span class="p">|</span><span class="w"> </span>grep<span class="w"> </span>freecad
<span class="w">        </span>freecad-test1_20220814-1_amd64.deb
sudo<span class="w"> </span>dpkg<span class="w"> </span>-i<span class="w"> </span>freecad-test1_20220814-1_amd64.deb<span class="w">   </span><span class="c1"># install</span>
dkpg<span class="w"> </span>-l<span class="w"> </span><span class="p">|</span><span class="w"> </span>grep<span class="w"> </span>freecad<span class="w">                            </span><span class="c1"># find by name</span>
sudo<span class="w"> </span>dpkg<span class="w"> </span>-r<span class="w"> </span>freecad-test1<span class="w">                        </span><span class="c1"># uninstall by name</span>
</pre></div>
<p><span id="Updating_the_source_code"></span>
</p>
<h2><span id=".D0.9E.D0.B1.D0.BD.D0.BE.D0.B2.D0.BB.D0.B5.D0.BD.D0.B8.D0.B5_.D0.B8.D1.81.D1.85.D0.BE.D0.B4.D0.BD.D0.BE.D0.B3.D0.BE_.D0.BA.D0.BE.D0.B4.D0.B0"></span><span class="mw-headline" id="&#1054;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;_&#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086;_&#1082;&#1086;&#1076;&#1072;">&#1054;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072;</span></h2>
<p>&#1057;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; CMake &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1088;&#1072;&#1079;&#1091;&#1084;&#1085;&#1086; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1103;&#1090;&#1100; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076; &#1080; &#1087;&#1077;&#1088;&#1077;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1083;&#1086;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1091;&#1089;&#1082;&#1086;&#1088;&#1103;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080;.
</p><p>&#1055;&#1077;&#1088;&#1077;&#1081;&#1076;&#1080;&#1090;&#1077; &#1074; &#1090;&#1086; &#1084;&#1077;&#1089;&#1090;&#1086;, &#1075;&#1076;&#1077; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076; FreeCAD &#1073;&#1099;&#1083; &#1074;&#1087;&#1077;&#1088;&#1074;&#1099;&#1077; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085;, &#1080; &#1080;&#1079;&#1074;&#1083;&#1077;&#1082;&#1080;&#1090;&#1077; &#1085;&#1086;&#1074;&#1099;&#1081; &#1082;&#1086;&#1076;:
</p>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span><span class="nb">cd</span><span class="w"> </span>freecad-source
git<span class="w"> </span>pull
</pre></div>
<p>&#1047;&#1072;&#1090;&#1077;&#1084; &#1087;&#1077;&#1088;&#1077;&#1081;&#1076;&#1080;&#1090;&#1077; &#1074; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075; &#1089;&#1073;&#1086;&#1088;&#1082;&#1080;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1082;&#1086;&#1076; &#1073;&#1099;&#1083; &#1089;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085; &#1080;&#1079;&#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086;, &#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1077; <code>cmake</code>, &#1091;&#1082;&#1072;&#1079;&#1072;&#1074; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1081; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075; (denoted by a dot); &#1079;&#1072;&#1090;&#1077;&#1084; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1077; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1085;&#1091;&#1102; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1102; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <code>make</code>.
</p>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span><span class="nb">cd</span><span class="w"> </span>build
cmake<span class="w"> </span>../
make<span class="w"> </span>-j<span class="k">$(</span>nproc<span class="w"> </span>--ignore<span class="o">=</span><span class="m">2</span><span class="k">)</span>
</pre></div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h2><span class="mw-headline" id="Uninstalling_the_source_code">Uninstalling the source code</span></h2>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>In case the compiled source code was installed with <code>sudo make install</code> (for Debian) the files were copied to the <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">/usr/local</span> folder into several subfolders. For uninstallation the file <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">install_manifest.txt</span> can be used. It has been created into the build folder during compilation and contains all installed files. As long as this file exists, the installation can be uninstalled.
</p>
</div>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span><span class="nb">cd</span><span class="w"> </span>freecad-source/build
xargs<span class="w"> </span>sudo<span class="w"> </span>rm<span class="w"> </span>&lt;<span class="w"> </span>install_manifest.txt
</pre></div>
<p><span id="Troubleshooting"></span>
</p>
<h2><span id=".D0.A0.D0.B0.D0.B7.D1.80.D0.B5.D1.88.D0.B5.D0.BD.D0.B8.D0.B5_.D0.BF.D1.80.D0.BE.D0.B1.D0.BB.D0.B5.D0.BC"></span><span class="mw-headline" id="&#1056;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;_&#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;">&#1056;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;</span></h2>
<p><span id="For_64_bit_systems"></span>
</p>
<h3><span id=".D0.9F.D1.80.D0.B8.D0.BC.D0.B5.D1.87.D0.B0.D0.BD.D0.B8.D0.B5_.D0.B4.D0.BB.D1.8F_64-.D0.B1.D0.B8.D1.82.D0.BD.D1.8B.D1.85_.D1.81.D0.B8.D1.81.D1.82.D0.B5.D0.BC"></span><span class="mw-headline" id="&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;_&#1076;&#1083;&#1103;_64-&#1073;&#1080;&#1090;&#1085;&#1099;&#1093;_&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;">&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077; &#1076;&#1083;&#1103; 64-&#1073;&#1080;&#1090;&#1085;&#1099;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;</span></h3>
<p>&#1055;&#1088;&#1080; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080; FreeCAD &#1085;&#1072; 64-&#1073;&#1080;&#1090; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1072; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1089; 64-&#1073;&#1080;&#1090;&#1085;&#1099;&#1084; &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1084; OpenCASCADE. &#1063;&#1090;&#1086;&#1073;&#1099; FreeCAD &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086; &#1079;&#1072;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1083;, &#1042;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090; <code>configure</code> &#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; <code>CXXFLAGS</code>:
</p>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span>./configure<span class="w"> </span><span class="nv">CXXFLAGS</span><span class="o">=</span><span class="s2">"-D_OCC64"</span>
</pre></div>
<p>&#1044;&#1083;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084; &#1085;&#1072; &#1073;&#1072;&#1079;&#1077; Debian &#1101;&#1090;&#1072; &#1086;&#1087;&#1094;&#1080;&#1103; &#1085;&#1077; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1075;&#1086;&#1090;&#1086;&#1074;&#1099;&#1093; &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074; OpenCASCADE, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1101;&#1090;&#1080; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1102;&#1090; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086; <code>CXXFLAGS</code> &#1074;&#1085;&#1091;&#1090;&#1088;&#1080;.
</p><p><span id="Automatic_build_scripts"></span>
</p>
<h2><span id=".D0.A1.D0.BA.D1.80.D0.B8.D0.BF.D1.82.D1.8B_.D0.B0.D0.B2.D1.82.D0.BE.D0.BC.D0.B0.D1.82.D0.B8.D1.87.D0.B5.D1.81.D0.BA.D0.BE.D0.B9_.D0.BA.D0.BE.D0.BC.D0.BF.D0.B8.D0.BB.D1.8F.D1.86.D0.B8.D0.B8"></span><span class="mw-headline" id="&#1057;&#1082;&#1088;&#1080;&#1087;&#1090;&#1099;_&#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081;_&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080;">&#1057;&#1082;&#1088;&#1080;&#1087;&#1090;&#1099; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080;</span></h2>
<p>&#1069;&#1090;&#1086; &#1074;&#1089;&#1105;, &#1095;&#1090;&#1086; &#1042;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086; &#1076;&#1083;&#1103; &#1087;&#1086;&#1083;&#1085;&#1086;&#1081; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080; FreeCAD. &#1069;&#1090;&#1086; &#1086;&#1076;&#1085;&#1086;&#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1074;&#1086;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;, &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1097;&#1077;&#1077; &#1085;&#1072; &#1089;&#1074;&#1077;&#1078;&#1077;&#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1086;&#1084; &#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074;&#1077;. &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1080;&#1090; &#1087;&#1072;&#1088;&#1086;&#1083;&#1100; root 
&#1076;&#1083;&#1103; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074; &#1085;&#1086;&#1074;&#1099;&#1093; &#1086;&#1085;&#1083;&#1072;&#1081;&#1085;&#1086;&#1074;&#1099;&#1093; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1077;&#1074;. &#1069;&#1090;&#1080; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072; 32- &#1080; 64-&#1073;&#1080;&#1090;&#1085;&#1099;&#1093; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103;&#1093;. &#1054;&#1085;&#1080; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1099; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081;, &#1085;&#1086;, &#1089;&#1082;&#1086;&#1088;&#1077;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086;, &#1073;&#1091;&#1076;&#1091;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1076;&#1083;&#1103; &#1087;&#1086;&#1079;&#1076;&#1085;&#1077;&#1081;&#1096;&#1080;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081; &#1089; &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1084;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080; &#1080;&#1083;&#1080; &#1073;&#1077;&#1079; &#1085;&#1080;&#1093;.
</p><p>&#1045;&#1089;&#1083;&#1080; &#1091; &#1074;&#1072;&#1089; &#1077;&#1089;&#1090;&#1100; &#1090;&#1072;&#1082;&#1086;&#1081; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090; &#1076;&#1083;&#1103; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074;&#1072;, &#1087;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1086;&#1073;&#1089;&#1091;&#1076;&#1080;&#1090;&#1077; &#1077;&#1075;&#1086; &#1085;&#1072; <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewforum.php?f=21&amp;sid=e3c22dca9da076fefb56b1d5c5fb3134">&#1060;&#1086;&#1088;&#1091;&#1084; FreeCAD</a>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1084;&#1099; &#1084;&#1086;&#1075;&#1083;&#1080; &#1077;&#1075;&#1086; &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100;.
</p>
<div class="mw-collapsible mw-collapsed toccolours">
<h3><span class="mw-headline" id="Ubuntu">Ubuntu</span></h3>
<div class="mw-collapsible-content">
<p>&#1069;&#1090;&#1080; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1099; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1074;&#1072;&#1102;&#1090; &#1085;&#1072;&#1076;&#1105;&#1078;&#1085;&#1099;&#1081; &#1087;&#1091;&#1090;&#1100; &#1076;&#1083;&#1103; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1074;&#1077;&#1088;&#1085;&#1086;&#1075;&#1086; &#1085;&#1072;&#1073;&#1086;&#1088;&#1072; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1077;&#1081;, &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1084;&#1099;&#1093; &#1076;&#1083;&#1103; &#1089;&#1073;&#1086;&#1088;&#1082;&#1080; &#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072; FreeCAD &#1074; Ubuntu. &#1054;&#1085;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1080; PPA Ubuntu FreeCAD, &#1080; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1085;&#1072; &#1083;&#1102;&#1073;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; Ubuntu, &#1076;&#1083;&#1103; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1077;&#1089;&#1090;&#1100; &#1094;&#1077;&#1083;&#1077;&#1074;&#1086;&#1081; PPA. PPA &#1085;&#1072; <a rel="nofollow" class="external text" href="https://launchpad.net/~freecad-maintainers/+archive/ubuntu/freecad-daily">freecad-daily</a> &#1085;&#1072;&#1094;&#1077;&#1083;&#1077;&#1085; &#1085;&#1072; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1102;&#1102; &#1074;&#1077;&#1088;&#1089;&#1080;&#1102; Ubuntu, &#1072; <a rel="nofollow" class="external text" href="https://launchpad.net/~freecad-maintainers/+archive/ubuntu/freecad-stable">'&#1089;&#1090;&#1072;&#1073;&#1080;&#1083;&#1100;&#1085;&#1099;&#1081;'</a> PPA &#1085;&#1072;&#1094;&#1077;&#1083;&#1077;&#1085; &#1085;&#1072;  &#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1077; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; Ubuntu.
</p><p>&#1069;&#1090;&#1086;&#1090; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1076;&#1085;&#1077;&#1074;&#1085;&#1086;&#1081; &#1089;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1089;&#1085;&#1080;&#1084;&#1086;&#1082; FreeCAD &#1080; &#1077;&#1075;&#1086; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1077;&#1081;. &#1054;&#1085; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1076;&#1085;&#1077;&#1074;&#1085;&#1086;&#1081; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1081;, &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1101;&#1090;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; &#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099;. &#1047;&#1072;&#1090;&#1077;&#1084; &#1086;&#1085; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1072;&#1077;&#1090; &#1080;&#1079;&#1074;&#1083;&#1077;&#1082;&#1072;&#1090;&#1100; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076; &#1074; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075; &#1089;&#1073;&#1086;&#1088;&#1082;&#1080; &#1080; &#1074;&#1085;&#1086;&#1089;&#1080;&#1090; &#1074; &#1085;&#1077;&#1075;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;, &#1085;&#1072;&#1089;&#1090;&#1088;&#1072;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1088;&#1077;&#1076;&#1091; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <code>cmake</code> &#1080;, &#1085;&#1072;&#1082;&#1086;&#1085;&#1077;&#1094;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1074;&#1089;&#1102; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1091; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <code>make</code>. &#1057;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1077; &#1089;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1081; &#1074; &#1092;&#1072;&#1081;&#1083;, &#1089;&#1076;&#1077;&#1083;&#1072;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1099;&#1084; &#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1077; &#1077;&#1075;&#1086;, &#1085;&#1086; &#1085;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; <code>sudo</code>; &#1087;&#1088;&#1080;&#1074;&#1080;&#1083;&#1077;&#1075;&#1080;&#1080; &#1089;&#1091;&#1087;&#1077;&#1088;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1073;&#1091;&#1076;&#1091;&#1090; &#1079;&#1072;&#1087;&#1088;&#1072;&#1096;&#1080;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;.
</p>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span><span class="ch">#!/bin/sh</span>
sudo<span class="w"> </span>add-apt-repository<span class="w"> </span>--enable-source<span class="w"> </span>ppa:freecad-maintainers/freecad-daily<span class="w"> </span><span class="o">&amp;&amp;</span><span class="w"> </span>sudo<span class="w"> </span>apt-get<span class="w"> </span>update
sudo<span class="w"> </span>apt-get<span class="w"> </span>build-dep<span class="w"> </span>freecad-daily
sudo<span class="w"> </span>apt-get<span class="w"> </span>install<span class="w"> </span>freecad-daily

git<span class="w"> </span>clone<span class="w"> </span>--recurse-submodules<span class="w"> </span>https://github.com/FreeCAD/FreeCAD.git<span class="w"> </span>freecad-source
mkdir<span class="w"> </span>freecad-source/build
<span class="nb">cd</span><span class="w"> </span>freecad-source/build
cmake<span class="w"> </span>-DPYTHON_EXECUTABLE<span class="o">=</span>/usr/bin/python3<span class="w"> </span>-DFREECAD_USE_PYBIND11<span class="o">=</span>ON<span class="w"> </span>../
make<span class="w"> </span>-j<span class="k">$(</span>nproc<span class="w"> </span>--ignore<span class="o">=</span><span class="m">2</span><span class="k">)</span>
</pre></div>
<p>&#1055;&#1088;&#1080; &#1078;&#1077;&#1083;&#1072;&#1085;&#1080;&#1080; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1087;&#1088;&#1077;&#1076;&#1074;&#1072;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1089;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1091;&#1102; &#1074;&#1077;&#1088;&#1089;&#1080;&#1102; FreeCAD (<code>freecad-daily</code>), &#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1085;&#1072; &#1084;&#1077;&#1089;&#1090;&#1077;, &#1086;&#1076;&#1085;&#1072;&#1082;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086;&#1090; &#1087;&#1072;&#1082;&#1077;&#1090; &#1073;&#1091;&#1076;&#1077;&#1090; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1084;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088; &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074; &#1090;&#1072;&#1082;&#1078;&#1077; &#1089;&#1084;&#1086;&#1078;&#1077;&#1090; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1103;&#1090;&#1100; &#1089;&#1074;&#1086;&#1080; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080;; &#1101;&#1090;&#1086; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1085;&#1072;&#1084;&#1077;&#1088;&#1077;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1080;&#1090;&#1100; &#1079;&#1072; &#1088;&#1072;&#1079;&#1074;&#1080;&#1090;&#1080;&#1077;&#1084; FreeCAD, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1086; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1103;&#1090;&#1100; &#1080; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1099; &#1080;&#1079; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1103; Git.
</p><p>&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1089;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1102;&#1102; &#1074;&#1077;&#1088;&#1089;&#1080;&#1102; FreeCAD, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1074;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1077; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1081; "daily" &#1076;&#1083;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1077;&#1081;. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1101;&#1090;&#1086;&#1075;&#1086; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1089;&#1073;&#1086;&#1088;&#1082;&#1080; "&#1089;&#1090;&#1072;&#1073;&#1080;&#1083;&#1100;&#1085;&#1086;&#1081;" &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; &#1076;&#1083;&#1103; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1074;&#1099;&#1087;&#1091;&#1089;&#1082;&#1072; Ubuntu. &#1045;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086; &#1090;&#1072;&#1082;, &#1079;&#1072;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1074;&#1077;&#1088;&#1093;&#1085;&#1102;&#1102; &#1095;&#1072;&#1089;&#1090;&#1100; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1077;&#1075;&#1086; &#1089;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1084;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1103;&#1084;&#1080;. &#1044;&#1083;&#1103; Ubuntu 12.04 &#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1077; <code>--enable-source</code> &#1074; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1077;.
</p>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span><span class="ch">#!/bin/sh</span>
sudo<span class="w"> </span>add-apt-repository<span class="w"> </span>--enable-source<span class="w"> </span>ppa:freecad-maintainers/freecad-stable<span class="w"> </span><span class="o">&amp;&amp;</span><span class="w"> </span>sudo<span class="w"> </span>apt-get<span class="w"> </span>update
sudo<span class="w"> </span>apt-get<span class="w"> </span>build-dep<span class="w"> </span>freecad
sudo<span class="w"> </span>apt-get<span class="w"> </span>install<span class="w"> </span>libqt5xmlpatterns5-dev<span class="w">   </span><span class="c1"># Needed for 0.20; should go away on next packaging update </span>
sudo<span class="w"> </span>apt-get<span class="w"> </span>install<span class="w"> </span>freecad
</pre></div>
<p>&#1050;&#1072;&#1082; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;&#1099; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1087;&#1072;&#1082;&#1077;&#1090; <code>freecad</code> &#1080;&#1079; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1103; <code>freecad-stable</code>, &#1086;&#1085; &#1079;&#1072;&#1084;&#1077;&#1085;&#1080;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; FreeCAD, &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1081; &#1080;&#1079; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1103; Ubuntu Universe. &#1048;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; &#1073;&#1091;&#1076;&#1077;&#1090; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; <code>freecad</code>, &#1072; &#1085;&#1077; <code>freecad-stable</code>.
</p>
</div>
</div>
<div class="mw-collapsible mw-collapsed toccolours">
<h3><span class="mw-headline" id="openSUSE_2">openSUSE</span></h3>
<div class="mw-collapsible-content">
<div class="mw-translate-fuzzy">
<p>&#1053;&#1080;&#1082;&#1072;&#1082;&#1080;&#1093; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1093; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1077;&#1074; &#1085;&#1077; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080; FreeCAD. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1085;&#1077;&#1089;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1089; python3-devel, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100;. FreeCAD &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1089;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085; &#1080;&#1079; GIT
</p>
</div>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span><span class="c1"># install needed packages for development</span>
sudo<span class="w"> </span>zypper<span class="w"> </span>install<span class="w"> </span>gcc<span class="w"> </span>cmake<span class="w"> </span>OpenCASCADE-devel<span class="w"> </span>libXerces-c-devel<span class="w"> </span><span class="se">\</span>
python-devel<span class="w"> </span>libqt4-devel<span class="w"> </span>python-qt4<span class="w"> </span>Coin-devel<span class="w"> </span>SoQt-devel<span class="w"> </span>boost-devel<span class="w"> </span><span class="se">\</span>
libode-devel<span class="w"> </span>libQtWebKit-devel<span class="w"> </span>libeigen3-devel<span class="w"> </span>gcc-fortran<span class="w"> </span>git<span class="w"> </span>swig
<span class="w"> </span>
<span class="c1"># create new dir, and go into it</span>
mkdir<span class="w"> </span>FreeCAD-Compiled<span class="w"> </span>
<span class="nb">cd</span><span class="w"> </span>FreeCAD-Compiled
<span class="w"> </span>
<span class="c1"># get the source</span>
git<span class="w"> </span>clone<span class="w"> </span>--recurse-submodules<span class="w"> </span>https://github.com/FreeCAD/FreeCAD.git<span class="w"> </span>free-cad
<span class="w"> </span>
<span class="c1"># Now you will have a subfolder in this location called free-cad. It contains the source</span>
<span class="w"> </span>
<span class="c1"># make another dir for compilation, and go into it</span>
mkdir<span class="w"> </span>FreeCAD-Build1
<span class="nb">cd</span><span class="w"> </span>FreeCAD-Build1<span class="w"> </span>
<span class="w"> </span>
<span class="c1"># build configuration </span>
cmake<span class="w"> </span>../free-cad
<span class="w"> </span>
<span class="c1"># build FreeCAD</span>
make
<span class="w"> </span>
<span class="c1"># test FreeCAD</span>
<span class="nb">cd</span><span class="w"> </span>bin
./FreeCAD<span class="w"> </span>-t<span class="w"> </span><span class="m">0</span>
</pre></div>
<p>&#1055;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1074;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1077; git, &#1074; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1088;&#1072;&#1079;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1079;&#1072;&#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1089;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;, &#1074;&#1072;&#1084; &#1085;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1082;&#1083;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1089;&#1077; &#1087;&#1086;&#1076;&#1088;&#1103;&#1076; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1080;&#1079;&#1074;&#1083;&#1077;&#1082;&#1080;&#1090;&#1077; &#1080;&#1079; git &#1080; &#1089;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; &#1077;&#1097;&#1077; &#1088;&#1072;&#1079;
</p>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span><span class="c1"># go into free-cad dir created earlier</span>
<span class="nb">cd</span><span class="w"> </span>free-cad
<span class="w"> </span>
<span class="c1"># pull</span>
git<span class="w"> </span>pull
<span class="w"> </span>
<span class="c1"># get back to previous dir</span>
<span class="nb">cd</span><span class="w"> </span>..
<span class="w"> </span>
<span class="c1"># Now repeat last few steps from before.</span>
<span class="w"> </span>
<span class="c1"># make another dir for compilation, and go into it</span>
mkdir<span class="w"> </span>FreeCAD-Build2
<span class="nb">cd</span><span class="w"> </span>FreeCAD-Build2
<span class="w"> </span>
<span class="c1"># build configuration </span>
cmake<span class="w"> </span>../free-cad
<span class="w"> </span>
<span class="c1"># build FreeCAD</span>
<span class="c1"># Note: to speed up build use all CPU cores: make -j$(nproc)</span>
make
<span class="w"> </span>
<span class="c1"># test FreeCAD</span>
<span class="nb">cd</span><span class="w"> </span>bin
./FreeCAD<span class="w"> </span>-t<span class="w"> </span><span class="m">0</span>
</pre></div>
</div>
</div>
<div class="mw-collapsible mw-collapsed toccolours">
<h3><span class="mw-headline" id="Debian_Squeeze">Debian Squeeze</span></h3>
<div class="mw-collapsible-content">
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span><span class="c1"># get the needed tools and libs</span>
sudo<span class="w"> </span>apt-get<span class="w"> </span>install<span class="w"> </span>build-essential<span class="w"> </span>python<span class="w"> </span>libcoin60-dev<span class="w"> </span>libsoqt4-dev<span class="w"> </span><span class="se">\</span>
libxerces-c2-dev<span class="w"> </span>libboost-dev<span class="w"> </span>libboost-date-time-dev<span class="w"> </span>libboost-filesystem-dev<span class="w"> </span><span class="se">\</span>
libboost-graph-dev<span class="w"> </span>libboost-iostreams-dev<span class="w"> </span>libboost-program-options-dev<span class="w"> </span><span class="se">\</span>
libboost-serialization-dev<span class="w"> </span>libboost-signals-dev<span class="w"> </span>libboost-regex-dev<span class="w"> </span><span class="se">\</span>
libqt4-dev<span class="w"> </span>qt4-dev-tools<span class="w"> </span>python2.5-dev<span class="w"> </span><span class="se">\</span>
libsimage-dev<span class="w"> </span>libopencascade-dev<span class="w"> </span><span class="se">\</span>
libsoqt4-dev<span class="w"> </span>libode-dev<span class="w"> </span>subversion<span class="w"> </span>cmake<span class="w"> </span>libeigen2-dev<span class="w"> </span>python-pivy<span class="w"> </span><span class="se">\</span>
libtool<span class="w"> </span>autotools-dev<span class="w"> </span>automake<span class="w"> </span>gfortran
<span class="w"> </span>
<span class="c1"># checkout the latest source</span>
git<span class="w"> </span>clone<span class="w"> </span>--recurse-submodules<span class="w"> </span>https://github.com/FreeCAD/FreeCAD.git<span class="w"> </span>freecad
<span class="w"> </span>
<span class="c1"># go to source dir</span>
<span class="nb">cd</span><span class="w"> </span>freecad
<span class="w"> </span>
<span class="c1"># build configuration </span>
cmake<span class="w"> </span>.
<span class="w"> </span>
<span class="c1"># build FreeCAD</span>
<span class="c1"># Note: to speed up build use all CPU cores: make -j$(nproc)</span>
make
<span class="w"> </span>
<span class="c1"># test FreeCAD</span>
<span class="nb">cd</span><span class="w"> </span>bin
./FreeCAD<span class="w"> </span>-t<span class="w"> </span><span class="m">0</span>
</pre></div>
</div>
</div>
<div class="mw-collapsible mw-collapsed toccolours">
<h3><span id="Fedora_27.2F28.2F29"></span><span class="mw-headline" id="Fedora_27/28/29">Fedora 27/28/29</span></h3>
<div class="mw-collapsible-content">
<p>&#1054;&#1087;&#1091;&#1073;&#1083;&#1080;&#1082;&#1086;&#1074;&#1072;&#1085;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084; [<a rel="nofollow" class="external text" href="http://forum.freecad.org/memberlist.php?mode=viewprofile&amp;u=3666">PrzemoF</a>] &#1085;&#1072; &#1092;&#1086;&#1088;&#1091;&#1084;&#1077;.
</p>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span><span class="ch">#!/bin/bash</span>

<span class="nv">ARCH</span><span class="o">=</span><span class="k">$(</span>arch<span class="k">)</span>

<span class="nv">MAIN_DIR</span><span class="o">=</span>FreeCAD
<span class="nv">BUILD_DIR</span><span class="o">=</span>build

<span class="c1">#FEDORA_VERSION=27</span>
<span class="c1">#FEDORA_VERSION=28</span>
<span class="nv">FEDORA_VERSION</span><span class="o">=</span><span class="m">29</span>

<span class="nv">PACKAGES</span><span class="o">=</span><span class="s2">"gcc cmake gcc-c++ boost-devel zlib-devel swig eigen3 qt-devel \</span>
<span class="s2">shiboken shiboken-devel pyside-tools python-pyside python-pyside-devel xerces-c \</span>
<span class="s2">xerces-c-devel OCE-devel smesh graphviz python-pivy python-matplotlib tbb-devel \</span>
<span class="s2"> freeimage-devel Coin3 Coin3-devel med-devel vtk-devel"</span>

<span class="nv">FEDORA_29_PACKAGES</span><span class="o">=</span><span class="s2">"boost-python2 boost-python3 boost-python2-devel boost-python3-devel"</span>

<span class="k">if</span><span class="w"> </span><span class="o">[</span><span class="w"> </span><span class="s2">"</span><span class="nv">$FEDORA_VERSION</span><span class="s2">"</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="s2">"29"</span><span class="w"> </span><span class="o">]</span><span class="p">;</span><span class="w"> </span><span class="k">then</span>
<span class="w">    </span><span class="nv">PACKAGES</span><span class="o">=</span><span class="s2">"</span><span class="nv">$PACKAGES</span><span class="s2"> </span><span class="nv">$FEDORA_29_PACKAGES</span><span class="s2">"</span>
<span class="k">fi</span>

<span class="nb">echo</span><span class="w"> </span><span class="s2">"Installing packages required to build FreeCAD"</span>
sudo<span class="w"> </span>dnf<span class="w"> </span>-y<span class="w"> </span>install<span class="w"> </span><span class="nv">$PACKAGES</span>
<span class="nb">cd</span><span class="w"> </span>~
mkdir<span class="w"> </span><span class="nv">$MAIN_DIR</span><span class="w"> </span><span class="o">||</span><span class="w"> </span><span class="o">{</span><span class="w"> </span><span class="nb">echo</span><span class="w"> </span><span class="s2">"~/</span><span class="nv">$MAIN_DIR</span><span class="s2"> already exist. Quitting.."</span><span class="p">;</span><span class="w"> </span>exit<span class="p">;</span><span class="w"> </span><span class="o">}</span>
<span class="nb">cd</span><span class="w"> </span><span class="nv">$MAIN_DIR</span>
git<span class="w"> </span>clone<span class="w"> </span>--recurse-submodules<span class="w"> </span>https://github.com/FreeCAD/FreeCAD.git
mkdir<span class="w"> </span><span class="nv">$BUILD_DIR</span><span class="w"> </span><span class="o">||</span><span class="w"> </span><span class="o">{</span><span class="w"> </span><span class="nb">echo</span><span class="w"> </span><span class="s2">"~/</span><span class="nv">$BUILD_DIR</span><span class="s2"> already exist. Quitting.."</span><span class="p">;</span><span class="w"> </span>exit<span class="p">;</span><span class="w"> </span><span class="o">}</span>
<span class="nb">cd</span><span class="w"> </span><span class="nv">$BUILD_DIR</span>
cmake<span class="w"> </span>../FreeCAD<span class="w"> </span>
make<span class="w"> </span>-j<span class="k">$(</span>nproc<span class="k">)</span>
</pre></div>
</div>
</div>
<div class="mw-collapsible mw-collapsed toccolours">
<p><span id="Arch_using_AUR"></span>
</p>
<h3><span id="Arch_.D1.81_.D0.B8.D1.81.D0.BF.D0.BE.D0.BB.D1.8C.D0.B7.D0.BE.D0.B2.D0.B0.D0.BD.D0.B8.D0.B5.D0.BC_AUR"></span><span class="mw-headline" id="Arch_&#1089;_&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084;_AUR">Arch &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; AUR</span></h3>
<div class="mw-collapsible-content">
<p><a rel="nofollow" class="external text" href="https://aur.archlinux.org/">Arch User Repository (AUR)</a> - &#1101;&#1090;&#1086; &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1103; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1093; &#1088;&#1077;&#1094;&#1077;&#1087;&#1090;&#1086;&#1074; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086; &#1085;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089;&#1086;&#1087;&#1088;&#1086;&#1074;&#1086;&#1078;&#1076;&#1072;&#1102;&#1097;&#1080;&#1084;&#1080; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; / &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1084;. &#1054;&#1073;&#1099;&#1095;&#1085;&#1086; &#1086;&#1085;&#1080; &#1074; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100;, &#1082;&#1090;&#1086; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1083; &#1087;&#1086;&#1089;&#1099;&#1083;&#1082;&#1091; &#1080; &#1082;&#1072;&#1082; &#1076;&#1086;&#1083;&#1075;&#1086; &#1086;&#1085; &#1101;&#1090;&#1086; &#1076;&#1077;&#1083;&#1072;&#1083;. &#1056;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100; &#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099;. &#1058;&#1072;&#1082;&#1078;&#1077; &#1074; &#1101;&#1090;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084; &#1082;&#1086;&#1076;&#1086;&#1084;, &#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1086;&#1085;&#1086; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1082;&#1086;&#1084;&#1087;&#1072;&#1085;&#1080;&#1077;&#1081;-&#1074;&#1083;&#1072;&#1076;&#1077;&#1083;&#1100;&#1094;&#1077;&#1084;.
</p><p>&#1054;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1077; &#1090;&#1088;&#1077;&#1073;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&nbsp;: git
</p>
<div class="mw-translate-fuzzy">
<p>&#1064;&#1072;&#1075;&#1080;&nbsp;:
</p>
<ol><li>&#1054;&#1090;&#1082;&#1088;&#1086;&#1081;&#1090;&#1077; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1072;&#1083;. &#1055;&#1088;&#1080; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;. <code> mkdir git</code>. &#1055;&#1088;&#1080; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;. <code>cd git</code>.</li>
<li>&#1050;&#1083;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1081; AUR&nbsp;: <code>git clone <a rel="nofollow" class="external free" href="http://aur.archlinux.org/packages/freecad-git">http://aur.archlinux.org/packages/freecad-git</a></code></li>
<li>&#1042;&#1086;&#1081;&#1076;&#1080;&#1090;&#1077; &#1074; &#1087;&#1072;&#1087;&#1082;&#1091; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1103; AUR&nbsp;: <code>cd freecad-git</code></li>
<li>&#1050;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1103; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; <a rel="nofollow" class="external text" href="https://wiki.archlinux.org/index.php/Makepkg">Arch makepkg</a>&nbsp;: <code>makepkg -s</code>. &#1060;&#1083;&#1072;&#1075; -s &#1080;&#1083;&#1080; --syncdeps &#1090;&#1072;&#1082;&#1078;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080;.</li>
<li>&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1087;&#1072;&#1082;&#1077;&#1090;&nbsp;: <code>makepkg --install</code> &#1080;&#1083;&#1080; &#1076;&#1074;&#1072;&#1078;&#1076;&#1099; &#1097;&#1077;&#1083;&#1082;&#1085;&#1080;&#1090;&#1077; &#1080;&#1084;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072; pkgname-pkgver.pkg.tar.xz &#1074; &#1074;&#1072;&#1096;&#1077;&#1084; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1077; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;.</li></ol>
</div>
<div class="mw-translate-fuzzy">
<p>&#1063;&#1090;&#1086;&#1073;&#1099; &#1086;&#1073;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; FreeCAD &#1076;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080;, &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1080;&#1090;&#1077; &#1096;&#1072;&#1075; 3. &#1054;&#1073;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1081;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1074; &#1088;&#1077;&#1094;&#1077;&#1087;&#1090;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1086;&#1081;&#1076;&#1077;&#1090; &#1082;&#1072;&#1082;&#1086;&#1077;-&#1083;&#1080;&#1073;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1080;&#1083;&#1080; &#1087;&#1086;&#1103;&#1074;&#1103;&#1090;&#1089;&#1103; &#1085;&#1086;&#1074;&#1099;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; <code>git checkout-f</code> &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1072;.
</p>
</div>
</div>
</div>
<div class="docnav">
    <div><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-left.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span> <a href="../ru/Compile_on_Windows.html" title="Compile on Windows/ru">&#1050;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1103; &#1074; Windows</a></div>
    <div><a href="../ru/Compile_on_MacOS.html" title="Compile on MacOS/ru">&#1050;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1103; &#1074; MacOS</a>
 <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-right.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span></div>
    <div><a href="../ru/Online_Help_Toc.html" title="Online Help Toc/ru">&#1054;&#1075;&#1083;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;</a> <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Online_Help_Toc.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span></div>
</div>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><span typeof="mw:File"><a href="../index.php?title=User_hub.png&amp;filetimestamp=20190221145008&amp;.html" class="mw-file-description"><img src="../File/User_hub.png" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/User_hub.html" title="User hub/ru">&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b><a href="../ru/Getting_started.html" title="Getting started/ru">&#1053;&#1072;&#1095;&#1080;&#1085;&#1072;&#1102;&#1097;&#1080;&#1084;</a></b></li>
<li><b>&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072;:</b> <a href="../ru/Download.html" title="Download/ru">&#1047;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072;</a>, <a href="../ru/Installing_on_Windows.html" title="Installing on Windows/ru">Windows</a>, <a href="../ru/Installing_on_Linux.html" title="Installing on Linux/ru">Linux</a>, <a href="../ru/Installing_on_Mac.html" title="Installing on Mac/ru">Mac</a>, <a href="../ru/Installing_additional_components.html" title="Installing additional components/ru">
&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074;</a>, <a href="../ru/Compile_on_Docker.html" title="Compile on Docker/ru">Docker</a>, <a href="../ru/AppImage.html" title="AppImage/ru">AppImage</a>, <a href="../ru/Ubuntu_Snap.html" title="Ubuntu Snap/ru">Ubuntu Snap</a></li>
<li><b>&#1041;&#1072;&#1079;&#1086;&#1074;&#1072;&#1103;:</b> <a href="../ru/About_FreeCAD.html" title="About FreeCAD/ru">&#1054; FreeCAD</a>, <a href="../ru/Interface.html" title="Interface/ru">&#1048;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;</a>, <a href="../ru/Mouse_navigation.html" title="Mouse navigation/ru">&#1053;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1103; &#1084;&#1099;&#1096;&#1080;</a>, <a href="../ru/Selection_methods.html" title="Selection methods/ru">&#1052;&#1077;&#1090;&#1086;&#1076;&#1099; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103;</a>, <a href="../ru/Object_name.html" title="Object name/ru">&#1048;&#1084;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;</a>, <a href="../ru/Preferences_Editor.html" title="Preferences Editor/ru">&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;</a>, <a href="../ru/Workbenches.html" title="Workbenches/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>, <a href="../ru/Document_structure.html" title="Document structure/ru">&#1057;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;</a>, <a href="../ru/Property.html" title="Property/ru">&#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;</a>, <a href="../ru/Help_FreeCAD.html" title="Help FreeCAD/ru">&#1055;&#1086;&#1084;&#1086;&#1075;&#1080; FreeCAD</a>, <a href="../ru/Donate.html" title="Donate/ru">&#1055;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</a></li></ul>
<hr>
<ul><li><b>&#1055;&#1086;&#1084;&#1086;&#1097;&#1100;:</b> <a href="../ru/Tutorials.html" title="Tutorials/ru">&#1059;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082;&#1080;</a>, <a href="../ru/Video_tutorials.html" title="Video tutorials/ru">&#1042;&#1080;&#1076;&#1077;&#1086; &#1091;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082;&#1080;</a></li>
<li><b><a href="../ru/Workbenches.html" title="Workbenches/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>:</b> <a href="../ru/Std_Base.html" title="Std Base/ru">Std Base</a>, <a href="../ru/Arch_Workbench.html" title="Arch Workbench/ru">Arch</a>, <a href="../ru/Assembly_Workbench.html" title="Assembly Workbench/ru">Assembly</a>, <a href="../ru/CAM_Workbench.html" title="CAM Workbench/ru">CAM</a>, <a href="../ru/Draft_Workbench.html" title="Draft Workbench/ru">Draft</a>, <a href="../ru/FEM_Workbench.html" title="FEM Workbench/ru">FEM</a>, <a href="../ru/Inspection_Workbench.html" title="Inspection Workbench/ru">Inspection</a>, <a href="../ru/Mesh_Workbench.html" title="Mesh Workbench/ru">Mesh</a>, <a href="../ru/OpenSCAD_Workbench.html" title="OpenSCAD Workbench/ru">OpenSCAD</a>, <a href="../ru/Part_Workbench.html" title="Part Workbench/ru">Part</a>, <a href="../ru/PartDesign_Workbench.html" title="PartDesign Workbench/ru">PartDesign</a>, <a href="../ru/Points_Workbench.html" title="Points Workbench/ru">Points</a>, <a href="../ru/Reverse_Engineering_Workbench.html" title="Reverse Engineering Workbench/ru">Reverse Engineering</a>, <a href="../ru/Robot_Workbench.html" title="Robot Workbench/ru">Robot</a>, <a href="../ru/Sketcher_Workbench.html" title="Sketcher Workbench/ru">Sketcher</a>, <a href="../ru/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/ru">Spreadsheet</a>, <a href="../ru/Surface_Workbench.html" title="Surface Workbench/ru">Surface</a>, <a href="../ru/TechDraw_Workbench.html" title="TechDraw Workbench/ru">TechDraw</a>, <a href="../ru/Testing.html" title="Testing/ru">Test Framework</a></li></ul>
<hr>
<ul><li><b><a href="../ru/Addon.html" title="Addon/ru">Addons</a>:</b> <a href="../ru/Std_AddonMgr.html" title="Std AddonMgr/ru">&#1052;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1081;</a>, <a href="../ru/External_workbenches.html" title="External workbenches/ru">&#1042;&#1085;&#1077;&#1096;&#1085;&#1080;&#1077; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>, <a href="../ru/Scripting_and_macros.html" title="Scripting and macros/ru">C&#1082;&#1088;&#1080;&#1087;&#1090;&#1099; &#1080; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1099;</a></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="../ru/User_hub.html" title="User hub/ru">&#1059;&#1075;&#1086;&#1083;&#1086;&#1082; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;</a>, <a href="../ru/Power_users_hub.html" title="Power users hub/ru">&#1059;&#1075;&#1086;&#1083;&#1086;&#1082; &#1086;&#1087;&#1099;&#1090;&#1085;&#1099;&#1093; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;</a>, <a href="../ru/Developer_hub.html" title="Developer hub/ru">&#1059;&#1075;&#1086;&#1083;&#1086;&#1082; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20260101214317
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.185 seconds
Real time usage: 0.228 seconds
Preprocessor visited node count: 3009/1000000
Post&#8208;expand include size: 24469/2097152 bytes
Template argument size: 18125/2097152 bytes
Highest expansion depth: 5/100
Expensive parser function count: 52/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 44670/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   69.021      1 -total
 21.46%   14.810     52 Template:Code
 13.60%    9.388    301 Template:Incode
 12.57%    8.675      6 Template:MenuCommand
 10.68%    7.368      1 Template:Userdocnavi/ru
  3.59%    2.477      1 Template:Navigation_menu_2
  3.53%    2.433      5 Template:Button
  3.12%    2.153      3 Template:FileName
  3.07%    2.122      2 Template:Docnav/ru
  2.01%    1.387      1 Template:Caption
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:196754-0!canonical and timestamp 20260101214317 and revision id 1725393. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>