<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Creating a simple part with PartDesign/ru</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="ru" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Creating+a+simple+part+with+PartDesign&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/Creating_a_simple_part_with_PartDesign.html" class="mw-pt-progress mw-pt-progress--high" title="Erstellen eines einfachen Bauteils mit PartDesign (99% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Creating_a_simple_part_with_PartDesign.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Creating a simple part with PartDesign (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../tr/Creating_a_simple_part_with_PartDesign.html" class="mw-pt-progress mw-pt-progress--low" title="Par&ccedil;a Tasar&#305;m ile basit bir par&ccedil;a olu&#351;turma (1% translated)" lang="tr" dir="ltr">T&uuml;rk&ccedil;e</a></li>
<li><a href="../es/Creating_a_simple_part_with_PartDesign.html" class="mw-pt-progress mw-pt-progress--low" title="Crear una pieza simple con PartDesign (4% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/Creating_a_simple_part_with_PartDesign.html" class="mw-pt-progress mw-pt-progress--high" title="PartDesign Tutoriel pour cr&eacute;er une pi&egrave;ce simple (99% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/Creating_a_simple_part_with_PartDesign.html" class="mw-pt-progress mw-pt-progress--high" title="Creare una parte semplice con PartDesign (99% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Creating_a_simple_part_with_PartDesign.html" class="mw-pt-progress mw-pt-progress--high" title="Projekt Cz&#281;&#347;ci: tworzenie podstawowych bry&#322; (99% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt-br/Creating_a_simple_part_with_PartDesign.html" class="mw-pt-progress mw-pt-progress--high" title="Criando uma pe&ccedil;a simples com Part Design (99% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../ro/Creating_a_simple_part_with_PartDesign.html" class="mw-pt-progress mw-pt-progress--low" title="Crearea unei piese simple cu PartDesign (8% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--high" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</span></li></ul></div>
<table class="fcinfobox wikitable ct" style="width: 230px; float: right; margin-left: 1em">
<tbody><tr>
<td class="ctTitle" style="font-weight: bold; font-size: 125%;"><span typeof="mw:File"><span><img src="../File/Freecad.svg" decoding="async" width="32" height="32" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span> &#1056;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086;
</td></tr>
<tr>
<th class="ctOdd">&#1058;&#1077;&#1084;&#1072;
</th></tr>
<tr>
<td class="ctEven">&#1052;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;
</td></tr>
<tr>
<th class="ctOdd">&#1059;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100;
</th></tr>
<tr>
<td class="ctEven">&#1044;&#1083;&#1103; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1102;&#1097;&#1080;&#1093;
</td></tr>
<tr>
<th class="ctOdd">&#1042;&#1088;&#1077;&#1084;&#1103; &#1076;&#1083;&#1103; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1103;
</th></tr>
<tr>
<td class="ctEven">1 &#1095;&#1072;&#1089;
</td></tr>
<tr>
<th class="ctOdd">&#1040;&#1074;&#1090;&#1086;&#1088;&#1099;
</th></tr>
<tr>
<td class="ctEven">GlouGlou
</td></tr>
<tr>
<th class="ctOdd">FreeCAD &#1074;&#1077;&#1088;&#1089;&#1080;&#1103;
</th></tr>
<tr>
<td class="ctEven">0.17 &#1080; &#1074;&#1099;&#1096;&#1077;
</td></tr>
<tr>
<th class="ctOdd">&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;
</th></tr>
<tr>
<td class="ctEven">
</td></tr>
<tr>
<th class="ctOdd">&#1057;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; &#1090;&#1072;&#1082;&#1078;&#1077;
</th></tr>
<tr>
<td class="ctEven"><a href="../ru/Creating_a_simple_part_with_Part_WB.html" title="Creating a simple part with Part WB/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080; &#1074; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1077; Part</a>, <a href="../ru/Creating_a_simple_part_with_Draft_and_Part_WB.html" title="Creating a simple part with Draft and Part WB/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080; &#1074; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072;&#1093; Draft &#1080; Part</a>
</td></tr>
<tr>
<td class="ctToc"><br><meta property="mw:PageProp/toc">
</td></tr></tbody></table>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=GGTuto1_Vue.PNG&amp;filetimestamp=20180404144733&amp;.html" class="mw-file-description"><img src="../File/GGTuto1_Vue.PNG" decoding="async" width="744" height="544" class="mw-file-element" data-file-width="744" data-file-height="544"></a><figcaption></figcaption></figure>
<p>&#1062;&#1077;&#1083;&#1100; &#1101;&#1090;&#1086;&#1075;&#1086; &#1091;&#1088;&#1086;&#1082;&#1072; - &#1085;&#1072;&#1091;&#1095;&#1080;&#1090;&#1100; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1102;&#1097;&#1080;&#1093; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; FreeCAD &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1084; &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1084; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103;&#1084; &#1085;&#1072; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080;. &#1048;&#1079;&#1091;&#1095;&#1080;&#1074; &#1086;&#1089;&#1085;&#1086;&#1074;&#1099; &#1074; <a href="../ru/User_hub.html" title="User hub/ru">&#1091;&#1075;&#1086;&#1083;&#1082;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;</a>, &#1074;&#1099; &#1089;&#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1089;&#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1074;&#1086;&#1102; &#1087;&#1077;&#1088;&#1074;&#1091;&#1102; &#1076;&#1077;&#1090;&#1072;&#1083;&#1100; &#1096;&#1072;&#1075; &#1079;&#1072; &#1096;&#1072;&#1075;&#1086;&#1084;.
</p><p><b>&#1042; &#1095;&#1072;&#1089;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1074; &#1101;&#1090;&#1086;&#1084; &#1091;&#1088;&#1086;&#1082;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084;:</b>
</p>
<ul><li>&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <a href="../ru/PartDesign_Workbench.html" title="PartDesign Workbench/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; Part Design</a>.</li>
<li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074;&#1099;&#1076;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080; &#1074;&#1099;&#1088;&#1077;&#1079;&#1072;.</li>
<li>&#1048;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1094;&#1074;&#1077;&#1090;&#1072; &#1080; &#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080;.</li>
<li>&#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1090;&#1077;&#1083;&#1072; &#1074;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102;.</li>
<li>&#1054;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1086;&#1087;&#1086;&#1088;&#1085;&#1099;&#1093; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074; &#1085;&#1072; &#1101;&#1089;&#1082;&#1080;&#1079;&#1077;.</li>
<li>&#1048;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1083;&#1080; &#1073;&#1086;&#1083;&#1077;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074;.</li>
<li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081; &#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1081; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080; &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1086;&#1087;&#1086;&#1088;&#1085;&#1086;&#1081; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1094;&#1077;&#1085;&#1090;&#1088;&#1072; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1103;.</li></ul>
<p><span id="Using_Part_Design_workbench,_tracing_the_sketch"></span>
</p>
<h3><span id=".D0.A1.D0.BE.D0.B7.D0.B4.D0.B0.D0.BD.D0.B8.D0.B5_.D1.8D.D1.81.D0.BA.D0.B8.D0.B7.D0.B0_.D1.81_.D0.BF.D0.BE.D0.BC.D0.BE.D1.89.D1.8C.D1.8E_.D0.92.D0.B5.D1.80.D1.81.D1.82.D0.B0.D0.BA.D0.B0_Part_Design"></span><span class="mw-headline" id="&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077;_&#1101;&#1089;&#1082;&#1080;&#1079;&#1072;_&#1089;_&#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102;_&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072;_Part_Design">&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <a href="../ru/PartDesign_Workbench.html" title="PartDesign Workbench/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; Part Design</a></span></h3>
<p>&#1057;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1085;&#1086;&#1074;&#1099;&#1081; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; &#1080; &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;"><span typeof="mw:File"><a href="../index.php?title=Workbench_PartDesign.svg&amp;filetimestamp=20240405092932&amp;.html" class="mw-file-description"><img src="../File/Workbench_PartDesign.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b>Part Design</b></span> &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1083;&#1080;&#1073;&#1086; <a href="../ru/Getting_started.html#Exploring_the_interface%5Cru" title="Getting started/ru">&#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1077;&#1083;&#1100; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1086;&#1074;</a> (&#1087;&#1086;&#1084;&#1077;&#1095;&#1077;&#1085; &#1095;&#1080;&#1089;&#1083;&#1086;&#1084; 10 &#1085;&#1072; &#1082;&#1072;&#1088;&#1090;&#1080;&#1085;&#1082;&#1077; &#1087;&#1086; &#1089;&#1089;&#1099;&#1083;&#1082;&#1077;), &#1083;&#1080;&#1073;&#1086; &#1095;&#1077;&#1088;&#1077;&#1079; &#1075;&#1083;&#1072;&#1074;&#1085;&#1086;&#1077; &#1084;&#1077;&#1085;&#1102; <b>&#1042;&#1080;&#1076; &rarr; &#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;</b>. FreeCAD &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1089;&#1103; &#1089; &#1087;&#1072;&#1085;&#1077;&#1083;&#1103;&#1084;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074;&#1074;&#1077;&#1088;&#1093;&#1091;, &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1084; &#1074;&#1080;&#1076;&#1086;&#1084; &#1089;&#1083;&#1077;&#1074;&#1072; &#1080; 3D &#1074;&#1080;&#1076;&#1086;&#1084; &#1089;&#1087;&#1088;&#1072;&#1074;&#1072;.
</p><p><b>&#1057;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1090;&#1077;&#1083;&#1086;:</b>
</p><p>&#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; <span typeof="mw:File"><a href="../index.php?title=PartDesign_Body.svg&amp;filetimestamp=20191125185840&amp;.html" class="mw-file-description"><img src="../File/PartDesign_Body.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/PartDesign_Body.html" title="PartDesign Body/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1090;&#1077;&#1083;&#1086;</a>. <i><b>&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;:</b> &#1085;&#1077; &#1087;&#1091;&#1090;&#1072;&#1081;&#1090;&#1077; &#1090;&#1077;&#1083;&#1086;, &#1080;&#1082;&#1086;&#1085;&#1082;&#1072; &#1091; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1075;&#1086;&#1083;&#1091;&#1073;&#1072;&#1103;, &#1089; &#1090;&#1077;&#1083;&#1086;&#1084; &#1074; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1077; Part, &#1080;&#1082;&#1086;&#1085;&#1082;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1078;&#1077;&#1083;&#1090;&#1072;&#1103;.</i> &#1042;&#1086; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; <i>&#1052;&#1086;&#1076;&#1077;&#1083;&#1100;</i> &#1050;&#1086;&#1084;&#1073;&#1086; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1087;&#1086;&#1103;&#1074;&#1080;&#1090;&#1089;&#1103; &#1085;&#1086;&#1074;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1087;&#1086;&#1076; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; "Body", &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100;&#1102; &#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &#1073;&#1077;&#1079; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1103; ("Unnamed"). &#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; &#1085;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1090;.&#1082;. &#1084;&#1099; &#1077;&#1075;&#1086; &#1087;&#1086;&#1082;&#1072; &#1085;&#1077; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;. &#1058;&#1077;&#1083;&#1086; - &#1101;&#1090;&#1086; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; Part Design &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1074;&#1099;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1099; &#1086;&#1073;&#1088;&#1072;&#1079;&#1091;&#1103; &#1077;&#1076;&#1080;&#1085;&#1086;&#1077; &#1090;&#1074;&#1077;&#1088;&#1076;&#1086;&#1077; &#1090;&#1077;&#1083;&#1086;. &#1054;&#1085;&#1086; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1089;&#1074;&#1086;&#1080; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077; &#1086;&#1089;&#1080; &#1080; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080;. &#1045;&#1075;&#1086; &#1085;&#1072;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1086; &#1075;&#1086;&#1083;&#1091;&#1073;&#1099;&#1084; &#1094;&#1074;&#1077;&#1090;&#1086;&#1084; &#1074; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;, &#1095;&#1090;&#1086; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1086;&#1085;&#1086; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;, &#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1080;&#1077;&#1089;&#1103; &#1074; &#1085;&#1077;&#1084; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1074; &#1085;&#1077;&#1075;&#1086; &#1085;&#1086;&#1074;&#1099;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099;. &#1045;&#1089;&#1083;&#1080; &#1086;&#1085;&#1086; &#1085;&#1077; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1086;, &#1076;&#1074;&#1072;&#1078;&#1076;&#1099; &#1097;&#1077;&#1083;&#1082;&#1085;&#1080;&#1090;&#1077; &#1085;&#1072; &#1085;&#1077;&#1084; &#1080;&#1083;&#1080; &#1097;&#1077;&#1083;&#1082;&#1085;&#1080;&#1090;&#1077; &#1087;&#1088;&#1072;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; &#1084;&#1099;&#1096;&#1080; &#1080; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &laquo;&#1055;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1077; &#1090;&#1077;&#1083;&#1086;&raquo; &#1074; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1085;&#1086;&#1084; &#1084;&#1077;&#1085;&#1102;. &#1057;&#1083;&#1077;&#1074;&#1072; &#1086;&#1090; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080; "Body" &#1077;&#1089;&#1090;&#1100; &#1089;&#1080;&#1085;&#1080;&#1081; &#1103;&#1088;&#1083;&#1099;&#1095;&#1086;&#1082;, &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1095;&#1085;&#1099;&#1081; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1086;&#1084;&#1091; &#1074;&#1099;&#1096;&#1077;, &#1080; &#1089;&#1090;&#1088;&#1077;&#1083;&#1082;&#1072; &#1080;&#1083;&#1080; &#1079;&#1085;&#1072;&#1082; &#1087;&#1083;&#1102;&#1089;&#1072;, &#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1074;&#1072;&#1096;&#1077;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;. &#1065;&#1077;&#1083;&#1095;&#1086;&#1082; &#1087;&#1086; &#1089;&#1090;&#1088;&#1077;&#1083;&#1082;&#1077; &#1080;&#1083;&#1080; &#1079;&#1085;&#1072;&#1082;&#1091; &#1087;&#1083;&#1102;&#1089;&#1072; &#1087;&#1077;&#1088;&#1077;&#1076; "Body" &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1103;&#1077;&#1090; &#1077;&#1075;&#1086; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077;. &#1053;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1086;&#1085; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1089; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1100;&#1102; <i>Origin</i>. &#1055;&#1077;&#1088;&#1077;&#1076; &#1101;&#1090;&#1080;&#1084; <i>Origin</i> &#1090;&#1072;&#1082;&#1078;&#1077; &#1077;&#1089;&#1090;&#1100; &#1089;&#1090;&#1088;&#1077;&#1083;&#1082;&#1072; &#1080;&#1083;&#1080; &#1079;&#1085;&#1072;&#1082; &#1087;&#1083;&#1102;&#1089;&#1072;. &#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1085;&#1072; &#1085;&#1077;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1088;&#1072;&#1079;&#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100; &#1077;&#1075;&#1086; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077;. &#1054;&#1085; &#1087;&#1086;&#1082;&#1072;&#1078;&#1077;&#1090; &#1074;&#1099;&#1096;&#1077;&#1091;&#1087;&#1086;&#1084;&#1103;&#1085;&#1091;&#1090;&#1099;&#1077; &#1086;&#1087;&#1086;&#1088;&#1085;&#1099;&#1077; &#1086;&#1089;&#1080; &#1080; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080;, &#1082;&#1072;&#1082; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1085;&#1072; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1080; &#1085;&#1080;&#1078;&#1077;:
</p>
<figure class="mw-default-size mw-halign-none" typeof="mw:File"><a href="../index.php?title=PartDesign_Body_tree_Unnamed.png&amp;filetimestamp=20180723202230&amp;.html" class="mw-file-description"><img src="../File/PartDesign_Body_tree_Unnamed.png" decoding="async" width="174" height="196" class="mw-file-element" data-file-width="174" data-file-height="196"></a><figcaption></figcaption></figure>
<p><i>&#1042;&#1085;&#1086;&#1074;&#1100; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1086;&#1077; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1077; &#1090;&#1077;&#1083;&#1086; &#1089; &#1077;&#1075;&#1086; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1099;&#1084;.</i>
</p><p>&#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; <i>Origin</i> &#1087;&#1088;&#1080;&#1082;&#1088;&#1099;&#1090;&#1086; &#1089;&#1077;&#1088;&#1099;&#1084; &#1094;&#1074;&#1077;&#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1077;&#1075;&#1086; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1085;&#1077; &#1074;&#1080;&#1076;&#1080;&#1084;&#1086; &#1074; 3D &#1074;&#1080;&#1076;&#1077;. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1074;&#1080;&#1076;&#1080;&#1084;&#1099;&#1084; &#1074;&#1099;&#1073;&#1088;&#1072;&#1074; &#1077;&#1075;&#1086; &#1084;&#1099;&#1096;&#1100;&#1102; &#1080; &#1085;&#1072;&#1078;&#1072;&#1074; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1091; &#1055;&#1088;&#1086;&#1073;&#1077;&#1083;. &#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; <i>Origin</i> &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1086;&#1076;&#1089;&#1074;&#1077;&#1095;&#1077;&#1085;&#1086; &#1095;&#1077;&#1088;&#1085;&#1099;&#1084; &#1094;&#1074;&#1077;&#1090;&#1086;&#1084;. &#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1055;&#1088;&#1086;&#1073;&#1077;&#1083; &#1077;&#1097;&#1077; &#1088;&#1072;&#1079; &#1080; &#1077;&#1075;&#1086; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1089;&#1085;&#1086;&#1074;&#1072; &#1080;&#1089;&#1095;&#1077;&#1079;&#1085;&#1077;&#1090;. &#1050;&#1083;&#1080;&#1082;&#1085;&#1080;&#1090;&#1077; &#1084;&#1099;&#1096;&#1100;&#1102; &#1085;&#1072; &#1079;&#1085;&#1072;&#1095;&#1082;&#1077; &#1089;&#1090;&#1088;&#1077;&#1083;&#1082;&#1080; &#1080;&#1083;&#1080; &#1087;&#1083;&#1102;&#1089;&#1080;&#1082;&#1072; &#1087;&#1077;&#1088;&#1077;&#1076; &#1079;&#1085;&#1072;&#1095;&#1082;&#1086;&#1084; <i>Origin</i> &#1080; &#1077;&#1075;&#1086; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1089;&#1074;&#1077;&#1088;&#1085;&#1077;&#1090;&#1089;&#1103; &#1074; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;.
</p><p>&#1055;&#1077;&#1088;&#1077;&#1076; &#1090;&#1077;&#1084; &#1082;&#1072;&#1082; &#1084;&#1099; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1080;&#1084;, &#1076;&#1072;&#1074;&#1072;&#1081;&#1090;&#1077; &#1087;&#1077;&#1088;&#1077;&#1080;&#1084;&#1077;&#1085;&#1091;&#1077;&#1084; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; "Body".
</p><p><b>&#1055;&#1077;&#1088;&#1077;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1090;&#1077;&#1083;&#1072;:</b>
</p><p>&#1042; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1087;&#1088;&#1072;&#1074;&#1091;&#1102; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1085;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1077; "Body". &#1042; &#1087;&#1086;&#1103;&#1074;&#1080;&#1074;&#1096;&#1077;&#1084;&#1089;&#1103; &#1084;&#1077;&#1085;&#1102; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1089;&#1090;&#1088;&#1086;&#1095;&#1082;&#1091; <i>&#1055;&#1077;&#1088;&#1077;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1090;&#1100;</i>, &#1074;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; &#1085;&#1086;&#1074;&#1086;&#1077; &#1080;&#1084;&#1103;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; "Body part1" &#1080; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1091; <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">Enter</span>.
</p><p><b>&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072;/&#1089;&#1082;&#1077;&#1090;&#1095;&#1072;:</b>
</p><p>&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1089;&#1086;&#1079;&#1076;&#1072;&#1076;&#1080;&#1084; &#1101;&#1089;&#1082;&#1080;&#1079;/&#1089;&#1082;&#1077;&#1090;&#1095;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1086;&#1073;&#1097;&#1091;&#1102; &#1092;&#1086;&#1088;&#1084;&#1091; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080;. &#1057;&#1082;&#1077;&#1090;&#1095; &mdash; &#1101;&#1090;&#1086; &#1095;&#1077;&#1088;&#1090;&#1077;&#1078;, &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081; &#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080; &#1074; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1081; &#1085;&#1072;&#1084;&#1080; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080;. &#1053;&#1072; &#1085;&#1077;&#1084; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1099;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1087;&#1088;&#1080;&#1083;&#1080;&#1074;&#1099; &#1080; &#1074;&#1099;&#1077;&#1084;&#1082;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1084;&#1077;&#1102;&#1090;&#1089;&#1103; &#1087;&#1086; &#1074;&#1089;&#1077;&#1081; &#1076;&#1083;&#1080;&#1085;&#1077; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080;.
</p><p>&#1055;&#1091;&#1089;&#1090;&#1100; &#1076;&#1077;&#1090;&#1072;&#1083;&#1100; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;&#1076;&#1086;&#1083;&#1100; &#1086;&#1089;&#1080; Y, &#1089;&#1086;&#1079;&#1076;&#1072;&#1076;&#1080;&#1084; &#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080; &#1074; &#1087;&#1077;&#1088;&#1087;&#1077;&#1085;&#1076;&#1080;&#1082;&#1091;&#1083;&#1103;&#1088;&#1085;&#1086;&#1081; &#1086;&#1089;&#1080; Y &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080;.
</p><p>&#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1085;&#1072; <span typeof="mw:File"><a href="../index.php?title=Sketcher_NewSketch.svg&amp;filetimestamp=20231231201726&amp;.html" class="mw-file-description"><img src="../File/Sketcher_NewSketch.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Sketcher_NewSketch.html" title="Sketcher NewSketch/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1081; &#1101;&#1089;&#1082;&#1080;&#1079;</a>. &#1050;&#1086;&#1084;&#1073;&#1086; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1089;&#1103; &#1085;&#1072; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1091; <b>&#1047;&#1072;&#1076;&#1072;&#1095;&#1080;</b>, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1087;&#1086;&#1103;&#1074;&#1080;&#1090;&#1089;&#1103; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; <i>&#1042;&#1099;&#1073;&#1086;&#1088; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080;</i>. &#1042; &#1101;&#1090;&#1086;&#1084; &#1086;&#1082;&#1085;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1100; &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072;&#1096; &#1101;&#1089;&#1082;&#1080;&#1079;/&#1089;&#1082;&#1077;&#1090;&#1095;. &#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1100; <i>XZ_Plane (&#1041;&#1072;&#1079;&#1086;&#1074;&#1072;&#1103; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1100;)</i> &#1080; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">OK</span>. &#1042;&#1084;&#1077;&#1089;&#1090;&#1086; 3D &#1074;&#1080;&#1076;&#1072; &#1087;&#1086;&#1103;&#1074;&#1080;&#1090;&#1089;&#1103; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1101;&#1089;&#1082;&#1080;&#1079;&#1086;&#1074;/&#1089;&#1082;&#1077;&#1090;&#1095;&#1077;&#1081; &#1089;&#1086; &#1074;&#1089;&#1077;&#1084; &#1089;&#1074;&#1086;&#1080;&#1084; &#1085;&#1072;&#1073;&#1086;&#1088;&#1086;&#1084; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1050;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1100; XZ, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1084;&#1099; &#1073;&#1091;&#1076;&#1077;&#1084; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1089;&#1082;&#1077;&#1090;&#1095;.
</p><p>&#1063;&#1090;&#1086;&#1073;&#1099; &#1091;&#1087;&#1088;&#1086;&#1089;&#1090;&#1080;&#1090;&#1100; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072;/&#1089;&#1082;&#1077;&#1090;&#1095;&#1072;, &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1079;&#1072;&#1076;&#1072;&#1095; &#1074; &#1086;&#1082;&#1085;&#1077; "&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;" &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;:
</p>
<ul><li>&#1055;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1089;&#1077;&#1090;&#1082;&#1091;: &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1086;</li>
<li>&#1056;&#1072;&#1079;&#1084;&#1077;&#1088; &#1089;&#1077;&#1090;&#1082;&#1080;: 10 &#1084;&#1084;</li>
<li>&#1040;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103;: &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1086;</li></ul>
<p>&#1057;&#1086;&#1079;&#1076;&#1072;&#1076;&#1080;&#1084; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1101;&#1089;&#1082;&#1080;&#1079;/&#1089;&#1082;&#1077;&#1090;&#1095;:
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=GGTuto1_0.PNG&amp;filetimestamp=20180404143737&amp;.html" class="mw-file-description"><img src="../File/GGTuto1_0.PNG" decoding="async" width="830" height="478" class="mw-file-element" data-file-width="830" data-file-height="478"></a><figcaption></figcaption></figure>
<p><b>&#1044;&#1072;&#1074;&#1072;&#1081;&#1090;&#1077; &#1085;&#1072;&#1095;&#1085;&#1077;&#1084; &#1089; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;:</b>
</p><p>&#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; <span typeof="mw:File"><a href="../index.php?title=Sketcher_Line.svg&amp;filetimestamp=20170323210839&amp;.html" class="mw-file-description"><img src="../File/Sketcher_Line.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Sketcher_CreateLine.html" title="Sketcher CreateLine/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1083;&#1080;&#1085;&#1080;&#1102; &#1085;&#1072; &#1101;&#1089;&#1082;&#1080;&#1079;&#1077;</a>. &#1055;&#1086;&#1089;&#1090;&#1072;&#1074;&#1100;&#1090;&#1077; &#1084;&#1099;&#1096;&#1100;&#1102; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1091;&#1102; &#1090;&#1086;&#1095;&#1082;&#1091;, &#1091;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1089;&#1087;&#1088;&#1072;&#1074;&#1072; &#1086;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1103; &#1084;&#1099;&#1096;&#1080; &#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1084;&#1072;&#1083;&#1077;&#1085;&#1100;&#1082;&#1072;&#1103; &#1082;&#1088;&#1072;&#1089;&#1085;&#1072;&#1103; &#1090;&#1086;&#1095;&#1082;&#1072;. &#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1084;&#1099;&#1096;&#1080; &#1085;&#1072; 10 &#1096;&#1072;&#1075;&#1086;&#1074; &#1080;&#1083;&#1080; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1085;&#1086; 100 &#1084;&#1084; &#1074;&#1087;&#1088;&#1072;&#1074;&#1086; &#1074;&#1076;&#1086;&#1083;&#1100; &#1086;&#1089;&#1080; X &#1080; &#1089;&#1085;&#1086;&#1074;&#1072; &#1084;&#1099;&#1096;&#1100;&#1102; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1100;&#1090;&#1077; &#1090;&#1086;&#1095;&#1082;&#1091;. &#1055;&#1086;&#1082;&#1072; &#1085;&#1077; &#1074;&#1072;&#1078;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1083;&#1080;&#1085;&#1080;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1083;&#1072;&#1089;&#1100; &#1085;&#1077; &#1090;&#1086;&#1095;&#1085;&#1086; 100 &#1084;&#1084; &#1076;&#1083;&#1080;&#1085;&#1086;&#1081;, &#1087;&#1086;&#1079;&#1076;&#1085;&#1077;&#1077; &#1084;&#1099; &#1101;&#1090;&#1086; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1080;&#1084;.
</p><p>&#1055;&#1088;&#1086;&#1076;&#1077;&#1083;&#1072;&#1081;&#1090;&#1077; &#1090;&#1086; &#1078;&#1077; &#1089;&#1072;&#1084;&#1086;&#1077; &#1089; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072;. &#1057;&#1086;&#1077;&#1076;&#1080;&#1085;&#1103;&#1103; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099;, &#1089;&#1090;&#1072;&#1088;&#1072;&#1081;&#1090;&#1077;&#1089;&#1100; &#1089;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1080;&#1093; &#1082;&#1086;&#1085;&#1094;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1088;&#1080; &#1089;&#1086;&#1074;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1080; &#1079;&#1072;&#1075;&#1086;&#1088;&#1072;&#1102;&#1090;&#1089;&#1103; &#1078;&#1077;&#1083;&#1090;&#1099;&#1084; &#1094;&#1074;&#1077;&#1090;&#1086;&#1084;. &#1069;&#1090;&#1086; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1082;&#1086;&#1085;&#1094;&#1099; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1072;&#1102;&#1090;. &#1059; &#1074;&#1072;&#1089; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100;&#1089;&#1103; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1085;&#1086; &#1090;&#1072;&#1082;:
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=GGTuto1_1.PNG&amp;filetimestamp=20180404145042&amp;.html" class="mw-file-description"><img src="../File/GGTuto1_1.PNG" decoding="async" width="769" height="467" class="mw-file-element" data-file-width="769" data-file-height="467"></a><figcaption></figcaption></figure>
<p>&#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077; &#1085;&#1072; &#1084;&#1072;&#1083;&#1077;&#1085;&#1100;&#1082;&#1080;&#1077; &#1082;&#1088;&#1072;&#1089;&#1085;&#1099;&#1077; &#1083;&#1080;&#1085;&#1080;&#1080; &#1086;&#1082;&#1086;&#1083;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; - &#1101;&#1090;&#1086; &#1075;&#1086;&#1088;&#1080;&#1079;&#1086;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1080; &#1074;&#1077;&#1088;&#1090;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1080;&#1090;&#1077;&#1083;&#1080;. &#1054;&#1085;&#1080; &#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1102;&#1090; &#1085;&#1072;&#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1090;&#1100; &#1083;&#1080;&#1085;&#1080;&#1102; &#1089;&#1090;&#1088;&#1086;&#1075;&#1086; &#1075;&#1086;&#1088;&#1080;&#1079;&#1086;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086; &#1080;&#1083;&#1080; &#1089;&#1090;&#1088;&#1086;&#1075;&#1086; &#1074;&#1077;&#1088;&#1090;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;. &#1058;&#1072;&#1082; &#1078;&#1077; &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077; &#1085;&#1072; &#1084;&#1072;&#1083;&#1077;&#1085;&#1100;&#1082;&#1080;&#1077; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1099; &#1074; &#1074;&#1080;&#1076;&#1077; &#1076;&#1091;&#1075;&#1080;. &#1054;&#1085;&#1080; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1102;&#1090;, &#1095;&#1090;&#1086; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1072;&#1103; &#1090;&#1086;&#1095;&#1082;&#1072; &#1079;&#1072;&#1092;&#1080;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1072; &#1085;&#1072; Z &#1086;&#1089;&#1080;.
</p><p>&#1055;&#1086;&#1087;&#1088;&#1086;&#1073;&#1091;&#1081;&#1090;&#1077; &#1089;&#1077;&#1081;&#1095;&#1072;&#1089; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077;&#1084; &#1083;&#1077;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; &#1084;&#1099;&#1096;&#1080; &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1089; &#1085;&#1072;&#1078;&#1072;&#1090;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; &#1087;&#1077;&#1088;&#1077;&#1076;&#1074;&#1080;&#1085;&#1091;&#1090;&#1100; &#1077;&#1075;&#1086;. &#1044;&#1083;&#1103; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1101;&#1090;&#1086; &#1091;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100;, &#1072; &#1076;&#1083;&#1103; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1085;&#1077;&#1090;.
</p><p><b>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1080;&#1090;&#1077;&#1083;&#1077;&#1081;:</b>
</p><p>&#1042; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080; &#1082;&#1086;&#1084;&#1073;&#1086; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080;, &#1074;&#1086; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; "&#1047;&#1072;&#1076;&#1072;&#1095;&#1080;" &#1080;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103; &#1086;&#1082;&#1085;&#1086; "&#1057;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072;", &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1086; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1077;&#1081; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1099; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072;/&#1089;&#1082;&#1077;&#1090;&#1095;&#1072;. &#1057;&#1077;&#1081;&#1095;&#1072;&#1089; &#1080;&#1093; &#1086;&#1082;&#1086;&#1083;&#1086; 6, &#1085;&#1086; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1091;&#1084;&#1077;&#1085;&#1100;&#1096;&#1080;&#1090;&#1100; &#1080;&#1093; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1076;&#1086; 0.
</p><p>&#1053;&#1072;&#1082;&#1083;&#1086;&#1085;&#1085;&#1072;&#1103; &#1083;&#1080;&#1085;&#1080;&#1103; &#1091; &#1085;&#1072;&#1089; &#1089;&#1077;&#1081;&#1095;&#1072;&#1089; &#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1088;&#1072;&#1097;&#1072;&#1090;&#1100;&#1089;&#1103;. &#1047;&#1072;&#1076;&#1072;&#1076;&#1080;&#1084; &#1077;&#1081; &#1091;&#1075;&#1086;&#1083; &#1085;&#1072;&#1082;&#1083;&#1086;&#1085;&#1072;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1079;&#1072;&#1092;&#1080;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1077;&#1077; &#1080; &#1091;&#1084;&#1077;&#1085;&#1100;&#1096;&#1080;&#1090;&#1100; &#1095;&#1080;&#1089;&#1083;&#1086; &#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1077;&#1081; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1099;.
</p><p>&#1052;&#1099;&#1096;&#1100;&#1102; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1085;&#1072;&#1082;&#1083;&#1086;&#1085;&#1085;&#1091;&#1102; &#1083;&#1080;&#1085;&#1080;&#1102; &#1080; &#1085;&#1080;&#1078;&#1085;&#1102;&#1102; &#1075;&#1086;&#1088;&#1080;&#1079;&#1086;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1083;&#1080;&#1085;&#1080;&#1102;. &#1054;&#1085;&#1080; &#1086;&#1082;&#1088;&#1072;&#1089;&#1103;&#1090;&#1089;&#1103; &#1074; &#1079;&#1077;&#1083;&#1077;&#1085;&#1099;&#1081; &#1094;&#1074;&#1077;&#1090;. &#1047;&#1072;&#1090;&#1077;&#1084;  &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1085;&#1072; &#1080;&#1082;&#1086;&#1085;&#1082;&#1091;<span typeof="mw:File"><a href="../index.php?title=Constraint_InternalAngle.svg&amp;filetimestamp=20231231195514&amp;.html" class="mw-file-description"><img src="../File/Constraint_InternalAngle.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Sketcher_ConstrainAngle.html" title="Sketcher ConstrainAngle/ru">&#1060;&#1080;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1091;&#1075;&#1086;&#1083; &#1086;&#1090;&#1088;&#1077;&#1079;&#1082;&#1072; &#1080;&#1083;&#1080; &#1091;&#1075;&#1086;&#1083; &#1084;&#1077;&#1078;&#1076;&#1091; &#1076;&#1074;&#1091;&#1084;&#1103; &#1086;&#1090;&#1088;&#1077;&#1079;&#1082;&#1072;&#1084;&#1080;</a>.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=GGTuto1_2.PNG&amp;filetimestamp=20180424031258&amp;.html" class="mw-file-description"><img src="../File/GGTuto1_2.PNG" decoding="async" width="748" height="453" class="mw-file-element" data-file-width="748" data-file-height="453"></a><figcaption></figcaption></figure>
<p>&#1042;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1091;&#1075;&#1083;&#1072; 30&deg;. &#1059;&#1075;&#1086;&#1083; &#1084;&#1077;&#1078;&#1076;&#1091; &#1076;&#1074;&#1091;&#1084;&#1103; &#1083;&#1080;&#1085;&#1080;&#1103;&#1084;&#1080; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1089;&#1090;&#1072;&#1085;&#1077;&#1090; &#1092;&#1080;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1084;. &#1059;&#1075;&#1083;&#1086;&#1074;&#1086;&#1081; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1089;&#1083;&#1077;&#1074;&#1072; &#1086;&#1090; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; &#1087;&#1088;&#1086;&#1092;&#1080;&#1083;&#1103; &#1087;&#1077;&#1088;&#1077;&#1085;&#1077;&#1089;&#1080;&#1090;&#1077; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1099;&#1096;&#1080; &#1074;&#1085;&#1091;&#1090;&#1088;&#1100; &#1087;&#1088;&#1086;&#1092;&#1080;&#1083;&#1103;.
</p><p>&#1057;&#1077;&#1081;&#1095;&#1072;&#1089; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1084; &#1090;&#1086;&#1095;&#1085;&#1091;&#1102; &#1076;&#1083;&#1080;&#1085;&#1091; &#1085;&#1080;&#1078;&#1085;&#1077;&#1081; &#1075;&#1086;&#1088;&#1080;&#1079;&#1086;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1083;&#1080;&#1085;&#1080;&#1080;. &#1065;&#1077;&#1083;&#1082;&#1085;&#1080;&#1090;&#1077; &#1085;&#1072; &#1085;&#1077;&#1081; &#1084;&#1099;&#1096;&#1100;&#1102; &#1080; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; <span typeof="mw:File"><a href="../index.php?title=Constraint_HorizontalDistance.svg&amp;filetimestamp=20231231195335&amp;.html" class="mw-file-description"><img src="../File/Constraint_HorizontalDistance.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Sketcher_ConstrainDistanceX.html" title="Sketcher ConstrainDistanceX/ru">&#1060;&#1080;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1088;&#1072;&#1089;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1087;&#1086; &#1075;&#1086;&#1088;&#1080;&#1079;&#1086;&#1085;&#1090;&#1072;&#1083;&#1080; &#1084;&#1077;&#1078;&#1076;&#1091; &#1076;&#1074;&#1091;&#1084;&#1103; &#1090;&#1086;&#1095;&#1082;&#1072;&#1084;&#1080; &#1080;&#1083;&#1080; &#1082;&#1086;&#1085;&#1094;&#1072;&#1084;&#1080; &#1086;&#1090;&#1088;&#1077;&#1079;&#1082;&#1072;</a>.
</p><p>&#1042;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; 100 &#1084;&#1084;. &#1042;&#1077;&#1088;&#1090;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1083;&#1080;&#1085;&#1080;&#1103; &#1089;&#1087;&#1088;&#1072;&#1074;&#1072; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1090;&#1086;&#1095;&#1085;&#1086; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1072;&#1077;&#1090; &#1089; 10-&#1084; &#1082;&#1074;&#1072;&#1076;&#1088;&#1072;&#1090;&#1086;&#1084; &#1089;&#1077;&#1090;&#1082;&#1080; &#1089;&#1087;&#1088;&#1072;&#1074;&#1072; &#1086;&#1090; &#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;.
</p><p>&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1084; &#1086;&#1073;&#1097;&#1091;&#1102; &#1074;&#1099;&#1089;&#1086;&#1090;&#1091; &#1087;&#1088;&#1086;&#1092;&#1080;&#1083;&#1103;, &#1074;&#1099;&#1073;&#1088;&#1072;&#1074; &#1084;&#1099;&#1096;&#1100;&#1102; &#1089;&#1072;&#1084;&#1091;&#1102; &#1074;&#1099;&#1089;&#1086;&#1082;&#1091;&#1102; &#1090;&#1086;&#1095;&#1082;&#1091; &#1089;&#1083;&#1077;&#1074;&#1072; &#1080; &#1090;&#1086;&#1095;&#1082;&#1091; &#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;. &#1047;&#1072;&#1090;&#1077;&#1084; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1085;&#1072; &#1080;&#1082;&#1086;&#1085;&#1082;&#1091; <span typeof="mw:File"><a href="../index.php?title=Constraint_VerticalDistance.svg&amp;filetimestamp=20231231200028&amp;.html" class="mw-file-description"><img src="../File/Constraint_VerticalDistance.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Sketcher_ConstrainDistanceY.html" title="Sketcher ConstrainDistanceY/ru">&#1060;&#1080;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1088;&#1072;&#1089;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1087;&#1086; &#1074;&#1077;&#1088;&#1090;&#1080;&#1082;&#1072;&#1083;&#1080; &#1084;&#1077;&#1078;&#1076;&#1091; &#1076;&#1074;&#1091;&#1084;&#1103; &#1090;&#1086;&#1095;&#1082;&#1072;&#1084;&#1080; &#1080;&#1083;&#1080; &#1082;&#1086;&#1085;&#1094;&#1072;&#1084;&#1080; &#1086;&#1090;&#1088;&#1077;&#1079;&#1082;&#1072;</a> &#1080; &#1074;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; 50 &#1084;&#1084;.
</p><p>&#1058;&#1072;&#1082; &#1078;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; &#1076;&#1083;&#1080;&#1085;&#1099; &#1087;&#1088;&#1086;&#1077;&#1082;&#1094;&#1080;&#1080; &#1085;&#1072;&#1082;&#1083;&#1086;&#1085;&#1085;&#1086;&#1081; &#1083;&#1080;&#1085;&#1080;&#1080; &#1074; 50&#1084;&#1084;.
</p><p>&#1063;&#1090;&#1086;&#1073;&#1099; &#1085;&#1077; &#1079;&#1072;&#1075;&#1088;&#1086;&#1084;&#1086;&#1078;&#1076;&#1072;&#1090;&#1100; &#1095;&#1077;&#1088;&#1090;&#1077;&#1078;, &#1074;&#1099;&#1085;&#1077;&#1089;&#1080;&#1090;&#1077; &#1083;&#1080;&#1085;&#1080;&#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074; &#1079;&#1072; &#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1099; &#1087;&#1088;&#1086;&#1092;&#1080;&#1083;&#1103;. &#1042;&#1072;&#1096; &#1089;&#1082;&#1077;&#1090;&#1095; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1077;&#1090;&#1100; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1085;&#1086; &#1090;&#1072;&#1082;:
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=GGTuto1_3.PNG&amp;filetimestamp=20180404145419&amp;.html" class="mw-file-description"><img src="../File/GGTuto1_3.PNG" decoding="async" width="942" height="596" class="mw-file-element" data-file-width="942" data-file-height="596"></a><figcaption></figcaption></figure>
<p>&#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1077;&#1081; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1099; &#1091;&#1084;&#1077;&#1085;&#1100;&#1096;&#1080;&#1083;&#1086;&#1089;&#1100; &#1076;&#1086; 2, &#1091; &#1085;&#1072;&#1089; &#1077;&#1097;&#1077; &#1086;&#1089;&#1090;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1077; &#1082;&#1086;&#1085;&#1094;&#1099; &#1086;&#1090;&#1088;&#1077;&#1079;&#1082;&#1086;&#1074;.
</p><p><b>&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1076;&#1091;&#1075;&#1080;</b>
</p><p>&#1050;&#1083;&#1080;&#1082;&#1085;&#1080;&#1090;&#1077; &#1085;&#1072; &#1080;&#1082;&#1086;&#1085;&#1082;&#1077; <span typeof="mw:File"><a href="../index.php?title=Sketcher_Arc.svg&amp;filetimestamp=20170323210906&amp;.html" class="mw-file-description"><img src="../File/Sketcher_Arc.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Sketcher_CreateArc.html" title="Sketcher CreateArc/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1076;&#1091;&#1075;&#1091; &#1085;&#1072; &#1101;&#1089;&#1082;&#1080;&#1079;&#1077;</a>, &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1084;&#1099;&#1096;&#1080; &#1074; &#1094;&#1077;&#1085;&#1090;&#1088; &#1089; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1072;&#1084;&#1080; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1085;&#1086; x = 80 y = 30, &#1079;&#1072;&#1090;&#1077;&#1084; &#1084;&#1099;&#1096;&#1100;&#1102; &#1091;&#1082;&#1072;&#1078;&#1080;&#1090;&#1077; &#1085;&#1072;&#1095;&#1072;&#1083;&#1086; &#1076;&#1091;&#1075;&#1080; &#1085;&#1072; &#1087;&#1088;&#1072;&#1074;&#1086;&#1084; &#1082;&#1086;&#1085;&#1094;&#1077; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1081; &#1075;&#1086;&#1088;&#1080;&#1079;&#1086;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1083;&#1080;&#1085;&#1080;&#1080;, &#1087;&#1086;&#1090;&#1086;&#1084; &#1077;&#1077; &#1082;&#1086;&#1085;&#1077;&#1094; &#1085;&#1072; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1084; &#1082;&#1086;&#1085;&#1094;&#1077; &#1087;&#1088;&#1072;&#1074;&#1086;&#1081; &#1074;&#1077;&#1088;&#1090;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1083;&#1080;&#1085;&#1080;&#1080;. &#1059;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1082;&#1086;&#1085;&#1094;&#1099; &#1083;&#1080;&#1085;&#1080;&#1081; &#1087;&#1086;&#1076;&#1089;&#1074;&#1077;&#1095;&#1080;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1078;&#1077;&#1083;&#1090;&#1099;&#1084; &#1094;&#1074;&#1077;&#1090;&#1086;&#1084; &#1087;&#1077;&#1088;&#1077;&#1076; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077;&#1084; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1084;&#1099;&#1096;&#1080;.
</p><p>&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1090;&#1086;&#1095;&#1085;&#1099;&#1081; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1088;&#1072;&#1076;&#1080;&#1091;&#1089;&#1072; &#1076;&#1091;&#1075;&#1080;: &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1076;&#1091;&#1075;&#1091;, &#1079;&#1072;&#1090;&#1077;&#1084; &#1082;&#1083;&#1080;&#1082;&#1085;&#1080;&#1090;&#1077; &#1084;&#1099;&#1096;&#1100;&#1102; &#1085;&#1072; &#1080;&#1082;&#1086;&#1085;&#1082;&#1077; <span typeof="mw:File"><a href="../index.php?title=Constraint_Radius.svg&amp;filetimestamp=20231231195846&amp;.html" class="mw-file-description"><img src="../File/Constraint_Radius.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Sketcher_ConstrainRadius.html" title="Sketcher ConstrainRadius/ru">&#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1080;&#1090;&#1100; &#1076;&#1091;&#1075;&#1091; &#1080;&#1083;&#1080; &#1086;&#1082;&#1088;&#1091;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;</a> &#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; 20 &#1084;&#1084;.
</p><p>&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1080;&#1084; &#1076;&#1091;&#1075;&#1091; &#1089; &#1083;&#1080;&#1085;&#1080;&#1103;&#1084;&#1080;: &#1084;&#1099;&#1096;&#1100;&#1102; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1076;&#1091;&#1075;&#1091; &#1080; &#1074;&#1077;&#1088;&#1085;&#1102;&#1102; &#1083;&#1080;&#1085;&#1080;&#1102;, &#1079;&#1072;&#1090;&#1077;&#1084; &#1082;&#1083;&#1080;&#1082;&#1085;&#1080;&#1090;&#1077; <span typeof="mw:File"><a href="../index.php?title=Constraint_Tangent.svg&amp;filetimestamp=20231231195942&amp;.html" class="mw-file-description"><img src="../File/Constraint_Tangent.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Sketcher_ConstrainTangent.html" title="Sketcher ConstrainTangent/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; &#1082;&#1072;&#1089;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1084;&#1077;&#1078;&#1076;&#1091; &#1076;&#1074;&#1091;&#1084;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084;&#1080;</a>. &#1055;&#1086;&#1103;&#1074;&#1080;&#1090;&#1089;&#1103; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; <i>&#1047;&#1072;&#1084;&#1077;&#1085;&#1072; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103;</i>, &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">OK</span>. &#1057;&#1076;&#1077;&#1083;&#1072;&#1081;&#1090;&#1077; &#1090;&#1086; &#1078;&#1077; &#1089;&#1072;&#1084;&#1086;&#1077; &#1085;&#1072; &#1076;&#1088;&#1091;&#1075;&#1086;&#1084; &#1082;&#1086;&#1085;&#1094;&#1077; &#1076;&#1091;&#1075;&#1080;.
</p><p>&#1052;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1083;&#1080; &#1101;&#1089;&#1082;&#1080;&#1079; &#1074; &#1076;&#1074;&#1072; &#1101;&#1090;&#1072;&#1087;&#1072;. &#1053;&#1086; &#1084;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1075;&#1083;&#1080; &#1073;&#1099; &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1087;&#1088;&#1086;&#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1092;&#1080;&#1083;&#1100;, &#1072; &#1087;&#1086;&#1090;&#1086;&#1084; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103;.
</p><p><br>
<b>&#1055;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1085;&#1099;&#1081; &#1101;&#1089;&#1082;&#1080;&#1079;:</b>
</p><p>&#1045;&#1089;&#1083;&#1080; &#1074;&#1089;&#1077; &#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;, &#1090;&#1086; &#1091; &#1074;&#1072;&#1089; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100;&#1089;&#1103; &#1101;&#1090;&#1086;:
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=GGTuto1_4.PNG&amp;filetimestamp=20180404145610&amp;.html" class="mw-file-description"><img src="../File/GGTuto1_4.PNG" decoding="async" width="695" height="473" class="mw-file-element" data-file-width="695" data-file-height="473"></a><figcaption></figcaption></figure>
<p>&#1069;&#1089;&#1082;&#1080;&#1079; &#1089;&#1090;&#1072;&#1083; &#1079;&#1077;&#1083;&#1077;&#1085;&#1099;&#1084;, &#1095;&#1090;&#1086; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1086;&#1085; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1079;&#1072;&#1092;&#1080;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;. &#1041;&#1086;&#1083;&#1100;&#1096;&#1077; &#1085;&#1077;&#1090; &#1085;&#1080;&#1082;&#1072;&#1082;&#1080;&#1093; &#1085;&#1077;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081;, &#1074;&#1089;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1090;&#1086;&#1095;&#1085;&#1086; &#1079;&#1072;&#1076;&#1072;&#1085;&#1099;. &#1069;&#1090;&#1086; &#1087;&#1086;&#1076;&#1090;&#1074;&#1077;&#1088;&#1078;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1100;&#1102; "&#1069;&#1089;&#1082;&#1080;&#1079; &#1085;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1077;&#1081; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1099;" &#1085;&#1072; &#1082;&#1086;&#1084;&#1073;&#1086; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080;. &#1047;&#1072;&#1084;&#1077;&#1090;&#1100;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1094;&#1077;&#1085;&#1090;&#1088; &#1076;&#1091;&#1075;&#1080; &#1089;&#1083;&#1077;&#1075;&#1082;&#1072; &#1089;&#1076;&#1074;&#1080;&#1085;&#1091;&#1083;&#1089;&#1103;, &#1101;&#1090;&#1086; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1083;&#1086;&#1089;&#1100; &#1074; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1090;&#1088;&#1077;&#1093; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1093; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1081;. FreeCAD &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1080;&#1083; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;&#1077; &#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1094;&#1077;&#1085;&#1090;&#1088;&#1072; &#1076;&#1091;&#1075;&#1080;.
</p><p>&#1045;&#1089;&#1083;&#1080; &#1074;&#1072;&#1096; &#1101;&#1089;&#1082;&#1080;&#1079; &#1077;&#1097;&#1077; &#1085;&#1077; &#1086;&#1082;&#1088;&#1072;&#1089;&#1080;&#1083;&#1089;&#1103; &#1074; &#1079;&#1077;&#1083;&#1077;&#1085;&#1099;&#1081; &#1094;&#1074;&#1077;&#1090;, &#1090;&#1086;, &#1089;&#1082;&#1086;&#1088;&#1077;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086;, &#1086;&#1076;&#1085;&#1072; &#1080;&#1083;&#1080; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1090;&#1086;&#1095;&#1077;&#1082; &#1085;&#1077; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1072;&#1102;&#1090; (2 &#1090;&#1086;&#1095;&#1082;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1085;&#1072;&#1083;&#1086;&#1078;&#1077;&#1085;&#1099; &#1076;&#1088;&#1091;&#1075; &#1085;&#1072; &#1076;&#1088;&#1091;&#1075;&#1072;, &#1085;&#1086; &#1085;&#1077; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1072;&#1090;&#1100;). &#1042;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077; &#1084;&#1099;&#1096;&#1100;&#1102; &#1101;&#1090;&#1080; 2 &#1090;&#1086;&#1095;&#1082;&#1080; (&#1086;&#1082;&#1085;&#1086;&#1084; &#1079;&#1072;&#1093;&#1074;&#1072;&#1090;&#1072;) &#1080; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; <span typeof="mw:File"><a href="../index.php?title=Constraint_PointOnPoint.svg&amp;filetimestamp=20231231195749&amp;.html" class="mw-file-description"><img src="../File/Constraint_PointOnPoint.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Sketcher_ConstrainCoincident.html" title="Sketcher ConstrainCoincident/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1077;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1093; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;</a>. <i>&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;: &#1085;&#1077; &#1087;&#1077;&#1088;&#1077;&#1087;&#1091;&#1090;&#1072;&#1081;&#1090;&#1077; &#1080;&#1082;&#1086;&#1085;&#1082;&#1080; "&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1077;&#1085;&#1080;&#1103;..." &#1089; "&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1090;&#1086;&#1095;&#1082;&#1091; &#1085;&#1072; &#1101;&#1089;&#1082;&#1080;&#1079;&#1077;", &#1086;&#1085;&#1080; &#1093;&#1086;&#1090;&#1103; &#1086;&#1095;&#1077;&#1085;&#1100; &#1087;&#1086;&#1093;&#1086;&#1078;&#1080;, &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1103;&#1103; &#1080;&#1084;&#1077;&#1077;&#1090; &#1073;&#1086;&#1083;&#1077;&#1077; &#1082;&#1088;&#1091;&#1087;&#1085;&#1091;&#1102; &#1080;&#1082;&#1086;&#1085;&#1082;&#1091; &#1080; &#1086;&#1085;&#1072; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1086;&#1076;&#1080;&#1085;&#1086;&#1082;&#1091;&#1102; &#1090;&#1086;&#1095;&#1082;&#1091; &#1074; &#1101;&#1089;&#1082;&#1080;&#1079;.</i>
</p><p>&#1055;&#1088;&#1086;&#1081;&#1076;&#1080;&#1090;&#1077; &#1090;&#1072;&#1082; &#1087;&#1086; &#1074;&#1089;&#1077;&#1084; &#1085;&#1077; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1072;&#1102;&#1097;&#1080;&#1084; &#1090;&#1086;&#1095;&#1082;&#1072;&#1084;.
</p><p>&#1045;&#1089;&#1083;&#1080; &#1074;&#1072;&#1096; &#1101;&#1089;&#1082;&#1080;&#1079; &#1074;&#1089;&#1077; &#1077;&#1097;&#1077; &#1085;&#1077; &#1086;&#1082;&#1088;&#1072;&#1089;&#1080;&#1083;&#1089;&#1103; &#1074; &#1079;&#1077;&#1083;&#1077;&#1085;&#1099;&#1081; &#1094;&#1074;&#1077;&#1090;, &#1091;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1074;&#1089;&#1077; &#1083;&#1080;&#1085;&#1080;&#1080;, &#1082;&#1088;&#1086;&#1084;&#1077; &#1085;&#1072;&#1082;&#1083;&#1086;&#1085;&#1085;&#1099;&#1093;, &#1080;&#1084;&#1077;&#1102;&#1090; &#1079;&#1085;&#1072;&#1095;&#1082;&#1080; <span typeof="mw:File"><a href="../index.php?title=Constraint_Horizontal.svg&amp;filetimestamp=20231231195319&amp;.html" class="mw-file-description"><img src="../File/Constraint_Horizontal.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Sketcher_ConstrainHorizontal.html" title="Sketcher ConstrainHorizontal/ru">&#1043;&#1086;&#1088;&#1080;&#1079;&#1086;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086;</a> or <span typeof="mw:File"><a href="../index.php?title=Constraint_Vertical.svg&amp;filetimestamp=20231231200018&amp;.html" class="mw-file-description"><img src="../File/Constraint_Vertical.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Sketcher_ConstrainVertical.html" title="Sketcher ConstrainVertical/ru">&#1042;&#1077;&#1088;&#1090;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086;</a> &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103;. &#1045;&#1089;&#1083;&#1080; &#1090;&#1072;&#1082;&#1086;&#1075;&#1086; &#1079;&#1085;&#1072;&#1095;&#1082;&#1072; &#1085;&#1077;&#1090;, &#1087;&#1086;&#1087;&#1088;&#1072;&#1074;&#1100;&#1090;&#1077; &#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1083;&#1080;&#1085;&#1080;&#1080;.
</p><p><span id="Using_Pad_and_Pocket_features"></span>
</p>
<h3><span id=".D0.98.D1.81.D0.BF.D0.BE.D0.BB.D1.8C.D0.B7.D0.BE.D0.B2.D0.B0.D0.BD.D0.B8.D0.B5_.D0.B2.D0.BE.D0.B7.D0.BC.D0.BE.D0.B6.D0.BD.D0.BE.D1.81.D1.82.D0.B5.D0.B9_.D0.B2.D1.8B.D0.B4.D0.B0.D0.B2.D0.BB.D0.B8.D0.B2.D0.B0.D0.BD.D0.B8.D1.8F_.D0.B8_.D0.B2.D1.8B.D1.80.D0.B5.D0.B7.D0.BE.D0.B2"></span><span class="mw-headline" id="&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;_&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081;_&#1074;&#1099;&#1076;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103;_&#1080;_&#1074;&#1099;&#1088;&#1077;&#1079;&#1086;&#1074;">&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081; &#1074;&#1099;&#1076;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080; &#1074;&#1099;&#1088;&#1077;&#1079;&#1086;&#1074;</span></h3>
<p>&#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">Close</span> &#1085;&#1072; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; &#1079;&#1072;&#1076;&#1072;&#1095; &#1074; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1084; &#1083;&#1077;&#1074;&#1086;&#1084; &#1091;&#1075;&#1083;&#1091;. &#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;  <b>Sketcher</b> &#1079;&#1072;&#1082;&#1088;&#1086;&#1077;&#1090;&#1089;&#1103;, &#1080; &#1084;&#1099; &#1074;&#1077;&#1088;&#1085;&#1077;&#1084;&#1089;&#1103; &#1085;&#1072; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; <b>Part Design</b>, &#1072; &#1082;&#1086;&#1084;&#1073;&#1086; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1089;&#1103; &#1085;&#1072; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1091; <i>&#1052;&#1086;&#1076;&#1077;&#1083;&#1100;</i>. &#1045;&#1089;&#1083;&#1080; &#1085;&#1072; &#1085;&#1077;&#1081; &#1074;&#1099; &#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1083;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; <i>Body part1</i> &#1088;&#1072;&#1079;&#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1099;&#1084;, &#1074;&#1099; &#1091;&#1074;&#1080;&#1076;&#1080;&#1090;&#1077; &#1085;&#1086;&#1074;&#1099;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; <b>Sketch</b> &#1087;&#1086;&#1076; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084; <i>Origin</i>, &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1081; &#1074; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; <i>Body</i>.
</p><p>&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1076;&#1072;&#1074;&#1072;&#1081;&#1090;&#1077; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1084; &#1085;&#1072;&#1096; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;. &#1044;&#1072;&#1081;&#1090;&#1077; &#1077;&#1084;&#1091; &#1085;&#1086;&#1074;&#1086;&#1077; &#1080;&#1084;&#1103;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; "tutorial1" &#1080;&#1083;&#1080; &#1083;&#1102;&#1073;&#1086;&#1077; &#1076;&#1088;&#1091;&#1075;&#1086;&#1077;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1074;&#1099; &#1089;&#1086;&#1095;&#1090;&#1077;&#1090;&#1077; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1103;&#1097;&#1080;&#1084;. &#1061;&#1086;&#1088;&#1086;&#1096;&#1072;&#1103; &#1087;&#1088;&#1080;&#1074;&#1099;&#1095;&#1082;&#1072; &#1087;&#1086;&#1095;&#1072;&#1097;&#1077; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1100; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1089;&#1088;&#1072;&#1079;&#1091; &#1087;&#1086;&#1089;&#1083;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072;/&#1089;&#1082;&#1077;&#1090;&#1095;&#1072; &#1080;&#1083;&#1080; &#1087;&#1086;&#1089;&#1083;&#1077; &#1082;&#1072;&#1082;&#1080;&#1093;-&#1083;&#1080;&#1073;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081;.
</p><p>&#1050;&#1083;&#1080;&#1082;&#1085;&#1080;&#1090;&#1077; &#1084;&#1099;&#1096;&#1100;&#1102; &#1085;&#1072; &#1080;&#1082;&#1086;&#1085;&#1082;&#1077; <span typeof="mw:File"><a href="../index.php?title=Std_ViewIsometric.svg&amp;filetimestamp=20240704204910&amp;.html" class="mw-file-description"><img src="../File/Std_ViewIsometric.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b>&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1080;&#1079;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1074;&#1080;&#1076;</b>, &#1079;&#1072;&#1090;&#1077;&#1084; &#1085;&#1072; <span typeof="mw:File"><a href="../index.php?title=Std_ViewFitAll.svg&amp;filetimestamp=20240704204734&amp;.html" class="mw-file-description"><img src="../File/Std_ViewFitAll.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Std_ViewFitAll.html" title="Std ViewFitAll/ru">&#1059;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1074;&#1089;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085;&#1077;</a>. &#1053;&#1072;&#1096;&#1072; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1079;&#1080;&#1090;&#1089;&#1103; &#1087;&#1086;&#1089;&#1077;&#1088;&#1077;&#1076;&#1080;&#1085;&#1077; &#1086;&#1082;&#1085;&#1072; 3D &#1074;&#1080;&#1076;&#1072; &#1080; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1074;&#1080;&#1076;&#1085;&#1072;.
</p><p>&#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; <span typeof="mw:File"><a href="../index.php?title=PartDesign_Pad.svg&amp;filetimestamp=20240522201513&amp;.html" class="mw-file-description"><img src="../File/PartDesign_Pad.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/PartDesign_Pad.html" title="PartDesign Pad/ru">&#1042;&#1099;&#1076;&#1072;&#1074;&#1080;&#1090;&#1100; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1081; &#1101;&#1089;&#1082;&#1080;&#1079;</a> &#1080; &#1074;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1076;&#1083;&#1080;&#1085;&#1099; 30 &#1084;&#1084;. &#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">OK</span>, &#1076;&#1077;&#1090;&#1072;&#1083;&#1100; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090; &#1086;&#1073;&#1098;&#1077;&#1084;. &#1042; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1087;&#1086;&#1103;&#1074;&#1080;&#1090;&#1089;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; <b>Pad</b> (&#1077;&#1075;&#1086; &#1090;&#1072;&#1082;&#1078;&#1077; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086;&#1084;) &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; <i>Sketch</i>. &#1053;&#1072; &#1089;&#1072;&#1084;&#1086;&#1084; &#1076;&#1077;&#1083;&#1077; &#1077;&#1075;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1084; <i>Sketch</i>, &#1090;.&#1082;. &#1086;&#1085; &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085; &#1085;&#1072; &#1085;&#1077;&#1084;. &#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1084;&#1099;&#1096;&#1082;&#1086;&#1081; &#1079;&#1085;&#1072;&#1095;&#1086;&#1082; &#1089;&#1090;&#1088;&#1077;&#1083;&#1082;&#1080; &#1080;&#1083;&#1080; &#1087;&#1083;&#1102;&#1089;&#1080;&#1082;&#1072; &#1087;&#1077;&#1088;&#1077;&#1076; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1084; <i>Pad</i> &#1095;&#1090;&#1086;&#1073;&#1099; &#1088;&#1072;&#1079;&#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100; &#1077;&#1075;&#1086; &#1080; &#1074;&#1099; &#1091;&#1074;&#1080;&#1076;&#1080;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1086;&#1085; &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085; &#1085;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1077; <i>Sketch</i>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1089;&#1082;&#1088;&#1099;&#1090; (&#1087;&#1086;&#1084;&#1077;&#1095;&#1077;&#1085; &#1089;&#1077;&#1088;&#1099;&#1084; &#1094;&#1074;&#1077;&#1090;&#1086;&#1084;).
</p><p>&#1059; &#1085;&#1072;&#1089; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1083;&#1072;&#1089;&#1100; &#1074;&#1086;&#1090; &#1090;&#1072;&#1082;&#1072;&#1103; &#1076;&#1077;&#1090;&#1072;&#1083;&#1100;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=GGTuto1_5.PNG&amp;filetimestamp=20180409012958&amp;.html" class="mw-file-description"><img src="../File/GGTuto1_5.PNG" decoding="async" width="677" height="570" class="mw-file-element" data-file-width="677" data-file-height="570"></a><figcaption></figcaption></figure>
<p><b>&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1103;</b>
</p><p>&#1050;&#1083;&#1080;&#1082;&#1085;&#1080;&#1090;&#1077; &#1084;&#1099;&#1096;&#1100;&#1102; &#1085;&#1072; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1081; (&#1082;&#1074;&#1072;&#1076;&#1088;&#1072;&#1090;&#1085;&#1086;&#1081;) &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1080; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1082;&#1083;&#1080;&#1082;&#1085;&#1080;&#1090;&#1077; &#1085;&#1072; &#1080;&#1082;&#1086;&#1085;&#1082;&#1077; <span typeof="mw:File"><a href="../index.php?title=Sketcher_NewSketch.svg&amp;filetimestamp=20231231201726&amp;.html" class="mw-file-description"><img src="../File/Sketcher_NewSketch.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1081; &#1101;&#1089;&#1082;&#1080;&#1079;/&#1089;&#1082;&#1077;&#1090;&#1095;. FreeCAD &#1089;&#1086;&#1079;&#1076;&#1072;&#1089;&#1090; &#1085;&#1086;&#1074;&#1099;&#1081; &#1101;&#1089;&#1082;&#1080;&#1079;, &#1087;&#1088;&#1080;&#1082;&#1088;&#1077;&#1087;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1082; &#1101;&#1090;&#1086;&#1081; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1080;. &#1048;&#1090;&#1072;&#1082;, &#1084;&#1099; &#1089;&#1077;&#1081;&#1095;&#1072;&#1089; &#1085;&#1072; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080;, &#1087;&#1072;&#1088;&#1072;&#1083;&#1083;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080; XY, &#1085;&#1086; &#1074;&#1099;&#1096;&#1077; &#1077;&#1077; &#1085;&#1072; &#1074;&#1099;&#1089;&#1086;&#1090;&#1091; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080;, &#1090;.&#1077;. &#1085;&#1072; 50 &#1084;&#1084;.
</p><p>&#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100;&#1089;&#1103; &#1086;&#1082;&#1085;&#1086; 3D &#1074;&#1080;&#1076;&#1072; &#1085;&#1072; &#1080;&#1079;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1074;&#1080;&#1076; <span typeof="mw:File"><a href="../index.php?title=Std_ViewIsometric.svg&amp;filetimestamp=20240704204910&amp;.html" class="mw-file-description"><img src="../File/Std_ViewIsometric.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> &#1080;&#1083;&#1080; &#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1074;&#1080;&#1076; &#1089;&#1074;&#1077;&#1088;&#1093;&#1091; <span typeof="mw:File"><a href="../index.php?title=Std_ViewTop.svg&amp;filetimestamp=20240704205120&amp;.html" class="mw-file-description"><img src="../File/Std_ViewTop.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span>. &#1042; &#1083;&#1102;&#1073;&#1086;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100;&#1089;&#1103; &#1074; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088; &#1089;&#1082;&#1077;&#1090;&#1095;&#1072; (&#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100;&#1089;&#1103; &#1074; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1100; &#1089;&#1082;&#1077;&#1090;&#1095;&#1072;) &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1080;&#1082;&#1086;&#1085;&#1082;&#1091; <span typeof="mw:File"><a href="../index.php?title=Sketcher_ViewSketch.svg&amp;filetimestamp=20231231201925&amp;.html" class="mw-file-description"><img src="../File/Sketcher_ViewSketch.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Sketcher_ViewSketch.html" title="Sketcher ViewSketch/ru">&#1055;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072;</a>.
</p><p>&#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1086;&#1089;&#1085;&#1086;&#1074;&#1086;&#1081; &#1076;&#1083;&#1103; &#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1089;&#1082;&#1077;&#1090;&#1095;&#1072; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1089;&#1083;&#1091;&#1078;&#1080;&#1090; &#1089;&#1072;&#1084;&#1086; &#1090;&#1074;&#1077;&#1088;&#1076;&#1086;&#1077; &#1090;&#1077;&#1083;&#1086;. &#1054;&#1089;&#1085;&#1086;&#1074;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1088;&#1072;&#1079;&#1085;&#1086;&#1081;, &#1085;&#1086; &#1079;&#1076;&#1077;&#1089;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1090;&#1074;&#1077;&#1088;&#1076;&#1086;&#1077; &#1090;&#1077;&#1083;&#1086;.
</p><p>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; <span typeof="mw:File"><a href="../index.php?title=Sketcher_Circle.svg&amp;filetimestamp=20170323210933&amp;.html" class="mw-file-description"><img src="../File/Sketcher_Circle.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Sketcher_CreateCircle.html" title="Sketcher CreateCircle/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1086;&#1082;&#1088;&#1091;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074; &#1101;&#1089;&#1082;&#1080;&#1079;&#1077;</a> &#1082;&#1083;&#1080;&#1082;&#1085;&#1080;&#1090;&#1077; &#1084;&#1099;&#1096;&#1082;&#1086;&#1081; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1085;&#1086; &#1087;&#1086;&#1089;&#1077;&#1088;&#1077;&#1076;&#1080;&#1085;&#1077; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1080; &#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1082;&#1088;&#1091;&#1075; &#1083;&#1102;&#1073;&#1086;&#1075;&#1086; &#1088;&#1072;&#1076;&#1080;&#1091;&#1089;&#1072;.
</p><p>&#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1082;&#1088;&#1091;&#1075; &#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084; <span typeof="mw:File"><a href="../index.php?title=Constraint_Radius.svg&amp;filetimestamp=20231231195846&amp;.html" class="mw-file-description"><img src="../File/Constraint_Radius.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Sketcher_ConstrainRadius.html" title="Sketcher ConstrainRadius/ru">&#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1080;&#1090;&#1100; &#1076;&#1091;&#1075;&#1091; &#1080;&#1083;&#1080; &#1086;&#1082;&#1088;&#1091;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;</a> &#1089;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1076;&#1083;&#1103; &#1085;&#1077;&#1075;&#1086; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; &#1088;&#1072;&#1076;&#1080;&#1091;&#1089;&#1072;, &#1074;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; 5 &#1084;&#1084;.
</p><p>&#1052;&#1099;&#1096;&#1100;&#1102; &#1091;&#1082;&#1072;&#1078;&#1080;&#1090;&#1077; &#1094;&#1077;&#1085;&#1090;&#1088; &#1082;&#1088;&#1091;&#1075;&#1072; &#1080; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1085;&#1072; &#1080;&#1082;&#1086;&#1085;&#1082;&#1091; <span typeof="mw:File"><a href="../index.php?title=Sketcher_ConstrainLock.svg&amp;filetimestamp=20240101173404&amp;.html" class="mw-file-description"><img src="../File/Sketcher_ConstrainLock.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Sketcher_ConstrainLock.html" title="Sketcher ConstrainLock/ru">&#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;</a>. &#1047;&#1072;&#1090;&#1077;&#1084; &#1097;&#1077;&#1083;&#1082;&#1085;&#1080;&#1090;&#1077; &#1076;&#1074;&#1072;&#1078;&#1076;&#1099; &#1085;&#1072; &#1075;&#1086;&#1088;&#1080;&#1079;&#1086;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1085;&#1086;&#1081; &#1083;&#1080;&#1085;&#1080;&#1080; &#1080; &#1074;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; -65 &#1084;&#1084; (&#1079;&#1076;&#1077;&#1089;&#1100; &#1084;&#1099; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1102; &#1094;&#1077;&#1085;&#1090;&#1088;&#1072; &#1082;&#1088;&#1091;&#1075;&#1072; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090; &#1074; &#1101;&#1089;&#1082;&#1080;&#1079;&#1077;). &#1057;&#1076;&#1077;&#1083;&#1072;&#1081;&#1090;&#1077; &#1090;&#1086; &#1078;&#1077; &#1089;&#1072;&#1084;&#1086;&#1077; &#1089; &#1074;&#1077;&#1088;&#1090;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1085;&#1086;&#1081; &#1083;&#1080;&#1085;&#1080;&#1077;&#1081;, &#1074;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; &#1090;&#1072;&#1084; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; 15&#1084;&#1084;. &#1062;&#1077;&#1085;&#1090;&#1088; &#1082;&#1088;&#1091;&#1075;&#1072; &#1079;&#1072;&#1081;&#1084;&#1077;&#1090; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;&#1077; &#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1080; &#1101;&#1089;&#1082;&#1080;&#1079; &#1086;&#1082;&#1088;&#1072;&#1089;&#1080;&#1090;&#1089;&#1103; &#1074; &#1079;&#1077;&#1083;&#1077;&#1085;&#1099;&#1081; &#1094;&#1074;&#1077;&#1090;, &#1101;&#1090;&#1086; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;, &#1095;&#1090;&#1086; &#1074; &#1085;&#1077;&#1084; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1085;&#1077;&#1090; &#1085;&#1077;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081;:
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=GGTuto1_6.PNG&amp;filetimestamp=20180409013213&amp;.html" class="mw-file-description"><img src="../File/GGTuto1_6.PNG" decoding="async" width="604" height="516" class="mw-file-element" data-file-width="604" data-file-height="516"></a><figcaption></figcaption></figure>
<p>&#1047;&#1072;&#1082;&#1088;&#1086;&#1081;&#1090;&#1077; &#1101;&#1089;&#1082;&#1080;&#1079;. &#1042; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1085;&#1080;&#1078;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; "Pad" &#1087;&#1086;&#1103;&#1074;&#1080;&#1090;&#1089;&#1103; &#1085;&#1086;&#1074;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; <b>Sketch001</b>. &#1055;&#1086;&#1082;&#1072; Sketch001 &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;, &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1085;&#1072; <span typeof="mw:File"><a href="../index.php?title=PartDesign_Pocket.svg&amp;filetimestamp=20170324053209&amp;.html" class="mw-file-description"><img src="../File/PartDesign_Pocket.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/PartDesign_Pocket.html" title="PartDesign Pocket/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1074;&#1099;&#1088;&#1077;&#1079; &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072;</a>.
</p><p>&#1042;&#1099;&#1088;&#1077;&#1079; - &#1101;&#1090;&#1086; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1095;&#1072;&#1089;&#1090;&#1100; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080;. &#1057; &#1077;&#1075;&#1086; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1099; &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1084; &#1095;&#1072;&#1089;&#1090;&#1100; &#1074; &#1074;&#1080;&#1076;&#1077; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1072;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1085;&#1072; &#1101;&#1089;&#1082;&#1080;&#1079;&#1077; &#1091; &#1085;&#1072;&#1089; &#1085;&#1072;&#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085; &#1082;&#1088;&#1091;&#1075;. &#1042; &#1086;&#1082;&#1085;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1074;&#1099;&#1088;&#1077;&#1079;&#1072; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1090;&#1080;&#1087; "&#1053;&#1072;&#1089;&#1082;&#1074;&#1086;&#1079;&#1100;" &#1080; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">OK</span>. &#1042; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1082; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1091; "Body" &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1089;&#1103; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; <b>Pocket</b>, &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1085;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1077; "Sketch001".
</p><p><span id="Changing_color_and_transparency"></span>
</p>
<h3><span id=".D0.98.D0.B7.D0.BC.D0.B5.D0.BD.D0.B5.D0.BD.D0.B8.D0.B5_.D1.86.D0.B2.D0.B5.D1.82.D0.B0_.D0.B8_.D0.BF.D1.80.D0.BE.D0.B7.D1.80.D0.B0.D1.87.D0.BD.D0.BE.D1.81.D1.82.D0.B8"></span><span class="mw-headline" id="&#1048;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;_&#1094;&#1074;&#1077;&#1090;&#1072;_&#1080;_&#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080;">&#1048;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1094;&#1074;&#1077;&#1090;&#1072; &#1080; &#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080;</span></h3>
<p>&#1045;&#1089;&#1090;&#1100; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1094;&#1074;&#1077;&#1090; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080;, &#1095;&#1072;&#1089;&#1090;&#1086; &#1073;&#1099;&#1074;&#1072;&#1077;&#1090; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086; &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1076;&#1077;&#1090;&#1072;&#1083;&#1100; &#1089;&#1088;&#1077;&#1076;&#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093;. &#1058;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100; &#1080;&#1079;&#1076;&#1077;&#1083;&#1080;&#1103;, &#1095;&#1090;&#1086; &#1073;&#1099;&#1074;&#1072;&#1077;&#1090; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086; &#1076;&#1083;&#1103; &#1074;&#1080;&#1079;&#1091;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1077;&#1075;&#1086; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1093; &#1095;&#1072;&#1089;&#1090;&#1077;&#1081;.
</p>
<div class="mw-translate-fuzzy">
<p>&#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1090;&#1074;&#1077;&#1088;&#1076;&#1086;&#1077; &#1090;&#1077;&#1083;&#1086; <b>Body part1</b> &#1085;&#1072; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; "&#1052;&#1086;&#1076;&#1077;&#1083;&#1100;" &#1082;&#1086;&#1084;&#1073;&#1086; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080;. &#1042; &#1077;&#1077; &#1085;&#1080;&#1078;&#1085;&#1077;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080; &#1086;&#1090;&#1082;&#1088;&#1086;&#1081;&#1090;&#1077; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1091; "&#1042;&#1080;&#1076;" &#1080; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; <i>Shape Color</i> (&#1062;&#1074;&#1077;&#1090; &#1092;&#1080;&#1075;&#1091;&#1088;&#1099;). &#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1074;&#1072;&#1084; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1077;&#1088;&#1090;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1089;&#1082;&#1088;&#1086;&#1083;&#1083;&#1073;&#1072;&#1088; &#1089;&#1087;&#1088;&#1072;&#1074;&#1072;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1085;&#1072;&#1081;&#1090;&#1080; &#1077;&#1075;&#1086;. <i>&#1042;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1080;&#1090;&#1100; &#1089;&#1090;&#1086;&#1083;&#1073;&#1077;&#1094; &laquo;&#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086;&raquo;: &#1085;&#1072;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1084;&#1099;&#1096;&#1080; &#1085;&#1072; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1091;&#1102; &#1083;&#1080;&#1085;&#1080;&#1102; &#1084;&#1077;&#1078;&#1076;&#1091; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1072;&#1084;&#1080; &laquo;&#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086;&raquo; &#1080; &laquo;&#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&raquo;; &#1082;&#1086;&#1075;&#1076;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1087;&#1088;&#1077;&#1074;&#1088;&#1072;&#1090;&#1080;&#1090;&#1089;&#1103; &#1074; &#1076;&#1074;&#1091;&#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1102;&#1102; &#1089;&#1090;&#1088;&#1077;&#1083;&#1082;&#1091;, &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1080; &#1091;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1081;&#1090;&#1077; &#1083;&#1077;&#1074;&#1091;&#1102; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1084;&#1099;&#1096;&#1080; &#1080; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1097;&#1080;&#1090;&#1077; &#1077;&#1077; &#1074; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1091;, &#1079;&#1072;&#1090;&#1077;&#1084; &#1086;&#1090;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1077;.</i> &#1042; &#1082;&#1086;&#1083;&#1086;&#1085;&#1082;&#1077; "&#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;" &#1082;&#1083;&#1080;&#1082;&#1085;&#1080;&#1090;&#1077; &#1085;&#1072; &#1089;&#1077;&#1088;&#1086;&#1084; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;&#1077;, &#1086;&#1090;&#1082;&#1088;&#1086;&#1077;&#1090;&#1089;&#1103; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075; <b>&#1042;&#1099;&#1073;&#1086;&#1088; &#1094;&#1074;&#1077;&#1090;&#1072;</b>. &#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1094;&#1074;&#1077;&#1090; &#1080; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; OK. &#1047;&#1072;&#1090;&#1077;&#1084;, &#1089;&#1085;&#1086;&#1074;&#1072; &#1074;&#1086; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; "&#1042;&#1080;&#1076;" &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <i>Transparency</i> (&#1055;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;), &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1085;&#1072; 50 &#1080; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">Enter</span>. &#1053;&#1086;&#1083;&#1100; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1085;&#1077;&#1087;&#1088;&#1086;&#1079;&#1085;&#1072;&#1095;&#1085;&#1099;&#1081;, 100 - &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1099;&#1081;.
</p>
</div>
<p>&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1077; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080;. &#1069;&#1090;&#1086; &#1095;&#1072;&#1089;&#1090;&#1086; &#1073;&#1099;&#1074;&#1072;&#1077;&#1090; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1089;&#1082;&#1088;&#1099;&#1090;&#1099;&#1077; &#1080;&#1083;&#1080; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1077; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1080; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;.
</p><p>&#1042;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; "Line Color" (&#1062;&#1074;&#1077;&#1090; &#1083;&#1080;&#1085;&#1080;&#1080;) &#1080; "Line Width" (&#1058;&#1086;&#1083;&#1097;&#1080;&#1085;&#1072; &#1083;&#1080;&#1085;&#1080;&#1080;) &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1094;&#1074;&#1077;&#1090; &#1080; &#1090;&#1086;&#1083;&#1097;&#1080;&#1085;&#1091; &#1083;&#1080;&#1085;&#1080;&#1081; &#1082;&#1086;&#1085;&#1090;&#1091;&#1088;&#1086;&#1074; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080;.
</p>
<h3><span id=".D0.9F.D0.B5.D1.80.D0.B5.D0.BC.D0.B5.D1.89.D0.B5.D0.BD.D0.B8.D0.B5_.D0.B4.D0.B5.D1.82.D0.B0.D0.BB.D0.B8"></span><span class="mw-headline" id="&#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077;_&#1076;&#1077;&#1090;&#1072;&#1083;&#1080;">&#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080;</span></h3>
<p>&#1042;&#1086;&#1081;&#1076;&#1080;&#1090;&#1077; &#1074; &#1084;&#1077;&#1085;&#1102; <i>&#1042;&#1080;&#1076;</i> &#1080; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; <i>&#1055;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;/&#1089;&#1082;&#1088;&#1099;&#1090;&#1100; &#1086;&#1089;&#1080; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;</i>. &#1069;&#1090;&#1086; &#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1086;&#1089;&#1080; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;. &#1042;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1074; &#1086;&#1082;&#1085;&#1077; 3D &#1074;&#1080;&#1076;&#1072; &#1086;&#1089;&#1080; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090; X, Y &#1080; Z &#1082;&#1088;&#1072;&#1089;&#1085;&#1086;&#1075;&#1086;, &#1079;&#1077;&#1083;&#1077;&#1085;&#1086;&#1075;&#1086; &#1080; &#1089;&#1080;&#1085;&#1077;&#1075;&#1086; &#1094;&#1074;&#1077;&#1090;&#1072; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;. &#1054;&#1085;&#1080; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1086;&#1089;&#1090;&#1072;&#1102;&#1090;&#1089;&#1103; &#1085;&#1072; &#1084;&#1077;&#1089;&#1090;&#1077; &#1080; &#1087;&#1086;&#1084;&#1086;&#1075;&#1091;&#1090; &#1085;&#1072;&#1084; &#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1077;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1084;&#1099; &#1073;&#1091;&#1076;&#1077;&#1084; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1085;&#1077;&#1084; &#1080;&#1083;&#1080; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100; &#1076;&#1077;&#1090;&#1072;&#1083;&#1100;.
</p><p>&#1042; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1082;&#1083;&#1080;&#1082;&#1085;&#1080;&#1090;&#1077; &#1085;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1077; "Body". &#1042; &#1085;&#1080;&#1078;&#1085;&#1077;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080; &#1082;&#1086;&#1084;&#1073;&#1086; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1089;&#1083;&#1077;&#1074;&#1072; &#1074;&#1099; &#1091;&#1074;&#1080;&#1076;&#1080;&#1090;&#1077; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1086; &#1085;&#1080;&#1078;&#1077; (&#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1073;&#1099;&#1083;&#1072; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1072; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1072; <i>&#1044;&#1072;&#1085;&#1085;&#1099;&#1077;</i>):
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=GGTuto1_10.PNG&amp;filetimestamp=20180415051258&amp;.html" class="mw-file-description"><img src="../File/GGTuto1_10.PNG" decoding="async" width="550" height="302" class="mw-file-element" data-file-width="550" data-file-height="302"></a><figcaption></figcaption></figure>
<p>&#1050;&#1083;&#1080;&#1082;&#1085;&#1080;&#1090;&#1077; &#1085;&#1072; &#1084;&#1072;&#1083;&#1077;&#1085;&#1100;&#1082;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1077; &#1089; &#1090;&#1088;&#1077;&#1084;&#1103; &#1090;&#1086;&#1095;&#1082;&#1072;&#1084;&#1080;, &#1084;&#1085;&#1086;&#1075;&#1086;&#1090;&#1086;&#1095;&#1080;&#1077;&#1084;. &#1045;&#1089;&#1083;&#1080; &#1101;&#1090;&#1091; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1085;&#1077; &#1074;&#1080;&#1076;&#1085;&#1086;, &#1082;&#1083;&#1080;&#1082;&#1085;&#1080;&#1090;&#1077; &#1074; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1077; "&#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;" &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; "Placement" (&#1052;&#1077;&#1089;&#1090;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103;). &#1042; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1079;&#1072;&#1076;&#1072;&#1095; &#1086;&#1090;&#1082;&#1088;&#1086;&#1077;&#1090;&#1089;&#1103; &#1085;&#1086;&#1074;&#1086;&#1077; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086;. &#1057; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1089;&#1090;&#1088;&#1077;&#1083;&#1086;&#1082; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1080; &#1091;&#1075;&#1083;&#1099; &#1085;&#1072;&#1082;&#1083;&#1086;&#1085;&#1072; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080;. &#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1088;&#1072;&#1082;&#1091;&#1088;&#1089; 3D &#1074;&#1080;&#1076;&#1072; &#1086;&#1089;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077;&#1080;&#1079;&#1084;&#1077;&#1085;&#1085;&#1099;&#1084;.
</p><p>&#1044;&#1088;&#1091;&#1075;&#1086;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;: &#1074; &#1082;&#1086;&#1084;&#1073;&#1086; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; "Body" &#1080; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1085;&#1072; &#1085;&#1077;&#1084; &#1087;&#1088;&#1072;&#1074;&#1091;&#1102; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1084;&#1099;&#1096;&#1080;, &#1079;&#1072;&#1090;&#1077;&#1084; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; <i>&#1055;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;</i>. &#1042;&#1099; &#1091;&#1074;&#1080;&#1076;&#1080;&#1090;&#1077; &#1090;&#1072;&#1082;&#1091;&#1102; &#1082;&#1072;&#1088;&#1090;&#1080;&#1085;&#1082;&#1091;:
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=GGTuto1_11.PNG&amp;filetimestamp=20180415052048&amp;.html" class="mw-file-description"><img src="../File/GGTuto1_11.PNG" decoding="async" width="769" height="577" class="mw-file-element" data-file-width="769" data-file-height="577"></a><figcaption></figcaption></figure>
<p>&#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1083;&#1077;&#1074;&#1091;&#1102; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1084;&#1099;&#1096;&#1080; &#1085;&#1072; &#1082;&#1086;&#1085;&#1091;&#1089;&#1077; &#1080;&#1083;&#1080; &#1082;&#1088;&#1091;&#1078;&#1086;&#1095;&#1082;&#1077; &#1094;&#1074;&#1077;&#1090;&#1072; &#1085;&#1091;&#1078;&#1085;&#1086;&#1081; &#1074;&#1072;&#1084; &#1086;&#1089;&#1080; &#1080; &#1085;&#1077; &#1086;&#1090;&#1087;&#1091;&#1089;&#1082;&#1072;&#1103; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1072;&#1081;&#1090;&#1077; &#1076;&#1077;&#1090;&#1072;&#1083;&#1100; &#1074;&#1076;&#1086;&#1083;&#1100; &#1080;&#1083;&#1080; &#1074;&#1086;&#1082;&#1088;&#1091;&#1075; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1081; &#1086;&#1089;&#1080;.
</p><p>&#1042;&#1077;&#1088;&#1085;&#1080;&#1090;&#1077; &#1091;&#1075;&#1083;&#1099; &#1080; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1099; &#1074; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;.
</p><p><span id="Displaying_reference_dimensions_in_the_sketch"></span>
</p>
<h3><span id=".D0.9E.D1.82.D0.BE.D0.B1.D1.80.D0.B0.D0.B6.D0.B5.D0.BD.D0.B8.D0.B5_.D1.80.D0.B0.D0.B7.D0.BC.D0.B5.D1.80.D0.BE.D0.B2_.D0.BD.D0.B0_.D1.8D.D1.81.D0.BA.D0.B8.D0.B7.D0.B5"></span><span class="mw-headline" id="&#1054;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;_&#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074;_&#1085;&#1072;_&#1101;&#1089;&#1082;&#1080;&#1079;&#1077;">&#1054;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074; &#1085;&#1072; &#1101;&#1089;&#1082;&#1080;&#1079;&#1077;</span></h3>
<p>&#1048;&#1085;&#1086;&#1075;&#1076;&#1072; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086; &#1079;&#1085;&#1072;&#1090;&#1100; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1076;&#1077;&#1090;&#1072;&#1083;&#1077;&#1081; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072;, &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1088;&#1072;&#1089;&#1095;&#1077;&#1090;&#1085;&#1099;&#1093;. &#1048;&#1093; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1076;&#1083;&#1103; &#1089;&#1087;&#1088;&#1072;&#1074;&#1082;&#1080; &#1080;&#1083;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1083;&#1103; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074;.
</p><p>&#1042; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1088;&#1072;&#1089;&#1082;&#1088;&#1086;&#1081;&#1090;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; <i>Body part1</i>, &#1079;&#1072;&#1090;&#1077;&#1084; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1081; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; <i>Pad</i>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1073;&#1099;&#1083;&#1086; &#1074;&#1080;&#1076;&#1085;&#1086; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1101;&#1089;&#1082;&#1080;&#1079; "Sketch". &#1044;&#1074;&#1072;&#1078;&#1076;&#1099; &#1097;&#1077;&#1083;&#1082;&#1085;&#1080;&#1090;&#1077; &#1085;&#1072; &#1085;&#1077;&#1084; (&#1080;&#1083;&#1080; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1087;&#1088;&#1072;&#1074;&#1091;&#1102; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1084;&#1099;&#1096;&#1080; &#1080; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; <i>&#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1101;&#1089;&#1082;&#1080;&#1079;</i> &#1074; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1085;&#1086;&#1084; &#1084;&#1077;&#1085;&#1102;), &#1079;&#1072;&#1090;&#1077;&#1084; &#1082;&#1083;&#1080;&#1082;&#1085;&#1080;&#1090;&#1077; <span typeof="mw:File"><a href="../index.php?title=Sketcher_ToggleConstraint.svg&amp;filetimestamp=20231231200147&amp;.html" class="mw-file-description"><img src="../File/Sketcher_ToggleConstraint.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Sketcher_ToggleDrivingConstraint.html" title="Sketcher ToggleDrivingConstraint/ru">&#1055;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077;/&#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077;</a>. (<b>&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;:</b> &#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1101;&#1082;&#1088;&#1072;&#1085;&#1072; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072; &#1101;&#1090;&#1086;&#1090; &#1079;&#1085;&#1072;&#1095;&#1086;&#1082; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1085;&#1077; &#1074;&#1080;&#1076;&#1077;&#1085;. &#1045;&#1089;&#1083;&#1080; &#1077;&#1075;&#1086; &#1085;&#1077; &#1074;&#1080;&#1076;&#1085;&#1086;, &#1089; &#1087;&#1088;&#1072;&#1074;&#1086;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; "&#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072;" &#1077;&#1089;&#1090;&#1100; &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">&raquo;</span>. &#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1077;&#1105;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1089;&#1082;&#1088;&#1099;&#1090;&#1099;&#1077; &#1080;&#1082;&#1086;&#1085;&#1082;&#1080;.). &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1089;&#1087;&#1088;&#1072;&#1074;&#1086;&#1095;&#1085;&#1099;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099;, &#1072; &#1085;&#1077; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074;. &#1054;&#1085;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1089;&#1080;&#1085;&#1080;&#1084;&#1080; &#1080; &#1085;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1074;&#1083;&#1080;&#1103;&#1090;&#1100; &#1085;&#1072; &#1092;&#1086;&#1088;&#1084;&#1099; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072;, &#1080;&#1079; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1086;&#1085;&#1080; &#1074;&#1079;&#1103;&#1090;&#1099;, &#1086;&#1085;&#1080; &#1088;&#1072;&#1089;&#1089;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;.
</p><p>&#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1101;&#1090;&#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099;:
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=GGTuto1_7.PNG&amp;filetimestamp=20180415024239&amp;.html" class="mw-file-description"><img src="../File/GGTuto1_7.PNG" decoding="async" width="922" height="671" class="mw-file-element" data-file-width="922" data-file-height="671"></a><figcaption></figcaption></figure>
<p>&#1052;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1074;&#1080;&#1076;&#1077;&#1090;&#1100;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1095;&#1090;&#1086; &#1076;&#1091;&#1075;&#1072; &#1080;&#1084;&#1077;&#1077;&#1090; &#1076;&#1083;&#1080;&#1085;&#1091; 20, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1086;&#1085;&#1072; &#1082;&#1072;&#1089;&#1072;&#1077;&#1090;&#1089;&#1103; &#1088;&#1077;&#1073;&#1077;&#1088;.
</p><p>&#1058;&#1072;&#1082;&#1078;&#1077; &#1074;&#1080;&#1076;&#1085;&#1086;, &#1095;&#1090;&#1086; FreeCAD &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1090; &#1083;&#1077;&#1074;&#1091;&#1102; &#1075;&#1088;&#1072;&#1085;&#1100; (50-50xTAN 30&deg;) &#1080; &#1088;&#1072;&#1089;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1086;&#1090; &#1094;&#1077;&#1085;&#1090;&#1088;&#1072; &#1076;&#1091;&#1075;&#1080; &#1076;&#1086; &#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;.
</p><p><span id="Editing_one_or_more_dimensions"></span>
</p>
<h3><span id=".D0.98.D0.B7.D0.BC.D0.B5.D0.BD.D0.B5.D0.BD.D0.B8.D0.B5_.D0.BE.D0.B4.D0.BD.D0.BE.D0.B3.D0.BE_.D0.B8.D0.BB.D0.B8_.D0.BD.D0.B5.D1.81.D0.BA.D0.BE.D0.BB.D1.8C.D0.BA.D0.B8.D1.85_.D1.80.D0.B0.D0.B7.D0.BC.D0.B5.D1.80.D0.BE.D0.B2"></span><span class="mw-headline" id="&#1048;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;_&#1086;&#1076;&#1085;&#1086;&#1075;&#1086;_&#1080;&#1083;&#1080;_&#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093;_&#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074;">&#1048;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1083;&#1080; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074;</span></h3>
<p>&#1042; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1077; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1074;&#1072;&#1088;&#1100;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;. &#1069;&#1090;&#1086; &#1086;&#1095;&#1077;&#1085;&#1100; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;: &#1076;&#1083;&#1103; &#1090;&#1086;&#1083;&#1097;&#1080;&#1085;&#1099; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080; &#1076;&#1074;&#1072;&#1078;&#1076;&#1099; &#1097;&#1077;&#1083;&#1082;&#1085;&#1080;&#1090;&#1077; Pad, &#1079;&#1072;&#1090;&#1077;&#1084; &#1074;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; &#1085;&#1086;&#1074;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, 40 &#1084;&#1084;. &#1042; &#1085;&#1080;&#1078;&#1085;&#1077;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080; &#1082;&#1086;&#1084;&#1073;&#1086; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1074;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1101;&#1090;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;. &#1055;&#1086;&#1076;&#1090;&#1074;&#1077;&#1088;&#1076;&#1080;&#1090;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1080; &#1092;&#1086;&#1088;&#1084;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1089;&#1103;.
</p><p>&#1058;&#1072;&#1082; &#1078;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1076;&#1083;&#1080;&#1085;&#1091; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080;: &#1097;&#1077;&#1083;&#1082;&#1085;&#1080;&#1090;&#1077; &#1076;&#1074;&#1072;&#1078;&#1076;&#1099; &#1084;&#1099;&#1096;&#1100;&#1102; &#1085;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1077; "Sketch", &#1079;&#1072;&#1090;&#1077;&#1084; &#1076;&#1074;&#1072;&#1078;&#1076;&#1099; &#1085;&#1072; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1080;&#1090;&#1077;&#1083;&#1077; &#1076;&#1083;&#1080;&#1085;&#1099; &#1074; 100 &#1084;&#1084;, &#1080; &#1074;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; &#1085;&#1086;&#1074;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;  110 &#1084;&#1084;. &#1047;&#1072;&#1090;&#1077;&#1084; &#1087;&#1086;&#1076;&#1090;&#1074;&#1077;&#1088;&#1076;&#1080;&#1090;&#1077;.
</p><p>&#1052;&#1099; &#1074;&#1080;&#1076;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1076;&#1077;&#1090;&#1072;&#1083;&#1100; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1083;&#1072;&#1089;&#1100;, &#1085;&#1086; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1077; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1085;&#1077; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1094;&#1077;&#1085;&#1090;&#1088;&#1077; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1081; &#1075;&#1088;&#1072;&#1085;&#1080;. &#1069;&#1090;&#1086; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091;, &#1095;&#1090;&#1086; &#1077;&#1075;&#1086; &#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1073;&#1099;&#1083;&#1086; &#1079;&#1072;&#1076;&#1072;&#1085;&#1086; &#1085;&#1072; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1084; &#1101;&#1089;&#1082;&#1080;&#1079;&#1077;. &#1053;&#1077; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;, &#1085;&#1086; &#1089;&#1082;&#1086;&#1088;&#1077;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086; &#1085;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1077; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1086;&#1089;&#1090;&#1072;&#1074;&#1072;&#1083;&#1086;&#1089;&#1100; &#1073;&#1099; &#1074; &#1094;&#1077;&#1085;&#1090;&#1088;&#1077; &#1075;&#1088;&#1072;&#1085;&#1080;, &#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1077;&#1105; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1089;&#1103;.
</p><p><br>
</p>
<h3><span id=".D0.A6.D0.B5.D0.BD.D1.82.D1.80.D0.B8.D1.80.D0.BE.D0.B2.D0.B0.D0.BD.D0.B8.D0.B5_.D0.BE.D1.82.D0.B2.D0.B5.D1.80.D1.81.D1.82.D0.B8.D1.8F"></span><span class="mw-headline" id="&#1062;&#1077;&#1085;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;_&#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1103;">&#1062;&#1077;&#1085;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1103;</span></h3>
<p><b>&#1055;&#1077;&#1088;&#1074;&#1099;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1081; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080;.</b>
</p><p>&#1055;&#1077;&#1088;&#1077;&#1081;&#1076;&#1080;&#1090;&#1077; &#1089;&#1085;&#1086;&#1074;&#1072; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1081; &#1075;&#1088;&#1072;&#1085;&#1080; &#1080; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1077; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1103; &#1087;&#1086; &#1075;&#1086;&#1088;&#1080;&#1079;&#1086;&#1085;&#1090;&#1072;&#1083;&#1080; &#1080; &#1074;&#1077;&#1088;&#1090;&#1080;&#1082;&#1072;&#1083;&#1080;.
</p><p>&#1047;&#1072;&#1090;&#1077;&#1084; &#1082;&#1083;&#1080;&#1082;&#1085;&#1080;&#1090;&#1077; &#1085;&#1072; &#1080;&#1082;&#1086;&#1085;&#1082;&#1077; <span typeof="mw:File"><a href="../index.php?title=Sketcher_External.svg&amp;filetimestamp=20240101091332&amp;.html" class="mw-file-description"><img src="../File/Sketcher_External.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Sketcher_External.html" title="Sketcher External/ru">&#1044;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1074;&#1085;&#1077;&#1096;&#1085;&#1102;&#1102; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1102;</a>.
</p><p>&#1057;&#1086;&#1079;&#1076;&#1072;&#1076;&#1080;&#1084; &#1085;&#1072; &#1101;&#1089;&#1082;&#1080;&#1079;&#1077; &#1076;&#1074;&#1077; &#1083;&#1080;&#1085;&#1080;&#1080;. &#1054;&#1085;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1084;&#1080; &#1087;&#1086; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1102; &#1082; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;.
</p><p>&#1042;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077; &#1084;&#1099;&#1096;&#1100;&#1102; &#1088;&#1077;&#1073;&#1088;&#1086; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1081; &#1075;&#1088;&#1072;&#1085;&#1080; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1088;&#1077;&#1073;&#1088;&#1086; &#1089;&#1086; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099; &#1092;&#1072;&#1089;&#1082;&#1080;.
</p><p>&#1053;&#1072;&#1076; &#1088;&#1077;&#1073;&#1088;&#1086;&#1084; &#1087;&#1086;&#1103;&#1074;&#1080;&#1090;&#1089;&#1103; &#1083;&#1080;&#1085;&#1080;&#1103; &#1087;&#1091;&#1088;&#1087;&#1091;&#1088;&#1085;&#1086;&#1075;&#1086; &#1094;&#1074;&#1077;&#1090;&#1072;. &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1090;&#1072;&#1082; &#1078;&#1077; &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077; &#1088;&#1077;&#1073;&#1088;&#1086; &#1089;&#1086; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099; &#1089;&#1082;&#1088;&#1091;&#1075;&#1083;&#1077;&#1085;&#1080;&#1103;.
</p><p>&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1101;&#1090;&#1080; &#1074;&#1089;&#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1083;&#1080;&#1085;&#1080;&#1080;, &#1090;&#1086;&#1095;&#1085;&#1077;&#1077; &#1080;&#1093; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1099;&#1077; &#1090;&#1086;&#1095;&#1082;&#1080;, &#1076;&#1083;&#1103; &#1094;&#1077;&#1085;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1082;&#1088;&#1091;&#1075;&#1072;. &#1053;&#1086; &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1085;&#1091;&#1078;&#1085;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1077;&#1097;&#1077; &#1076;&#1074;&#1077; &#1074;&#1089;&#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1083;&#1080;&#1085;&#1080;&#1080; &#1087;&#1086; &#1076;&#1080;&#1072;&#1075;&#1086;&#1085;&#1072;&#1083;&#1080;.
</p><p>&#1050;&#1083;&#1080;&#1082;&#1085;&#1091;&#1074; &#1084;&#1099;&#1096;&#1082;&#1086;&#1081; &#1085;&#1072; &#1080;&#1082;&#1086;&#1085;&#1082;&#1077; <span typeof="mw:File"><a href="../index.php?title=Sketcher_ToggleConstruction.svg&amp;filetimestamp=20240228175128&amp;.html" class="mw-file-description"><img src="../File/Sketcher_ToggleConstruction.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Sketcher_ToggleConstruction.html" title="Sketcher ToggleConstruction/ru">&#1055;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1080;&#1083;&#1080; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1091;&#1102; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1102; &#1074;/&#1080;&#1079; &#1088;&#1077;&#1078;&#1080;&#1084; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072;</a>, &#1084;&#1099; &#1087;&#1077;&#1088;&#1077;&#1081;&#1076;&#1077;&#1084; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080;: &#1083;&#1080;&#1085;&#1080;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1099; &#1073;&#1091;&#1076;&#1077;&#1084; &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1090;&#1100; &#1073;&#1091;&#1076;&#1091;&#1090; &#1075;&#1086;&#1083;&#1091;&#1073;&#1086;&#1075;&#1086; &#1094;&#1074;&#1077;&#1090;&#1072; &#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1074;&#1080;&#1076;&#1085;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072;. &#1057; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1090;&#1072;&#1082;&#1080;&#1093; &#1076;&#1080;&#1072;&#1075;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1083;&#1080;&#1085;&#1080;&#1081; &#1084;&#1099; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1084; &#1094;&#1077;&#1085;&#1090;&#1088; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1103;. &#1057;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1080;&#1093; &#1090;&#1072;&#1082;, &#1082;&#1072;&#1082; &#1076;&#1077;&#1083;&#1072;&#1083;&#1080; &#1101;&#1090;&#1086; &#1088;&#1072;&#1085;&#1100;&#1096;&#1077;. &#1059;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1074;&#1089;&#1077; &#1082;&#1086;&#1085;&#1094;&#1099; &#1083;&#1080;&#1085;&#1080;&#1081; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1072;&#1102;&#1090;.
</p><p>&#1047;&#1072;&#1090;&#1077;&#1084; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1094;&#1077;&#1085;&#1090;&#1088; &#1082;&#1088;&#1091;&#1075;&#1072;, &#1086;&#1073;&#1077; &#1076;&#1080;&#1072;&#1075;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1083;&#1080;&#1085;&#1080;&#1080;, &#1080; &#1082;&#1083;&#1080;&#1082;&#1085;&#1080;&#1090;&#1077; &#1085;&#1072; &#1080;&#1082;&#1086;&#1085;&#1082;&#1077; <span typeof="mw:File"><a href="../index.php?title=Constraint_PointOnObject.svg&amp;filetimestamp=20231231195734&amp;.html" class="mw-file-description"><img src="../File/Constraint_PointOnObject.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Sketcher_ConstrainPointOnObject.html" title="Sketcher ConstrainPointOnObject/ru">&#1055;&#1088;&#1080;&#1074;&#1103;&#1079;&#1072;&#1090;&#1100; &#1090;&#1086;&#1095;&#1082;&#1091; &#1082; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1091;</a>, &#1094;&#1077;&#1085;&#1090;&#1088; &#1082;&#1088;&#1091;&#1075;&#1072; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1089;&#1103; &#1074; &#1090;&#1086;&#1095;&#1082;&#1091; &#1087;&#1077;&#1088;&#1077;&#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1076;&#1080;&#1072;&#1075;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1083;&#1080;&#1085;&#1080;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1080; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1094;&#1077;&#1085;&#1090;&#1088;&#1086;&#1084; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1081; &#1075;&#1088;&#1072;&#1085;&#1080;.
&#1069;&#1089;&#1082;&#1080;&#1079; &#1089;&#1090;&#1072;&#1085;&#1077;&#1090; &#1079;&#1077;&#1083;&#1077;&#1085;&#1099;&#1084;, &#1090;.&#1077;. &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1079;&#1072;&#1092;&#1080;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1084;. &#1069;&#1090;&#1086; &#1074;&#1072;&#1078;&#1085;&#1086;. &#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1087;&#1086;&#1084;&#1080;&#1084;&#1086; &#1088;&#1072;&#1076;&#1080;&#1091;&#1089;&#1072; &#1086;&#1082;&#1088;&#1091;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1085;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1085;&#1080;&#1082;&#1072;&#1082;&#1080;&#1093; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1085;&#1099;&#1093; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1081;.
</p><p>&#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; <span typeof="mw:File"><a href="../index.php?title=Sketcher_ToggleConstruction.svg&amp;filetimestamp=20240228175128&amp;.html" class="mw-file-description"><img src="../File/Sketcher_ToggleConstruction.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Sketcher_ToggleConstruction.html" title="Sketcher ToggleConstruction/ru">&#1055;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1080;&#1083;&#1080; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1091;&#1102; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1102; &#1074;/&#1080;&#1079; &#1088;&#1077;&#1078;&#1080;&#1084; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072;</a> &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1100; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080; &#1080; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072;, &#1077;&#1089;&#1083;&#1080; &#1086;&#1085;&#1080; &#1073;&#1099;&#1083;&#1080; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1099;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080;, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1086;&#1096;&#1080;&#1073;&#1082;&#1091; &#1087;&#1088;&#1080; &#1074;&#1099;&#1093;&#1086;&#1076;&#1077; &#1080;&#1079; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=GGTuto1_8.PNG&amp;filetimestamp=20180415032841&amp;.html" class="mw-file-description"><img src="../File/GGTuto1_8.PNG" decoding="async" width="875" height="655" class="mw-file-element" data-file-width="875" data-file-height="655"></a><figcaption></figcaption></figure>
<p>&#1042;&#1099;&#1081;&#1076;&#1077;&#1084; &#1080;&#1079; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072;. &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1084;&#1099; &#1074;&#1080;&#1076;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1077; &#1094;&#1077;&#1085;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1086; &#1085;&#1072; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1081; &#1075;&#1088;&#1072;&#1085;&#1080; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1089;&#1085;&#1086;&#1074;&#1072; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080;, &#1090;&#1086;&#1083;&#1097;&#1080;&#1085;&#1091; &#1080;&#1083;&#1080; &#1076;&#1083;&#1080;&#1085;&#1091;, &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1077; &#1086;&#1089;&#1090;&#1072;&#1085;&#1077;&#1090;&#1089;&#1103; &#1074; &#1094;&#1077;&#1085;&#1090;&#1088;&#1077; &#1075;&#1088;&#1072;&#1085;&#1080;.
</p><p><b>&#1057;&#1086;&#1082;&#1088;&#1099;&#1090;&#1080;&#1077; &#1074;&#1089;&#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1083;&#1080;&#1085;&#1080;&#1081;:</b>
</p><p>&#1048;&#1085;&#1086;&#1075;&#1076;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1073;&#1086;&#1081;&#1090;&#1080;&#1089;&#1100; &#1073;&#1077;&#1079; &#1074;&#1089;&#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1083;&#1080;&#1085;&#1080;&#1081;. &#1054;&#1090;&#1082;&#1088;&#1086;&#1081;&#1090;&#1077; &#1101;&#1089;&#1082;&#1080;&#1079; &#1089;&#1085;&#1086;&#1074;&#1072;, &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1077; &#1074;&#1089;&#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1083;&#1080;&#1085;&#1080;&#1080; &#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; <span typeof="mw:File"><a href="../index.php?title=Constraint_Symmetric.svg&amp;filetimestamp=20231231195931&amp;.html" class="mw-file-description"><img src="../File/Constraint_Symmetric.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Sketcher_ConstrainSymmetric.html" title="Sketcher ConstrainSymmetric/ru">&#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089;&#1080;&#1084;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080;</a> &#1084;&#1077;&#1078;&#1076;&#1091; &#1076;&#1074;&#1091;&#1084;&#1103; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1086;&#1087;&#1086;&#1083;&#1086;&#1078;&#1085;&#1099;&#1084;&#1080; &#1082;&#1086;&#1085;&#1094;&#1072;&#1084;&#1080; &#1083;&#1080;&#1085;&#1080;&#1081; &#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1081; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080; &#1080; &#1094;&#1077;&#1085;&#1090;&#1088;&#1086;&#1084; &#1082;&#1088;&#1091;&#1075;&#1072; (&#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1090;&#1086;&#1095;&#1082;&#1080; &#1074; &#1101;&#1090;&#1086;&#1084; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077;):
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=GGTuto1_12.PNG&amp;filetimestamp=20180416033300&amp;.html" class="mw-file-description"><img src="../File/GGTuto1_12.PNG" decoding="async" width="867" height="660" class="mw-file-element" data-file-width="867" data-file-height="660"></a><figcaption></figcaption></figure>
<p>&#1052;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1083;&#1080; &#1094;&#1077;&#1085;&#1090;&#1088; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1103; &#1090;&#1086;&#1095;&#1085;&#1086; &#1074; &#1090;&#1086;&#1084; &#1078;&#1077; &#1084;&#1077;&#1089;&#1090;&#1077;. &#1048;&#1090;&#1072;&#1082;, &#1073;&#1083;&#1072;&#1075;&#1086;&#1076;&#1072;&#1088;&#1103; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1081;, &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1093; &#1074; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1077; Sketcher, &#1077;&#1089;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074; &#1088;&#1077;&#1096;&#1080;&#1090;&#1100; &#1086;&#1076;&#1085;&#1091; &#1080; &#1090;&#1091; &#1078;&#1077; &#1079;&#1072;&#1076;&#1072;&#1095;&#1091;. &#1069;&#1090;&#1086;&#1090; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1095;&#1072;&#1089;&#1090;&#1086; &#1083;&#1091;&#1095;&#1096;&#1077; &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1089;&#1090;&#1077;&#1081;&#1096;&#1080;&#1081; &#1084;&#1077;&#1090;&#1086;&#1076;, &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1080;&#1074; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1080; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1085;&#1091;&#1090;&#1100;.
</p><p><b>&#1042;&#1090;&#1086;&#1088;&#1086;&#1081; &#1084;&#1077;&#1090;&#1086;&#1076; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1086;&#1087;&#1086;&#1088;&#1085;&#1086;&#1081; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080;.</b>
</p><p>&#1045;&#1089;&#1090;&#1100; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081;, &#1073;&#1086;&#1083;&#1077;&#1077; &#1073;&#1099;&#1089;&#1090;&#1088;&#1099;&#1081; &#1084;&#1077;&#1090;&#1086;&#1076;, &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1081; &#1089; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 0.17: &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1086;&#1087;&#1086;&#1088;&#1085;&#1086;&#1081; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080; &#1075;&#1088;&#1072;&#1085;&#1080;.
</p><p>&#1057;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1085;&#1072; &#1050;&#1086;&#1084;&#1073;&#1086; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; "Pocket" &#1074;&#1084;&#1077;&#1089;&#1090;&#1077; &#1089; &#1101;&#1089;&#1082;&#1080;&#1079;&#1086;&#1084; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1103;. &#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1074;&#1077;&#1088;&#1093;&#1085;&#1102;&#1102; &#1075;&#1088;&#1072;&#1085;&#1100; &#1080; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; <span typeof="mw:File"><a href="../index.php?title=PartDesign_Point.svg&amp;filetimestamp=20240405093024&amp;.html" class="mw-file-description"><img src="../File/PartDesign_Point.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/PartDesign_Point.html" title="PartDesign Point/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1086;&#1087;&#1086;&#1088;&#1085;&#1091;&#1102; &#1090;&#1086;&#1095;&#1082;&#1091;</a>: &#1087;&#1086;&#1103;&#1074;&#1080;&#1090;&#1089;&#1103; &#1086;&#1087;&#1086;&#1088;&#1085;&#1072;&#1103; &#1090;&#1086;&#1095;&#1082;&#1072; &#1085;&#1072; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1081; &#1075;&#1088;&#1072;&#1085;&#1080; &#1090;&#1077;&#1083;&#1072;. &#1056;&#1077;&#1078;&#1080;&#1084; &#1087;&#1088;&#1080;&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; "&#1062;&#1077;&#1085;&#1090;&#1088; &#1084;&#1072;&#1089;&#1089;".
</p><p>&#1058;.&#1082;. &#1075;&#1088;&#1072;&#1085;&#1100; &#1090;&#1077;&#1083;&#1072; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1072;&#1103;, &#1077;&#1077; &#1094;&#1077;&#1085;&#1090;&#1088; &#1084;&#1072;&#1089;&#1089; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1072;&#1077;&#1090; &#1089; &#1094;&#1077;&#1085;&#1090;&#1088;&#1086;&#1084; &#1077;&#1077; &#1076;&#1080;&#1072;&#1075;&#1086;&#1085;&#1072;&#1083;&#1077;&#1081;. &#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; "Ok" &#1080; &#1085;&#1072; &#1075;&#1088;&#1072;&#1085;&#1080; &#1087;&#1086;&#1103;&#1074;&#1080;&#1090;&#1089;&#1103; &#1086;&#1087;&#1086;&#1088;&#1085;&#1072;&#1103; &#1090;&#1086;&#1095;&#1082;&#1072;.
</p><p>&#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1074;&#1077;&#1088;&#1093;&#1085;&#1102;&#1102; &#1075;&#1088;&#1072;&#1085;&#1100; &#1089;&#1085;&#1086;&#1074;&#1072; &#1080; &#1076;&#1077;&#1088;&#1078;&#1072; &#1085;&#1072;&#1078;&#1072;&#1090;&#1086;&#1081; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1091; CTRL, &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1090;&#1086;&#1095;&#1082;&#1091;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1074;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1095;&#1090;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1083;&#1080; &#1085;&#1072; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;, &#1079;&#1072;&#1090;&#1077;&#1084; &#1086;&#1090;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1077; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1091; CTRL &#1080; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077;  <span typeof="mw:File"><a href="../index.php?title=PartDesign_Plane.svg&amp;filetimestamp=20170324054826&amp;.html" class="mw-file-description"><img src="../File/PartDesign_Plane.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/PartDesign_Plane.html" title="PartDesign Plane/ru">&#1054;&#1087;&#1086;&#1088;&#1085;&#1072;&#1103; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1100;</a>. &#1055;&#1086;&#1103;&#1074;&#1080;&#1090;&#1089;&#1103; &#1086;&#1087;&#1086;&#1088;&#1085;&#1072;&#1103; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1100;, &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1072;&#1102;&#1097;&#1072;&#1103; &#1089; &#1086;&#1087;&#1086;&#1088;&#1085;&#1086;&#1081; &#1090;&#1086;&#1095;&#1082;&#1086;&#1081; &#1080; &#1075;&#1088;&#1072;&#1085;&#1100;&#1102;. &#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; "Ok".
</p><p>&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1086;&#1095;&#1077;&#1085;&#1100; &#1083;&#1077;&#1075;&#1082;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1094;&#1077;&#1085;&#1090;&#1088; &#1082;&#1088;&#1091;&#1075;&#1072;! &#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1085;&#1072; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; &#1080;&#1083;&#1080; &#1085;&#1072; 3D &#1074;&#1080;&#1076;&#1077; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1100;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1074;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1095;&#1090;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1083;&#1080; &#1080; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; <span typeof="mw:File"><a href="../index.php?title=Sketcher_NewSketch.svg&amp;filetimestamp=20231231201726&amp;.html" class="mw-file-description"><img src="../File/Sketcher_NewSketch.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Sketcher_NewSketch.html" title="Sketcher NewSketch/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1081; &#1101;&#1089;&#1082;&#1080;&#1079;</a>, &#1087;&#1086;&#1103;&#1074;&#1080;&#1090;&#1089;&#1103; &#1101;&#1089;&#1082;&#1080;&#1079; &#1085;&#1072; &#1086;&#1087;&#1086;&#1088;&#1085;&#1086;&#1081; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080; &#1089; &#1085;&#1072;&#1095;&#1072;&#1083;&#1086;&#1084; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090; &#1074; &#1086;&#1087;&#1086;&#1088;&#1085;&#1086;&#1081; &#1090;&#1086;&#1095;&#1082;&#1077;. &#1047;&#1072;&#1090;&#1077;&#1084; &#1089;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1082;&#1088;&#1091;&#1075; &#1088;&#1072;&#1076;&#1080;&#1091;&#1089;&#1086;&#1084; 5 &#1084;&#1084; &#1089; &#1094;&#1077;&#1085;&#1090;&#1088;&#1086;&#1084; &#1074; &#1085;&#1072;&#1095;&#1072;&#1083;&#1077; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090; &#1080; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; "Ok" (&#1101;&#1089;&#1082;&#1080;&#1079; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1089;&#1090;&#1072;&#1090;&#1100; &#1079;&#1077;&#1083;&#1077;&#1085;&#1099;&#1084;).
</p><p>&#1057;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1074;&#1099;&#1088;&#1077;&#1079; &#1082;&#1072;&#1082; &#1074;&#1099; &#1101;&#1090;&#1086; &#1076;&#1077;&#1083;&#1072;&#1083;&#1080; &#1088;&#1072;&#1085;&#1077;&#1077;, &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1089;&#1103; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1077;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074; &#1094;&#1077;&#1085;&#1090;&#1088;&#1077; &#1074;&#1077;&#1088;&#1085;&#1077;&#1081; &#1075;&#1088;&#1072;&#1085;&#1080;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=GGTuto1_9.PNG&amp;filetimestamp=20180415043948&amp;.html" class="mw-file-description"><img src="../File/GGTuto1_9.PNG" decoding="async" width="814" height="686" class="mw-file-element" data-file-width="814" data-file-height="686"></a><figcaption></figcaption></figure>
<p>&#1069;&#1090;&#1086; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086;&#1076;&#1086;&#1096;&#1083;&#1086; &#1082; &#1082;&#1086;&#1085;&#1094;&#1091;, &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1077; &#1092;&#1072;&#1081;&#1083;, &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1085;&#1072; &#1101;&#1090;&#1086;&#1081; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1079;&#1091;&#1095;&#1072;&#1090;&#1100; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; FreeCAD. &#1052;&#1077;&#1085;&#1103;&#1081;&#1090;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099;, &#1084;&#1077;&#1085;&#1103;&#1081;&#1090;&#1077; &#1092;&#1086;&#1088;&#1084;&#1099;, &#1076;&#1077;&#1083;&#1072;&#1081;&#1090;&#1077; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1103; &#1085;&#1072; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1103;&#1093; &#1090;&#1077;&#1083;&#1072;. &#1053;&#1077; &#1073;&#1086;&#1081;&#1090;&#1077;&#1089;&#1100; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080;, &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089;&#1086;&#1074;&#1077;&#1088;&#1096;&#1072;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080; &#1084;&#1099; &#1091;&#1095;&#1080;&#1084;&#1089;&#1103;!
</p><p>&#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1100; &#1076;&#1088;&#1091;&#1075;&#1086;&#1077; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086; &#1085;&#1072; &#1089;&#1083;&#1077;&#1075;&#1082;&#1072; &#1073;&#1086;&#1083;&#1077;&#1077; &#1089;&#1083;&#1086;&#1078;&#1085;&#1086;&#1081; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080;:
</p><p><a href="../ru/Basic_Part_Design_Tutorial.html" title="Basic Part Design Tutorial/ru">&#1056;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1102; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080; &#1074; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1077; "Part Design"</a>
</p><p><br>
</p>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><a href="../ru/PartDesign_Workbench.html" title="PartDesign Workbench/ru">PartDesign</a> <span typeof="mw:File"><a href="../index.php?title=Workbench_PartDesign.svg&amp;filetimestamp=20240405092932&amp;.html" class="mw-file-description"><img src="../File/Workbench_PartDesign.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b>&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1099;:</b> <a href="../ru/Std_Part.html" title="Std Part/ru">Part</a>, <a href="../ru/Std_Group.html" title="Std Group/ru">Group</a></li>
<li><b>&#1042;&#1089;&#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;:</b> <a href="../ru/PartDesign_Body.html" title="PartDesign Body/ru">Create body</a>, <a href="../ru/PartDesign_NewSketch.html" title="PartDesign NewSketch/ru">Create sketch</a>, <a href="../ru/Sketcher_EditSketch.html" title="Sketcher EditSketch/ru">Edit sketch</a>, <a href="../ru/Sketcher_MapSketch.html" title="Sketcher MapSketch/ru">Map sketch to face</a></li></ul>
<hr>
<ul><li><b>&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</b>
<ul><li><b>&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;:</b> <a href="../ru/PartDesign_Point.html" title="PartDesign Point/ru">Create a datum point</a>, <a href="../ru/PartDesign_Line.html" title="PartDesign Line/ru">Create a datum line</a>, <a href="../ru/PartDesign_Plane.html" title="PartDesign Plane/ru">Create a datum plane</a>, <a href="../ru/PartDesign_CoordinateSystem.html" title="PartDesign CoordinateSystem/ru">Create a local coordinate system</a>, <a href="../ru/PartDesign_ShapeBinder.html" title="PartDesign ShapeBinder/ru">Create a shape binder</a>, <a href="../ru/PartDesign_Clone.html" title="PartDesign Clone/ru">Create a clone</a></li>
<li><b>&#1040;&#1076;&#1076;&#1080;&#1090;&#1080;&#1074;&#1085;&#1099;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;:</b> <a href="../ru/PartDesign_Pad.html" title="PartDesign Pad/ru">Pad</a>, <a href="../ru/PartDesign_Revolution.html" title="PartDesign Revolution/ru">Revolution</a>, <a href="../ru/PartDesign_AdditiveLoft.html" title="PartDesign AdditiveLoft/ru">Additive loft</a>, <a href="../ru/PartDesign_AdditivePipe.html" title="PartDesign AdditivePipe/ru">Additive pipe</a>, <a href="../ru/PartDesign_AdditiveBox.html" title="PartDesign AdditiveBox/ru">Additive box</a>, <a href="../ru/PartDesign_AdditiveCone.html" title="PartDesign AdditiveCone/ru">Additive cone</a>, <a href="../ru/PartDesign_AdditiveCylinder.html" title="PartDesign AdditiveCylinder/ru">Additive cylinder</a>, <a href="../ru/PartDesign_AdditiveEllipsoid.html" title="PartDesign AdditiveEllipsoid/ru">Additive ellipsoid</a>, <a href="../ru/PartDesign_AdditivePrism.html" title="PartDesign AdditivePrism/ru">Additive prism</a>, <a href="../ru/PartDesign_AdditiveSphere.html" title="PartDesign AdditiveSphere/ru">Additive sphere</a>, <a href="../ru/PartDesign_AdditiveTorus.html" title="PartDesign AdditiveTorus/ru">Additive torus</a>, <a href="../ru/PartDesign_AdditiveWedge.html" title="PartDesign AdditiveWedge/ru">Additive wedge</a></li>
<li><b>&#1057;&#1091;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;:</b> <a href="../ru/PartDesign_Pocket.html" title="PartDesign Pocket/ru">Pocket</a>, <a href="../ru/PartDesign_Hole.html" title="PartDesign Hole/ru">Hole</a>, <a href="../ru/PartDesign_Groove.html" title="PartDesign Groove/ru">Groove</a>, <a href="../ru/PartDesign_SubtractiveLoft.html" title="PartDesign SubtractiveLoft/ru">Subtractive loft</a>, <a href="../ru/PartDesign_SubtractivePipe.html" title="PartDesign SubtractivePipe/ru">Subtractive pipe</a>, <a href="../ru/PartDesign_SubtractiveBox.html" title="PartDesign SubtractiveBox/ru">Subtractive box</a>, <a href="../ru/PartDesign_SubtractiveCone.html" title="PartDesign SubtractiveCone/ru">Subtractive cone</a>, <a href="../ru/PartDesign_SubtractiveCylinder.html" title="PartDesign SubtractiveCylinder/ru">Subtractive cylinder</a>, <a href="../ru/PartDesign_SubtractiveEllipsoid.html" title="PartDesign SubtractiveEllipsoid/ru">Subtractive ellipsoid</a>, <a href="../ru/PartDesign_SubtractivePrism.html" title="PartDesign SubtractivePrism/ru">Subtractive prism</a>, <a href="../ru/PartDesign_SubtractiveSphere.html" title="PartDesign SubtractiveSphere/ru">Subtractive sphere</a>, <a href="../ru/PartDesign_SubtractiveTorus.html" title="PartDesign SubtractiveTorus/ru">Subtractive torus</a>, &lrm;<a href="../ru/PartDesign_SubtractiveWedge.html" title="PartDesign SubtractiveWedge/ru">Subtractive wedge</a></li></ul></li></ul>
<hr>
<ul><li><b>&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1090;&#1088;&#1072;&#1085;&#1089;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;:</b> <a href="../ru/PartDesign_Mirrored.html" title="PartDesign Mirrored/ru">Mirrored</a>, <a href="../ru/PartDesign_LinearPattern.html" title="PartDesign LinearPattern/ru">Linear Pattern</a>, <a href="../ru/PartDesign_PolarPattern.html" title="PartDesign PolarPattern/ru">Polar Pattern</a>, <a href="../ru/PartDesign_MultiTransform.html" title="PartDesign MultiTransform/ru">Create MultiTransform</a></li>
<li><b>&#1054;&#1090;&#1076;&#1077;&#1083;&#1086;&#1095;&#1085;&#1099;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;:</b> <a href="../ru/PartDesign_Fillet.html" title="PartDesign Fillet/ru">Fillet</a>, <a href="../ru/PartDesign_Chamfer.html" title="PartDesign Chamfer/ru">Chamfer</a>, <a href="../ru/PartDesign_Draft.html" title="PartDesign Draft/ru">Draft</a>, <a href="../ru/PartDesign_Thickness.html" title="PartDesign Thickness/ru">Thickness</a></li>
<li><b>&#1041;&#1080;&#1085;&#1072;&#1088;&#1085;&#1099;&#1077;:</b> <a href="../ru/PartDesign_Boolean.html" title="PartDesign Boolean/ru">Boolean operation</a></li></ul>
<hr>
<ul><li><b>&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;:</b> <a href="../ru/PartDesign_Migrate.html" title="PartDesign Migrate/ru">Migrate</a>, <a href="../ru/PartDesign_WizardShaft.html" title="PartDesign WizardShaft/ru">Shaft design wizard</a>, <a href="../ru/PartDesign_InvoluteGear.html" title="PartDesign InvoluteGear/ru">Involute gear</a></li>
<li><b>&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1085;&#1086;&#1075;&#1086; &#1084;&#1077;&#1085;&#1102;:</b> <a href="../ru/PartDesign_MoveTip.html" title="PartDesign MoveTip/ru">Set tip</a>, <a href="../ru/PartDesign_MoveFeature.html" title="PartDesign MoveFeature/ru">Move object to other body</a>, <a href="../ru/PartDesign_MoveFeatureInTree.html" title="PartDesign MoveFeatureInTree/ru">Move object after other object</a></li></ul></div>
    </div></div>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><span typeof="mw:File"><a href="../index.php?title=Workbench_Sketcher.svg&amp;filetimestamp=20231231194727&amp;.html" class="mw-file-description"><img src="../File/Workbench_Sketcher.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Sketcher_Workbench.html" title="Sketcher Workbench/ru">&#1057;&#1082;&#1077;&#1090;&#1095;&#1077;&#1088;</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b>&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077;:</b> <a href="../ru/Sketcher_NewSketch.html" title="Sketcher NewSketch/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1101;&#1089;&#1082;&#1080;&#1079;</a>, <a href="../ru/Sketcher_EditSketch.html" title="Sketcher EditSketch/ru">&#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1101;&#1089;&#1082;&#1080;&#1079;</a>, <a href="../ru/Sketcher_MapSketch.html" title="Sketcher MapSketch/ru">&#1055;&#1088;&#1080;&#1082;&#1088;&#1077;&#1087;&#1080;&#1090;&#1077; &#1101;&#1089;&#1082;&#1080;&#1079;</a>, <a href="../ru/Sketcher_ReorientSketch.html" title="Sketcher ReorientSketch/ru">&#1055;&#1077;&#1088;&#1077;&#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1101;&#1089;&#1082;&#1080;&#1079;</a>, <a href="../ru/Sketcher_ValidateSketch.html" title="Sketcher ValidateSketch/ru">&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100; &#1101;&#1089;&#1082;&#1080;&#1079;</a>, <a href="../ru/Sketcher_MergeSketches.html" title="Sketcher MergeSketches/ru">&#1054;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1080;&#1090;&#1100; &#1101;&#1089;&#1082;&#1080;&#1079;&#1099;</a>, <a href="../ru/Sketcher_MirrorSketch.html" title="Sketcher MirrorSketch/ru">&#1054;&#1090;&#1088;&#1072;&#1079;&#1080;&#1090;&#1100; &#1101;&#1089;&#1082;&#1080;&#1079; &#1079;&#1077;&#1088;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;</a>, <a href="../ru/Sketcher_LeaveSketch.html" title="Sketcher LeaveSketch/ru">&#1055;&#1086;&#1082;&#1080;&#1085;&#1091;&#1090;&#1100; &#1101;&#1089;&#1082;&#1080;&#1079;</a>, <a href="../ru/Sketcher_ViewSketch.html" title="Sketcher ViewSketch/ru">&#1055;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072;</a>, <a href="../ru/Sketcher_ViewSection.html" title="Sketcher ViewSection/ru">&#1055;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088; &#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;</a>, <a href="../ru/Sketcher_Grid.html" title="Sketcher Grid/ru">&#1055;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1089;&#1077;&#1090;&#1082;&#1091;</a>, <a href="../ru/Sketcher_Snap.html" title="Sketcher Snap/ru">&#1055;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1091;</a>, <a href="../ru/Sketcher_RenderingOrder.html" title="Sketcher RenderingOrder/ru">&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1072; &#1087;&#1088;&#1086;&#1088;&#1080;&#1089;&#1086;&#1074;&#1082;&#1080;</a>, <a href="../ru/Sketcher_StopOperation.html" title="Sketcher StopOperation/ru">&#1054;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1102;</a></li></ul>
<hr>
<ul><li><b>&#1043;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1103; &#1057;&#1082;&#1077;&#1090;&#1095;&#1077;&#1088;&#1072;:</b> <a href="../ru/Sketcher_CreatePoint.html" title="Sketcher CreatePoint/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1090;&#1086;&#1095;&#1082;&#1091;</a>, <a href="../ru/Sketcher_CreatePolyline.html" title="Sketcher CreatePolyline/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1083;&#1080;&#1085;&#1080;&#1102; &#1087;&#1086; &#1090;&#1086;&#1095;&#1082;&#1072;&#1084; (&#1087;&#1086;&#1083;&#1080;&#1083;&#1080;&#1085;&#1080;&#1102;)</a>, <a href="../ru/Sketcher_CreateLine.html" title="Sketcher CreateLine/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1086;&#1090;&#1088;&#1077;&#1079;&#1086;&#1082;</a>, <a href="../ru/Sketcher_CreateArc.html" title="Sketcher CreateArc/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1076;&#1091;&#1075;&#1091; &#1086;&#1090; &#1094;&#1077;&#1085;&#1090;&#1088;&#1072;</a>, <a href="../ru/Sketcher_Create3PointArc.html" title="Sketcher Create3PointArc/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1076;&#1091;&#1075;&#1091; &#1087;&#1086; 3 &#1090;&#1086;&#1095;&#1082;&#1072;&#1084;</a>, <a href="../ru/Sketcher_CreateArcOfEllipse.html" title="Sketcher CreateArcOfEllipse/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1101;&#1083;&#1083;&#1080;&#1087;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1091;&#1102; &#1076;&#1091;&#1075;&#1091;</a>, <a href="../ru/Sketcher_CreateArcOfHyperbola.html" title="Sketcher CreateArcOfHyperbola/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1075;&#1080;&#1087;&#1077;&#1088;&#1073;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1082;&#1091;&#1102; &#1076;&#1091;&#1075;&#1091;</a>, <a href="../ru/Sketcher_CreateArcOfParabola.html" title="Sketcher CreateArcOfParabola/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1087;&#1072;&#1088;&#1072;&#1073;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1082;&#1091;&#1102; &#1076;&#1091;&#1075;&#1091;</a>, <a href="../ru/Sketcher_CreateCircle.html" title="Sketcher CreateCircle/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1082;&#1088;&#1091;&#1075; &#1087;&#1086; &#1094;&#1077;&#1085;&#1090;&#1088;&#1091;</a>, <a href="../ru/Sketcher_Create3PointCircle.html" title="Sketcher Create3PointCircle/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1082;&#1088;&#1091;&#1075; &#1087;&#1086; 3 &#1090;&#1086;&#1095;&#1082;&#1072;&#1084;</a>, <a href="../ru/Sketcher_CreateEllipseByCenter.html" title="Sketcher CreateEllipseByCenter/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1101;&#1083;&#1083;&#1080;&#1087;&#1089; &#1086;&#1090; &#1094;&#1077;&#1085;&#1090;&#1088;&#1072;</a>, <a href="../ru/Sketcher_CreateEllipseBy3Points.html" title="Sketcher CreateEllipseBy3Points/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1101;&#1083;&#1083;&#1080;&#1087;&#1089; &#1087;&#1086; 3 &#1090;&#1086;&#1095;&#1082;&#1072;&#1084;</a>, <a href="../ru/Sketcher_CreateRectangle.html" title="Sketcher CreateRectangle/ru">&#1055;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;</a>, <a href="../ru/Sketcher_CreateRectangle_Center.html" title="Sketcher CreateRectangle Center/ru">&#1062;&#1077;&#1085;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;</a>, <a href="../ru/Sketcher_CreateOblong.html" title="Sketcher CreateOblong/ru">&#1057;&#1082;&#1088;&#1091;&#1075;&#1083;&#1105;&#1085;&#1085;&#1099;&#1081; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;</a>, <a href="../ru/Sketcher_CreateTriangle.html" title="Sketcher CreateTriangle/ru">&#1058;&#1088;&#1077;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;</a>, <a href="../ru/Sketcher_CreateSquare.html" title="Sketcher CreateSquare/ru">&#1050;&#1074;&#1072;&#1076;&#1088;&#1072;&#1090;</a>, <a href="../ru/Sketcher_CreatePentagon.html" title="Sketcher CreatePentagon/ru">&#1055;&#1103;&#1090;&#1080;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;</a>, <a href="../ru/Sketcher_CreateHexagon.html" title="Sketcher CreateHexagon/ru">&#1064;&#1077;&#1089;&#1090;&#1080;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;</a>, <a href="../ru/Sketcher_CreateHeptagon.html" title="Sketcher CreateHeptagon/ru">&#1057;&#1077;&#1084;&#1080;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;</a>, <a href="../ru/Sketcher_CreateOctagon.html" title="Sketcher CreateOctagon/ru">&#1042;&#1086;&#1089;&#1100;&#1084;&#1080;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;</a>, <a href="../ru/Sketcher_CreateRegularPolygon.html" title="Sketcher CreateRegularPolygon/ru">&#1055;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1099;&#1081; &#1084;&#1085;&#1086;&#1075;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;</a>, <a href="../ru/Sketcher_CreateSlot.html" title="Sketcher CreateSlot/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1087;&#1072;&#1079;</a>, <a href="../ru/Sketcher_CreateArcSlot.html" title="Sketcher CreateArcSlot/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1076;&#1091;&#1075;&#1086;&#1074;&#1086;&#1081; &#1089;&#1083;&#1086;&#1090;</a>, <a href="../ru/Sketcher_CreateBSpline.html" title="Sketcher CreateBSpline/ru">B-&#1089;&#1087;&#1083;&#1072;&#1081;&#1085; &#1087;&#1086; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100;&#1085;&#1099;&#1084; &#1090;&#1086;&#1095;&#1082;&#1072;&#1084;</a>, <a href="../ru/Sketcher_CreatePeriodicBSpline.html" title="Sketcher CreatePeriodicBSpline/ru">&#1055;&#1077;&#1088;&#1080;&#1086;&#1076;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; B-&#1089;&#1087;&#1083;&#1072;&#1081;&#1085; &#1087;&#1086; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100;&#1085;&#1099;&#1084; &#1090;&#1086;&#1095;&#1082;&#1072;&#1084;</a>, <a href="../ru/Sketcher_CreateBSplineByInterpolation.html" title="Sketcher CreateBSplineByInterpolation/ru">B-&#1089;&#1087;&#1083;&#1072;&#1081;&#1085; &#1087;&#1086; &#1091;&#1079;&#1083;&#1072;&#1084;</a>, <a href="../ru/Sketcher_CreatePeriodicBSplineByInterpolation.html" title="Sketcher CreatePeriodicBSplineByInterpolation/ru">&#1055;&#1077;&#1088;&#1080;&#1086;&#1076;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; B-&#1089;&#1087;&#1083;&#1072;&#1081;&#1085; &#1087;&#1086; &#1091;&#1079;&#1083;&#1072;&#1084;</a>, <a href="../ru/Sketcher_ToggleConstruction.html" title="Sketcher ToggleConstruction/ru">&#1055;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1074;&#1089;&#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1091;&#1102; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1102;</a></li></ul>
<hr>
<ul><li><b>&#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074; &#1057;&#1082;&#1077;&#1090;&#1095;&#1077;&#1088;&#1077;:</b>
<ul><li><b>&#1056;&#1072;&#1079;&#1084;&#1077;&#1088;&#1085;&#1099;&#1077; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103;:</b> <a href="../ru/Sketcher_Dimension.html" title="Sketcher Dimension/ru">&#1056;&#1072;&#1079;&#1084;&#1077;&#1088;</a>, <a href="../ru/Sketcher_ConstrainDistanceX.html" title="Sketcher ConstrainDistanceX/ru">&#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; &#1088;&#1072;&#1089;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103; &#1087;&#1086; &#1075;&#1086;&#1088;&#1080;&#1079;&#1086;&#1085;&#1090;&#1072;&#1083;&#1080;</a>, <a href="../ru/Sketcher_ConstrainDistanceY.html" title="Sketcher ConstrainDistanceY/ru">&#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; &#1088;&#1072;&#1089;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103; &#1087;&#1086; &#1074;&#1077;&#1088;&#1090;&#1080;&#1082;&#1072;&#1083;&#1080;</a>, <a href="../ru/Sketcher_ConstrainDistance.html" title="Sketcher ConstrainDistance/ru">&#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; &#1056;&#1072;&#1089;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103;</a>, <a href="../ru/Sketcher_ConstrainRadiam.html" title="Sketcher ConstrainRadiam/ru">&#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; &#1088;&#1072;&#1076;&#1080;&#1091;&#1089;&#1072;/&#1076;&#1080;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;</a>, <a href="../ru/Sketcher_ConstrainRadius.html" title="Sketcher ConstrainRadius/ru">&#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; &#1056;&#1072;&#1076;&#1080;&#1091;&#1089;&#1072;</a>, <a href="../ru/Sketcher_ConstrainDiameter.html" title="Sketcher ConstrainDiameter/ru">&#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; &#1044;&#1080;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;</a>, <a href="../ru/Sketcher_ConstrainAngle.html" title="Sketcher ConstrainAngle/ru">&#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; &#1059;&#1075;&#1083;&#1072;</a>, <a href="../ru/Sketcher_ConstrainLock.html" title="Sketcher ConstrainLock/ru">&#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;</a></li>
<li><b>&#1043;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103;:</b> <a href="../ru/Sketcher_ConstrainCoincidentUnified.html" title="Sketcher ConstrainCoincidentUnified/ru">&#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1090;&#1086;&#1095;&#1077;&#1082;</a>, <a href="../ru/Sketcher_ConstrainCoincident.html" title="Sketcher ConstrainCoincident/ru">&#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; &#1057;&#1086;&#1074;&#1087;&#1072;&#1076;&#1077;&#1085;&#1080;&#1103; &#1090;&#1086;&#1095;&#1077;&#1082;</a>, <a href="../ru/Sketcher_ConstrainPointOnObject.html" title="Sketcher ConstrainPointOnObject/ru">&#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; &#1058;&#1086;&#1095;&#1082;&#1080; &#1085;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1077;</a>, <a href="../ru/Sketcher_ConstrainHorVer.html" title="Sketcher ConstrainHorVer/ru">&#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1080;&#1090;&#1100; &#1075;&#1086;&#1088;&#1080;&#1079;&#1086;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100;/&#1074;&#1077;&#1088;&#1090;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100;</a>, <a href="../ru/Sketcher_ConstrainHorizontal.html" title="Sketcher ConstrainHorizontal/ru">&#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1080;&#1090;&#1100; &#1075;&#1086;&#1088;&#1080;&#1079;&#1086;&#1085;&#1090;&#1072;&#1083;&#1100;</a>, <a href="../ru/Sketcher_ConstrainVertical.html" title="Sketcher ConstrainVertical/ru">&#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1080;&#1090;&#1100; &#1074;&#1077;&#1088;&#1090;&#1080;&#1082;&#1072;&#1083;&#1100;</a>, <a href="../ru/Sketcher_ConstrainParallel.html" title="Sketcher ConstrainParallel/ru">&#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; &#1055;&#1072;&#1088;&#1072;&#1083;&#1083;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080;</a>, <a href="../ru/Sketcher_ConstrainPerpendicular.html" title="Sketcher ConstrainPerpendicular/ru">&#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1077;&#1088;&#1087;&#1077;&#1085;&#1076;&#1080;&#1082;&#1091;&#1083;&#1103;&#1088;&#1085;&#1086;&#1089;&#1090;&#1080;</a>, <a href="../ru/Sketcher_ConstrainTangent.html" title="Sketcher ConstrainTangent/ru">&#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1080;&#1090;&#1100; &#1082;&#1072;&#1089;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1091;&#1102; &#1080;&#1083;&#1080; &#1082;&#1086;&#1083;&#1083;&#1080;&#1085;&#1077;&#1072;&#1088;&#1085;&#1086;&#1089;&#1090;&#1100;</a>, <a href="../ru/Sketcher_ConstrainEqual.html" title="Sketcher ConstrainEqual/ru">&#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; &#1101;&#1082;&#1074;&#1080;&#1074;&#1072;&#1083;&#1077;&#1085;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;</a>, <a href="../ru/Sketcher_ConstrainSymmetric.html" title="Sketcher ConstrainSymmetric/ru">&#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1080;&#1090;&#1100; &#1089;&#1080;&#1084;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;</a>, <a href="../ru/Sketcher_ConstrainBlock.html" title="Sketcher ConstrainBlock/ru">&#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103;</a></li>
<li><b>&#1044;&#1088;&#1091;&#1075;&#1080;&#1077; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103;:</b> <a href="../ru/Sketcher_ConstrainSnellsLaw.html" title="Sketcher ConstrainSnellsLaw/ru">&#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1077;&#1083;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1103; (&#1047;&#1072;&#1082;&#1086;&#1085; &#1057;&#1085;&#1077;&#1083;&#1083;&#1080;&#1091;&#1089;&#1072;)</a></li>
<li><b>&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1081;:</b> <a href="../ru/Sketcher_ToggleDrivingConstraint.html" title="Sketcher ToggleDrivingConstraint/ru">&#1055;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077;/&#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077;</a>, <a href="../ru/Sketcher_ToggleActiveConstraint.html" title="Sketcher ToggleActiveConstraint/ru">&#1042;&#1082;&#1083;/&#1074;&#1099;&#1082;&#1083; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077;</a></li></ul></li></ul>
<hr>
<ul><li><b>&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1057;&#1082;&#1077;&#1090;&#1095;&#1077;&#1088;&#1072;:</b> <a href="../ru/Sketcher_CreateFillet.html" title="Sketcher CreateFillet/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1089;&#1082;&#1088;&#1091;&#1075;&#1083;&#1077;&#1085;&#1080;&#1077;</a>, <a href="../ru/Sketcher_CreateChamfer.html" title="Sketcher CreateChamfer/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1060;&#1072;&#1089;&#1082;&#1091;</a>, <a href="../ru/Sketcher_Trimming.html" title="Sketcher Trimming/ru">&#1054;&#1073;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100; &#1088;&#1077;&#1073;&#1088;&#1086;</a>, <a href="../ru/Sketcher_Split.html" title="Sketcher Split/ru">&#1056;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1088;&#1077;&#1073;&#1088;&#1086;</a>, <a href="../ru/Sketcher_Extend.html" title="Sketcher Extend/ru">&#1055;&#1088;&#1086;&#1076;&#1083;&#1080;&#1090;&#1100; &#1088;&#1077;&#1073;&#1088;&#1086;</a>, <a href="../ru/Sketcher_External.html" title="Sketcher External/ru">&#1042;&#1085;&#1077;&#1096;&#1085;&#1103;&#1103; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1103;</a>, <a href="../ru/Sketcher_CarbonCopy.html" title="Sketcher CarbonCopy/ru">&#1057;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1085;&#1072;&#1103; &#1082;&#1086;&#1087;&#1080;&#1103;</a>, <a href="../ru/Sketcher_SelectOrigin.html" title="Sketcher SelectOrigin/ru">&#1042;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; &#1085;&#1072;&#1095;&#1072;&#1083;&#1086; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;</a>, <a href="../ru/Sketcher_SelectHorizontalAxis.html" title="Sketcher SelectHorizontalAxis/ru">&#1042;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; &#1075;&#1086;&#1088;&#1080;&#1079;&#1086;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1086;&#1089;&#1100;</a>, <a href="../ru/Sketcher_SelectVerticalAxis.html" title="Sketcher SelectVerticalAxis/ru">&#1042;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; &#1074;&#1077;&#1088;&#1090;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1086;&#1089;&#1100;</a>, <a href="../ru/Sketcher_Translate.html" title="Sketcher Translate/ru">&#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; / &#1083;&#1080;&#1085;&#1077;&#1081;&#1085;&#1099;&#1081; &#1084;&#1072;&#1089;&#1089;&#1080;&#1074;</a>, <a href="../ru/Sketcher_Rotate.html" title="Sketcher Rotate/ru">&#1055;&#1086;&#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100; / &#1082;&#1088;&#1091;&#1075;&#1086;&#1074;&#1086;&#1081; &#1084;&#1072;&#1089;&#1089;&#1080;&#1074;</a>, <a href="../ru/Sketcher_Scale.html" title="Sketcher Scale/ru">&#1052;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;</a>, <a href="../ru/Sketcher_Offset.html" title="Sketcher Offset/ru">&#1057;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1102;</a>, <a href="../ru/Sketcher_Symmetry.html" title="Sketcher Symmetry/ru">&#1057;&#1080;&#1084;&#1084;&#1077;&#1090;&#1088;&#1080;&#1103;</a>, <a href="../ru/Sketcher_RemoveAxesAlignment.html" title="Sketcher RemoveAxesAlignment/ru">&#1059;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1074;&#1099;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1086; &#1086;&#1089;&#1103;&#1084;</a>, <a href="../ru/Sketcher_DeleteAllGeometry.html" title="Sketcher DeleteAllGeometry/ru">&#1059;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1074;&#1089;&#1102; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1102;</a>, <a href="../ru/Sketcher_DeleteAllConstraints.html" title="Sketcher DeleteAllConstraints/ru">&#1059;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1074;&#1089;&#1077; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103;</a></li></ul>
<hr>
<ul><li><b>&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1076;&#1083;&#1103; B-&#1089;&#1087;&#1083;&#1072;&#1081;&#1085; &#1057;&#1082;&#1077;&#1090;&#1095;&#1077;&#1088;&#1072;:</b> <a href="../ru/Sketcher_BSplineConvertToNURBS.html" title="Sketcher BSplineConvertToNURBS/ru">&#1055;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1102; &#1074; B-&#1089;&#1087;&#1083;&#1072;&#1081;&#1085;</a>, <a href="../ru/Sketcher_BSplineIncreaseDegree.html" title="Sketcher BSplineIncreaseDegree/ru">&#1059;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1090;&#1100; &#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1100; B-&#1089;&#1087;&#1083;&#1072;&#1081;&#1085;&#1072;</a>, <a href="../ru/Sketcher_BSplineDecreaseDegree.html" title="Sketcher BSplineDecreaseDegree/ru">&#1059;&#1084;&#1077;&#1085;&#1100;&#1096;&#1080;&#1090;&#1100; &#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1100; B-&#1089;&#1087;&#1083;&#1072;&#1081;&#1085;&#1072;</a>, <a href="../ru/Sketcher_BSplineIncreaseKnotMultiplicity.html" title="Sketcher BSplineIncreaseKnotMultiplicity/ru">&#1059;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1090;&#1100; &#1082;&#1088;&#1072;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; &#1091;&#1079;&#1083;&#1072;</a>, <a href="../ru/Sketcher_BSplineDecreaseKnotMultiplicity.html" title="Sketcher BSplineDecreaseKnotMultiplicity/ru">&#1059;&#1084;&#1077;&#1085;&#1100;&#1096;&#1080;&#1090;&#1100; &#1082;&#1088;&#1072;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; &#1091;&#1079;&#1083;&#1072;</a>, <a href="../ru/Sketcher_BSplineInsertKnot.html" title="Sketcher BSplineInsertKnot/ru">&#1042;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1091;&#1079;&#1077;&#1083;</a>, <a href="../ru/Sketcher_JoinCurves.html" title="Sketcher JoinCurves/ru">&#1054;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1080;&#1090;&#1100; &#1082;&#1088;&#1080;&#1074;&#1099;&#1077;</a></li></ul>
<hr>
<ul><li><b>&#1042;&#1080;&#1079;&#1091;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; &#1074; &#1069;&#1089;&#1082;&#1080;&#1079;&#1077;:</b> <a href="../ru/Sketcher_SelectElementsWithDoFs.html" title="Sketcher SelectElementsWithDoFs/ru">&#1042;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1085;&#1099;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099;</a>, <a href="../ru/Sketcher_SelectConstraints.html" title="Sketcher SelectConstraints/ru">&#1042;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1085;&#1072;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1077; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103;</a>, <a href="../ru/Sketcher_SelectElementsAssociatedWithConstraints.html" title="Sketcher SelectElementsAssociatedWithConstraints/ru">&#1042;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1080;&#1074;&#1072;&#1077;&#1084;&#1091;&#1102; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1102;</a>, <a href="../ru/Sketcher_SelectRedundantConstraints.html" title="Sketcher SelectRedundantConstraints/ru">&#1042;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1080;&#1079;&#1073;&#1099;&#1090;&#1086;&#1095;&#1085;&#1099;&#1077; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103;</a>, <a href="../ru/Sketcher_SelectConflictingConstraints.html" title="Sketcher SelectConflictingConstraints/ru">&#1042;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1082;&#1086;&#1085;&#1092;&#1083;&#1080;&#1082;&#1090;&#1091;&#1102;&#1097;&#1080;&#1077; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103;</a>, <a href="../ru/Sketcher_ArcOverlay.html" title="Sketcher ArcOverlay/ru">&#1055;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;/&#1089;&#1082;&#1088;&#1099;&#1090;&#1100; &#1074;&#1089;&#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1091;&#1102; &#1086;&#1082;&#1088;&#1091;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1076;&#1083;&#1103; &#1076;&#1091;&#1075;</a>, <a href="../ru/Sketcher_BSplineDegree.html" title="Sketcher BSplineDegree/ru">&#1055;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;/&#1057;&#1082;&#1088;&#1099;&#1090;&#1100; &#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1100; B-&#1089;&#1087;&#1083;&#1072;&#1081;&#1085;&#1072;</a>, <a href="../ru/Sketcher_BSplinePolygon.html" title="Sketcher BSplinePolygon/ru">&#1055;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;/&#1057;&#1082;&#1088;&#1099;&#1090;&#1100; &#1087;&#1086;&#1083;&#1080;&#1075;&#1086;&#1085; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; B-&#1089;&#1087;&#1083;&#1072;&#1081;&#1085;&#1086;&#1084;</a>, <a href="../ru/Sketcher_BSplineComb.html" title="Sketcher BSplineComb/ru">&#1055;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;/&#1089;&#1082;&#1088;&#1099;&#1090;&#1100; &#1075;&#1088;&#1077;&#1073;&#1077;&#1085;&#1100; &#1082;&#1088;&#1080;&#1074;&#1080;&#1079;&#1085;&#1099; B-&#1089;&#1087;&#1083;&#1072;&#1081;&#1085;&#1072;</a>, <a href="../ru/Sketcher_BSplineKnotMultiplicity.html" title="Sketcher BSplineKnotMultiplicity/ru">&#1055;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;/&#1089;&#1082;&#1088;&#1099;&#1090;&#1100; &#1082;&#1088;&#1072;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; &#1091;&#1079;&#1083;&#1086;&#1074; &#1042;-&#1089;&#1087;&#1083;&#1072;&#1081;&#1085;&#1072;</a>, <a href="../ru/Sketcher_BSplinePoleWeight.html" title="Sketcher BSplinePoleWeight/ru">&#1055;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;/&#1089;&#1082;&#1088;&#1099;&#1090;&#1100; &#1074;&#1077;&#1089; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100;&#1085;&#1099;&#1093; &#1090;&#1086;&#1095;&#1077;&#1082; B-&#1089;&#1087;&#1083;&#1072;&#1081;&#1085;&#1072;</a>, <a href="../ru/Sketcher_RestoreInternalAlignmentGeometry.html" title="Sketcher RestoreInternalAlignmentGeometry/ru">&#1055;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;/&#1089;&#1082;&#1088;&#1099;&#1090;&#1100; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1102;&#1102; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1102;</a>, <a href="../ru/Sketcher_SwitchVirtualSpace.html" title="Sketcher SwitchVirtualSpace/ru">&#1055;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1074;&#1080;&#1088;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086;</a></li></ul>
<hr>
<ul><li><b>&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;:</b> <a href="../ru/Sketcher_Dialog.html" title="Sketcher Dialog/ru">&#1044;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; &#1057;&#1082;&#1077;&#1090;&#1095;&#1077;&#1088;&#1072;</a>, <a href="../ru/Sketcher_Preferences.html" title="Sketcher Preferences/ru">&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;</a>, <a href="../ru/Sketcher_scripting.html" title="Sketcher scripting/ru">&#1053;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1074; &#1074; &#1057;&#1082;&#1077;&#1090;&#1095;&#1077;&#1088;</a></li></ul></div>
    </div></div>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><span typeof="mw:File"><a href="../index.php?title=User_hub.png&amp;filetimestamp=20190221145008&amp;.html" class="mw-file-description"><img src="../File/User_hub.png" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/User_hub.html" title="User hub/ru">&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b><a href="../ru/Getting_started.html" title="Getting started/ru">&#1053;&#1072;&#1095;&#1080;&#1085;&#1072;&#1102;&#1097;&#1080;&#1084;</a></b></li>
<li><b>&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072;:</b> <a href="../ru/Download.html" title="Download/ru">&#1047;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072;</a>, <a href="../ru/Installing_on_Windows.html" title="Installing on Windows/ru">Windows</a>, <a href="../ru/Installing_on_Linux.html" title="Installing on Linux/ru">Linux</a>, <a href="../ru/Installing_on_Mac.html" title="Installing on Mac/ru">Mac</a>, <a href="../ru/Installing_additional_components.html" title="Installing additional components/ru">
&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074;</a>, <a href="../ru/Compile_on_Docker.html" title="Compile on Docker/ru">Docker</a>, <a href="../ru/AppImage.html" title="AppImage/ru">AppImage</a>, <a href="../ru/Ubuntu_Snap.html" title="Ubuntu Snap/ru">Ubuntu Snap</a></li>
<li><b>&#1041;&#1072;&#1079;&#1086;&#1074;&#1072;&#1103;:</b> <a href="../ru/About_FreeCAD.html" title="About FreeCAD/ru">&#1054; FreeCAD</a>, <a href="../ru/Interface.html" title="Interface/ru">&#1048;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;</a>, <a href="../ru/Mouse_navigation.html" title="Mouse navigation/ru">&#1053;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1103; &#1084;&#1099;&#1096;&#1080;</a>, <a href="../ru/Selection_methods.html" title="Selection methods/ru">&#1052;&#1077;&#1090;&#1086;&#1076;&#1099; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103;</a>, <a href="../ru/Object_name.html" title="Object name/ru">&#1048;&#1084;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;</a>, <a href="../ru/Preferences_Editor.html" title="Preferences Editor/ru">&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;</a>, <a href="../ru/Workbenches.html" title="Workbenches/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>, <a href="../ru/Document_structure.html" title="Document structure/ru">&#1057;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;</a>, <a href="../ru/Property.html" title="Property/ru">&#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;</a>, <a href="../ru/Help_FreeCAD.html" title="Help FreeCAD/ru">&#1055;&#1086;&#1084;&#1086;&#1075;&#1080; FreeCAD</a>, <a href="../ru/Donate.html" title="Donate/ru">&#1055;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</a></li></ul>
<hr>
<ul><li><b>&#1055;&#1086;&#1084;&#1086;&#1097;&#1100;:</b> <a href="../ru/Tutorials.html" title="Tutorials/ru">&#1059;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082;&#1080;</a>, <a href="../ru/Video_tutorials.html" title="Video tutorials/ru">&#1042;&#1080;&#1076;&#1077;&#1086; &#1091;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082;&#1080;</a></li>
<li><b><a href="../ru/Workbenches.html" title="Workbenches/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>:</b> <a href="../ru/Std_Base.html" title="Std Base/ru">Std Base</a>, <a href="../ru/Arch_Workbench.html" title="Arch Workbench/ru">Arch</a>, <a href="../ru/Assembly_Workbench.html" title="Assembly Workbench/ru">Assembly</a>, <a href="../ru/CAM_Workbench.html" title="CAM Workbench/ru">CAM</a>, <a href="../ru/Draft_Workbench.html" title="Draft Workbench/ru">Draft</a>, <a href="../ru/FEM_Workbench.html" title="FEM Workbench/ru">FEM</a>, <a href="../ru/Inspection_Workbench.html" title="Inspection Workbench/ru">Inspection</a>, <a href="../ru/Mesh_Workbench.html" title="Mesh Workbench/ru">Mesh</a>, <a href="../ru/OpenSCAD_Workbench.html" title="OpenSCAD Workbench/ru">OpenSCAD</a>, <a href="../ru/Part_Workbench.html" title="Part Workbench/ru">Part</a>, <a href="../ru/PartDesign_Workbench.html" title="PartDesign Workbench/ru">PartDesign</a>, <a href="../ru/Points_Workbench.html" title="Points Workbench/ru">Points</a>, <a href="../ru/Reverse_Engineering_Workbench.html" title="Reverse Engineering Workbench/ru">Reverse Engineering</a>, <a href="../ru/Robot_Workbench.html" title="Robot Workbench/ru">Robot</a>, <a href="../ru/Sketcher_Workbench.html" title="Sketcher Workbench/ru">Sketcher</a>, <a href="../ru/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/ru">Spreadsheet</a>, <a href="../ru/Surface_Workbench.html" title="Surface Workbench/ru">Surface</a>, <a href="../ru/TechDraw_Workbench.html" title="TechDraw Workbench/ru">TechDraw</a>, <a href="../ru/Testing.html" title="Testing/ru">Test Framework</a></li></ul>
<hr>
<ul><li><b><a href="../ru/Addon.html" title="Addon/ru">Addons</a>:</b> <a href="../ru/Std_AddonMgr.html" title="Std AddonMgr/ru">&#1052;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1081;</a>, <a href="../ru/External_workbenches.html" title="External workbenches/ru">&#1042;&#1085;&#1077;&#1096;&#1085;&#1080;&#1077; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>, <a href="../ru/Scripting_and_macros.html" title="Scripting and macros/ru">C&#1082;&#1088;&#1080;&#1087;&#1090;&#1099; &#1080; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1099;</a></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="../ru/User_hub.html" title="User hub/ru">&#1059;&#1075;&#1086;&#1083;&#1086;&#1082; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;</a>, <a href="../ru/Power_users_hub.html" title="Power users hub/ru">&#1059;&#1075;&#1086;&#1083;&#1086;&#1082; &#1086;&#1087;&#1099;&#1090;&#1085;&#1099;&#1093; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;</a>, <a href="../ru/Developer_hub.html" title="Developer hub/ru">&#1059;&#1075;&#1086;&#1083;&#1086;&#1082; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20251013085525
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.185 seconds
Real time usage: 0.245 seconds
Preprocessor visited node count: 332/1000000
Post&#8208;expand include size: 38675/2097152 bytes
Template argument size: 15127/2097152 bytes
Highest expansion depth: 5/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 2425/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   14.899      1 -total
 31.16%    4.643      1 Template:TutorialInfo/ru
 28.48%    4.243      1 Template:Sketcher_Tools_navi/ru
 21.31%    3.175      3 Template:Navigation_menu_2
 16.68%    2.485      1 Template:PartDesign_Tools_navi/ru
 10.72%    1.597      1 Template:Userdocnavi/ru
  7.56%    1.126      9 Template:KEY
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:130575-0!canonical and timestamp 20251013085525 and revision id 1661493. Rendering was triggered because: unknown
 -->
</div>
</div><script src="../site.js"></script>