<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Creating a simple part with Part WB/ru</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="ru" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Creating+a+simple+part+with+Part+WB&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/Creating_a_simple_part_with_Part_WB.html" class="mw-pt-progress mw-pt-progress--high" title="Erstellen eines einfachen Bauteils mit dem Arbeitsbereich Part (99% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Creating_a_simple_part_with_Part_WB.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Creating a simple part with Part WB (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../fr/Creating_a_simple_part_with_Part_WB.html" class="mw-pt-progress mw-pt-progress--high" title="Cr&eacute;er une simple pi&egrave;ce avec l'atelier Part (99% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/Creating_a_simple_part_with_Part_WB.html" class="mw-pt-progress mw-pt-progress--low" title="Creazione di una parte semplice con l'Ambiente Part (1% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Creating_a_simple_part_with_Part_WB.html" class="mw-pt-progress mw-pt-progress--high" title="&#346;rodowisko Cz&#281;&#347;&#263;: Tworzenie prostej cz&#281;&#347;ci (99% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt-br/Creating_a_simple_part_with_Part_WB.html" class="mw-pt-progress mw-pt-progress--high" title="Criando uma pe&ccedil;a simples com a bancada Part (96% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--high" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</span></li></ul></div>
<table class="fcinfobox wikitable ct" style="width: 230px; float: right; margin-left: 1em">
<tbody><tr>
<td class="ctTitle" style="font-weight: bold; font-size: 125%;"><span typeof="mw:File"><span><img src="../File/Freecad.svg" decoding="async" width="32" height="32" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span> &#1056;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086;
</td></tr>
<tr>
<th class="ctOdd">&#1058;&#1077;&#1084;&#1072;
</th></tr>
<tr>
<td class="ctEven">&#1052;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;
</td></tr>
<tr>
<th class="ctOdd">&#1059;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100;
</th></tr>
<tr>
<td class="ctEven">&#1044;&#1083;&#1103; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1102;&#1097;&#1080;&#1093;
</td></tr>
<tr>
<th class="ctOdd">&#1042;&#1088;&#1077;&#1084;&#1103; &#1076;&#1083;&#1103; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1103;
</th></tr>
<tr>
<td class="ctEven">2 &#1095;&#1072;&#1089;&#1072;
</td></tr>
<tr>
<th class="ctOdd">&#1040;&#1074;&#1090;&#1086;&#1088;&#1099;
</th></tr>
<tr>
<td class="ctEven">heda
</td></tr>
<tr>
<th class="ctOdd">FreeCAD &#1074;&#1077;&#1088;&#1089;&#1080;&#1103;
</th></tr>
<tr>
<td class="ctEven">0.19 &#1080; &#1074;&#1099;&#1096;&#1077;
</td></tr>
<tr>
<th class="ctOdd">&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;
</th></tr>
<tr>
<td class="ctEven">
</td></tr>
<tr>
<th class="ctOdd">&#1057;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; &#1090;&#1072;&#1082;&#1078;&#1077;
</th></tr>
<tr>
<td class="ctEven"><a href="../ru/Creating_a_simple_part_with_PartDesign.html" title="Creating a simple part with PartDesign/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080; &#1074; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1077; PartDesign</a>, <a href="../ru/Creating_a_simple_part_with_Draft_and_Part_WB.html" title="Creating a simple part with Draft and Part WB/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080; &#1074; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072;&#1093; Draft &#1080; Part</a>
</td></tr>
<tr>
<td class="ctToc"><br><meta property="mw:PageProp/toc">
</td></tr></tbody></table>
<p><span id="Introduction"></span>
</p>
<h2><span id=".D0.92.D0.B2.D0.B5.D0.B4.D0.B5.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;">&#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;</span></h2>
<p>&#1069;&#1090;&#1086; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;&#1084; &#1074; 3D &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; <a href="../ru/Part_Workbench.html" title="Part Workbench/ru">Part</a> <span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Switch_PartWorkbench.JPG&amp;filetimestamp=20170227183926&amp;.html" class="mw-file-description"><img src="../File/Switch_PartWorkbench.JPG" decoding="async" width="197" height="39" class="mw-file-element" data-file-width="197" data-file-height="39"></a></span> &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; FreeCAD. &#1055;&#1086;&#1089;&#1083;&#1077; &#1077;&#1075;&#1086; &#1087;&#1088;&#1086;&#1095;&#1090;&#1077;&#1085;&#1080;&#1103; &#1074;&#1099; &#1089;&#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1089;&#1090;&#1099;&#1077; 3D &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1090;&#1072;&#1082;&#1080;&#1093; &#1087;&#1088;&#1080;&#1084;&#1080;&#1090;&#1080;&#1074;&#1086;&#1074; &#1082;&#1072;&#1082; &#1082;&#1091;&#1073;&#1099;, &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1099;, &#1080; &#1090;.&#1076;. &#1089; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084; &#1090;&#1077;&#1093;&#1085;&#1080;&#1082;&#1080; <a rel="nofollow" class="external text" href="https://ru.wikipedia.org/wiki/%D0%9A%D0%BE%D0%BD%D1%81%D1%82%D1%80%D1%83%D0%BA%D1%82%D0%B8%D0%B2%D0%BD%D0%B0%D1%8F_%D1%81%D0%BF%D0%BB%D0%BE%D1%88%D0%BD%D0%B0%D1%8F_%D0%B3%D0%B5%D0%BE%D0%BC%D0%B5%D1%82%D1%80%D0%B8%D1%8F">&#1050;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1080;&#1074;&#1085;&#1072;&#1103; &#1089;&#1087;&#1083;&#1086;&#1096;&#1085;&#1072;&#1103; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1103;</a>. &#1044;&#1088;&#1091;&#1075;&#1080;&#1084; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1086;&#1084; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; 3D &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1076;&#1074;&#1091;&#1084;&#1077;&#1088;&#1085;&#1099;&#1093; &#1092;&#1080;&#1075;&#1091;&#1088; &#1087;&#1091;&#1090;&#1077;&#1084; &#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103; &#1080; &#1076;&#1074;&#1080;&#1078;&#1077;&#1085;&#1080;&#1103; &#1101;&#1090;&#1080;&#1093; &#1092;&#1080;&#1075;&#1091;&#1088; &#1074; 3D &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1077;. &#1055;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1077;&#1077; &#1086;&#1073; &#1101;&#1090;&#1086;&#1081; &#1090;&#1077;&#1093;&#1085;&#1080;&#1082;&#1077; &#1095;&#1080;&#1090;&#1072;&#1081;&#1090;&#1077;, &#1087;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1074; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1077; <i><a href="../ru/Creating_a_simple_part_with_PartDesign.html" title="Creating a simple part with PartDesign/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080; &#1074;  PartDesign</a></i>. &#1042; &#1101;&#1090;&#1080;&#1093; &#1076;&#1074;&#1091;&#1093; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1072;&#1093; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086; &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1076;&#1085;&#1072; &#1080; &#1090;&#1072; &#1078;&#1077; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100; &#1076;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1102;&#1097;&#1080;&#1077; &#1085;&#1072; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1084; &#1086;&#1087;&#1099;&#1090;&#1077; &#1080;&#1079;&#1091;&#1095;&#1080;&#1083;&#1080; &#1076;&#1074;&#1077; &#1088;&#1072;&#1079;&#1085;&#1099;&#1077; &#1090;&#1077;&#1093;&#1085;&#1080;&#1082;&#1080; &#1080;&#1093; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1080; &#1090;&#1086;, &#1082;&#1072;&#1082; &#1086;&#1085;&#1080; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085;&#1099; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; FreeCAD. &#1069;&#1090;&#1080; &#1090;&#1077;&#1093;&#1085;&#1080;&#1082;&#1080; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103; &#1082;&#1086;&#1085;&#1094;&#1077;&#1087;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1086;, &#1085;&#1086; &#1087;&#1088;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1080; &#1084;&#1086;&#1076;&#1077;&#1083;&#1077;&#1081; &#1080;&#1093; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;. &#1045;&#1089;&#1090;&#1100; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1080; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1076;&#1074;&#1091;&#1093; &#1090;&#1077;&#1093;&#1085;&#1080;&#1082; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1085;&#1086; &#1086;&#1085;&#1080; &#1082;&#1072;&#1089;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1103;&#1079;&#1099;&#1082;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; FreeCAD. &#1057;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086; <a href="../ru/Creating_a_simple_part_with_Draft_and_Part_WB.html" title="Creating a simple part with Draft and Part WB/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080; &#1074; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072;&#1093; Draft &#1080; Part</a>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1086;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1076;&#1074;&#1091;&#1093; &#1090;&#1077;&#1093;&#1085;&#1080;&#1082; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;. &#1054;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; <b>Draft</b> &#1080; 2D &#1092;&#1080;&#1075;&#1091;&#1088;&#1099;, &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1079;&#1072;&#1090;&#1077;&#1084; &#1074; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1077; <b>Part</b> &#1089;&#1086;&#1079;&#1076;&#1072;&#1105;&#1090;&#1089;&#1103; 3D &#1084;&#1086;&#1076;&#1077;&#1083;&#1100; &#1090;&#1072;&#1082;&#1072;&#1103; &#1078;&#1077;, &#1082;&#1072;&#1082; &#1074; &#1101;&#1090;&#1086;&#1084; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1077;.
</p>
<div class="mw-translate-fuzzy">
<p>&#1055;&#1077;&#1088;&#1077;&#1076; &#1090;&#1077;&#1084; &#1082;&#1072;&#1082; &#1084;&#1099; &#1085;&#1072;&#1095;&#1085;&#1077;&#1084;, &#1087;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1087;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077;, &#1082;&#1072;&#1082; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1090;&#1100; <b><a href="../ru/Mouse_navigation.html" title="Mouse navigation/ru">&#1085;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1102;</a></b> &#1074; 3D &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1077;. &#1055;&#1088;&#1080; &#1085;&#1072;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1103; &#1084;&#1099;&#1096;&#1080; &#1085;&#1072; &#1080;&#1082;&#1086;&#1085;&#1082;&#1091; &#1089; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084; &#1084;&#1099;&#1096;&#1080; &#1074; &#1085;&#1080;&#1078;&#1085;&#1077;&#1084; &#1087;&#1088;&#1072;&#1074;&#1086;&#1084; &#1091;&#1075;&#1083;&#1091; &#1086;&#1082;&#1085;&#1072; FreeCAD, &#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1076;&#1089;&#1082;&#1072;&#1079;&#1082;&#1072; &#1082;&#1072;&#1082; &#1085;&#1072; &#1082;&#1072;&#1088;&#1090;&#1080;&#1085;&#1082;&#1077; &#1085;&#1080;&#1078;&#1077;.
</p>
</div>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb00-01_navi.png&amp;filetimestamp=20220605095910&amp;.html" class="mw-file-description"><img src="../File/T101pwb00-01_navi.png" decoding="async" width="384" height="180" class="mw-file-element" data-file-width="384" data-file-height="180"></a><figcaption></figcaption></figure>
<p>&#1052;&#1085;&#1086;&#1075;&#1080;&#1077; &#1085;&#1086;&#1074;&#1080;&#1095;&#1082;&#1080; &#1074; CAD &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1093; &#1079;&#1072;&#1089;&#1090;&#1088;&#1077;&#1074;&#1072;&#1102;&#1090; &#1085;&#1072; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1080; &#1090;&#1077;&#1093; &#1080;&#1083;&#1080; &#1080;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; &#1087;&#1088;&#1080; &#1080;&#1093; &#1080;&#1079;&#1091;&#1095;&#1077;&#1085;&#1080;&#1080;. &#1045;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086; &#1087;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1086; &#1089; &#1074;&#1072;&#1084;&#1080;, &#1087;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1080;&#1097;&#1080;&#1090;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077; &#1074; wiki &#1080;&#1083;&#1080; &#1085;&#1072; &#1092;&#1086;&#1088;&#1091;&#1084;&#1077; &ndash; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1091;&#1078;&#1077; &#1089;&#1090;&#1072;&#1083;&#1082;&#1080;&#1074;&#1072;&#1083;&#1080;&#1089;&#1100; &#1089; &#1090;&#1072;&#1082;&#1086;&#1081; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1086;&#1081; &#1088;&#1072;&#1085;&#1077;&#1077; &#1080; &#1091;&#1078;&#1077; &#1085;&#1072;&#1096;&#1083;&#1080; &#1077;&#1105; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;. &#1048;&#1083;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1085;&#1072; &#1092;&#1086;&#1088;&#1091;&#1084;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1089; &#1074;&#1072;&#1096;&#1080;&#1084; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1086;&#1084; &#1080;&#1083;&#1080; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;&#1084; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;. &#1060;&#1086;&#1088;&#1091;&#1084; &#1080;&#1084;&#1077;&#1077;&#1090; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1090;&#1077;&#1084;, &#1075;&#1076;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1087;&#1086;&#1084;&#1086;&#1095;&#1100; &#1085;&#1072;&#1081;&#1090;&#1080; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1074;&#1089;&#1077;&#1084; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072;&#1084;, &#1101;&#1090;&#1080; &#1090;&#1077;&#1084;&#1099; &#1073;&#1099;&#1074;&#1072;&#1102;&#1090; &#1087;&#1086;&#1093;&#1086;&#1078;&#1080; &#1085;&#1072; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1072; &#1080; &#1095;&#1072;&#1089;&#1090;&#1086; &#1080;&#1084;&#1077;&#1102;&#1090; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1099;&#1077; &#1092;&#1086;&#1090;&#1086;&#1075;&#1088;&#1072;&#1092;&#1080;&#1080;.
</p><p><span id="The_tutorial_covers"></span>
</p>
<h3><span id=".D0.A1.D0.BE.D0.B4.D0.B5.D1.80.D0.B6.D0.B0.D0.BD.D0.B8.D0.B5_.D1.80.D1.83.D0.BA.D0.BE.D0.B2.D0.BE.D0.B4.D1.81.D1.82.D0.B2.D0.B0"></span><span class="mw-headline" id="&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;_&#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1072;">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1072;</span></h3>
<ul><li>&#1057;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1077;&#1084;&#1072;&#1103; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100;</li>
<li>&#1055;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; Part &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1087;&#1088;&#1080;&#1084;&#1080;&#1090;&#1080;&#1074;&#1086;&#1074;</li>
<li>&#1048;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1094;&#1074;&#1077;&#1090;&#1072; &#1080; &#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080;</li>
<li>&#1044;&#1088;&#1091;&#1075;&#1086;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1081;</li>
<li>&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1103; &#1089; &#1092;&#1072;&#1089;&#1082;&#1086;&#1081;</li>
<li>&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1087;&#1086;&#1083;&#1086;&#1081; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080;</li>
<li>&#1044;&#1088;&#1091;&#1075;&#1086;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1092;&#1072;&#1089;&#1082;&#1080;</li>
<li>&#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074;</li>
<li>&#1054;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; &#1076;&#1077;&#1088;&#1077;&#1074;&#1072; &#1085;&#1077;&#1084;&#1085;&#1086;&#1075;&#1086; &#1087;&#1086;-&#1076;&#1088;&#1091;&#1075;&#1086;&#1084;&#1091;</li>
<li>&#1055;&#1086;&#1076;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; &#1080;&#1090;&#1086;&#1075;&#1086;&#1074;</li></ul>
<p><span id="The_model_to_make"></span>
</p>
<h2><span id=".D0.A1.D0.BE.D0.B7.D0.B4.D0.B0.D0.B2.D0.B0.D0.B5.D0.BC.D0.B0.D1.8F_.D0.BC.D0.BE.D0.B4.D0.B5.D0.BB.D1.8C"></span><span class="mw-headline" id="&#1057;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1077;&#1084;&#1072;&#1103;_&#1084;&#1086;&#1076;&#1077;&#1083;&#1100;">&#1057;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1077;&#1084;&#1072;&#1103; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100;</span></h2>
<figure class="mw-halign-center" typeof="mw:File"><a href="../index.php?title=GGTuto1_Vue.PNG&amp;filetimestamp=20180404144733&amp;.html" class="mw-file-description"><img src="../File/GGTuto1_Vue.PNG" decoding="async" width="372" height="272" class="mw-file-element" data-file-width="744" data-file-height="544"></a><figcaption></figcaption></figure>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb01-02_dims.png&amp;filetimestamp=20220605100016&amp;.html" class="mw-file-description"><img src="../File/T101pwb01-02_dims.png" decoding="async" width="309" height="351" class="mw-file-element" data-file-width="309" data-file-height="351"></a><figcaption></figcaption></figure>
<p><span id="Using_the_Part_Workbench_to_create_and_manipulate_the_primitive_building_blocks"></span>
</p>
<h2><span id=".D0.9F.D1.80.D0.B8.D0.BC.D0.B5.D0.BD.D0.B5.D0.BD.D0.B8.D0.B5_.D0.B2.D0.B5.D1.80.D1.81.D1.82.D0.B0.D0.BA.D0.B0_Part_.D0.B4.D0.BB.D1.8F_.D1.81.D0.BE.D0.B7.D0.B4.D0.B0.D0.BD.D0.B8.D1.8F_.D0.BC.D0.BE.D0.B4.D0.B5.D0.BB.D0.B8_.D1.81_.D0.B8.D1.81.D0.BF.D0.BE.D0.BB.D1.8C.D0.B7.D0.BE.D0.B2.D0.B0.D0.BD.D0.B8.D0.B5.D0.BC_.D0.BF.D1.80.D0.B8.D0.BC.D0.B8.D1.82.D0.B8.D0.B2.D0.BE.D0.B2"></span><span class="mw-headline" id="&#1055;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;_&#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072;_Part_&#1076;&#1083;&#1103;_&#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103;_&#1084;&#1086;&#1076;&#1077;&#1083;&#1080;_&#1089;_&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084;_&#1087;&#1088;&#1080;&#1084;&#1080;&#1090;&#1080;&#1074;&#1086;&#1074;">&#1055;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; Part &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1087;&#1088;&#1080;&#1084;&#1080;&#1090;&#1080;&#1074;&#1086;&#1074;</span></h2>
<p>&#1057;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1085;&#1086;&#1074;&#1099;&#1081; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; &#1080; &#1089;&#1088;&#1072;&#1079;&#1091; &#1078;&#1077; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1077; &#1077;&#1075;&#1086; &#1087;&#1086;&#1076; &#1085;&#1086;&#1074;&#1099;&#1084; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084;. &#1042;&#1086;&#1079;&#1100;&#1084;&#1080;&#1090;&#1077; &#1093;&#1086;&#1088;&#1086;&#1096;&#1091;&#1102; &#1087;&#1088;&#1080;&#1074;&#1099;&#1095;&#1082;&#1091; &#1088;&#1077;&#1075;&#1091;&#1083;&#1103;&#1088;&#1085;&#1086; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1100; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;, &#1080;&#1083;&#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1093;&#1086;&#1090;&#1103; &#1073;&#1099; &#1087;&#1077;&#1088;&#1077;&#1076; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1084;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;. &#1047;&#1072;&#1090;&#1077;&#1084; &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; <b><a href="../ru/Part_Workbench.html" title="Part Workbench/ru">Part</a></b> &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1083;&#1080;&#1073;&#1086; <a href="../ru/Getting_started.html#Exploring_the_interface" title="Getting started/ru">&#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1077;&#1083;&#1100; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1086;&#1074;</a> (&#1087;&#1086;&#1084;&#1077;&#1095;&#1077;&#1085; &#1095;&#1080;&#1089;&#1083;&#1086;&#1084; 10 &#1085;&#1072; &#1082;&#1072;&#1088;&#1090;&#1080;&#1085;&#1082;&#1077; &#1087;&#1086; &#1089;&#1089;&#1099;&#1083;&#1082;&#1077;), &#1083;&#1080;&#1073;&#1086; &#1095;&#1077;&#1088;&#1077;&#1079; &#1075;&#1083;&#1072;&#1074;&#1085;&#1086;&#1077; &#1084;&#1077;&#1085;&#1102; <b>&#1042;&#1080;&#1076; &rarr; &#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;</b>. FreeCAD &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1089;&#1103; &#1089; &#1087;&#1072;&#1085;&#1077;&#1083;&#1103;&#1084;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074;&#1074;&#1077;&#1088;&#1093;&#1091;, &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1084; &#1074;&#1080;&#1076;&#1086;&#1084; &#1089;&#1083;&#1077;&#1074;&#1072; &#1080; 3D &#1074;&#1080;&#1076;&#1086;&#1084; &#1089;&#1087;&#1088;&#1072;&#1074;&#1072;.
</p><p><span id="Create_the_main_solid_block"></span>
</p>
<h3><span id=".D0.A1.D0.BE.D0.B7.D0.B4.D0.B0.D0.BD.D0.B8.D0.B5_.D0.BE.D1.81.D0.BD.D0.BE.D0.B2.D0.BD.D0.BE.D0.B3.D0.BE_.D1.82.D0.B2.D0.B5.D1.80.D0.B4.D0.BE.D0.B3.D0.BE_.D1.82.D0.B5.D0.BB.D0.B0"></span><span class="mw-headline" id="&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077;_&#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1075;&#1086;_&#1090;&#1074;&#1077;&#1088;&#1076;&#1086;&#1075;&#1086;_&#1090;&#1077;&#1083;&#1072;">&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1075;&#1086; &#1090;&#1074;&#1077;&#1088;&#1076;&#1086;&#1075;&#1086; &#1090;&#1077;&#1083;&#1072;</span></h3>
<div class="mw-translate-fuzzy">
<p>&#1050;&#1083;&#1080;&#1082;&#1085;&#1080;&#1090;&#1077; &#1084;&#1099;&#1096;&#1082;&#1086;&#1081; &#1085;&#1072; &#1080;&#1082;&#1086;&#1085;&#1082;&#1077; <span typeof="mw:File"><a href="../Part_Box.html" title="Part Box"><img src="../File/Part_Box.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Part_Box.html" title="Part Box/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1090;&#1074;&#1077;&#1088;&#1076;&#1086;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1082;&#1091;&#1073;</a> &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1091;&#1073;. &#1054;&#1085; &#1087;&#1086;&#1103;&#1074;&#1080;&#1090;&#1089;&#1103; &#1074; &#1086;&#1082;&#1085;&#1077; <a href="../ru/3D_view.html" class="mw-redirect" title="3D view/ru">3D &#1074;&#1080;&#1076;</a> &#1080; &#1074; &#1074;&#1080;&#1076;&#1077; &#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1074; <a href="../ru/Tree_view.html" class="mw-redirect" title="Tree view/ru">&#1044;&#1077;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;</a> &#1085;&#1072; &#1073;&#1086;&#1082;&#1086;&#1074;&#1086;&#1081; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080;.
</p>
</div>
<p>&#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; <span typeof="mw:File"><a href="../Std_ViewIsometric.html" title="Std ViewIsometric"><img src="../File/Std_ViewIsometric.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Std_ViewIsometric.html" title="Std ViewIsometric/ru">&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1080;&#1079;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1074;&#1080;&#1076;</a> &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1082;&#1091;&#1073; &#1074; 3D &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1077;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb01-03_cube1.png&amp;filetimestamp=20220605100125&amp;.html" class="mw-file-description"><img src="../File/T101pwb01-03_cube1.png" decoding="async" width="628" height="506" class="mw-file-element" data-file-width="628" data-file-height="506"></a><figcaption></figcaption></figure>
<p>&#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1082;&#1091;&#1073; &#1074; <a href="../ru/Tree_view.html" class="mw-redirect" title="Tree view/ru">&#1044;&#1077;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;</a>, &#1074; &#1086;&#1082;&#1085;&#1077; 3D &#1074;&#1080;&#1076;&#1072; &#1086;&#1085; &#1086;&#1082;&#1088;&#1072;&#1089;&#1080;&#1090;&#1089;&#1103; &#1074; &#1079;&#1077;&#1083;&#1105;&#1085;&#1099;&#1081; &#1094;&#1074;&#1077;&#1090;. &#1053;&#1080;&#1078;&#1077; &#1074; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1074;&#1099; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1089;&#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1082;&#1091;&#1073; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085; &#1089; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072;&#1084;&#1080; <b>&#1044;&#1083;&#1080;&#1085;&#1072; x &#1064;&#1080;&#1088;&#1080;&#1085;&#1072; x &#1042;&#1099;&#1089;&#1086;&#1090;&#1072;</b> &#1074; <i>10 x 10 x 10 mm</i>. &#1048;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1101;&#1090;&#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1085;&#1072; <b>100 x 30 x 50</b>, &#1101;&#1090;&#1086; &#1073;&#1091;&#1076;&#1091;&#1090; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb01-04_cubedims.png&amp;filetimestamp=20220605100146&amp;.html" class="mw-file-description"><img src="../File/T101pwb01-04_cubedims.png" decoding="async" width="700" height="362" class="mw-file-element" data-file-width="700" data-file-height="362"></a><figcaption></figcaption></figure>
<p>&#1044;&#1083;&#1103; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;, &#1090;&#1072;&#1082;&#1080;&#1093; &#1082;&#1072;&#1082; <i>&#1044;&#1083;&#1080;&#1085;&#1072;</i>, &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1086;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089;&#1087;&#1080;&#1085;&#1073;&#1086;&#1082;&#1089;&#1086;&#1084;, &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1074;&#1074;&#1077;&#1089;&#1090;&#1080; &#1095;&#1080;&#1089;&#1083;&#1086;&#1074;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1080;&#1083;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1086;&#1083;&#1077;&#1089;&#1080;&#1082;&#1072; &#1084;&#1099;&#1096;&#1082;&#1080;. &#1050;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080; &#1089;&#1086; &#1089;&#1090;&#1088;&#1077;&#1083;&#1082;&#1072;&#1084;&#1080; &#1074;&#1074;&#1077;&#1088;&#1093; &#1080; &#1074;&#1085;&#1080;&#1079; &#1090;&#1072;&#1082; &#1078;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;. &#1042; &#1089;&#1072;&#1084;&#1086;&#1084; &#1087;&#1088;&#1072;&#1074;&#1086;&#1084; &#1086;&#1082;&#1085;&#1077; &#1085;&#1072; &#1082;&#1072;&#1088;&#1090;&#1080;&#1085;&#1082;&#1077; &#1074;&#1099;&#1096;&#1077;, &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; <i>&#1042;&#1099;&#1089;&#1086;&#1090;&#1072;</i> &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1086; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1080; &#1077;&#1089;&#1083;&#1080; &#1074; &#1090;&#1072;&#1082;&#1086;&#1084; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; &#1087;&#1086;&#1082;&#1088;&#1091;&#1090;&#1080;&#1090;&#1100; &#1082;&#1086;&#1083;&#1077;&#1089;&#1080;&#1082;&#1086; &#1084;&#1099;&#1096;&#1082;&#1080;, &#1090;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100;.
</p><p>&#1050;&#1083;&#1080;&#1082;&#1085;&#1080;&#1090;&#1077; &#1084;&#1099;&#1096;&#1082;&#1086;&#1081; &#1085;&#1072; &#1080;&#1082;&#1086;&#1085;&#1082;&#1077; <span typeof="mw:File"><a href="../Std_ViewFitAll.html" title="Std ViewFitAll"><img src="../File/Std_ViewFitAll.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b><a href="../ru/Std_ViewFitAll.html" title="Std ViewFitAll/ru">&#1059;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1074;&#1089;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085;&#1077;</a></b> &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100; &#1074; &#1094;&#1077;&#1085;&#1090;&#1088; &#1086;&#1082;&#1085;&#1072; 3D &#1074;&#1080;&#1076;&#1072;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb01-05_cube2.png&amp;filetimestamp=20220605100204&amp;.html" class="mw-file-description"><img src="../File/T101pwb01-05_cube2.png" decoding="async" width="629" height="508" class="mw-file-element" data-file-width="629" data-file-height="508"></a><figcaption></figcaption></figure>
<p><span id="Create_the_fillet"></span>
</p>
<h3><span id=".D0.A1.D0.BE.D0.B7.D0.B4.D0.B0.D0.BD.D0.B8.D0.B5_.D1.81.D0.BA.D1.80.D1.83.D0.B3.D0.BB.D0.B5.D0.BD.D0.B8.D1.8F"></span><span class="mw-headline" id="&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077;_&#1089;&#1082;&#1088;&#1091;&#1075;&#1083;&#1077;&#1085;&#1080;&#1103;">&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1089;&#1082;&#1088;&#1091;&#1075;&#1083;&#1077;&#1085;&#1080;&#1103;</span></h3>
<p>&#1044;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1089;&#1082;&#1088;&#1091;&#1075;&#1083;&#1077;&#1085;&#1080;&#1077; &#1088;&#1077;&#1073;&#1088;&#1072; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;, &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1080;&#1082;&#1086;&#1085;&#1082;&#1091; <span typeof="mw:File"><a href="../Part_Fillet.html" title="Part Fillet"><img src="../File/Part_Fillet.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b><a href="../ru/Part_Fillet.html" title="Part Fillet/ru">&#1057;&#1082;&#1088;&#1091;&#1075;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1082;&#1088;&#1072;&#1103; &#1092;&#1086;&#1088;&#1084;&#1099;</a></b>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1086;&#1090;&#1082;&#1088;&#1086;&#1077;&#1090; <i>&#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1079;&#1072;&#1076;&#1072;&#1095;</i> &#1076;&#1083;&#1103; &#1089;&#1082;&#1088;&#1091;&#1075;&#1083;&#1077;&#1085;&#1080;&#1081; &#1074; <a href="../ru/Combo_view.html" class="mw-redirect" title="Combo view/ru">&#1050;&#1086;&#1084;&#1073;&#1086; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080;</a>. &#1059;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084; &#1084;&#1099;&#1096;&#1080; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1074;&#1077;&#1088;&#1093;&#1085;&#1080;&#1081; &#1087;&#1088;&#1072;&#1074;&#1099;&#1081; &#1091;&#1075;&#1086;&#1083; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; &#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <i>&#1056;&#1072;&#1076;&#1080;&#1091;&#1089;</i> &#1074; 20 &#1084;&#1084;, &#1080; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">OK</span>.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb01-06_filletrad.png&amp;filetimestamp=20220605100233&amp;.html" class="mw-file-description"><img src="../File/T101pwb01-06_filletrad.png" decoding="async" width="885" height="576" class="mw-file-element" data-file-width="885" data-file-height="576"></a><figcaption></figcaption></figure> 
<p><i>&#1055;&#1072;&#1085;&#1077;&#1083;&#1100; &#1079;&#1072;&#1076;&#1072;&#1095;</i> &#1079;&#1072;&#1082;&#1088;&#1086;&#1077;&#1090;&#1089;&#1103; &#1080; &#1085;&#1072; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1087;&#1086;&#1103;&#1074;&#1080;&#1090;&#1089;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; <i>Fillet</i> &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1087;&#1088;&#1077;&#1078;&#1085;&#1077;&#1075;&#1086; &#1082;&#1091;&#1073;&#1072;.
</p><p><span id="Visibility_of_children"></span>
</p>
<h3><span id=".D0.92.D0.B8.D0.B4.D0.B8.D0.BC.D0.BE.D1.81.D1.82.D1.8C_.D0.B4.D0.BE.D1.87.D0.B5.D1.80.D0.BD.D0.B8.D1.85_.D0.BE.D0.B1.D1.8A.D0.B5.D0.BA.D1.82.D0.BE.D0.B2"></span><span class="mw-headline" id="&#1042;&#1080;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100;_&#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1093;_&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;">&#1042;&#1080;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;</span></h3>
<p>&#1050;&#1083;&#1080;&#1082;&#1085;&#1080;&#1090;&#1077; &#1084;&#1099;&#1096;&#1082;&#1086;&#1081; &#1085;&#1072; &#1087;&#1083;&#1102;&#1089;&#1080;&#1082;&#1077;/&#1089;&#1090;&#1088;&#1077;&#1083;&#1086;&#1095;&#1082;&#1077; &#1074;&#1085;&#1080;&#1079; &#1074; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; <i>Fillet</i>. &#1069;&#1090;&#1086; &#1074; &#1085;&#1072;&#1096;&#1077;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; <i>Cube</i>,  &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1084;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1083;&#1080; &#1088;&#1072;&#1085;&#1077;&#1077;. &#1053;&#1086; &#1086;&#1085; &#1089;&#1077;&#1081;&#1095;&#1072;&#1089; &#1089;&#1090;&#1072;&#1083; &#1085;&#1077; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1084;, &#1089;&#1077;&#1088;&#1099;&#1084;. &#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1077;&#1075;&#1086; &#1080; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1087;&#1088;&#1086;&#1073;&#1077;&#1083; &ndash; &#1101;&#1090;&#1086; &#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090; &#1074;&#1080;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; <i>Cube</i> &#1080; &#1086;&#1085; &#1089;&#1077;&#1081;&#1095;&#1072;&#1089; &#1089;&#1085;&#1086;&#1074;&#1072; &#1089;&#1090;&#1072;&#1085;&#1077;&#1090; &#1074;&#1080;&#1076;&#1080;&#1084;&#1099;&#1084; &#1080; &#1077;&#1075;&#1086; &#1080;&#1082;&#1086;&#1085;&#1082;&#1072; &#1091;&#1078;&#1077; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1077;&#1088;&#1086;&#1081;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1079;&#1072;&#1092;&#1080;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1082;&#1083;&#1080;&#1082;&#1085;&#1080;&#1090;&#1077; &#1084;&#1099;&#1096;&#1082;&#1086;&#1081; &#1074; &#1087;&#1091;&#1089;&#1090;&#1086;&#1084; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1077; &#1076;&#1077;&#1088;&#1077;&#1074;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1074; &#1080;&#1083;&#1080; &#1086;&#1082;&#1085;&#1072; 3D &#1074;&#1080;&#1076;&#1072;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb01-07_fillet.png&amp;filetimestamp=20220605100253&amp;.html" class="mw-file-description"><img src="../File/T101pwb01-07_fillet.png" decoding="async" width="510" height="227" class="mw-file-element" data-file-width="510" data-file-height="227"></a><figcaption></figcaption></figure>
<p><span id="Create_the_chamfer"></span>
</p>
<h3><span id=".D0.A1.D0.BE.D0.B7.D0.B4.D0.B0.D0.BD.D0.B8.D0.B5_.D1.84.D0.B0.D1.81.D0.BA.D0.B8"></span><span class="mw-headline" id="&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077;_&#1092;&#1072;&#1089;&#1082;&#1080;">&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1092;&#1072;&#1089;&#1082;&#1080;</span></h3>
<p>&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1089;&#1086;&#1079;&#1076;&#1072;&#1076;&#1080;&#1084; 30-&#1090;&#1080; &#1075;&#1088;&#1072;&#1076;&#1091;&#1089;&#1085;&#1091;&#1102; &#1092;&#1072;&#1089;&#1082;&#1091;, &#1087;&#1088;&#1077;&#1076;&#1074;&#1072;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1074; &#1074;&#1080;&#1076;&#1080;&#1084;&#1099;&#1084; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; <i>&#1050;&#1091;&#1073;</i> &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; <i>&#1057;&#1082;&#1088;&#1091;&#1075;&#1083;&#1077;&#1085;&#1080;&#1077;</i>. &#1042; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1077; <a href="../ru/Part_Workbench.html" title="Part Workbench/ru">Part</a> &#1080;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1092;&#1072;&#1089;&#1086;&#1082;,  &#1085;&#1086; &#1084;&#1099; &#1089;&#1077;&#1081;&#1095;&#1072;&#1089; &#1089;&#1076;&#1077;&#1083;&#1072;&#1077;&#1084; &#1092;&#1072;&#1089;&#1082;&#1091; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1076;&#1088;&#1091;&#1075;&#1086;&#1075;&#1086; &#1087;&#1088;&#1080;&#1084;&#1080;&#1090;&#1080;&#1074;&#1072; &#1080; &#1073;&#1091;&#1083;&#1077;&#1074;&#1086;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1086;&#1073;&#1088;&#1077;&#1079;&#1072;&#1085;&#1080;&#1103;.
</p>
<div class="mw-translate-fuzzy">
<p>&#1057;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1085;&#1086;&#1074;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; <span typeof="mw:File"><a href="../Part_Box.html" title="Part Box"><img src="../File/Part_Box.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b><a href="../ru/Part_Box.html" title="Part Box/ru">&#1058;&#1074;&#1077;&#1088;&#1076;&#1086;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1082;&#1091;&#1073;</a></b> &#1080; &#1076;&#1072;&#1081;&#1090;&#1077; &#1077;&#1084;&#1091; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; 60 x 30 x 30. &#1042; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1077; <b>Placement</b> &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1091;&#1075;&#1086;&#1083; &#1074; -30 &#1075;&#1088;&#1072;&#1076;&#1091;&#1089;&#1086;&#1074;.
</p>
</div>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb01-08_chamfer1.png&amp;filetimestamp=20220605100310&amp;.html" class="mw-file-description"><img src="../File/T101pwb01-08_chamfer1.png" decoding="async" width="952" height="490" class="mw-file-element" data-file-width="952" data-file-height="490"></a><figcaption></figcaption></figure>
<p>&#1059;&#1075;&#1086;&#1083; &#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; <b> &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1085;&#1099;&#1077; &#1086;&#1089;&#1080;</b> &#1082;&#1072;&#1082; &#1086;&#1089;&#1080; &#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103;. &#1054;&#1089;&#1100;&#1102; &#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1086;&#1089;&#1100; Z, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1085;&#1072;&#1084; &#1085;&#1077; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1080;&#1090;. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1089;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1086;&#1089;&#1100; &#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072; &#1086;&#1089;&#1100; Y, &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1074; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; z &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; <i>&#1054;&#1089;&#1100;</i> &#1074; 0, &#1072; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; y &#1074; 1.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb01-09_chamfer2.png&amp;filetimestamp=20220605100325&amp;.html" class="mw-file-description"><img src="../File/T101pwb01-09_chamfer2.png" decoding="async" width="952" height="490" class="mw-file-element" data-file-width="952" data-file-height="490"></a><figcaption></figcaption></figure>
<p>&#1058;&#1086;&#1075;&#1086; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1076;&#1086;&#1089;&#1090;&#1080;&#1095;&#1100;, &#1077;&#1089;&#1083;&#1080; &#1091;&#1075;&#1086;&#1083; &#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103; &#1084;&#1099; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1084; &#1074; +30 &#1075;&#1088;&#1072;&#1076;&#1091;&#1089;&#1086;&#1074;, &#1072; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1091; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; <i>&#1054;&#1089;&#1100;</i> &#1074; -1.
</p><p><span id="Python_console"></span>
</p>
<h4><span id=".D0.9A.D0.BE.D0.BD.D1.81.D0.BE.D0.BB.D1.8C_Python"></span><span class="mw-headline" id="&#1050;&#1086;&#1085;&#1089;&#1086;&#1083;&#1100;_Python">&#1050;&#1086;&#1085;&#1089;&#1086;&#1083;&#1100; Python</span></h4>
<p>&#1045;&#1089;&#1083;&#1080; &#1087;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1085;&#1072; &#1095;&#1077;&#1088;&#1090;&#1077;&#1078; &#1075;&#1086;&#1090;&#1086;&#1074;&#1086;&#1081; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080;, &#1090;&#1086; &#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1090;&#1077;&#1083;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1084;&#1099; &#1089;&#1077;&#1081;&#1095;&#1072;&#1089; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1083;&#1080;, &#1085;&#1091;&#1078;&#1085;&#1086; &#1089;&#1082;&#1086;&#1088;&#1088;&#1077;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;. &#1053;&#1086; &#1085;&#1077;&#1090; &#1090;&#1086;&#1095;&#1085;&#1086;&#1081; &#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1085;&#1099;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1084;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1087;&#1086;&#1076;&#1085;&#1103;&#1090;&#1100; &#1077;&#1075;&#1086; &#1074;&#1074;&#1077;&#1088;&#1093;. &#1045;&#1105; &#1084;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1080;&#1090;&#1100;. &#1044;&#1072;&#1074;&#1072;&#1081;&#1090;&#1077; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1076;&#1077;&#1083;&#1072;&#1077;&#1084; &#1074; <b><a href="../ru/Python_console.html" class="mw-redirect" title="Python console/ru">&#1050;&#1086;&#1085;&#1089;&#1086;&#1083;&#1080; Python</a></b>, &#1101;&#1090;&#1086; &#1086;&#1089;&#1085;&#1086;&#1074;&#1099; &#1090;&#1088;&#1080;&#1075;&#1086;&#1085;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080;. &#1045;&#1089;&#1083;&#1080; &#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1100; Python &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; FreeCAD &#1091; &#1074;&#1072;&#1089; &#1085;&#1077; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1090;&#1086; &#1074; &#1087;&#1091;&#1089;&#1090;&#1086;&#1084; &#1084;&#1077;&#1089;&#1090;&#1077; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1087;&#1088;&#1072;&#1074;&#1091;&#1102; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1084;&#1099;&#1096;&#1080;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1100;&#1090;&#1077; &#1075;&#1072;&#1083;&#1086;&#1095;&#1082;&#1091; &#1074; &#1089;&#1090;&#1088;&#1086;&#1095;&#1082;&#1077; <i>&#1050;&#1086;&#1085;&#1089;&#1086;&#1083;&#1100; Python</i>. &#1050;&#1086;&#1085;&#1089;&#1086;&#1083;&#1100; &#1087;&#1086;&#1103;&#1074;&#1080;&#1090;&#1089;&#1103; &#1074; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1084; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1077; FreeCAD. &#1058;&#1086; &#1078;&#1077; &#1089;&#1072;&#1084;&#1086;&#1077; &#1089;&#1076;&#1077;&#1083;&#1072;&#1081;&#1090;&#1077; &#1089; &#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1100;&#1102; <b><a href="../ru/Report_view.html" class="mw-redirect" title="Report view/ru">&#1054;&#1090;&#1095;&#1077;&#1090;</a></b>. &#1053;&#1072; &#1085;&#1077;&#1081; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1080;&#1083;&#1080; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1085;&#1091;&#1078;&#1085;&#1086; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1076;&#1072;&#1083;&#1100;&#1096;&#1077; &#1076;&#1083;&#1103; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1082;&#1086;&#1084;&#1084;&#1072;&#1085;&#1076;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb01-10_pyconsole.png&amp;filetimestamp=20220605100353&amp;.html" class="mw-file-description"><img src="../File/T101pwb01-10_pyconsole.png" decoding="async" width="462" height="190" class="mw-file-element" data-file-width="462" data-file-height="190"></a><figcaption></figcaption></figure>
<p>&#1042; &#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1080; Python &#1087;&#1088;&#1077;&#1078;&#1076;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086; &#1084;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1100; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1091;&#1102; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1091; <b><a rel="nofollow" class="external text" href="https://docs.python.org/3/library/math.html#module-math">math</a></b>, &#1087;&#1086;&#1089;&#1083;&#1077; &#1095;&#1077;&#1075;&#1086; &#1087;&#1086; &#1092;&#1086;&#1088;&#1084;&#1091;&#1083;&#1077; <i>(50 - math.tan(math.radians(30)) * 50)</i> &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1080;&#1090;&#1100; &#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1085;&#1091;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1085;&#1091;&#1078;&#1085;&#1086; &#1087;&#1086;&#1076;&#1085;&#1103;&#1090;&#1100; &#1090;&#1077;&#1083;&#1086; &#1074; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080; &#1086;&#1089;&#1080; Z.
&#1057;&#1082;&#1086;&#1087;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1081; &#1080;&#1079; &#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1080; Python &#1080; &#1074;&#1089;&#1090;&#1072;&#1074;&#1100;&#1090;&#1077;
&#1077;&#1075;&#1086; &#1074; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; z &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; <i>&#1055;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;</i> &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; <b>Cube001</b>. &#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1076;&#1083;&#1103; &#1089;&#1085;&#1103;&#1090;&#1080;&#1103; &#1092;&#1072;&#1089;&#1082;&#1080; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086; &#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085; &#1080; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb01-11_chamfer3.png&amp;filetimestamp=20220605100410&amp;.html" class="mw-file-description"><img src="../File/T101pwb01-11_chamfer3.png" decoding="async" width="952" height="490" class="mw-file-element" data-file-width="952" data-file-height="490"></a><figcaption></figcaption></figure>
<p><span id="Expressions"></span>
</p>
<h4><span id=".D0.92.D1.8B.D1.80.D0.B0.D0.B6.D0.B5.D0.BD.D0.B8.D1.8F"></span><span class="mw-headline" id="&#1042;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;">&#1042;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;</span></h4>
<p>&#1044;&#1083;&#1103; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1081; &#1085;&#1077; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1100; Python, &#1074; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;&#1074; &#1087;&#1088;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077; &#1089; &#1095;&#1080;&#1089;&#1083;&#1086;&#1074;&#1099;&#1084;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1073;&#1086;&#1081;&#1090;&#1080;&#1089;&#1100; &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1099;&#1084; &#1082;&#1072;&#1083;&#1100;&#1082;&#1091;&#1083;&#1103;&#1090;&#1086;&#1088;&#1086;&#1084; FreeCAD. &#1042;&#1086; FreeCAD &#1101;&#1090;&#1086; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; <b><a href="../ru/Expressions.html" title="Expressions/ru">&#1042;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;</a></b>. &#1042; &#1088;&#1077;&#1078;&#1080;&#1084; <i>&#1042;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;</i> &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1074;&#1086;&#1081;&#1090;&#1080; &#1087;&#1086; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084;&#1091; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1102; &#1083;&#1077;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1084;&#1099;&#1096;&#1080; &#1085;&#1072; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1080; z &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; <i>&#1055;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;</i> &#1074; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;, &#1087;&#1086;&#1089;&#1083;&#1077; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1089;&#1087;&#1088;&#1072;&#1074;&#1072; &#1087;&#1086;&#1103;&#1074;&#1080;&#1090;&#1089;&#1103; &#1084;&#1072;&#1083;&#1077;&#1085;&#1100;&#1082;&#1080;&#1081; &#1082;&#1088;&#1091;&#1075;&#1083;&#1099;&#1081; &#1075;&#1086;&#1083;&#1091;&#1073;&#1086;&#1081; &#1079;&#1085;&#1072;&#1095;&#1086;&#1082;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb01-12_expression1.png&amp;filetimestamp=20220605100429&amp;.html" class="mw-file-description"><img src="../File/T101pwb01-12_expression1.png" decoding="async" width="295" height="78" class="mw-file-element" data-file-width="295" data-file-height="78"></a><figcaption></figcaption></figure> 
<p>&#1045;&#1089;&#1083;&#1080; &#1084;&#1099; &#1085;&#1072;&#1078;&#1084;&#1077;&#1084; &#1085;&#1072; &#1101;&#1090;&#1086;&#1090; &#1079;&#1085;&#1072;&#1095;&#1086;&#1082;, &#1087;&#1086;&#1103;&#1074;&#1080;&#1090;&#1089;&#1103; &#1084;&#1072;&#1083;&#1077;&#1085;&#1100;&#1082;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; <i>&#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088; &#1092;&#1086;&#1088;&#1084;&#1091;&#1083;</i>, &#1075;&#1076;&#1077;, &#1082;&#1072;&#1082; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1085;&#1080;&#1078;&#1077;, &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100; &#1092;&#1086;&#1088;&#1084;&#1091;&#1083;&#1099; &#1080; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1042;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; - &#1101;&#1090;&#1086; &#1084;&#1086;&#1097;&#1085;&#1099;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;, &#1090;.&#1082;. &#1086;&#1085;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1086;&#1087;&#1077;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;&#1084;&#1080; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1080;&#1093; &#1082;&#1072;&#1082; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077; &#1087;&#1088;&#1080; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103;&#1093;. &#1050;&#1086;&#1088;&#1086;&#1095;&#1077;, &#1074; &#1085;&#1072;&#1096;&#1077;&#1081; &#1092;&#1086;&#1088;&#1084;&#1091;&#1083;&#1077; &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1095;&#1080;&#1089;&#1083;&#1072; 50 &#1084;&#1099; &#1084;&#1086;&#1075;&#1083;&#1080; &#1073;&#1099; &#1074;&#1074;&#1077;&#1089;&#1090;&#1080; <i>&#1048;&#1084;&#1103; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;</i>, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1077;&#1075;&#1086; &#1074;&#1099;&#1089;&#1086;&#1090;&#1091; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1075;&#1086; &#1090;&#1077;&#1083;&#1072;. &#1058;&#1086;&#1075;&#1076;&#1072; &#1073;&#1099; &#1087;&#1088;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1080; &#1074;&#1099;&#1089;&#1086;&#1090;&#1099; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1075;&#1086; &#1090;&#1077;&#1083;&#1072; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1083;&#1086;&#1089;&#1100; &#1073;&#1099; &#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1092;&#1072;&#1089;&#1082;&#1080;. 50 - &#1101;&#1090;&#1086; &#1074;&#1099;&#1089;&#1086;&#1090;&#1072; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1082;&#1091;&#1073;&#1072;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1089;&#1099;&#1083;&#1072;&#1090;&#1100;&#1089;&#1103; &#1082;&#1072;&#1082; <i>Cube.Height</i>, &#1090;.&#1077;. &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; <i>Height</i> &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; <i>Cube</i>. &#1041;&#1086;&#1083;&#1077;&#1077; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1091;&#1102; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1081;&#1090;&#1080; &#1085;&#1072; wiki.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb01-13_expression2.png&amp;filetimestamp=20220605100448&amp;.html" class="mw-file-description"><img src="../File/T101pwb01-13_expression2.png" decoding="async" width="300" height="129" class="mw-file-element" data-file-width="300" data-file-height="129"></a><figcaption></figcaption></figure> 
<div class="mw-translate-fuzzy">
<p>&#1063;&#1090;&#1086;&#1073;&#1099; &#1089;&#1085;&#1103;&#1090;&#1100; &#1092;&#1072;&#1089;&#1082;&#1091;, &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1080; &#1076;&#1077;&#1088;&#1078;&#1080;&#1090;&#1077; &#1085;&#1072;&#1078;&#1072;&#1090;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">Ctrl</span>, &#1079;&#1072;&#1090;&#1077;&#1084; &#1083;&#1077;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; &#1084;&#1099;&#1096;&#1080; &#1082;&#1083;&#1080;&#1082;&#1085;&#1080;&#1090;&#1077; &#1085;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1077; <b>Fillet</b> &#1074; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;, &#1087;&#1086;&#1090;&#1086;&#1084; &#1085;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1077; &#1074;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1082;&#1091;&#1073;&#1072; (&#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; <b>Cube001</b>) &#1080;, &#1085;&#1072;&#1082;&#1086;&#1085;&#1077;&#1094;, &#1074; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1082;&#1083;&#1080;&#1082;&#1085;&#1080;&#1090;&#1077; &#1085;&#1072; &#1080;&#1082;&#1086;&#1085;&#1082;&#1077; <span typeof="mw:File"><a href="../Part_Cut.html" title="Part Cut"><img src="../File/Part_Cut.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b><a href="../ru/Part_Cut.html" title="Part Cut/ru">&#1054;&#1073;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100; &#1076;&#1074;&#1077; &#1092;&#1080;&#1075;&#1091;&#1088;&#1099;</a></b>. &#1053;&#1072; &#1074;&#1072;&#1096;&#1077;&#1084; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;&#1089;&#1103; &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1087;&#1086;&#1076; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; <b>Cut</b>.
</p>
</div>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb01-14_model1.png&amp;filetimestamp=20220605100514&amp;.html" class="mw-file-description"><img src="../File/T101pwb01-14_model1.png" decoding="async" width="414" height="292" class="mw-file-element" data-file-width="414" data-file-height="292"></a><figcaption></figcaption></figure>
<p><span id="The_toolbars"></span>
</p>
<h4><span id=".D0.9F.D0.B0.D0.BD.D0.B5.D0.BB.D0.B8_.D0.B8.D0.BD.D1.81.D1.82.D1.80.D1.83.D0.BC.D0.B5.D0.BD.D1.82.D0.BE.D0.B2"></span><span class="mw-headline" id="&#1055;&#1072;&#1085;&#1077;&#1083;&#1080;_&#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;">&#1055;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;</span></h4>
<p>&#1055;&#1086;&#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1084; &#1086; &#1087;&#1072;&#1085;&#1077;&#1083;&#1103;&#1093; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1090;.&#1082;. &#1086;&#1085;&#1080; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1089;&#1072;&#1084;&#1099;&#1084; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1085;&#1099;&#1084; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1086;&#1084; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;. &#1056;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1087;&#1072;&#1085;&#1077;&#1083;&#1077;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1076;&#1072;&#1083;&#1077;&#1082;&#1080;&#1084; &#1086;&#1090; &#1080;&#1076;&#1077;&#1072;&#1083;&#1072; &#1085;&#1072; &#1084;&#1086;&#1085;&#1080;&#1090;&#1086;&#1088;&#1077; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072;. &#1053;&#1086;, &#1082; &#1089;&#1095;&#1072;&#1089;&#1090;&#1100;&#1102;, &#1080;&#1093; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1083;&#1077;&#1075;&#1082;&#1086; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100;. &#1055;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; &#1085;&#1072; &#1074;&#1077;&#1088;&#1093;&#1085;&#1102;&#1102; &#1095;&#1072;&#1089;&#1090;&#1100; &#1082;&#1072;&#1088;&#1090;&#1080;&#1085;&#1082;&#1080; &#1085;&#1080;&#1078;&#1077;. &#1053;&#1072; &#1085;&#1077;&#1081; &#1076;&#1074;&#1072; &#1088;&#1103;&#1076;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1077;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1085;&#1086; &#1074;&#1080;&#1076;&#1085;&#1086; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1085;&#1086;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1082;&#1085;&#1086;&#1087;&#1086;&#1082; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; <a href="../ru/Part_Workbench.html" title="Part Workbench/ru">Part</a>. &#1055;&#1088;&#1086;&#1089;&#1090;&#1077;&#1081;&#1096;&#1080;&#1081; &#1087;&#1091;&#1090;&#1100; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1074;&#1080;&#1076;&#1080;&#1084;&#1099;&#1084; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1082;&#1085;&#1086;&#1087;&#1086;&#1082; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; - &#1101;&#1090;&#1086; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1080;&#1090;&#1100; &#1086;&#1082;&#1085;&#1086; FreeCAD, &#1077;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086; &#1077;&#1097;&#1077; &#1085;&#1077; &#1089;&#1076;&#1077;&#1083;&#1072;&#1085;&#1086;.
</p><p>&#1054;&#1073;&#1099;&#1095;&#1085;&#1086; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1087;&#1072;&#1085;&#1077;&#1083;&#1077;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1085;&#1072;&#1089;&#1090;&#1088;&#1072;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1076; &#1089;&#1074;&#1086;&#1081; &#1074;&#1082;&#1091;&#1089; &#1080; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1084;&#1086;&#1085;&#1080;&#1090;&#1086;&#1088;&#1072;. &#1044;&#1083;&#1103; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1085;&#1072;&#1078;&#1072;&#1090;&#1100; &#1083;&#1077;&#1074;&#1091;&#1102; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1085;&#1072; &#1083;&#1077;&#1074;&#1086;&#1084; &#1082;&#1088;&#1072;&#1077; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080; &#1085;&#1077; &#1086;&#1090;&#1087;&#1091;&#1089;&#1082;&#1072;&#1103; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1087;&#1077;&#1088;&#1077;&#1085;&#1077;&#1089;&#1090;&#1080; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1074; &#1085;&#1091;&#1078;&#1085;&#1086;&#1077; &#1084;&#1077;&#1089;&#1090;&#1086;, &#1079;&#1072;&#1090;&#1077;&#1084; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1086;&#1090;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100;. &#1042; &#1085;&#1080;&#1078;&#1085;&#1077;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080; &#1082;&#1072;&#1088;&#1090;&#1080;&#1085;&#1082;&#1080; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1087;&#1072;&#1085;&#1077;&#1083;&#1077;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1073;&#1099;&#1083;&#1086; &#1089;&#1082;&#1086;&#1088;&#1088;&#1077;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1086;, &#1076;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1080;&#1093; &#1087;&#1086;&#1083;&#1085;&#1086;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;. &#1056;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1087;&#1072;&#1085;&#1077;&#1083;&#1077;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1079;&#1072;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1077;&#1090;&#1089;&#1103;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb01-141_toolbars.png&amp;filetimestamp=20220801140324&amp;.html" class="mw-file-description"><img src="../File/T101pwb01-141_toolbars.png" decoding="async" width="876" height="337" class="mw-file-element" data-file-width="876" data-file-height="337"></a><figcaption></figcaption></figure>
<p><span id="The_measurement_tool"></span>
</p>
<h4><span id=".D0.98.D0.B7.D0.BC.D0.B5.D1.80.D0.B8.D1.82.D0.B5.D0.BB.D1.8C.D0.BD.D1.8B.D0.B9_.D0.B8.D0.BD.D1.81.D1.82.D1.80.D1.83.D0.BC.D0.B5.D0.BD.D1.82"></span><span class="mw-headline" id="&#1048;&#1079;&#1084;&#1077;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081;_&#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;">&#1048;&#1079;&#1084;&#1077;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;</span></h4>
<p>&#1044;&#1083;&#1103; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1080; &#1085;&#1072;&#1096;&#1080;&#1093; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1081; &#1080; &#1074;&#1077;&#1088;&#1085;&#1086;&#1089;&#1090;&#1080; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1092;&#1072;&#1089;&#1082;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; <b><a href="../ru/Part_Workbench.html#Measure" title="Part Workbench/ru">&#1048;&#1079;&#1084;&#1077;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;</a></b> &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; <b>Part</b>. &#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1085;&#1072; &#1080;&#1082;&#1086;&#1085;&#1082;&#1091; <span typeof="mw:File"><a href="../Part_Measure_Linear.html" title="Part Measure Linear"><img src="../File/Part_Measure_Linear.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b><a href="../ru/Part_Measure_Linear.html" title="Part Measure Linear/ru">&#1056;&#1091;&#1083;&#1077;&#1090;&#1082;&#1072;</a></b>, &#1086;&#1090;&#1082;&#1088;&#1086;&#1077;&#1090;&#1089;&#1103; <i>&#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1079;&#1072;&#1076;&#1072;&#1095;</i>. &#1047;&#1072;&#1090;&#1077;&#1084; &#1084;&#1099;&#1096;&#1082;&#1086;&#1081; &#1085;&#1072; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1076;&#1074;&#1072; &#1082;&#1086;&#1085;&#1094;&#1072; &#1088;&#1077;&#1073;&#1088;&#1072; &#1092;&#1072;&#1089;&#1082;&#1080;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb01-15_model1measure1.png&amp;filetimestamp=20220605100548&amp;.html" class="mw-file-description"><img src="../File/T101pwb01-15_model1measure1.png" decoding="async" width="1007" height="490" class="mw-file-element" data-file-width="1007" data-file-height="490"></a><figcaption></figcaption></figure>
<p>&#1059;&#1073;&#1077;&#1076;&#1080;&#1074;&#1096;&#1080;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084;, &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1078;&#1072;&#1090;&#1100; &#1085;&#1072; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <i>Clear all dimensions</i> &#1080; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1100; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;.
</p><p><span id="Create_the_hole"></span>
</p>
<h3><span id=".D0.A1.D0.BE.D0.B7.D0.B4.D0.B0.D0.BD.D0.B8.D0.B5_.D0.BE.D1.82.D0.B2.D0.B5.D1.80.D1.81.D1.82.D0.B8.D1.8F"></span><span class="mw-headline" id="&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077;_&#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1103;">&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1103;</span></h3>
<p>&#1063;&#1090;&#1086;&#1073;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1077; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1085;&#1072; &#1080;&#1082;&#1086;&#1085;&#1082;&#1091; <span typeof="mw:File"><a href="../%D0%A1%D0%BE%D0%B7%D0%B4%D0%B0%D1%82%D1%8C_%D1%86%D0%B8%D0%BB%D0%B8%D0%BD%D0%B4%D1%80.html" title="&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;"><img src="../File/Part_Cylinder.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b><a href="../ru/Part_Cylinder.html" title="Part Cylinder/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;</a></b>, &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; <i>&#1088;&#1072;&#1076;&#1080;&#1091;&#1089;</i> &#1074; 5 &#1084;&#1084; &#1080; <i>&#1074;&#1099;&#1089;&#1086;&#1090;&#1091;</i> &#1074; 50 &#1084;&#1084;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb01-16_cyl1.png&amp;filetimestamp=20220605100603&amp;.html" class="mw-file-description"><img src="../File/T101pwb01-16_cyl1.png" decoding="async" width="1007" height="490" class="mw-file-element" data-file-width="1007" data-file-height="490"></a><figcaption></figcaption></figure>
<p>&#1044;&#1072;&#1083;&#1077;&#1077; &#1085;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1077; &#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1085;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072;&#1084; &#1085;&#1072; &#1095;&#1077;&#1088;&#1090;&#1077;&#1078;&#1077;. &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077;  <span typeof="mw:File"><a href="../Std_ViewTop.html" title="Std ViewTop"><img src="../File/Std_ViewTop.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b><a href="../ru/Std_ViewTop.html" title="Std ViewTop/ru">&#1042;&#1080;&#1076; &#1089;&#1074;&#1077;&#1088;&#1093;&#1091;</a></b>,  &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077;&#1084; &#1087;&#1088;&#1072;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; &#1084;&#1099;&#1096;&#1080; &#1085;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1077; <b>&#1062;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;</b> &#1074; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1086;&#1090;&#1082;&#1088;&#1086;&#1081;&#1090;&#1077; &#1084;&#1077;&#1085;&#1102; &#1080; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1074; &#1085;&#1077;&#1084; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091;  <b>&#1055;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;</b>.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb01-17_cyl1translate.png&amp;filetimestamp=20220605100621&amp;.html" class="mw-file-description"><img src="../File/T101pwb01-17_cyl1translate.png" decoding="async" width="1007" height="251" class="mw-file-element" data-file-width="1007" data-file-height="251"></a><figcaption></figcaption></figure>
<p>&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; <i>&#1055;&#1088;&#1080;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1077; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103;</i> &#1074; 5 &#1084;&#1084;. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1082;&#1088;&#1072;&#1089;&#1085;&#1091;&#1102; &#1080; &#1079;&#1077;&#1083;&#1077;&#1085;&#1091;&#1102; &#1089;&#1090;&#1088;&#1077;&#1083;&#1082;&#1080; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1077; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088; &#1085;&#1072; 15&#1084;&#1084; &#1087;&#1086; &#1086;&#1089;&#1080; y &#1080; &#1085;&#1072; 65&#1084;&#1084; &#1087;&#1086; &#1086;&#1089;&#1080; x. &#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1085;&#1091;&#1078;&#1085;&#1086; &#1085;&#1072; &#1089;&#1090;&#1088;&#1077;&#1083;&#1082;&#1077; &#1085;&#1072;&#1078;&#1072;&#1090;&#1100; &#1085;&#1072; &#1083;&#1077;&#1074;&#1091;&#1102; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1084;&#1099;&#1096;&#1080; &#1080; &#1085;&#1077; &#1086;&#1090;&#1087;&#1091;&#1089;&#1082;&#1072;&#1103; &#1077;&#1077; &#1074;&#1077;&#1089;&#1090;&#1080; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088; &#1082; &#1085;&#1091;&#1078;&#1085;&#1086;&#1081; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1080;, &#1079;&#1072;&#1090;&#1077;&#1084; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1086;&#1090;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100;. &#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">OK</span> &#1080; &#1079;&#1072;&#1082;&#1088;&#1086;&#1081;&#1090;&#1077; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075; <i>&#1055;&#1088;&#1080;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103;</i>. &#1063;&#1090;&#1086;&#1073;&#1099; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1077;, &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">Ctrl</span>, &#1083;&#1077;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; &#1084;&#1099;&#1096;&#1080; &#1085;&#1072; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; <b>Cut</b> &#1080; <b>&#1062;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;</b>, &#1079;&#1072;&#1090;&#1077;&#1084; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1085;&#1072; &#1080;&#1082;&#1086;&#1085;&#1082;&#1091; <span typeof="mw:File"><a href="../Part_Cut.html" title="Part Cut"><img src="../File/Part_Cut.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b><a href="../ru/Part_Cut.html" title="Part Cut/ru">&#1054;&#1073;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100; &#1076;&#1074;&#1077; &#1092;&#1080;&#1075;&#1091;&#1088;&#1099;</a></b> &#1074; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1085;&#1072; &#1074;&#1072;&#1096;&#1077;&#1084; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1076;&#1080;&#1085; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; <b>Cut001</b>.
</p><p>&#1055;&#1086;&#1079;&#1076;&#1088;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084;, &#1084;&#1086;&#1076;&#1077;&#1083;&#1100; &#1075;&#1086;&#1090;&#1086;&#1074;&#1072;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb01-18_model1complete.png&amp;filetimestamp=20220605100640&amp;.html" class="mw-file-description"><img src="../File/T101pwb01-18_model1complete.png" decoding="async" width="395" height="292" class="mw-file-element" data-file-width="395" data-file-height="292"></a><figcaption></figcaption></figure>
<p>&#1058;&#1077;&#1087;&#1077;&#1088;&#1100;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100; &#1075;&#1086;&#1090;&#1086;&#1074;&#1072;, &#1076;&#1072;&#1074;&#1072;&#1081;&#1090;&#1077; &#1080;&#1079;&#1091;&#1095;&#1080;&#1084; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1087;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1102; &#1089;&#1072;&#1084;&#1086;&#1081; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;, &#1077;&#1077; &#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1075;&#1086; &#1074;&#1080;&#1076;&#1072;, &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1080; &#1088;&#1072;&#1079;&#1085;&#1099;&#1077; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1099; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081;.
</p><p><span id="Changing_the_color_and_transparency"></span>
</p>
<h2><span id=".D0.98.D0.B7.D0.BC.D0.B5.D0.BD.D0.B5.D0.BD.D0.B8.D0.B5_.D1.86.D0.B2.D0.B5.D1.82.D0.B0_.D0.B8_.D0.BF.D1.80.D0.BE.D0.B7.D1.80.D0.B0.D1.87.D0.BD.D0.BE.D1.81.D1.82.D0.B8"></span><span class="mw-headline" id="&#1048;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;_&#1094;&#1074;&#1077;&#1090;&#1072;_&#1080;_&#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080;">&#1048;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1094;&#1074;&#1077;&#1090;&#1072; &#1080; &#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080;</span></h2>
<p>&#1042;&#1085;&#1077;&#1096;&#1085;&#1080;&#1081; &#1074;&#1080;&#1076; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1084;&#1080; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1072;&#1084;&#1080;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1080; <i>&#1042;&#1080;&#1076;</i> &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; &#1085;&#1072; &#1082;&#1086;&#1084;&#1073;&#1086; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080;. &#1055;&#1088;&#1086;&#1089;&#1090;&#1086; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1085;&#1072; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1081;&#1090;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; - &#1094;&#1074;&#1077;&#1090; &#1083;&#1080;&#1085;&#1080;&#1081;, &#1094;&#1074;&#1077;&#1090; &#1092;&#1086;&#1088;&#1084;&#1099; &#1080;&#1083;&#1080; &#1077;&#1105; &#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb02-01_appearance1.png&amp;filetimestamp=20220605100705&amp;.html" class="mw-file-description"><img src="../File/T101pwb02-01_appearance1.png" decoding="async" width="319" height="535" class="mw-file-element" data-file-width="319" data-file-height="535"></a><figcaption></figcaption></figure>
<p>&#1050; &#1089;&#1086;&#1078;&#1072;&#1083;&#1077;&#1085;&#1080;&#1102;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1072;&#1082;&#1090;&#1080;&#1074;&#1077;&#1085; , &#1090;.&#1077;. &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;, &#1085;&#1077; &#1074;&#1080;&#1076;&#1085;&#1086;, &#1082;&#1072;&#1082;&#1080;&#1084; &#1073;&#1091;&#1076;&#1077;&#1090; &#1077;&#1075;&#1086; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1081; &#1074;&#1080;&#1076; &#1087;&#1086;&#1089;&#1083;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1085;&#1091;&#1078;&#1085;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1085;&#1077; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1084;. &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1080;&#1079;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1074;&#1080;&#1076;, &#1090;&#1072;&#1082; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1077; &#1074; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1080;&#1076;&#1085;&#1086; &#1083;&#1091;&#1095;&#1096;&#1077;. &#1044;&#1088;&#1091;&#1075;&#1080;&#1084; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1086;&#1084; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1081; &#1074;&#1080;&#1076; &#1084;&#1086;&#1078;&#1085;&#1086; &#1095;&#1077;&#1088;&#1077;&#1079; &#1084;&#1077;&#1085;&#1102;  <b>&#1042;&#1080;&#1076; &rarr; <span typeof="mw:File"><a href="../Std_SetAppearance.html" title="Std SetAppearance"><img src="../File/Std_SetAppearance.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> &#1042;&#1085;&#1077;&#1096;&#1085;&#1080;&#1081; &#1074;&#1080;&#1076;...</b>.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb02-02_appearance2.png&amp;filetimestamp=20220605100725&amp;.html" class="mw-file-description"><img src="../File/T101pwb02-02_appearance2.png" decoding="async" width="290" height="243" class="mw-file-element" data-file-width="290" data-file-height="243"></a><figcaption></figcaption></figure>
<p><span id="A_different_way_to_locate_the_hole"></span>
</p>
<h2><span id=".D0.94.D1.80.D1.83.D0.B3.D0.BE.D0.B9_.D1.81.D0.BF.D0.BE.D1.81.D0.BE.D0.B1_.D1.80.D0.B0.D0.B7.D0.BC.D0.B5.D1.89.D0.B5.D0.BD.D0.B8.D1.8F_.D0.BE.D1.82.D0.B2.D0.B5.D1.80.D1.81.D1.82.D0.B8.D1.8F"></span><span class="mw-headline" id="&#1044;&#1088;&#1091;&#1075;&#1086;&#1081;_&#1089;&#1087;&#1086;&#1089;&#1086;&#1073;_&#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103;_&#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1103;">&#1044;&#1088;&#1091;&#1075;&#1086;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1103;</span></h2>
<p>&#1042; &#1084;&#1077;&#1085;&#1102; <b>&#1060;&#1072;&#1081;&#1083; &rarr; &#1057;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1082;&#1072;&#1082;...</b> &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1087;&#1086;&#1076; &#1085;&#1086;&#1074;&#1099;&#1084; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084;. &#1059;&#1076;&#1072;&#1083;&#1080;&#1090;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; <b>Cut001</b> &#1080; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1077; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088; &#1074; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1091;&#1102; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1102;. 
&#1042;&#1072;&#1096;&#1072; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1077;&#1090;&#1100; &#1082;&#1072;&#1082; &#1085;&#1072; &#1082;&#1072;&#1088;&#1090;&#1080;&#1085;&#1082;&#1077; &#1085;&#1080;&#1078;&#1077;. &#1056;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1103; &#1074; &#1094;&#1077;&#1085;&#1090;&#1088;&#1077;  &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1081; &#1075;&#1088;&#1072;&#1085;&#1080; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;. &#1047;&#1072;&#1084;&#1077;&#1090;&#1100;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1094;&#1074;&#1077;&#1090; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; &#1086;&#1087;&#1103;&#1090;&#1100; &#1089;&#1090;&#1072;&#1083; &#1089;&#1077;&#1088;&#1099;&#1084; &#1080; &#1074;&#1089;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1099; &#1089;&#1076;&#1077;&#1083;&#1072;&#1083;&#1080;, &#1080;&#1089;&#1095;&#1077;&#1079;&#1083;&#1080;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb03-01_cyl.png&amp;filetimestamp=20220605100745&amp;.html" class="mw-file-description"><img src="../File/T101pwb03-01_cyl.png" decoding="async" width="754" height="379" class="mw-file-element" data-file-width="754" data-file-height="379"></a><figcaption></figcaption></figure> 
<p>&#1044;&#1083;&#1103; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1103; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1084;&#1099; &#1073;&#1091;&#1076;&#1077;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; <span typeof="mw:File"><a href="../Draft_Workbench.html" title="Draft Workbench"><img src="../File/Workbench_Draft.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b><a href="../ru/Draft_Workbench.html" title="Draft Workbench/ru">&#1063;&#1077;&#1088;&#1090;&#1077;&#1078;</a></b>. &#1054;&#1085;&#1086; &#1087;&#1086;-&#1087;&#1088;&#1077;&#1078;&#1085;&#1077;&#1084;&#1091; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1086; &#1074; &#1094;&#1077;&#1085;&#1090;&#1088;&#1077; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1081; &#1075;&#1088;&#1072;&#1085;&#1080; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;, &#1090;.&#1077;. &#1087;&#1086;&#1089;&#1077;&#1088;&#1077;&#1076;&#1080;&#1085;&#1077; &#1076;&#1080;&#1072;&#1075;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1083;&#1080;&#1085;&#1080;&#1081; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1081; &#1075;&#1088;&#1072;&#1085;&#1080;.
</p><p>&#1042;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; <b>Draft</b>, &#1074; 3D &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1087;&#1086;&#1103;&#1074;&#1080;&#1090;&#1089;&#1103; <i>&#1089;&#1077;&#1090;&#1082;&#1072;</i>. &#1054;&#1085;&#1072; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080; &#1074;&#1099;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; <span typeof="mw:File"><a href="../Draft_ToggleGrid.html" title="Draft ToggleGrid"><img src="../File/Draft_ToggleGrid.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Draft_ToggleGrid.html" title="Draft ToggleGrid/ru">Toggle Grid</a> &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; <b><a href="../ru/Draft_Snap.html" title="Draft Snap/ru">&#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1086;&#1082;</a></b> &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; <b>Draft</b> &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1081;&#1090;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1090;&#1077; <i>&#1090;&#1080;&#1087;&#1099; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1086;&#1082;</i> &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1091;&#1078;&#1085;&#1099; &#1074; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;. &#1057;&#1077;&#1081;&#1095;&#1072;&#1089; &#1085;&#1072;&#1084; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; <i>&#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1091;&#1102; &#1090;&#1086;&#1095;&#1082;&#1091;, &#1089;&#1088;&#1077;&#1076;&#1085;&#1102;&#1102; &#1090;&#1086;&#1095;&#1082;&#1091; &#1080; &#1094;&#1077;&#1085;&#1090;&#1088; &#1082;&#1088;&#1091;&#1075;&#1072;</i>, &#1090;.&#1077;. &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1086;&#1082; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1077;&#1090;&#1100; &#1082;&#1072;&#1082; &#1085;&#1072; &#1082;&#1072;&#1088;&#1090;&#1080;&#1085;&#1082;&#1077; &#1085;&#1080;&#1078;&#1077;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb03-02_snap.png&amp;filetimestamp=20220605100759&amp;.html" class="mw-file-description"><img src="../File/T101pwb03-02_snap.png" decoding="async" width="561" height="45" class="mw-file-element" data-file-width="561" data-file-height="45"></a><figcaption></figcaption></figure>
<p>&#1053;&#1072;&#1081;&#1090;&#1080; &#1090;&#1086;&#1095;&#1082;&#1091; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1094;&#1077;&#1085;&#1090;&#1088;&#1072; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1074; &#1076;&#1080;&#1072;&#1075;&#1086;&#1085;&#1072;&#1083;&#1100; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1074;&#1089;&#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1083;&#1080;&#1085;&#1080;&#1080; &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1077;&#1088;&#1077;&#1076;&#1080;&#1085;&#1091; &#1076;&#1080;&#1072;&#1075;&#1086;&#1085;&#1072;&#1083;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1090;&#1086;&#1095;&#1082;&#1080;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1094;&#1077;&#1085;&#1090;&#1088; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1072;. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1095;&#1090;&#1086; &#1085;&#1072;&#1084; &#1076;&#1072;&#1078;&#1077; &#1085;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1074;&#1089;&#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1083;&#1080;&#1085;&#1080;&#1080;, &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1072;&#1090;&#1100; &#1082; &#1091;&#1078;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1081; &#1090;&#1074;&#1077;&#1088;&#1076;&#1086;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080;.
</p><p>&#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; <b>&#1062;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;</b> &#1085;&#1072; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; (&#1086;&#1085; &#1089;&#1090;&#1072;&#1085;&#1077;&#1090; &#1079;&#1077;&#1083;&#1077;&#1085;&#1099;&#1084; &#1074; 3D &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1077;) &#1080; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1080;&#1082;&#1086;&#1085;&#1082;&#1091; <span typeof="mw:File"><a href="../Draft_Move.html" title="Draft Move"><img src="../File/Draft_Move.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b><a href="../ru/Draft_Move.html" title="Draft Move/ru">Move</a></b> &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1054;&#1090;&#1082;&#1088;&#1086;&#1077;&#1090;&#1089;&#1103; <i>&#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1079;&#1072;&#1076;&#1072;&#1095;</i> &#1076;&#1083;&#1103; &#1087;&#1077;&#1088;&#1077;&#1076;&#1074;&#1080;&#1075;&#1072;&#1077;&#1084;&#1099;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1091;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1095;&#1077;&#1082;&#1073;&#1086;&#1082;&#1089; <i>&#1050;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;</i> &#1074;&#1099;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb03-03_move.png&amp;filetimestamp=20220605100828&amp;.html" class="mw-file-description"><img src="../File/T101pwb03-03_move.png" decoding="async" width="318" height="453" class="mw-file-element" data-file-width="318" data-file-height="453"></a><figcaption></figcaption></figure>
<p>&#1047;&#1072;&#1090;&#1077;&#1084; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1077; &#1084;&#1099;&#1096;&#1100; &#1082; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1081; &#1075;&#1088;&#1072;&#1085;&#1080; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1072; &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1099; &#1091;&#1074;&#1080;&#1076;&#1077;&#1083;&#1080; <i>&#1073;&#1077;&#1083;&#1091;&#1102; &#1090;&#1086;&#1095;&#1082;&#1091;</i> &#1074; &#1094;&#1077;&#1085;&#1090;&#1088;&#1077; &#1082;&#1088;&#1091;&#1075;&#1072;, &#1082;&#1072;&#1082; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1085;&#1072; &#1083;&#1077;&#1074;&#1086;&#1084; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; &#1085;&#1080;&#1078;&#1077;. &#1069;&#1090;&#1086; &#1074;&#1084;&#1077;&#1089;&#1090;&#1077; &#1089; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1084; &#1088;&#1103;&#1076;&#1086;&#1084; &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084; &#1084;&#1099;&#1096;&#1080; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1097;&#1077;&#1083;&#1095;&#1086;&#1082; &#1083;&#1077;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; &#1084;&#1099;&#1096;&#1080; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1090; &#1082; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1077; &#1082; &#1073;&#1077;&#1083;&#1086;&#1081; &#1090;&#1086;&#1095;&#1082;&#1077;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb03-04_snapselect.png&amp;filetimestamp=20220605100908&amp;.html" class="mw-file-description"><img src="../File/T101pwb03-04_snapselect.png" decoding="async" width="919" height="398" class="mw-file-element" data-file-width="919" data-file-height="398"></a><figcaption></figcaption></figure>
<p>&#1050;&#1086;&#1075;&#1076;&#1072; &#1091; &#1074;&#1072;&#1089; &#1087;&#1086;&#1103;&#1074;&#1080;&#1090;&#1089;&#1103; &#1073;&#1077;&#1083;&#1072;&#1103; &#1090;&#1086;&#1095;&#1082;&#1072; &#1085;&#1072; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1081; &#1075;&#1088;&#1072;&#1085;&#1080;, &#1097;&#1077;&#1083;&#1082;&#1085;&#1080;&#1090;&#1077; &#1083;&#1077;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; &#1084;&#1099;&#1096;&#1080;, &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1080;&#1090;&#1077; &#1090;&#1086; &#1078;&#1077; &#1089;&#1072;&#1084;&#1086;&#1077; &#1076;&#1083;&#1103; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1081; &#1082;&#1074;&#1072;&#1076;&#1088;&#1072;&#1090;&#1085;&#1086;&#1081; &#1075;&#1088;&#1072;&#1085;&#1080; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1075;&#1086; &#1090;&#1077;&#1083;&#1072;, &#1082;&#1072;&#1082; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1085;&#1072; &#1087;&#1088;&#1072;&#1074;&#1086;&#1084; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; &#1074;&#1099;&#1096;&#1077;. &#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1094;&#1077;&#1085;&#1090;&#1088; &#1084;&#1072;&#1089;&#1089; &#1076;&#1083;&#1103; &#1083;&#1102;&#1073;&#1086;&#1075;&#1086; &#1090;&#1080;&#1087;&#1072; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1080;. &#1042; &#1085;&#1072;&#1096;&#1077;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1094;&#1077;&#1085;&#1090;&#1088; &#1084;&#1072;&#1089;&#1089; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1081; &#1075;&#1088;&#1072;&#1085;&#1080; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1072;&#1077;&#1090; &#1089; &#1077;&#1105; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084; &#1094;&#1077;&#1085;&#1090;&#1088;&#1086;&#1084;. &#1042;&#1099; &#1091;&#1078;&#1077; &#1079;&#1072;&#1084;&#1077;&#1090;&#1080;&#1083;&#1080;, &#1095;&#1090;&#1086; &#1076;&#1074;&#1080;&#1078;&#1077;&#1085;&#1080;&#1077; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1072; &#1072;&#1085;&#1080;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1086;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1074;&#1099; &#1074;&#1080;&#1076;&#1080;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1087;&#1088;&#1086;&#1080;&#1079;&#1086;&#1081;&#1090;&#1080;.
</p><p>&#1057;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1089;&#1082;&#1074;&#1086;&#1079;&#1085;&#1086;&#1077; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1077; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1080;&#1074; &#1073;&#1091;&#1083;&#1077;&#1074;&#1091;&#1102; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1086;&#1073;&#1088;&#1077;&#1079;&#1072;&#1085;&#1080;&#1103;, &#1086; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1083;&#1086;&#1089;&#1100; &#1074;&#1099;&#1096;&#1077;. &#1052;&#1086;&#1076;&#1077;&#1083;&#1100; &#1075;&#1086;&#1090;&#1086;&#1074;&#1072;. &#1057; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102;  <i>&#1088;&#1091;&#1083;&#1077;&#1090;&#1082;&#1080;</i> &#1085;&#1072; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1077; <b>Part</b> &#1091;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1077; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1086; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;. &#1048;&#1079;&#1084;&#1077;&#1088;&#1080;&#1090;&#1100; &#1088;&#1072;&#1089;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1084;&#1077;&#1078;&#1076;&#1091; <i>&#1090;&#1086;&#1095;&#1082;&#1072;&#1084;&#1080;</i>, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1080;&#1079;&#1084;&#1077;&#1088;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072;&#1076;&#1086; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1086;&#1090; &#1085;&#1091;&#1083;&#1077;&#1074;&#1086;&#1081; &#1090;&#1086;&#1095;&#1082;&#1080; &#1075;&#1083;&#1072;&#1074;&#1085;&#1086;&#1075;&#1086; &#1090;&#1077;&#1083;&#1072; &#1076;&#1086; &#1076;&#1072;&#1083;&#1100;&#1085;&#1077;&#1075;&#1086; &#1082;&#1088;&#1072;&#1103; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1103;. &#1059; &#1085;&#1072;&#1089; &#1101;&#1090;&#1086; &#1088;&#1072;&#1089;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090; 70&#1084;&#1084; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1103; &#1088;&#1072;&#1076;&#1080;&#1091;&#1089; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1103;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb03-05_modelmeasure.png&amp;filetimestamp=20220605100936&amp;.html" class="mw-file-description"><img src="../File/T101pwb03-05_modelmeasure.png" decoding="async" width="533" height="432" class="mw-file-element" data-file-width="533" data-file-height="432"></a><figcaption></figcaption></figure>
<p><span id="Making_the_hole_a_countersunk_hole"></span>
</p>
<h2><span id=".D0.A1.D0.BE.D0.B7.D0.B4.D0.B0.D0.BD.D0.B8.D0.B5_.D0.BE.D1.82.D0.B2.D0.B5.D1.80.D1.81.D1.82.D0.B8.D1.8F_.D1.81_.D1.84.D0.B0.D1.81.D0.BA.D0.BE.D0.B9"></span><span class="mw-headline" id="&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077;_&#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1103;_&#1089;_&#1092;&#1072;&#1089;&#1082;&#1086;&#1081;">&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1103; &#1089; &#1092;&#1072;&#1089;&#1082;&#1086;&#1081;</span></h2>
<p>&#1042;&#1077;&#1088;&#1085;&#1080;&#1090;&#1077;&#1089;&#1100; &#1085;&#1072; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; <a href="../ru/Part_Workbench.html" title="Part Workbench/ru">Part</a> &#1080; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1080;&#1082;&#1086;&#1085;&#1082;&#1080; <span typeof="mw:File"><a href="../Part_Cone.html" title="Part Cone"><img src="../File/Part_Cone.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b><a href="../ru/Part_Cone.html" title="Part Cone/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1090;&#1074;&#1077;&#1088;&#1076;&#1086;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1082;&#1086;&#1085;&#1091;&#1089;</a></b> &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1089;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; <i>&#1082;&#1086;&#1085;&#1091;&#1089;</i>. &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; <i>radius1</i> &#1074; 0 &#1084;&#1084; &#1080; <i>radius2</i> &#1074; 7 &#1084;&#1084;, &#1101;&#1090;&#1086; &#1076;&#1072;&#1089;&#1090; 2 &#1084;&#1084; <i>&#1092;&#1072;&#1089;&#1082;&#1080;</i> &#1087;&#1086; &#1088;&#1072;&#1076;&#1080;&#1091;&#1089;&#1091;. &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; <i>&#1074;&#1099;&#1089;&#1086;&#1090;&#1091;</i> &#1082;&#1086;&#1085;&#1091;&#1089;&#1072; &#1074; 7 &#1084;&#1084;, &#1074; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1091;&#1075;&#1086;&#1083; &#1074;&#1077;&#1088;&#1096;&#1080;&#1085;&#1099; &#1082;&#1086;&#1085;&#1091;&#1089;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; 90 &#1075;&#1088;&#1072;&#1076;&#1091;&#1089;&#1086;&#1074;, &#1072; &#1091;&#1075;&#1086;&#1083; &#1092;&#1072;&#1089;&#1082;&#1080; - 45 &#1075;&#1088;&#1072;&#1076;&#1091;&#1089;&#1086;&#1074;. &#1057;&#1090;&#1086;&#1080;&#1090; &#1086;&#1090;&#1084;&#1077;&#1090;&#1080;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086; &#1073;&#1099; &#1090;&#1072;&#1082; &#1078;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1102; <span typeof="mw:File"><a href="../Part_Chamfer.html" title="Part Chamfer"><img src="../File/Part_Chamfer.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Part_Chamfer.html" title="Part Chamfer/ru">&#1060;&#1072;&#1089;&#1082;&#1072;</a>.
</p><p>&#1042;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; FreeCAD &#1074;&#1099; &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090;&#1077; &#1080;&#1084;&#1077;&#1090;&#1100; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1080;&#1095;&#1100; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080; &#1090;&#1086;&#1075;&#1086; &#1078;&#1077; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1072; &#1088;&#1072;&#1079;&#1085;&#1099;&#1084;&#1080; &#1087;&#1091;&#1090;&#1103;&#1084;&#1080;. &#1058;&#1088;&#1091;&#1076;&#1085;&#1086; &#1089;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1079;&#1072;&#1088;&#1072;&#1085;&#1077;&#1077;, &#1082;&#1072;&#1082;&#1086;&#1081; &#1080;&#1079; &#1085;&#1080;&#1093; &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1099;&#1081;. &#1053;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1099; &#1084;&#1086;&#1075;&#1091;&#1090; &#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;&#1089;&#1103; &#1073;&#1086;&#1083;&#1077;&#1077; &#1075;&#1080;&#1073;&#1082;&#1080;&#1084;&#1080;, &#1080;&#1084;&#1077;&#1090;&#1100; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081; &#1076;&#1083;&#1103; &#1090;&#1088;&#1072;&#1085;&#1089;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1080; &#1090;.&#1076;. &#1042;&#1072;&#1096;&#1080; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1099; &#1082; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1102; 3D &#1084;&#1086;&#1076;&#1077;&#1083;&#1077;&#1081; &#1073;&#1091;&#1076;&#1091;&#1090; &#1084;&#1077;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; &#1087;&#1086; &#1084;&#1077;&#1088;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082; &#1074;&#1099; &#1073;&#1091;&#1076;&#1077;&#1090;&#1077; &#1091;&#1079;&#1085;&#1072;&#1074;&#1072;&#1090;&#1100; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1086; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1103;&#1093; FreeCAD.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb04-01_cone.png&amp;filetimestamp=20220605100958&amp;.html" class="mw-file-description"><img src="../File/T101pwb04-01_cone.png" decoding="async" width="764" height="425" class="mw-file-element" data-file-width="764" data-file-height="425"></a><figcaption></figcaption></figure>
<p>&#1057; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1083;&#1102;&#1073;&#1086;&#1075;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1074;&#1099;&#1096;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; &#1089;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1077; &#1082;&#1086;&#1085;&#1091;&#1089; &#1089; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1077;&#1084;.
</p><p>&#1053;&#1072; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; &#1085;&#1080;&#1078;&#1077; &#1089;&#1086;&#1074;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1082;&#1086;&#1085;&#1091;&#1089;&#1072; &#1080; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1103; &#1076;&#1077;&#1083;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1086;&#1081;  <i>&#1055;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;</i>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1080;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103; &#1074; &#1084;&#1077;&#1085;&#1102;, &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086;&#1084; &#1087;&#1088;&#1080; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1080; &#1085;&#1072; &#1087;&#1088;&#1072;&#1074;&#1091;&#1102; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1084;&#1099;&#1096;&#1080;. &#1055;&#1088;&#1080;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1077; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1086;
&#1074; 1 &#1084;&#1084; &#1090;.&#1082;. &#1077;&#1089;&#1083;&#1080; &#1073;&#1099; &#1087;&#1088;&#1080;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1077; &#1073;&#1099;&#1083;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1086; &#1074; 5 &#1084;&#1084; &#1082;&#1072;&#1082; &#1073;&#1099;&#1083;&#1086; &#1088;&#1072;&#1085;&#1077;&#1077;, &#1090;&#1086; &#1101;&#1090;&#1086; &#1085;&#1077; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1080;&#1083;&#1086; &#1073;&#1099; &#1089;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1082;&#1086;&#1085;&#1091;&#1089; &#1080; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1077; &#1080;&#1079;-&#1079;&#1072; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1076;&#1080;&#1072;&#1084;&#1077;&#1090;&#1088; &#1082;&#1086;&#1085;&#1091;&#1089;&#1072; &#1091; &#1085;&#1072;&#1089; 7 &#1084;&#1084;. &#1044;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1073;&#1099;&#1083;&#1086; &#1083;&#1077;&#1075;&#1095;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1082;&#1086;&#1085;&#1091;&#1089; &#1074; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1091;&#1102; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1102; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; <span typeof="mw:File"><a href="../Std_DrawStyle.html#Wireframe" title="Std DrawStyle"><img src="../File/Std_DrawStyleWireFrame.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b><a href="../ru/Std_DrawStyle.html#Wireframe" title="Std DrawStyle/ru">&#1050;&#1072;&#1088;&#1082;&#1072;&#1089;&#1085;&#1099;&#1081; &#1088;&#1077;&#1078;&#1080;&#1084;</a></b> &#1087;&#1088;&#1086;&#1088;&#1080;&#1089;&#1086;&#1074;&#1082;&#1080; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb04-02_conetranslate.png&amp;filetimestamp=20220605101020&amp;.html" class="mw-file-description"><img src="../File/T101pwb04-02_conetranslate.png" decoding="async" width="684" height="318" class="mw-file-element" data-file-width="684" data-file-height="318"></a><figcaption></figcaption></figure>
<p>&#1063;&#1090;&#1086;&#1073;&#1099; &#1079;&#1072;&#1082;&#1086;&#1085;&#1095;&#1080;&#1090;&#1100; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100;, &#1076;&#1072;&#1074;&#1072;&#1081;&#1090;&#1077; &#1073;&#1091;&#1076;&#1077;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; <span typeof="mw:File"><a href="../Part_Boolean.html" title="Part Boolean"><img src="../File/Part_Boolean.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b><a href="../ru/Part_Boolean.html" title="Part Boolean/ru">&#1041;&#1091;&#1083;&#1077;&#1074;&#1091; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1102; &#1089; &#1076;&#1074;&#1091;&#1084;&#1080; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1092;&#1086;&#1088;&#1084;&#1072;&#1084;&#1080;</a></b> &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;, &#1072; &#1087;&#1086;&#1090;&#1086;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1073;&#1091;&#1083;&#1077;&#1074;&#1091; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1102;. &#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1077;&#1077; &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1080; &#1074; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1086;&#1090;&#1082;&#1088;&#1086;&#1077;&#1090;&#1089;&#1103; &#1086;&#1082;&#1085;&#1086; &#1082;&#1072;&#1082; &#1085;&#1072; &#1083;&#1077;&#1074;&#1086;&#1084; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; &#1085;&#1080;&#1078;&#1077;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb04-03_boolean.png&amp;filetimestamp=20220605101040&amp;.html" class="mw-file-description"><img src="../File/T101pwb04-03_boolean.png" decoding="async" width="754" height="417" class="mw-file-element" data-file-width="754" data-file-height="417"></a><figcaption></figcaption></figure>
<p>&#1053;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1090;&#1088;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;: <i>&#1058;&#1080;&#1087; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080;</i>, <i>&#1055;&#1077;&#1088;&#1074;&#1072;&#1103; &#1092;&#1080;&#1075;&#1091;&#1088;&#1072;</i> &#1080; <i>&#1042;&#1090;&#1086;&#1088;&#1072;&#1103; &#1092;&#1080;&#1075;&#1091;&#1088;&#1072;</i>. &#1050;&#1086;&#1085;&#1091;&#1089; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100;,  &#1074; &#1076;&#1072;&#1085;&#1085;&#1086;&#1081; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1077; &#1101;&#1090;&#1086; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; <i>&#1056;&#1072;&#1079;&#1085;&#1086;&#1089;&#1090;&#1100;</i>, &#1072; &#1085;&#1077; <i>&#1042;&#1099;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100;</i>. &#1055;&#1077;&#1088;&#1074;&#1072;&#1103; &#1092;&#1080;&#1075;&#1091;&#1088;&#1072; - &#1101;&#1090;&#1086; &#1085;&#1072;&#1096;&#1072; <b>Cut001</b>, &#1086;&#1085;&#1072; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1075;&#1088;&#1091;&#1087;&#1087;&#1077; <i>&#1057;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103;</i>, &#1090;.&#1082;. &#1086;&#1085;&#1072; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1090;&#1074;&#1077;&#1088;&#1076;&#1099;&#1093; &#1090;&#1077;&#1083;. &#1042;&#1090;&#1086;&#1088;&#1072;&#1103; &#1092;&#1080;&#1075;&#1091;&#1088;&#1072; - <b>&#1050;&#1086;&#1085;&#1091;&#1089;</b>. &#1059;&#1082;&#1072;&#1079;&#1072;&#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">&#1055;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100;</span>, &#1082;&#1072;&#1082; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1085;&#1072; &#1082;&#1072;&#1088;&#1090;&#1080;&#1085;&#1082;&#1077; &#1089;&#1087;&#1088;&#1072;&#1074;&#1072;. &#1042; &#1075;&#1088;&#1091;&#1087;&#1087;&#1077; <i>&#1057;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103;</i> &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1087;&#1086;&#1103;&#1074;&#1080;&#1090;&#1100;&#1089;&#1103; &#1092;&#1080;&#1075;&#1091;&#1088;&#1072; <b>Cut002</b>, &#1101;&#1090;&#1086; &#1085;&#1072;&#1096;&#1072; &#1075;&#1086;&#1090;&#1086;&#1074;&#1072;&#1103; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100;. &#1054;&#1085;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1077;&#1090;&#1100; &#1090;&#1072;&#1082;, &#1082;&#1072;&#1082; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1085;&#1080;&#1078;&#1077;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb04-04_modelcomplete.png&amp;filetimestamp=20220605101119&amp;.html" class="mw-file-description"><img src="../File/T101pwb04-04_modelcomplete.png" decoding="async" width="674" height="313" class="mw-file-element" data-file-width="674" data-file-height="313"></a><figcaption></figcaption></figure>
<p><span id="Making_a_hollow_piece"></span>
</p>
<h2><span id=".D0.A1.D0.BE.D0.B7.D0.B4.D0.B0.D0.BD.D0.B8.D0.B5_.D0.BF.D0.BE.D0.BB.D0.BE.D0.B9_.D0.BC.D0.BE.D0.B4.D0.B5.D0.BB.D0.B8"></span><span class="mw-headline" id="&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077;_&#1087;&#1086;&#1083;&#1086;&#1081;_&#1084;&#1086;&#1076;&#1077;&#1083;&#1080;">&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1087;&#1086;&#1083;&#1086;&#1081; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;</span></h2>
<p>&#1057;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1077; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100; &#1087;&#1086;&#1076; &#1085;&#1086;&#1074;&#1099;&#1084; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; &#1087;&#1088;&#1080; &#1087;&#1086;&#1084;&#1086;&#1097;&#1080; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; <i>&#1057;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1082;&#1072;&#1082;...</i> &#1074; &#1075;&#1083;&#1072;&#1074;&#1085;&#1086;&#1084; &#1084;&#1077;&#1085;&#1102;. FreeCAD &#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100; &#1074;&#1089;&#1077; &#1090;&#1080;&#1087;&#1080;&#1095;&#1085;&#1099;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; 3D &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1086;&#1076;&#1085;&#1072; &#1080;&#1079; &#1085;&#1080;&#1093; &#1101;&#1090;&#1086; <span typeof="mw:File"><a href="../Part_Thickness.html" title="Part Thickness"><img src="../File/Part_Thickness.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b><a href="../ru/Part_Thickness.html" title="Part Thickness/ru">&#1057;&#1084;&#1077;&#1085;&#1072; &#1090;&#1086;&#1083;&#1097;&#1080;&#1085;&#1099;</a></b>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; <i>&#1087;&#1086;&#1083;&#1086;&#1081;</i> &#1076;&#1077;&#1090;&#1072;&#1083;&#1080;.
</p><p>&#1055;&#1086;&#1074;&#1077;&#1088;&#1085;&#1080;&#1090;&#1077; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100; &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1073;&#1099;&#1083;&#1072; &#1074;&#1080;&#1076;&#1085;&#1072; &#1085;&#1080;&#1078;&#1085;&#1103;&#1103; &#1077;&#1105; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1100;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb05-01_frombottom.png&amp;filetimestamp=20220605101140&amp;.html" class="mw-file-description"><img src="../File/T101pwb05-01_frombottom.png" decoding="async" width="428" height="384" class="mw-file-element" data-file-width="428" data-file-height="384"></a><figcaption></figcaption></figure>
<p>&#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; <i>&#1085;&#1080;&#1078;&#1085;&#1102;&#1102; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1100;</i> &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;, &#1079;&#1072;&#1090;&#1077;&#1084; &#1085;&#1072; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1077; <a href="../ru/Part_Workbench.html" title="Part Workbench/ru">Part </a> &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; <span typeof="mw:File"><a href="../Part_Thickness.html" title="Part Thickness"><img src="../File/Part_Thickness.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b><a href="../ru/Part_Thickness.html" title="Part Thickness/ru">&#1057;&#1084;&#1077;&#1085;&#1072; &#1090;&#1086;&#1083;&#1097;&#1080;&#1085;&#1099;</a></b> &#1080; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085;&#1077; &#1087;&#1086;&#1103;&#1074;&#1080;&#1090;&#1089;&#1103; &#1092;&#1080;&#1075;&#1091;&#1088;&#1072; &#1082;&#1072;&#1082; &#1085;&#1072; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; &#1085;&#1080;&#1078;&#1077;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb05-02_thickness_cmd.png&amp;filetimestamp=20220605101203&amp;.html" class="mw-file-description"><img src="../File/T101pwb05-02_thickness_cmd.png" decoding="async" width="755" height="420" class="mw-file-element" data-file-width="755" data-file-height="420"></a><figcaption></figcaption></figure>
<p>&#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">OK</span>. &#1050;&#1072;&#1082; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1085;&#1072;&#1088;&#1091;&#1078;&#1085;&#1099;&#1077; &#1091;&#1075;&#1083;&#1099; &#1092;&#1080;&#1075;&#1091;&#1088;&#1099; &#1080;&#1084;&#1077;&#1102;&#1090; <i>&#1089;&#1082;&#1088;&#1091;&#1075;&#1083;&#1077;&#1085;&#1080;&#1103;</i>.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb05-03_thickness_dimension.png&amp;filetimestamp=20220605101226&amp;.html" class="mw-file-description"><img src="../File/T101pwb05-03_thickness_dimension.png" decoding="async" width="298" height="280" class="mw-file-element" data-file-width="298" data-file-height="280"></a><figcaption></figcaption></figure>
<p>&#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1089;&#1077;&#1081;&#1095;&#1072;&#1089; &#1080;&#1079;&#1084;&#1077;&#1088;&#1080;&#1090;&#1100; &#1096;&#1080;&#1088;&#1080;&#1085;&#1091; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080;, &#1086;&#1085;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; 32 &#1084;&#1084;, &#1090;.&#1082;. <i>&#1090;&#1086;&#1083;&#1097;&#1080;&#1085;&#1072;</i> &#1082;&#1072;&#1082; &#1073;&#1099; &#1087;&#1088;&#1080;&#1082;&#1083;&#1072;&#1076;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; <i>&#1089;&#1085;&#1072;&#1088;&#1091;&#1078;&#1080;</i>. &#1044;&#1072;&#1074;&#1072;&#1081;&#1090;&#1077; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1080;&#1084; &#1101;&#1090;&#1086;. &#1050;&#1083;&#1080;&#1082;&#1085;&#1080;&#1090;&#1077; &#1076;&#1074;&#1072;&#1078;&#1076;&#1099; &#1085;&#1072; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; &#1080; &#1074; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; <i>join</i> &#1085;&#1072;  <i>intersection</i> &#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <i>&#1090;&#1086;&#1083;&#1097;&#1080;&#1085;&#1099;</i> &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1074; -1.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb05-04_thickness_modify.png&amp;filetimestamp=20220605101248&amp;.html" class="mw-file-description"><img src="../File/T101pwb05-04_thickness_modify.png" decoding="async" width="308" height="395" class="mw-file-element" data-file-width="308" data-file-height="395"></a><figcaption></figcaption></figure>
<p>&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1096;&#1080;&#1088;&#1080;&#1085;&#1072; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; 30 &#1084;&#1084; &#1082;&#1072;&#1082; &#1080; &#1073;&#1099;&#1083;&#1086;, &#1072; &#1085;&#1072;&#1088;&#1091;&#1078;&#1085;&#1099;&#1077; &#1091;&#1075;&#1083;&#1099; &#1089;&#1085;&#1086;&#1074;&#1072; &#1086;&#1089;&#1090;&#1088;&#1099;&#1077;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb05-05_thickness_modified.png&amp;filetimestamp=20220605101312&amp;.html" class="mw-file-description"><img src="../File/T101pwb05-05_thickness_modified.png" decoding="async" width="237" height="237" class="mw-file-element" data-file-width="237" data-file-height="237"></a><figcaption></figcaption></figure>
<p><span id="A_different_way_to_position_the_chamfer"></span>
&#1044;&#1088;&#1091;&#1075;&#1086;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1092;&#1072;&#1089;&#1082;&#1080;
</p><p>&#1057;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1077; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100; &#1087;&#1086;&#1076; &#1085;&#1086;&#1074;&#1099;&#1084; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; &#1080; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1077; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100; &#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1083;&#1072;&#1089;&#1100; &#1082;&#1072;&#1082; &#1085;&#1072; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; &#1085;&#1080;&#1078;&#1077;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb06-01_startingpoint.png&amp;filetimestamp=20220605101333&amp;.html" class="mw-file-description"><img src="../File/T101pwb06-01_startingpoint.png" decoding="async" width="638" height="349" class="mw-file-element" data-file-width="638" data-file-height="349"></a><figcaption></figcaption></figure>
<p>&#1057;&#1076;&#1077;&#1083;&#1072;&#1081;&#1090;&#1077; <b>&#1050;&#1091;&#1073;</b> &#1089; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072;&#1084;&#1080; <b>30x30x60</b> &#1082;&#1072;&#1082; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1085;&#1080;&#1078;&#1077;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb06-02_with_cube.png&amp;filetimestamp=20220605101358&amp;.html" class="mw-file-description"><img src="../File/T101pwb06-02_with_cube.png" decoding="async" width="700" height="420" class="mw-file-element" data-file-width="700" data-file-height="420"></a><figcaption></figcaption></figure>
<p>&#1055;&#1086;&#1074;&#1077;&#1088;&#1085;&#1080;&#1090;&#1077; &#1077;&#1075;&#1086; &#1085;&#1072; -120 &#1075;&#1088;&#1072;&#1076;&#1091;&#1089;&#1086;&#1074; &#1074;&#1086;&#1082;&#1088;&#1091;&#1075; &#1086;&#1089;&#1080; Y &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1074; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; <i>&#1059;&#1075;&#1086;&#1083;</i> &#1074; &#1075;&#1088;&#1091;&#1087;&#1087;&#1077; <b>placement</b>.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb06-03_rotated_cube.png&amp;filetimestamp=20220605101419&amp;.html" class="mw-file-description"><img src="../File/T101pwb06-03_rotated_cube.png" decoding="async" width="854" height="430" class="mw-file-element" data-file-width="854" data-file-height="430"></a><figcaption></figcaption></figure>
<p>&#1048;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074; <b>X=50</b>, <b>Z=50</b> &#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1102; <i>&#1042;&#1099;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100;</i> &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1090;&#1072;&#1082;&#1091;&#1102; &#1078;&#1077; &#1092;&#1072;&#1089;&#1082;&#1091;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb06-04_cube_cut.png&amp;filetimestamp=20220605101448&amp;.html" class="mw-file-description"><img src="../File/T101pwb06-04_cube_cut.png" decoding="async" width="703" height="390" class="mw-file-element" data-file-width="703" data-file-height="390"></a><figcaption></figcaption></figure>
<p>&#1069;&#1090;&#1086; &#1077;&#1097;&#1077; &#1088;&#1072;&#1079; &#1087;&#1086;&#1076;&#1095;&#1077;&#1088;&#1082;&#1080;&#1074;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1074; 3D-&#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1095;&#1072;&#1089;&#1090;&#1086; &#1080;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1086;&#1074; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1086;&#1076;&#1080;&#1085; &#1080; &#1090;&#1086;&#1090; &#1078;&#1077; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;. &#1050;&#1086;&#1075;&#1076;&#1072; &#1076;&#1077;&#1083;&#1086; &#1076;&#1086;&#1093;&#1086;&#1076;&#1080;&#1090; &#1076;&#1086; &#1073;&#1072;&#1079;&#1086;&#1074;&#1086;&#1081; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080; &#1080;&#1083;&#1080; &#1090;&#1074;&#1077;&#1088;&#1076;&#1099;&#1093; &#1090;&#1077;&#1083;, &#1074; FreeCAD &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1088;&#1072;&#1079;&#1085;&#1099;&#1077; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1088;&#1072;&#1079;&#1085;&#1099;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1080; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1090;&#1091; &#1078;&#1077; &#1074;&#1085;&#1077;&#1096;&#1085;&#1102;&#1102; &#1092;&#1086;&#1088;&#1084;&#1091; &#1090;&#1074;&#1077;&#1088;&#1076;&#1086;&#1075;&#1086; &#1090;&#1077;&#1083;&#1072;. &#1042;&#1072;&#1084; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1085;&#1091;&#1078;&#1085;&#1086; &#1085;&#1072;&#1081;&#1090;&#1080; &#1089;&#1074;&#1086;&#1081; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1085;&#1072;&#1073;&#1086;&#1088; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1095;&#1090;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1080; &#1088;&#1072;&#1073;&#1086;&#1095;&#1080;&#1093; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1072;&#1084; &#1091;&#1076;&#1086;&#1073;&#1085;&#1099; &#1074; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080;. &#1052;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084; 3D &mdash; &#1101;&#1090;&#1086; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089; &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1076;&#1083;&#1103; &#1086;&#1089;&#1074;&#1086;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1072;.
</p><p><span id="Editing_dimensions,_face_colors_and_TNP"></span>
&#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074;, &#1094;&#1074;&#1077;&#1090;&#1086;&#1074; &#1075;&#1088;&#1072;&#1085;&#1077;&#1081; &#1080; TNP
</p><p>FreeCAD &mdash; &#1101;&#1090;&#1086; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1086; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; 3D-&#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1074;&#1072;&#1084; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1083;&#1102;&#1073;&#1086;&#1077; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1080;&#1083;&#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;, &#1080; &#1086;&#1085;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1103;&#1090;&#1100;&#1089;&#1103; &#1074; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1080; &#1089; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;. &#1054;&#1073;&#1099;&#1095;&#1085;&#1086; &#1074;&#1089;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090;, &#1085;&#1086; &#1087;&#1088;&#1080; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1083;&#1086;&#1084;&#1072;&#1090;&#1100; &mdash; &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1089;&#1082;&#1088;&#1091;&#1075;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1086; &#1085;&#1072; &#1082;&#1088;&#1086;&#1084;&#1082;&#1077;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1085;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1080;&#1079;-&#1079;&#1072; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;. &#1050;&#1086;&#1075;&#1076;&#1072; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100; &#1083;&#1086;&#1084;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; - &#1101;&#1090;&#1086; <b><a href="../ru/Topological_naming_problem.html" title="Topological naming problem/ru">&#1055;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1090;&#1086;&#1087;&#1086;&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</a></b>.
</p><p>&#1044;&#1072;&#1074;&#1072;&#1081;&#1090;&#1077; &#1087;&#1086;&#1101;&#1082;&#1089;&#1087;&#1077;&#1088;&#1080;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1091;&#1077;&#1084; &#1089; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074; &#1080; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100;, &#1089;&#1084;&#1086;&#1078;&#1077;&#1084; &#1083;&#1080; &#1084;&#1099; &#1089;&#1083;&#1086;&#1084;&#1072;&#1090;&#1100; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100;. &#1053;&#1077; &#1079;&#1072;&#1073;&#1099;&#1074;&#1072;&#1081;&#1090;&#1077; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1103;&#1090;&#1100; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100; &#1087;&#1086;&#1089;&#1083;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081;, &#1077;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103;. &#1069;&#1090;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; <span typeof="mw:File"><a href="../Std_Refresh.html" title="Std Refresh"><img src="../File/Std_Refresh.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Std_Refresh.html" title="Std Refresh/ru">&#1054;&#1073;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100;</a> &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1045;&#1089;&#1083;&#1080; &#1080;&#1082;&#1086;&#1085;&#1082;&#1072; &#1079;&#1072;&#1082;&#1088;&#1072;&#1096;&#1077;&#1085;&#1072; &#1089;&#1077;&#1088;&#1099;&#1084;, &#1079;&#1085;&#1072;&#1095;&#1080;&#1090; &#1085;&#1077;&#1090; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1103;&#1090;&#1100; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100;.
</p><p><span id="Reposition_the_cylinder"></span>
</p>
<h3><span id=".D0.9F.D0.B5.D1.80.D0.B5.D0.BC.D0.B5.D1.89.D0.B5.D0.BD.D0.B8.D0.B5_.D1.86.D0.B8.D0.BB.D0.B8.D0.BD.D0.B4.D1.80.D0.B0"></span><span class="mw-headline" id="&#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077;_&#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1072;">&#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1072;</span></h3>
<p>&#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1076;&#1072;&#1074;&#1072;&#1081;&#1090;&#1077; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1089;&#1090;&#1080;&#1084; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088; &#1080;&#1079; &#1094;&#1077;&#1085;&#1090;&#1088;&#1072; &#1074; &#1086;&#1076;&#1085;&#1091; &#1080;&#1079; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1075;&#1086; &#1090;&#1077;&#1083;&#1072; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; <i>Transform</i>. &#1050;&#1072;&#1082; &#1074;&#1099; &#1074;&#1080;&#1076;&#1080;&#1090;&#1077; &#1085;&#1072; &#1082;&#1072;&#1088;&#1090;&#1080;&#1085;&#1082;&#1077;, &#1082;&#1086;&#1085;&#1091;&#1089; &#1086;&#1089;&#1090;&#1072;&#1083;&#1089;&#1103; &#1085;&#1072; &#1089;&#1074;&#1086;&#1077;&#1084; &#1084;&#1077;&#1089;&#1090;&#1077;, &#1093;&#1086;&#1090;&#1103; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1083; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100;&#1089;&#1103; &#1074;&#1084;&#1077;&#1089;&#1090;&#1077; &#1089; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1077;&#1084;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb07-01_cylindermoved.png&amp;filetimestamp=20220605101519&amp;.html" class="mw-file-description"><img src="../File/T101pwb07-01_cylindermoved.png" decoding="async" width="713" height="418" class="mw-file-element" data-file-width="713" data-file-height="418"></a><figcaption></figcaption></figure>
<p>&#1050;&#1086;&#1075;&#1076;&#1072; &#1074;&#1099; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090;&#1077; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088; &#1074; &#1089;&#1082;&#1074;&#1086;&#1079;&#1100; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1100; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;, &#1074; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 0.19 &#1074;&#1099; &#1090;&#1077;&#1088;&#1103;&#1077;&#1090;&#1077; &#1095;&#1072;&#1089;&#1090;&#1100; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082; &#1094;&#1074;&#1077;&#1090;&#1072; &#1074;&#1072;&#1096;&#1077;&#1081; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;. FreeCAD &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1084; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072;&#1084; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1076;&#1083;&#1103; &#1094;&#1074;&#1077;&#1090;&#1086;&#1074; &#1080; &#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080; &#1092;&#1086;&#1088;&#1084;&#1099; &#1074; 3D-&#1074;&#1080;&#1076;&#1077;, &#1086;&#1076;&#1085;&#1072;&#1082;&#1086; &#1092;&#1086;&#1088;&#1084;&#1072; Cut002 &#1087;&#1086;-&#1087;&#1088;&#1077;&#1078;&#1085;&#1077;&#1084;&#1091; &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1094;&#1074;&#1077;&#1090;&#1072; &#1080; &#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1099;&#1083;&#1080; &#1091; &#1085;&#1077;&#1077; &#1088;&#1072;&#1085;&#1100;&#1096;&#1077;, &#1082;&#1072;&#1082; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1085;&#1072; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; &#1085;&#1080;&#1078;&#1077;.
</p><p><span id="Fixing_the_colors"></span>
</p>
<h3><span id=".D0.98.D1.81.D0.BF.D1.80.D0.B0.D0.B2.D0.BB.D0.B5.D0.BD.D0.B8.D0.B5_.D1.86.D0.B2.D0.B5.D1.82.D0.BE.D0.B2"></span><span class="mw-headline" id="&#1048;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;_&#1094;&#1074;&#1077;&#1090;&#1086;&#1074;">&#1048;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1094;&#1074;&#1077;&#1090;&#1086;&#1074;</span></h3>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb07-02_wrongcolor.png&amp;filetimestamp=20220605101538&amp;.html" class="mw-file-description"><img src="../File/T101pwb07-02_wrongcolor.png" decoding="async" width="739" height="418" class="mw-file-element" data-file-width="739" data-file-height="418"></a><figcaption></figcaption></figure>
<p>&#1042;&#1086;&#1090; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1080;&#1090;&#1100; &#1101;&#1090;&#1086;. &#1057;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; <i>&#1055;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;</i> &#1084;&#1099;&#1096;&#1082;&#1086;&#1081; &#1085;&#1072; &#1086;&#1076;&#1080;&#1085; &#1090;&#1080;&#1082; &#1074;&#1074;&#1077;&#1088;&#1093; &#1080;&#1083;&#1080; &#1074;&#1085;&#1080;&#1079;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100; &#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;. &#1057;&#1076;&#1077;&#1083;&#1072;&#1081;&#1090;&#1077; &#1090;&#1086; &#1078;&#1077; &#1089;&#1072;&#1084;&#1086;&#1077; &#1089; <i>&#1094;&#1074;&#1077;&#1090;&#1086;&#1084; &#1092;&#1086;&#1088;&#1084;&#1099;</i>. &#1044;&#1088;&#1091;&#1075;&#1086;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100; &#1094;&#1074;&#1077;&#1090; - &#1101;&#1090;&#1086; &#1085;&#1072;&#1078;&#1072;&#1090;&#1100; &#1087;&#1088;&#1072;&#1074;&#1091;&#1102; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1084;&#1099;&#1096;&#1080; &#1085;&#1072; &#1092;&#1080;&#1075;&#1091;&#1088;&#1077; <b>Cut002</b> &#1074; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1080; &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; &#1074; &#1084;&#1077;&#1085;&#1102; <b>&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1094;&#1074;&#1077;&#1090;&#1072;...</b>. &#1042; <i>&#1055;&#1072;&#1085;&#1077;&#1083;&#1080; &#1079;&#1072;&#1076;&#1072;&#1095;</i>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1087;&#1086;&#1103;&#1074;&#1080;&#1090;&#1089;&#1103;, &#1082;&#1083;&#1080;&#1082;&#1085;&#1080;&#1090;&#1077; <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;</span>, &#1101;&#1090;&#1086; &#1074;&#1077;&#1088;&#1085;&#1077;&#1090; &#1094;&#1074;&#1077;&#1090; &#1082; &#1090;&#1086;&#1084;&#1091;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1073;&#1099;&#1083; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085; &#1074; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;&#1093; &#1074;&#1080;&#1076;&#1072;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb07-03_set_colors.png&amp;filetimestamp=20220605101559&amp;.html" class="mw-file-description"><img src="../File/T101pwb07-03_set_colors.png" decoding="async" width="634" height="299" class="mw-file-element" data-file-width="634" data-file-height="299"></a><figcaption></figcaption></figure>
<p>&#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; <b>&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1094;&#1074;&#1077;&#1090;&#1072;...</b> &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; &#1089;&#1074;&#1086;&#1081; &#1094;&#1074;&#1077;&#1090; &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1080;.
</p><p><span id="Multiple_solids"></span>
</p>
<h3><span id=".D0.9C.D0.BD.D0.BE.D0.B6.D0.B5.D1.81.D1.82.D0.B2.D0.B5.D0.BD.D0.BD.D1.8B.D0.B5_.D1.82.D0.B2.D0.B5.D1.80.D0.B4.D1.8B.D0.B5_.D1.82.D0.B5.D0.BB.D0.B0"></span><span class="mw-headline" id="&#1052;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077;_&#1090;&#1074;&#1077;&#1088;&#1076;&#1099;&#1077;_&#1090;&#1077;&#1083;&#1072;">&#1052;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077; &#1090;&#1074;&#1077;&#1088;&#1076;&#1099;&#1077; &#1090;&#1077;&#1083;&#1072;</span></h3>
<p>&#1044;&#1088;&#1091;&#1075;&#1086;&#1081; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1075;&#1076;&#1077; &#1082;&#1091;&#1073;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1102;&#1097;&#1080;&#1081; &#1092;&#1072;&#1089;&#1082;&#1091;, &#1073;&#1099;&#1083; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085; &#1080; &#1087;&#1086;&#1074;&#1077;&#1088;&#1085;&#1091;&#1090;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb07-04_3solids.png&amp;filetimestamp=20220605101618&amp;.html" class="mw-file-description"><img src="../File/T101pwb07-04_3solids.png" decoding="async" width="739" height="415" class="mw-file-element" data-file-width="739" data-file-height="415"></a><figcaption></figcaption></figure>
<p>&#1045;&#1089;&#1083;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1090;&#1077;&#1083;&#1072;, &#1080;&#1079; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1072; &#1092;&#1072;&#1089;&#1082;&#1072;, &#1090;&#1072;&#1082;&#1080;&#1084; &#1078;&#1077; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1082;&#1072;&#1082; &#1085;&#1072; &#1082;&#1072;&#1088;&#1090;&#1080;&#1085;&#1082;&#1077;, &#1090;&#1086; &#1074; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1087;&#1086;&#1103;&#1074;&#1103;&#1090;&#1089;&#1103; 3 &#1085;&#1077; &#1087;&#1077;&#1088;&#1077;&#1089;&#1077;&#1082;&#1072;&#1102;&#1097;&#1080;&#1093;&#1089;&#1103; &#1090;&#1077;&#1083;&#1072;. &#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; <a href="../ru/Part_Workbench.html" title="Part Workbench/ru">Part</a> &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1080;&#1090; &#1074;&#1072;&#1084; &#1101;&#1090;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100;, &#1072; <a href="../ru/PartDesign_Workbench.html" title="PartDesign Workbench/ru">PartDesign</a> &#1085;&#1077;&#1090;. &#1042;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1077; &#1089; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1084;&#1080; &#1090;&#1077;&#1083;&#1072;&#1084;&#1080;, &#1083;&#1080;&#1073;&#1086; &#1086;&#1085; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1085;&#1077; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1079;&#1080;&#1090; &#1074;&#1089;&#1077; &#1090;&#1077;&#1083;&#1072;.
</p><p><span id="TNP"></span>
</p>
<h3><span id=".D0.9F.D1.80.D0.BE.D0.B1.D0.BB.D0.B5.D0.BC.D0.B0_.D1.82.D0.BE.D0.BF.D0.BE.D0.BB.D0.BE.D0.B3.D0.B8.D1.87.D0.B5.D1.81.D0.BA.D0.BE.D0.B3.D0.BE_.D0.B8.D0.BC.D0.B5.D0.BD.D0.BE.D0.B2.D0.B0.D0.BD.D0.B8.D1.8F"></span><span class="mw-headline" id="&#1055;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072;_&#1090;&#1086;&#1087;&#1086;&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086;_&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;">&#1055;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1090;&#1086;&#1087;&#1086;&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</span></h3>
<p>&#1044;&#1072;&#1074;&#1072;&#1081;&#1090;&#1077; &#1074;&#1077;&#1088;&#1085;&#1077;&#1084;&#1089;&#1103; &#1082; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1085;&#1086;&#1081; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; &#1080; &#1087;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084;, &#1082;&#1072;&#1082; &#1080;&#1084;&#1077;&#1085;&#1091;&#1102;&#1090;&#1089;&#1103; &#1077;&#1105; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1080;.
</p><p>&#1053;&#1072; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; &#1085;&#1080;&#1078;&#1077; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; <b><a href="../ru/Selection_view.html" class="mw-redirect" title="Selection view/ru">&#1055;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103;</a></b>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1086;, &#1072; &#1095;&#1090;&#1086; &#1085;&#1077;&#1090;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085; &#1094;&#1074;&#1077;&#1090;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1073;&#1099;&#1083;&#1086; &#1083;&#1077;&#1075;&#1095;&#1077; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb07-05_face2and9.png&amp;filetimestamp=20220605101651&amp;.html" class="mw-file-description"><img src="../File/T101pwb07-05_face2and9.png" decoding="async" width="685" height="310" class="mw-file-element" data-file-width="685" data-file-height="310"></a><figcaption></figcaption></figure>
<p>&#1045;&#1089;&#1083;&#1080; &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; &#1073;&#1086;&#1082;&#1086;&#1074;&#1091;&#1102; &#1075;&#1088;&#1072;&#1085;&#1100; &#1080; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1102;&#1102; &#1075;&#1088;&#1072;&#1085;&#1100; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1072;, &#1090;&#1086; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1086;&#1085;&#1080; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; Face2 &#1080; Face9, &#1075;&#1076;&#1077; Face2 &mdash; &#1101;&#1090;&#1086; &#1073;&#1086;&#1082;&#1086;&#1074;&#1072;&#1103; &#1075;&#1088;&#1072;&#1085;&#1100;. &#1053;&#1091;&#1084;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1075;&#1088;&#1072;&#1085;&#1077;&#1081; &#1091; &#1074;&#1072;&#1089; &#1084;&#1086;&#1078;&#1077;&#1090; &#1086;&#1090;&#1083;&#1080;&#1095;&#1072;&#1090;&#1100;&#1089;&#1103;.
</p><p>&#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1077; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088; &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1085; &#1087;&#1077;&#1088;&#1077;&#1089;&#1077;&#1082;&#1072;&#1083; &#1073;&#1086;&#1082;&#1086;&#1074;&#1091;&#1102; &#1075;&#1088;&#1072;&#1085;&#1100; &#1080; &#1074; <b>&#1055;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103;</b> &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; &#1076;&#1088;&#1091;&#1075;&#1086;&#1077; &#1080;&#1084;&#1103;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb07-06_newfacenumbers.png&amp;filetimestamp=20220605101709&amp;.html" class="mw-file-description"><img src="../File/T101pwb07-06_newfacenumbers.png" decoding="async" width="683" height="307" class="mw-file-element" data-file-width="683" data-file-height="307"></a><figcaption></figcaption></figure>
<p>Face2 - &#1101;&#1090;&#1086; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1087;&#1088;&#1072;&#1074;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1081; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1080; Face2, &#1072; Face8 - &#1083;&#1077;&#1074;&#1072;&#1103; &#1077;&#1105; &#1095;&#1072;&#1089;&#1090;&#1100;. &#1062;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088; &#1087;&#1088;&#1077;&#1078;&#1076;&#1077; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1083;&#1089;&#1103; Face9, &#1072; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; Face7. FreeCAD &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1085;&#1091;&#1084;&#1077;&#1088;&#1072;&#1094;&#1080;&#1102; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;. &#1054;&#1073;&#1097;&#1077;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1075;&#1088;&#1072;&#1085;&#1077;&#1081; &#1074; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1081; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; &#1073;&#1099;&#1083;&#1086; 10, &#1087;&#1086;&#1089;&#1083;&#1077; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1072; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1072; &#1085;&#1072; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1100; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; &#1080;&#1093; &#1089;&#1090;&#1072;&#1083;&#1086; 11. &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1086;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1085;&#1091;&#1084;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1075;&#1088;&#1072;&#1085;&#1077;&#1081; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100;&#1089;&#1103;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1089;&#1103; &#1090;&#1072;&#1082; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1072;&#1103; &#1090;&#1086;&#1087;&#1086;&#1083;&#1086;&#1075;&#1080;&#1103;. &#1069;&#1090;&#1086;, &#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;, &#1082;&#1072;&#1078;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077;&#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1076;&#1077;&#1090;&#1072;&#1083;&#1100;&#1102;, &#1085;&#1086; &#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;&#1077;&#1089;&#1100;&#1084;&#1072; &#1074;&#1072;&#1078;&#1085;&#1099;&#1084; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084; 3D CAD. &#1055;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1100;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1083;&#1080; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1091;&#1102; &#1075;&#1088;&#1072;&#1085;&#1100; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1076;&#1083;&#1103; &#1076;&#1088;&#1091;&#1075;&#1086;&#1075;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;, &#1088;&#1072;&#1085;&#1100;&#1096;&#1077; &#1086;&#1085;&#1072; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1083;&#1072;&#1089;&#1100; Face9, &#1072; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; Face8. &#1057;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1077;&#1084;&#1091;&#1102; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1091;&#1102; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1086;&#1090;&#1077;&#1088;&#1103;&#1085;&#1072;. &#1055;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; FreeCAD, &#1087;&#1086; &#1082;&#1088;&#1072;&#1081;&#1085;&#1077;&#1081; &#1084;&#1077;&#1088;&#1077;, &#1074; &#1074;&#1099;&#1087;&#1091;&#1097;&#1077;&#1085;&#1085;&#1099;&#1093; &#1074; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1077;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103;&#1093;, &#1085;&#1077; &#1086;&#1090;&#1089;&#1083;&#1077;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1077;&#1084;&#1091;&#1102; &#1075;&#1088;&#1072;&#1085;&#1100;, &#1072; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1090;&#1089;&#1083;&#1077;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1087;&#1088;&#1086;&#1085;&#1091;&#1084;&#1077;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1091;&#1102; &#1075;&#1088;&#1072;&#1085;&#1100;, &#1084;&#1086;&#1076;&#1077;&#1083;&#1100; &#1083;&#1086;&#1084;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1076;&#1077;&#1083;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1075;&#1088;&#1072;&#1085;&#1100;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1087;&#1086;&#1079;&#1078;&#1077; &#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1085;&#1072;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;.
</p><p>&#1069;&#1090;&#1086; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; <b><a href="../ru/Topological_naming_problem.html" title="Topological naming problem/ru">&#1055;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1090;&#1086;&#1087;&#1086;&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</a></b>. &#1046;&#1077;&#1083;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1080;&#1079;&#1091;&#1095;&#1080;&#1090;&#1100;, &#1082;&#1072;&#1082; &#1080;&#1079;&#1073;&#1077;&#1078;&#1072;&#1090;&#1100; &#1087;&#1086;&#1083;&#1086;&#1084;&#1082;&#1080; &#1084;&#1086;&#1076;&#1077;&#1083;&#1077;&#1081;.
</p><p><span id="Organizing_the_tree_a_bit_differently"></span>
</p>
<h2><span id=".D0.94.D1.80.D1.83.D0.B3.D0.B0.D1.8F_.D0.BE.D1.80.D0.B3.D0.B0.D0.BD.D0.B8.D0.B7.D0.B0.D1.86.D0.B8.D1.8F_.D0.B4.D0.B5.D1.80.D0.B5.D0.B2.D0.B0_.D0.BF.D1.80.D0.BE.D0.B5.D0.BA.D1.82.D0.B0"></span><span class="mw-headline" id="&#1044;&#1088;&#1091;&#1075;&#1072;&#1103;_&#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103;_&#1076;&#1077;&#1088;&#1077;&#1074;&#1072;_&#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;">&#1044;&#1088;&#1091;&#1075;&#1072;&#1103; &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; &#1076;&#1077;&#1088;&#1077;&#1074;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;</span></h2>
<p>&#1057;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1077; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100; &#1087;&#1086;&#1076; &#1085;&#1086;&#1074;&#1099;&#1084; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084;. &#1059;&#1076;&#1072;&#1083;&#1080;&#1090;&#1077; &#1074;&#1089;&#1077; &#1088;&#1072;&#1079;&#1088;&#1077;&#1079;&#1099;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1083;&#1072;&#1089;&#1100; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100;, &#1082;&#1072;&#1082; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1085;&#1080;&#1078;&#1077;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb08-01_primitives.png&amp;filetimestamp=20220605101739&amp;.html" class="mw-file-description"><img src="../File/T101pwb08-01_primitives.png" decoding="async" width="721" height="388" class="mw-file-element" data-file-width="721" data-file-height="388"></a><figcaption></figcaption></figure>
<p>&#1055;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; <b>Part</b> &#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1080; &#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1093; &#1084;&#1086;&#1076;&#1077;&#1083;&#1077;&#1081;, &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; &#1076;&#1077;&#1088;&#1077;&#1074;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1090;&#1072;&#1090;&#1100; &#1089;&#1083;&#1086;&#1078;&#1085;&#1086;&#1081; &#1076;&#1083;&#1103; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1103;. &#1053;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1084;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1083;&#1080; &#1076;&#1077;&#1090;&#1072;&#1083;&#1100; &#1080; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1083;&#1080; &#1082; &#1085;&#1077;&#1081; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1091;&#1102; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1102;. &#1042; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1077; Part  &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1080;&#1090;&#1100; &#1087;&#1088;&#1080;&#1084;&#1080;&#1090;&#1080;&#1074;&#1099; &#1074; &#1086;&#1076;&#1085;&#1091; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1091;&#1102; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1102;. &#1042; &#1085;&#1072;&#1096;&#1077;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1091; &#1085;&#1072;&#1089; &#1077;&#1089;&#1090;&#1100; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;, &#1082;&#1086;&#1085;&#1091;&#1089; &#1080; &#1082;&#1091;&#1073;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103;&#1084;&#1080; &#1088;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1085;&#1080;&#1103;.
</p><p>&#1042;&#1084;&#1077;&#1089;&#1090;&#1086; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1088;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1087;&#1088;&#1080;&#1084;&#1080;&#1090;&#1080;&#1074;&#1072;, &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1080;&#1093; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1080;&#1090;&#1100; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1077;&#1081; <span typeof="mw:File"><a href="../Part_Fuse.html" title="Part Fuse"><img src="../File/Part_Fuse.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <b><a href="../ru/Part_Fuse.html" title="Part Fuse/ru">&#1054;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077;</a></b>, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1088;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1085;&#1080;&#1077; &#1084;&#1077;&#1078;&#1076;&#1091; &#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1084;&#1080; <b>Fillet</b> &#1080; <b>Fusion</b>.
</p><p>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1101;&#1090;&#1086;&#1090; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;, &#1076;&#1077;&#1088;&#1077;&#1074;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1074; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;&#1084; &#1080;&#1090;&#1086;&#1075;&#1077; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1080;&#1090; &#1090;&#1072;&#1082;, &#1082;&#1072;&#1082; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1085;&#1080;&#1078;&#1077;, &#1095;&#1090;&#1086; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1086;&#1084; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1103; &#1090;&#1086;&#1081; &#1078;&#1077; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;. &#1057;&#1088;&#1072;&#1074;&#1085;&#1080;&#1090;&#1077; &#1101;&#1090;&#1086; &#1089; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084; &#1076;&#1088;&#1077;&#1074;&#1086;&#1074;&#1080;&#1076;&#1085;&#1099;&#1084; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084;, &#1085;&#1080; &#1086;&#1076;&#1085;&#1086; &#1080;&#1079; &#1085;&#1080;&#1093; &#1085;&#1077; &#1083;&#1091;&#1095;&#1096;&#1077; &#1076;&#1088;&#1091;&#1075;&#1086;&#1075;&#1086;, &#1086;&#1076;&#1085;&#1072;&#1082;&#1086; &#1087;&#1088;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1080; &#1073;&#1086;&#1083;&#1077;&#1077; &#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1093; &#1084;&#1086;&#1076;&#1077;&#1083;&#1077;&#1081; &#1086;&#1076;&#1080;&#1085; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076; &#1087;&#1086; &#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1102; &#1089; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084; &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; &#1087;&#1088;&#1077;&#1080;&#1084;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1072; &#1074; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1090;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;/&#1088;&#1077;&#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;, &#1077;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;.
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=T101pwb08-02_fused.png&amp;filetimestamp=20220605101803&amp;.html" class="mw-file-description"><img src="../File/T101pwb08-02_fused.png" decoding="async" width="696" height="307" class="mw-file-element" data-file-width="696" data-file-height="307"></a><figcaption></figcaption></figure>
<p><span id="Wrapping_up"></span>
</p>
<h2><span id=".D0.9F.D0.BE.D0.B4.D0.B2.D0.B5.D0.B4.D0.B5.D0.BD.D0.B8.D0.B5_.D0.B8.D1.82.D0.BE.D0.B3.D0.BE.D0.B2"></span><span class="mw-headline" id="&#1055;&#1086;&#1076;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;_&#1080;&#1090;&#1086;&#1075;&#1086;&#1074;">&#1055;&#1086;&#1076;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; &#1080;&#1090;&#1086;&#1075;&#1086;&#1074;</span></h2>
<p>&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1074;&#1099; &#1082;&#1088;&#1072;&#1090;&#1082;&#1086; &#1086;&#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1080;&#1083;&#1080;&#1089;&#1100; &#1089; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1084; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1086;&#1084; FreeCAD, &#1080;&#1079;&#1091;&#1095;&#1080;&#1083;&#1080; &#1086;&#1089;&#1085;&#1086;&#1074;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; <b>Part</b> &#1080; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1091;&#1084;&#1077;&#1090;&#1100; &#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1087;&#1088;&#1086;&#1089;&#1090;&#1099;&#1077; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; &#1087;&#1086; &#1089;&#1074;&#1086;&#1077;&#1084;&#1091; &#1074;&#1082;&#1091;&#1089;&#1091;. &#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; <b>Part</b> - &#1101;&#1090;&#1086; &#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1090;&#1074;&#1077;&#1088;&#1076;&#1099;&#1093; &#1084;&#1086;&#1076;&#1077;&#1083;&#1077;&#1081;. &#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; <b>PartDesign</b> - &#1101;&#1090;&#1086; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;. &#1056;&#1072;&#1079;&#1085;&#1099;&#1077; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080; &#1080;&#1084;&#1077;&#1102;&#1090; &#1088;&#1072;&#1079;&#1085;&#1099;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1080; &#1088;&#1072;&#1079;&#1085;&#1099;&#1077; &#1088;&#1072;&#1073;&#1086;&#1095;&#1080;&#1077; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1099;. &#1055;&#1086;&#1083;&#1085;&#1086;&#1077; &#1080;&#1079;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; FreeCAD, &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1089; &#1091;&#1095;&#1077;&#1090;&#1086;&#1084; &#1074;&#1089;&#1077;&#1093; &#1085;&#1072;&#1076;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082; &#1080; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1086;&#1074;, &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1075;&#1086;&#1076;&#1099;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1072;&#1081;&#1090;&#1077; &#1080;&#1079;&#1091;&#1095;&#1072;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1077; &#1080; &#1088;&#1072;&#1079;&#1085;&#1099;&#1077; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1084;&#1086;&#1076;&#1077;&#1083;&#1077;&#1081; &mdash; &#1087;&#1088;&#1086;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1081;&#1090;&#1077; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1091;&#1095;&#1077;&#1073;&#1085;&#1099;&#1077; &#1087;&#1086;&#1089;&#1086;&#1073;&#1080;&#1103; &#1085;&#1072; &#1074;&#1080;&#1082;&#1080;. &#1054;&#1073;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1087;&#1088;&#1077;&#1082;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077; &#1089; FreeCAD. &#1056;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1090;&#1089;&#1103; &#1080;&#1079;&#1091;&#1095;&#1080;&#1090;&#1100; <i>sketches</i> (&#1101;&#1089;&#1082;&#1080;&#1079;&#1099;) &#1080; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; <b>PartDesign</b>, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1089;&#1086;&#1089;&#1088;&#1077;&#1076;&#1086;&#1090;&#1086;&#1095;&#1077;&#1085;&#1099; &#1085;&#1072; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1080; &#1090;&#1074;&#1077;&#1088;&#1076;&#1099;&#1093; &#1090;&#1077;&#1083;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1089;&#1086;&#1089;&#1088;&#1077;&#1076;&#1086;&#1090;&#1086;&#1095;&#1077;&#1085;&#1099; &#1085;&#1072; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1079;&#1076;&#1072;&#1085;&#1080;&#1081;, &#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1080;&#1079;&#1091;&#1095;&#1080;&#1090;&#1100; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080; <b>Draft</b> &#1080; <b>Arch</b>.
</p><p>FreeCAD &#1076;&#1077;&#1083;&#1072;&#1102;&#1090; &#1076;&#1086;&#1073;&#1088;&#1086;&#1074;&#1086;&#1083;&#1100;&#1094;&#1099; &#1074; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1077;&#1097;&#1077; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1080;&#1090;&#1100; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; FreeCAD, &#1087;&#1086;&#1076;&#1091;&#1084;&#1072;&#1081;&#1090;&#1077; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1085;&#1077;&#1089;&#1090;&#1080; &#1089;&#1074;&#1086;&#1081; <a href="../ru/Help_FreeCAD.html" title="Help FreeCAD/ru">&#1074;&#1082;&#1083;&#1072;&#1076;</a> &#1074; FreeCAD, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1087;&#1086;&#1084;&#1086;&#1095;&#1100; &#1091;&#1083;&#1091;&#1095;&#1096;&#1080;&#1090;&#1100; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1102;.
</p>
<!-- 
NewPP limit report
Cached time: 20251226205220
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.191 seconds
Real time usage: 0.354 seconds
Preprocessor visited node count: 311/1000000
Post&#8208;expand include size: 3614/2097152 bytes
Template argument size: 576/2097152 bytes
Highest expansion depth: 3/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1821/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    6.586      1 -total
 35.89%    2.364      1 Template:TutorialInfo/ru
 19.07%    1.256      5 Template:Button
 18.77%    1.236      3 Template:MenuCommand
 16.35%    1.077      2 Template:KEY
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:292882-0!canonical and timestamp 20251226205220 and revision id 1720514. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>