<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Document structure/ru</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="ru" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Document+structure&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../id/Document_structure.html" class="mw-pt-progress mw-pt-progress--low" title="Document structure (6% translated)" lang="id" dir="ltr">Bahasa Indonesia</a></li>
<li><a href="../de/Document_structure.html" class="mw-pt-progress mw-pt-progress--complete" title="Dokumentstruktur (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Document_structure.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Document structure (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../tr/Document_structure.html" class="mw-pt-progress mw-pt-progress--high" title="Belge yap&#305;s&#305; (72% translated)" lang="tr" dir="ltr">T&uuml;rk&ccedil;e</a></li>
<li><a href="../es/Document_structure.html" class="mw-pt-progress mw-pt-progress--med" title="Estructura del documento (61% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/Document_structure.html" class="mw-pt-progress mw-pt-progress--complete" title="Structure d'un document (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../hr/Document_structure.html" class="mw-pt-progress mw-pt-progress--low" title="FreeCAD-Dokument (6% translated)" lang="hr" dir="ltr">hrvatski</a></li>
<li><a href="../it/Document_structure.html" class="mw-pt-progress mw-pt-progress--complete" title="Struttura del documento (100% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Document_structure.html" class="mw-pt-progress mw-pt-progress--complete" title="Struktura dokumentu (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt/Document_structure.html" class="mw-pt-progress mw-pt-progress--med" title="Estrutura do documento (67% translated)" lang="pt" dir="ltr">portugu&ecirc;s</a></li>
<li><a href="../pt-br/Document_structure.html" class="mw-pt-progress mw-pt-progress--high" title="Estrutura do documento (89% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../ro/Document_structure.html" class="mw-pt-progress mw-pt-progress--high" title="Structura unui document/fi&#537;ier &icirc;n FreeCAD (72% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><a href="../sv/Document_structure.html" class="mw-pt-progress mw-pt-progress--med" title="Document structure (61% translated)" lang="sv" dir="ltr">svenska</a></li>
<li><a href="../cs/Document_structure.html" class="mw-pt-progress mw-pt-progress--complete" title="Struktura dokumentu (100% translated)" lang="cs" dir="ltr">&#269;e&scaron;tina</a></li>
<li><a href="../bg/Document_structure.html" class="mw-pt-progress mw-pt-progress--med" title="&#1057;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; &#1085;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1080;&#1090;&#1077; (56% translated)" lang="bg" dir="ltr">&#1073;&#1098;&#1083;&#1075;&#1072;&#1088;&#1089;&#1082;&#1080;</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</span></li>
<li><a href="../uk/Document_structure.html" class="mw-pt-progress mw-pt-progress--low" title="Document structure (6% translated)" lang="uk" dir="ltr">&#1091;&#1082;&#1088;&#1072;&#1111;&#1085;&#1089;&#1100;&#1082;&#1072;</a></li>
<li><a href="../zh/Document_structure.html" class="mw-pt-progress mw-pt-progress--high" title="&#25991;&#26723;&#32467;&#26500; (72% translated)" lang="zh" dir="ltr">&#20013;&#25991;</a></li>
<li><a href="../zh-cn/Document_structure.html" class="mw-pt-progress mw-pt-progress--complete" title="&#25991;&#26723;&#32467;&#26500; (100% translated)" lang="zh-Hans-CN" dir="ltr">&#20013;&#25991;&#65288;&#20013;&#22269;&#22823;&#38470;&#65289;</a></li>
<li><a href="../ja/Document_structure.html" class="mw-pt-progress mw-pt-progress--low" title="FreeCAD&#12501;&#12449;&#12452;&#12523;&#12398;&#27083;&#36896; (6% translated)" lang="ja" dir="ltr">&#26085;&#26412;&#35486;</a></li>
<li><a href="../ko/Document_structure.html" class="mw-pt-progress mw-pt-progress--med" title="&#47928;&#49436; &#44396;&#51312; (56% translated)" lang="ko" dir="ltr">&#54620;&#44397;&#50612;</a></li></ul></div>
<div class="docnav">
    <div><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-left.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span> <a href="../ru/Navigation_Cube.html" title="Navigation Cube/ru">&#1053;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1081; &#1082;&#1091;&#1073;</a></div>
    <div><a href="../ru/Property_View.html" title="Property View/ru">&#1054;&#1082;&#1085;&#1086; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;</a>
 <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-right.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span></div>
    <div><a href="../ru/Online_Help_Toc.html" title="Online Help Toc/ru">&#1054;&#1075;&#1083;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;</a> <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Online_Help_Toc.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span></div>
</div>
<div style="clear:right; margin-bottom: .5em; float: right; padding: .5em 0 .8em 1.4em; background: none;"><meta property="mw:PageProp/toc"></div>
<figure class="mw-default-size mw-halign-left" typeof="mw:File"><a href="../index.php?title=Screenshot_treeview.jpg&amp;filetimestamp=20181210181422&amp;.html" class="mw-file-description"><img src="../File/Screenshot_treeview.jpg" decoding="async" width="350" height="438" class="mw-file-element" data-file-width="350" data-file-height="438"></a><figcaption></figcaption></figure>
<p>&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; FreeCAD &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1074;&#1089;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;. &#1054;&#1085; &#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099;, &#1080; &#1087;&#1088;&#1077;&#1076;&#1084;&#1077;&#1090;&#1099;, &#1089;&#1076;&#1077;&#1083;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089; &#1083;&#1102;&#1073;&#1086;&#1075;&#1086; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1103;(workbench). &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1100;&#1089;&#1103; &#1084;&#1077;&#1078;&#1076;&#1091; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1103;&#1084;&#1080;, &#1080; &#1076;&#1086; &#1089;&#1080;&#1093; &#1087;&#1086;&#1088; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1085;&#1072; &#1090;&#1086;&#1084; &#1078;&#1077; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1077;. &#1055;&#1086;&#1083;&#1091;&#1095;&#1080;&#1074;&#1096;&#1080;&#1081;&#1089;&#1103; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1105;&#1085; &#1085;&#1072; &#1076;&#1080;&#1089;&#1082;&#1077; &#1087;&#1088;&#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;. &#1042; FreeCAD, &#1074;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1086;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086; &#1080; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;&#1080;&#1076;&#1086;&#1074; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080; &#1090;&#1086;&#1075;&#1086; &#1078;&#1077; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;.
</p><p>&#1042; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1086;&#1084;&#1077;&#1097;&#1077;&#1085;&#1099; &#1074; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099; &#1080; &#1080;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1088;&#1080;&#1089;&#1074;&#1086;&#1080;&#1090;&#1100; &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1080;&#1084;&#1077;&#1085;&#1072;. &#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1075;&#1088;&#1091;&#1087;&#1087;&#1072;&#1084;&#1080;, &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084;&#1080; &#1080; &#1080;&#1084;&#1077;&#1085;&#1072;&#1084;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1075;&#1083;&#1072;&#1074;&#1085;&#1099;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <a href="../ru/Tree_view.html" class="mw-redirect" title="Tree view/ru">&#1076;&#1088;&#1077;&#1074;&#1086;&#1074;&#1080;&#1076;&#1085;&#1086;&#1075;&#1086; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072;</a>. <b>&#1087;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;:</b> &#1058;&#1072;&#1082;&#1078;&#1077; &#1101;&#1090;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100;, &#1082;&#1072;&#1082; &#1080; &#1074;&#1089;&#1105; &#1074; FreeCAD, &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1080;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1077;&#1090;&#1072;&#1090;&#1086;&#1088;&#1072; <a href="../ru/Python.html" title="Python/ru">Python</a>. &#1042; <a href="../ru/Tree_view.html" class="mw-redirect" title="Tree view/ru">&#1076;&#1088;&#1077;&#1074;&#1086;&#1074;&#1080;&#1076;&#1085;&#1086;&#1084; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077;</a> &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; <span typeof="mw:File"><a href="../index.php?title=Std_Group.svg&amp;filetimestamp=20240528082502&amp;.html" class="mw-file-description"><img src="../File/Std_Group.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../Std_Group.html" title="Std Group">&#1075;&#1088;&#1091;&#1087;&#1087;&#1099;</a>, &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1074; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099;, &#1091;&#1076;&#1072;&#1083;&#1103;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1080;&#1083;&#1080; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099;, &#1082;&#1083;&#1080;&#1082;&#1085;&#1091;&#1074; &#1087;&#1088;&#1072;&#1074;&#1086;&#1081; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1077;&#1081; &#1085;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1074; <a href="../ru/Tree_view.html" class="mw-redirect" title="Tree view/ru">&#1076;&#1088;&#1077;&#1074;&#1086;&#1074;&#1080;&#1076;&#1085;&#1086;&#1084; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077;</a>, &#1087;&#1077;&#1088;&#1077;&#1080;&#1084;&#1077;&#1085;&#1091;&#1081;&#1090;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;. &#1058;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1074; &#1077;&#1075;&#1086; &#1074; &#1076;&#1088;&#1077;&#1074;&#1086;&#1074;&#1080;&#1076;&#1085;&#1086;&#1084; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1080; &#1085;&#1072;&#1078;&#1072;&#1074; F2, &#1090;&#1072;&#1082;&#1078;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1080; &#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1103;.
</p><p>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1074;&#1093;&#1086;&#1076;&#1103;&#1097;&#1080;&#1077; &#1074; FreeCAD &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1090;&#1080;&#1087;&#1086;&#1074;. &#1050;&#1072;&#1078;&#1076;&#1099;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1081; &#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1089;&#1074;&#1086;&#1080; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077; &#1090;&#1080;&#1087;&#1099; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1076;&#1083;&#1103; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072; <span typeof="mw:File"><a href="../index.php?title=Workbench_Mesh.svg&amp;filetimestamp=20200404173024&amp;.html" class="mw-file-description"><img src="../File/Workbench_Mesh.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Mesh_Workbench.html" title="Mesh Workbench/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; &#1087;&#1086;&#1083;&#1080;&#1075;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</a> &#1089;&#1086;&#1079;&#1076;&#1072;&#1105;&#1090; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1097;&#1080;&#1077; &#1080;&#1079; &#1087;&#1086;&#1083;&#1080;&#1075;&#1086;&#1085;&#1086;&#1074;, <span typeof="mw:File"><a href="../index.php?title=Workbench_Part.svg&amp;filetimestamp=20240712190040&amp;.html" class="mw-file-description"><img src="../File/Workbench_Part.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Part_Workbench.html" title="Part Workbench/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; &#1044;&#1077;&#1090;&#1072;&#1083;&#1077;&#1081;</a> &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080;, <span typeof="mw:File"><a href="../index.php?title=Workbench_Draft.svg&amp;filetimestamp=20200404172706&amp;.html" class="mw-file-description"><img src="../File/Workbench_Draft.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Draft_Workbench.html" title="Draft Workbench/ru">&#1063;&#1077;&#1088;&#1090;&#1077;&#1078;&#1085;&#1099;&#1081; &#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;</a> &#1090;&#1072;&#1082;&#1078;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1105;&#1090; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080;, &#1080; &#1090;.&#1076;.
</p><p>&#1045;&#1089;&#1083;&#1080; &#1077;&#1089;&#1090;&#1100; &#1087;&#1086; &#1082;&#1088;&#1072;&#1081;&#1085;&#1077;&#1081; &#1084;&#1077;&#1088;&#1077; &#1086;&#1076;&#1080;&#1085; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1081; &#1074; FreeCAD, &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1077;&#1089;&#1090;&#1100; &#1086;&#1076;&#1080;&#1085; &#1080; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1076;&#1080;&#1085; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1081; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;. &#1069;&#1090;&#1086;&#1090; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1084; &#1086;&#1082;&#1085;&#1077; 3D &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1072;, &#1101;&#1090;&#1086; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; &#1085;&#1072;&#1076; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1074;&#1099; &#1089;&#1077;&#1081;&#1095;&#1072;&#1089; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090;&#1077;.
</p><p><span id="Application_and_User_Interface"></span>
</p>
<h2><span id=".D0.9F.D1.80.D0.B8.D0.BB.D0.BE.D0.B6.D0.B5.D0.BD.D0.B8.D1.8F_.D0.B8_.D0.B8.D0.BD.D1.82.D0.B5.D1.80.D1.84.D0.B5.D0.B9.D1.81_.D0.BF.D0.BE.D0.BB.D1.8C.D0.B7.D0.BE.D0.B2.D0.B0.D1.82.D0.B5.D0.BB.D1.8F"></span><span class="mw-headline" id="&#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;_&#1080;_&#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;_&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;">&#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;</span></h2>
<p>&#1050;&#1072;&#1082; &#1087;&#1086;&#1095;&#1090;&#1080; &#1074;&#1089;&#1077; &#1074; FreeCAD, &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1081; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;(GUI) &#1086;&#1090;&#1076;&#1077;&#1083;&#1077;&#1085; &#1086;&#1090; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;(App). &#1058;&#1072;&#1082;&#1078;&#1077; &#1080; &#1089; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080;. &#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090; &#1080;&#1079; &#1076;&#1074;&#1091;&#1093; &#1095;&#1072;&#1089;&#1090;&#1077;&#1081;: &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; &#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1080;&#1081; &#1074;&#1072;&#1096;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;, &#1080; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; &#1082;&#1072;&#1082; &#1042;&#1080;&#1076;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085;&#1077; &#1085;&#1072;&#1096;&#1080;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;. 
</p><p>&#1044;&#1091;&#1084;&#1072;&#1081;&#1090;&#1077; &#1086;&#1073; &#1101;&#1090;&#1086;&#1084; &#1082;&#1072;&#1082; &#1086; &#1076;&#1074;&#1091;&#1093; &#1084;&#1077;&#1089;&#1090;&#1072;&#1093;, &#1075;&#1076;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1099; &#1074;&#1072;&#1096;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;. &#1048;&#1093; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; (&#1101;&#1090;&#1086; &#1082;&#1091;&#1073;? &#1082;&#1086;&#1085;&#1091;&#1089;? &#1077;&#1075;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;?) &#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1089;&#1103; &#1074; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1077; &#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1080;, &#1072; &#1080;&#1093; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; (&#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1074; &#1095;&#1077;&#1088;&#1085;&#1099;&#1093; &#1083;&#1080;&#1085;&#1080;&#1103;&#1093;? &#1089; &#1089;&#1080;&#1085;&#1080;&#1084;&#1080; &#1075;&#1088;&#1072;&#1085;&#1103;&#1084;&#1080;?) &#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1089;&#1103; &#1074; &#1095;&#1072;&#1089;&#1090;&#1080; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; &#1042;&#1080;&#1076;. &#1047;&#1072;&#1095;&#1077;&#1084; &#1101;&#1090;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1085;&#1086;? &#1055;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; FreeCAD &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085; <i>&#1073;&#1077;&#1079;</i> &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1074; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072;&#1093;, &#1080; &#1084;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1074; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1080; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1085;&#1072;&#1096;&#1080;&#1084;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084;&#1080;, &#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1085;&#1080;&#1095;&#1077;&#1075;&#1086; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085;&#1077;.
</p><p>&#1045;&#1097;&#1077; &#1074; &#1095;&#1072;&#1089;&#1090;&#1080; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &#1042;&#1080;&#1076; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1089;&#1103; &#1086;&#1073;&#1098;&#1105;&#1084;&#1085;&#1099;&#1077; &#1074;&#1080;&#1076;&#1099;. &#1054;&#1076;&#1080;&#1085; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1093; &#1074;&#1080;&#1076;&#1086;&#1074;, &#1090;&#1072;&#1082; &#1095;&#1090;&#1086; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1088;&#1086;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1090;&#1100; &#1074;&#1072;&#1096; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086; &#1089; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1090;&#1086;&#1095;&#1077;&#1082; &#1079;&#1088;&#1077;&#1085;&#1080;&#1103;. &#1052;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074;&#1099; &#1093;&#1086;&#1090;&#1077;&#1083;&#1080; &#1073;&#1099; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086; &#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1085;&#1072; &#1074;&#1072;&#1096; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1089;&#1087;&#1077;&#1088;&#1077;&#1076;&#1080; &#1080; &#1089;&#1074;&#1077;&#1088;&#1093;&#1091;? &#1058;&#1086;&#1075;&#1076;&#1072; &#1074; &#1074;&#1072;&#1096;&#1077;&#1084; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1076;&#1074;&#1077; &#1095;&#1072;&#1089;&#1090;&#1080; &#1042;&#1080;&#1076; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;. &#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1077; &#1074;&#1080;&#1076;&#1099; &#1080;&#1083;&#1080; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1100; &#1089;&#1090;&#1072;&#1088;&#1099;&#1077; &#1074;&#1080;&#1076;&#1099; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1085;&#1102; &#1042;&#1080;&#1076; &#1080;&#1083;&#1080; &#1082;&#1083;&#1080;&#1082;&#1085;&#1091;&#1074; &#1087;&#1088;&#1072;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; &#1084;&#1099;&#1096;&#1080; &#1087;&#1086; &#1079;&#1072;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; &#1074;&#1080;&#1076;&#1072;.
</p><p><span id="Scripting"></span>
</p>
<h2><span id=".D0.9F.D1.80.D0.BE.D0.B3.D1.80.D0.B0.D0.BC.D0.BC.D0.B8.D1.80.D0.BE.D0.B2.D0.B0.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;">&#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;</span></h2>
<p>&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1083;&#1077;&#1075;&#1082;&#1086; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1099; &#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1099; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1080;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1077;&#1090;&#1072;&#1090;&#1086;&#1088;&#1072; <a href="../ru/Python.html" title="Python/ru">Python</a>. 
&#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">FreeCAD</span><span class="o">.</span><span class="n">ActiveDocument</span>
</pre></div>
<p>&#1042;&#1077;&#1088;&#1085;&#1077;&#1090; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1081; (&#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1081;) &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">FreeCAD</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">Blob</span>
</pre></div>
<p>&#1044;&#1072;&#1089;&#1090; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1091; &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; "Blob" &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">FreeCADGui</span><span class="o">.</span><span class="n">ActiveDocument</span>
</pre></div>
<p>&#1042;&#1077;&#1088;&#1085;&#1077;&#1090; &#1074;&#1080;&#1076;-&#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1099;&#1081; &#1089; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1084; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084;
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">FreeCADGui</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">Blob</span>
</pre></div>
<p>&#1055;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084;&#1091; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1102; (&#1074;&#1080;&#1076;&#1091;) &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; Blob
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">FreeCADGui</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">ActiveView</span>
</pre></div>
<p>&#1042;&#1077;&#1088;&#1085;&#1077;&#1090; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1081; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1081; &#1074;&#1080;&#1076;.
</p><p><br>
</p>
<div class="docnav">
    <div><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-left.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span> <a href="../ru/Navigation_Cube.html" title="Navigation Cube/ru">&#1053;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1081; &#1082;&#1091;&#1073;</a></div>
    <div><a href="../ru/Property_View.html" title="Property View/ru">&#1054;&#1082;&#1085;&#1086; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;</a>
 <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-right.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span></div>
    <div><a href="../ru/Online_Help_Toc.html" title="Online Help Toc/ru">&#1054;&#1075;&#1083;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;</a> <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Online_Help_Toc.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span></div>
</div>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><span typeof="mw:File"><a href="../index.php?title=User_hub.png&amp;filetimestamp=20190221145008&amp;.html" class="mw-file-description"><img src="../File/User_hub.png" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/User_hub.html" title="User hub/ru">&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b><a href="../ru/Getting_started.html" title="Getting started/ru">&#1053;&#1072;&#1095;&#1080;&#1085;&#1072;&#1102;&#1097;&#1080;&#1084;</a></b></li>
<li><b>&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072;:</b> <a href="../ru/Download.html" title="Download/ru">&#1047;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072;</a>, <a href="../ru/Installing_on_Windows.html" title="Installing on Windows/ru">Windows</a>, <a href="../ru/Installing_on_Linux.html" title="Installing on Linux/ru">Linux</a>, <a href="../ru/Installing_on_Mac.html" title="Installing on Mac/ru">Mac</a>, <a href="../ru/Installing_additional_components.html" title="Installing additional components/ru">
&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074;</a>, <a href="../ru/Compile_on_Docker.html" title="Compile on Docker/ru">Docker</a>, <a href="../ru/AppImage.html" title="AppImage/ru">AppImage</a>, <a href="../ru/Ubuntu_Snap.html" title="Ubuntu Snap/ru">Ubuntu Snap</a></li>
<li><b>&#1041;&#1072;&#1079;&#1086;&#1074;&#1072;&#1103;:</b> <a href="../ru/About_FreeCAD.html" title="About FreeCAD/ru">&#1054; FreeCAD</a>, <a href="../ru/Interface.html" title="Interface/ru">&#1048;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;</a>, <a href="../ru/Mouse_navigation.html" title="Mouse navigation/ru">&#1053;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1103; &#1084;&#1099;&#1096;&#1080;</a>, <a href="../ru/Selection_methods.html" title="Selection methods/ru">&#1052;&#1077;&#1090;&#1086;&#1076;&#1099; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103;</a>, <a href="../ru/Object_name.html" title="Object name/ru">&#1048;&#1084;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;</a>, <a href="../ru/Preferences_Editor.html" title="Preferences Editor/ru">&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;</a>, <a href="../ru/Workbenches.html" title="Workbenches/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>, <a class="mw-selflink selflink">&#1057;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;</a>, <a href="../ru/Property.html" title="Property/ru">&#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;</a>, <a href="../ru/Help_FreeCAD.html" title="Help FreeCAD/ru">&#1055;&#1086;&#1084;&#1086;&#1075;&#1080; FreeCAD</a>, <a href="../ru/Donate.html" title="Donate/ru">&#1055;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</a></li></ul>
<hr>
<ul><li><b>&#1055;&#1086;&#1084;&#1086;&#1097;&#1100;:</b> <a href="../ru/Tutorials.html" title="Tutorials/ru">&#1059;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082;&#1080;</a>, <a href="../ru/Video_tutorials.html" title="Video tutorials/ru">&#1042;&#1080;&#1076;&#1077;&#1086; &#1091;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082;&#1080;</a></li>
<li><b><a href="../ru/Workbenches.html" title="Workbenches/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>:</b> <a href="../ru/Std_Base.html" title="Std Base/ru">Std Base</a>, <a href="../ru/Arch_Workbench.html" title="Arch Workbench/ru">Arch</a>, <a href="../ru/Assembly_Workbench.html" title="Assembly Workbench/ru">Assembly</a>, <a href="../ru/CAM_Workbench.html" title="CAM Workbench/ru">CAM</a>, <a href="../ru/Draft_Workbench.html" title="Draft Workbench/ru">Draft</a>, <a href="../ru/FEM_Workbench.html" title="FEM Workbench/ru">FEM</a>, <a href="../ru/Inspection_Workbench.html" title="Inspection Workbench/ru">Inspection</a>, <a href="../ru/Mesh_Workbench.html" title="Mesh Workbench/ru">Mesh</a>, <a href="../ru/OpenSCAD_Workbench.html" title="OpenSCAD Workbench/ru">OpenSCAD</a>, <a href="../ru/Part_Workbench.html" title="Part Workbench/ru">Part</a>, <a href="../ru/PartDesign_Workbench.html" title="PartDesign Workbench/ru">PartDesign</a>, <a href="../ru/Points_Workbench.html" title="Points Workbench/ru">Points</a>, <a href="../ru/Reverse_Engineering_Workbench.html" title="Reverse Engineering Workbench/ru">Reverse Engineering</a>, <a href="../ru/Robot_Workbench.html" title="Robot Workbench/ru">Robot</a>, <a href="../ru/Sketcher_Workbench.html" title="Sketcher Workbench/ru">Sketcher</a>, <a href="../ru/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/ru">Spreadsheet</a>, <a href="../ru/Surface_Workbench.html" title="Surface Workbench/ru">Surface</a>, <a href="../ru/TechDraw_Workbench.html" title="TechDraw Workbench/ru">TechDraw</a>, <a href="../ru/Testing.html" title="Testing/ru">Test Framework</a></li></ul>
<hr>
<ul><li><b><a href="../ru/Addon.html" title="Addon/ru">Addons</a>:</b> <a href="../ru/Std_AddonMgr.html" title="Std AddonMgr/ru">&#1052;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1081;</a>, <a href="../ru/External_workbenches.html" title="External workbenches/ru">&#1042;&#1085;&#1077;&#1096;&#1085;&#1080;&#1077; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>, <a href="../ru/Scripting_and_macros.html" title="Scripting and macros/ru">C&#1082;&#1088;&#1080;&#1087;&#1090;&#1099; &#1080; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1099;</a></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="../ru/User_hub.html" title="User hub/ru">&#1059;&#1075;&#1086;&#1083;&#1086;&#1082; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;</a>, <a href="../ru/Power_users_hub.html" title="Power users hub/ru">&#1059;&#1075;&#1086;&#1083;&#1086;&#1082; &#1086;&#1087;&#1099;&#1090;&#1085;&#1099;&#1093; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;</a>, <a href="../ru/Developer_hub.html" title="Developer hub/ru">&#1059;&#1075;&#1086;&#1083;&#1086;&#1082; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20260222122837
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.088 seconds
Real time usage: 0.152 seconds
Preprocessor visited node count: 152/1000000
Post&#8208;expand include size: 8256/2097152 bytes
Template argument size: 2792/2097152 bytes
Highest expansion depth: 5/100
Expensive parser function count: 5/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 5347/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   18.303      1 -total
 30.73%    5.625      1 Template:Userdocnavi/ru
 26.20%    4.795      5 Template:Code
 17.73%    3.245      2 Template:Docnav/ru
 10.54%    1.930      1 Template:Navigation_menu_2
  9.58%    1.754      1 Template:TOCright
  9.27%    1.697      1 Template:Emphasis
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:975-0!canonical and timestamp 20260222122837 and revision id 1757654. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>