<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Donate/ru</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="ru" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Donate&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/Donate.html" class="mw-pt-progress mw-pt-progress--med" title="Spenden (58% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Donate.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Donate (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/Donate.html" class="mw-pt-progress mw-pt-progress--low" title="Donaciones (12% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/Donate.html" class="mw-pt-progress mw-pt-progress--med" title="Faire un don (62% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/Donate.html" class="mw-pt-progress mw-pt-progress--med" title="Donazioni (62% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Donate.html" class="mw-pt-progress mw-pt-progress--high" title="Dotacje (96% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt-br/Donate.html" class="mw-pt-progress mw-pt-progress--low" title="Doa&ccedil;&otilde;es (12% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../fi/Donate.html" class="mw-pt-progress mw-pt-progress--med" title="Lahjoitukset (25% translated)" lang="fi" dir="ltr">suomi</a></li>
<li><a href="../sv/Donate.html" class="mw-pt-progress mw-pt-progress--high" title="Donera (96% translated)" lang="sv" dir="ltr">svenska</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--med" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</span></li>
<li><a href="../zh-tw/Donate.html" class="mw-pt-progress mw-pt-progress--low" title="&#25424;&#29563; (4% translated)" lang="zh-Hant-TW" dir="ltr">&#20013;&#25991;&#65288;&#33274;&#28771;&#65289;</a></li>
<li><a href="../ja/Donate.html" class="mw-pt-progress mw-pt-progress--low" title="&#23492;&#20184; (4% translated)" lang="ja" dir="ltr">&#26085;&#26412;&#35486;</a></li></ul></div>
<div class="mw-translate-fuzzy">
<p>&#1053;&#1080;&#1078;&#1077; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1099; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1099; &#1087;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1081;, &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1084; &#1074; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1077;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103;. &#1055;&#1086;&#1084;&#1085;&#1080;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1083;&#1072;&#1090;&#1080;&#1090;&#1100; &#1076;&#1077;&#1085;&#1100;&#1075;&#1080; &#1079;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;, &#1080;&#1079;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077; &#1080;&#1083;&#1080; &#1088;&#1072;&#1079;&#1074;&#1080;&#1090;&#1080;&#1077; FreeCAD. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1087;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1102;&#1090; FreeCAD &#1080; &#1077;&#1075;&#1086; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072;&#1084; &#1091;&#1076;&#1077;&#1083;&#1103;&#1090;&#1100; &#1074;&#1088;&#1077;&#1084;&#1103; &#1080; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1099; &#1076;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1088;&#1072;&#1079;&#1074;&#1080;&#1074;&#1072;&#1083;&#1089;&#1103; &#1073;&#1099;&#1089;&#1090;&#1088;&#1077;&#1077; &#1080; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1077;&#1077;.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Donations to the FreeCAD project are received and handled by the <a rel="nofollow" class="external text" href="https://fpa.freecad.org">FreeCAD project association</a> (FPA). See <a href="#The_FPA">below</a> for more details.
</p>
</div>
<ul class="gallery mw-gallery-traditional center">
		<li class="gallerybox" style="width: 163px">
			<div class="thumb" style="width: 158px; height: 158px;"><span typeof="mw:File"><a href="../File/PayPal_Logo_Icon_2014.svg" class="mw-file-description" title="PayPal"><img alt="PayPal" src="https://upload.wikimedia.org/wikipedia/commons/b/b7/PayPal_Logo_Icon_2014.svg" decoding="async" width="104" height="128" class="mw-file-element" data-file-width="585" data-file-height="720"></a></span></div>
			<div class="gallerytext"><a rel="nofollow" class="external text" href="https://www.paypal.com/donate/?hosted_button_id=M3Z8BGW6DB69Q">PayPal</a></div>
		</li>
		<li class="gallerybox" style="width: 163px">
			<div class="thumb" style="width: 158px; height: 158px;"><span typeof="mw:File"><a href="../index.php?title=SepaLogoEN.jpg&amp;filetimestamp=20220705123319&amp;.html" class="mw-file-description" title="SEPA bank transfer: IBAN BE04 0019 2896 4531"><img alt="SEPA bank transfer: IBAN BE04 0019 2896 4531" src="../File/SepaLogoEN.jpg" decoding="async" width="128" height="47" class="mw-file-element" data-file-width="1299" data-file-height="472"></a></span></div>
			<div class="gallerytext">SEPA bank transfer:<br>IBAN BE04 0019 2896 4531</div>
		</li>
		<li class="gallerybox" style="width: 163px">
			<div class="thumb" style="width: 158px; height: 158px;"><span typeof="mw:File"><a href="../index.php?title=Opencollective_logo.svg&amp;filetimestamp=20220705123832&amp;.html" class="mw-file-description" title="OpenCollective"><img alt="OpenCollective" src="../File/Opencollective_logo.svg" decoding="async" width="128" height="128" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span></div>
			<div class="gallerytext"><a rel="nofollow" class="external text" href="https://opencollective.com/freecad">OpenCollective</a></div>
		</li>
</ul>
<ul class="gallery mw-gallery-traditional center">
		<li class="gallerybox" style="width: 163px">
			<div class="thumb" style="width: 158px; height: 158px;"><span typeof="mw:File"><a href="../File/GitHub.svg" class="mw-file-description" title="GitHub sponsor"><img alt="GitHub sponsor" src="https://upload.wikimedia.org/wikipedia/commons/b/b3/GitHub.svg" decoding="async" width="128" height="57" class="mw-file-element" data-file-width="567" data-file-height="251"></a></span></div>
			<div class="gallerytext"><a rel="nofollow" class="external text" href="https://github.com/sponsors/FreeCAD">GitHub sponsor</a></div>
		</li>
		<li class="gallerybox" style="width: 163px">
			<div class="thumb" style="width: 158px; height: 158px;"><span typeof="mw:File"><a href="../index.php?title=Stripe-logo.png&amp;filetimestamp=20220718133635&amp;.html" class="mw-file-description" title="Stripe"><img alt="Stripe" src="../File/Stripe-logo.png" decoding="async" width="128" height="96" class="mw-file-element" data-file-width="1600" data-file-height="1200"></a></span></div>
			<div class="gallerytext"><a rel="nofollow" class="external text" href="https://donate.stripe.com/14k3ei9TYgwFclq145">Stripe</a></div>
		</li>
</ul>
<p>&#1050;&#1088;&#1086;&#1084;&#1077; &#1087;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1076;&#1077;&#1085;&#1077;&#1075; &#1080;&#1083;&#1080; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1082;&#1086;&#1076;&#1072;, &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1077;&#1089;&#1090;&#1100; &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1099; &#1087;&#1086;&#1084;&#1086;&#1095;&#1100;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1085;&#1072;&#1076; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1077;&#1081;, &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1072;&#1084;&#1080; &#1080;&#1083;&#1080; &#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1084; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;&#1084; &#1085;&#1072;&#1081;&#1090;&#1080; &#1089;&#1074;&#1086;&#1081; &#1087;&#1091;&#1090;&#1100;. &#1055;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1077;&#1077; &#1086;&#1073; &#1101;&#1090;&#1086;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1079;&#1085;&#1072;&#1090;&#1100; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; <a href="../ru/Help_FreeCAD.html" title="Help FreeCAD/ru">&#1055;&#1086;&#1084;&#1086;&#1097;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1091;</a>.
</p><p><span id="More_details_about_the_different_options"></span>
</p>
<meta property="mw:PageProp/toc">
<h2><span id=".D0.9F.D0.BE.D0.B4.D1.80.D0.BE.D0.B1.D0.BD.D0.B5.D0.B5_.D0.BE_.D1.80.D0.B0.D0.B7.D0.BB.D0.B8.D1.87.D0.BD.D1.8B.D1.85_.D0.B2.D0.B0.D1.80.D0.B8.D0.B0.D0.BD.D1.82.D0.B0.D1.85"></span><span class="mw-headline" id="&#1055;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1077;&#1077;_&#1086;_&#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093;_&#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1072;&#1093;">&#1055;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1077;&#1077; &#1086; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1072;&#1093;</span></h2>
<div class="mw-translate-fuzzy">
<ul><li><span typeof="mw:File"><a href="../File/PayPal_Logo_Icon_2014.svg" class="mw-file-description"><img src="https://upload.wikimedia.org/wikipedia/commons/b/b7/PayPal_Logo_Icon_2014.svg" decoding="async" width="24" height="30" class="mw-file-element" data-file-width="585" data-file-height="720"></a></span> &#1059; FreeCAD &#1077;&#1089;&#1090;&#1100; &#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; <a rel="nofollow" class="external text" href="https://www.paypal.com/donate/?hosted_button_id=M3Z8BGW6DB69Q">PayPal &#1072;&#1082;&#1082;&#1072;&#1091;&#1085;&#1090;</a>, &#1075;&#1076;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1083;&#1102;&#1073;&#1091;&#1102; &#1089;&#1091;&#1084;&#1084;&#1091; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1088;&#1077;&#1076;&#1080;&#1090;&#1085;&#1086;&#1081; &#1082;&#1072;&#1088;&#1090;&#1099; &#1080;&#1083;&#1080; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; Paypal &#1072;&#1082;&#1082;&#1072;&#1091;&#1085;&#1090;&#1072;, &#1077;&#1076;&#1080;&#1085;&#1086;&#1088;&#1072;&#1079;&#1086;&#1074;&#1086; &#1080;&#1083;&#1080; &#1087;&#1077;&#1088;&#1080;&#1086;&#1076;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;. &#1057;&#1095;&#1105;&#1090; PayPal &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FPA">FPA</a>. Paypal - &#1101;&#1090;&#1086; &#1091;&#1076;&#1086;&#1073;&#1085;&#1072;&#1103; &#1087;&#1083;&#1072;&#1090;&#1092;&#1086;&#1088;&#1084;&#1072;, &#1085;&#1086; &#1086;&#1085;&#1072; &#1074;&#1079;&#1080;&#1084;&#1072;&#1077;&#1090; &#1082;&#1086;&#1084;&#1080;&#1089;&#1089;&#1080;&#1102; &#1089; &#1090;&#1077;&#1093; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090; FreeCAD.</li></ul>
</div>
<div class="mw-translate-fuzzy">
<ul><li><span typeof="mw:File"><a href="../index.php?title=SepaLogoEN.jpg&amp;filetimestamp=20220705123319&amp;.html" class="mw-file-description"><img src="../File/SepaLogoEN.jpg" decoding="async" width="24" height="9" class="mw-file-element" data-file-width="1299" data-file-height="472"></a></span> &#1059; FreeCAD &#1077;&#1089;&#1090;&#1100; &#1089;&#1095;&#1105;&#1090; &#1074; &#1077;&#1074;&#1088;&#1086;&#1073;&#1072;&#1085;&#1082;&#1077;, &#1082;&#1091;&#1076;&#1072; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100; &#1076;&#1077;&#1085;&#1100;&#1075;&#1080; &#1085;&#1072;&#1087;&#1088;&#1103;&#1084;&#1091;&#1102; &#1095;&#1077;&#1088;&#1077;&#1079; &#1089;&#1074;&#1086;&#1105; &#1073;&#1072;&#1085;&#1082;&#1086;&#1074;&#1089;&#1082;&#1086;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;. &#1053;&#1086;&#1084;&#1077;&#1088; IBAN - BE04 0019 2896 4531, &#1087;&#1088;&#1080;&#1085;&#1072;&#1076;&#1083;&#1077;&#1078;&#1080;&#1090; &#1072;&#1089;&#1089;&#1086;&#1094;&#1080;&#1072;&#1094;&#1080;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; FreeCAD. &#1041;&#1072;&#1085;&#1082;&#1086;&#1074;&#1089;&#1082;&#1086;&#1077; &#1072;&#1075;&#1077;&#1085;&#1090;&#1089;&#1090;&#1074;&#1086; - BNP Paribas Fortis, &#1072;&#1076;&#1088;&#1077;&#1089;: Rue de la Station 64, 1360 Perwez, Belgium, BIC/SWIFT &#1082;&#1086;&#1076;: GEBABEBBXXX</li></ul>
</div>
<div class="mw-translate-fuzzy">
<ul><li><span typeof="mw:File"><a href="../index.php?title=Opencollective_logo.svg&amp;filetimestamp=20220705123832&amp;.html" class="mw-file-description"><img src="../File/Opencollective_logo.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> &#1059; FreeCAD &#1077;&#1089;&#1090;&#1100; &#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; <a rel="nofollow" class="external text" href="https://opencollective.com/freecad">OpenCollective PayPal &#1072;&#1082;&#1082;&#1072;&#1091;&#1085;&#1090;</a>, &#1075;&#1076;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1083;&#1102;&#1073;&#1091;&#1102; &#1089;&#1091;&#1084;&#1084;&#1091;, &#1077;&#1076;&#1080;&#1085;&#1086;&#1088;&#1072;&#1079;&#1086;&#1074;&#1086; &#1080;&#1083;&#1080; &#1087;&#1077;&#1088;&#1080;&#1086;&#1076;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;, &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1088;&#1077;&#1076;&#1080;&#1090;&#1085;&#1086;&#1081; &#1082;&#1072;&#1088;&#1090;&#1099;, SEPA &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1072; &#1080;&#1083;&#1080; Paypal. &#1057;&#1095;&#1077;&#1090; OpenCollective &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FPA">FPA</a>. OpenCollective - &#1101;&#1090;&#1086; &#1093;&#1086;&#1088;&#1086;&#1096;&#1080;&#1081; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1086;&#1085; &#1085;&#1077;&#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084; &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1084;&#1085;&#1086;&#1075;&#1080;&#1084;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;&#1084;&#1080; &#1089; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084; &#1082;&#1086;&#1076;&#1086;&#1084;. OpenCollective &#1090;&#1072;&#1082;&#1078;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/501(c)_organization">501(c)(6)</a> &#1085;&#1077;&#1082;&#1086;&#1084;&#1084;&#1077;&#1088;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1077;&#1081; &#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1099;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; <a rel="nofollow" class="external text" href="https://docs.opencollective.com/help/financial-contributors/receipts">&#1082;&#1074;&#1080;&#1090;&#1072;&#1085;&#1094;&#1080;&#1080; &#1086; &#1087;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;&#1093;</a>, &#1095;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086; &#1076;&#1083;&#1103; &#1072;&#1084;&#1077;&#1088;&#1080;&#1082;&#1072;&#1085;&#1089;&#1082;&#1080;&#1093; &#1085;&#1072;&#1083;&#1086;&#1075;&#1086;&#1087;&#1083;&#1072;&#1090;&#1077;&#1083;&#1100;&#1097;&#1080;&#1082;&#1086;&#1074; (&#1093;&#1086;&#1090;&#1103; &#1087;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1085;&#1077; &#1086;&#1073;&#1083;&#1072;&#1075;&#1072;&#1102;&#1090;&#1089;&#1103; &#1085;&#1072;&#1083;&#1086;&#1075;&#1086;&#1084;).</li></ul>
</div>
<div class="mw-translate-fuzzy">
<ul><li><span typeof="mw:File"><a href="../File/GitHub.svg" class="mw-file-description"><img src="https://upload.wikimedia.org/wikipedia/commons/b/b3/GitHub.svg" decoding="async" width="24" height="11" class="mw-file-element" data-file-width="567" data-file-height="251"></a></span> <a rel="nofollow" class="external text" href="https://github.com/sponsors/FreeCAD">&#1052;&#1077;&#1094;&#1077;&#1085;&#1072;&#1090;&#1099; GitHub</a> - &#1101;&#1090;&#1086; &#1089;&#1087;&#1086;&#1085;&#1089;&#1086;&#1088;&#1089;&#1082;&#1072;&#1103; &#1087;&#1083;&#1072;&#1090;&#1092;&#1086;&#1088;&#1084;&#1072;, &#1087;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1077;&#1084;&#1072;&#1103; GitHub, &#1075;&#1076;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1099; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077; &#1082;&#1086;&#1076;&#1099; FreeCAD. &#1047;&#1076;&#1077;&#1089;&#1100; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1077;&#1078;&#1077;&#1084;&#1077;&#1089;&#1103;&#1095;&#1085;&#1086; &#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1085;&#1072; FreeCAD &#1083;&#1102;&#1073;&#1091;&#1102; &#1089;&#1091;&#1084;&#1084;&#1091;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1082;&#1088;&#1077;&#1076;&#1080;&#1090;&#1085;&#1091;&#1102; &#1082;&#1072;&#1088;&#1090;&#1091; &#1080;&#1083;&#1080; Paypal. &#1040;&#1082;&#1082;&#1072;&#1091;&#1085;&#1090;&#1086;&#1084; &#1089;&#1087;&#1086;&#1085;&#1089;&#1086;&#1088;&#1086;&#1074; GitHub &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FPA">FPA</a>.</li></ul>
</div> 
<div class="mw-translate-fuzzy">
<ul><li><span typeof="mw:File"><a href="../index.php?title=Stripe-logo.png&amp;filetimestamp=20220718133635&amp;.html" class="mw-file-description"><img src="../File/Stripe-logo.png" decoding="async" width="24" height="18" class="mw-file-element" data-file-width="1600" data-file-height="1200"></a></span> &#1059; FreeCAD &#1077;&#1089;&#1090;&#1100; &#1072;&#1082;&#1082;&#1072;&#1091;&#1085;&#1090; <a rel="nofollow" class="external text" href="https://donate.stripe.com/14k3ei9TYgwFclq145">&#1076;&#1083;&#1103; &#1087;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1081; Stripe</a>, &#1075;&#1076;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1086;&#1076;&#1085;&#1086;&#1088;&#1072;&#1079;&#1086;&#1074;&#1086;&#1077; &#1087;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1088;&#1077;&#1076;&#1080;&#1090;&#1085;&#1086;&#1081; &#1082;&#1072;&#1088;&#1090;&#1099;.</li></ul>
</div>
<p><span id="Sponsoring"></span>
</p>
<h2><span id=".D0.A1.D0.BF.D0.BE.D0.BD.D1.81.D0.BE.D1.80.D1.81.D0.BA.D0.B0.D1.8F_.D0.BF.D0.BE.D0.B4.D0.B4.D0.B5.D1.80.D0.B6.D0.BA.D0.B0"></span><span class="mw-headline" id="&#1057;&#1087;&#1086;&#1085;&#1089;&#1086;&#1088;&#1089;&#1082;&#1072;&#1103;_&#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1072;">&#1057;&#1087;&#1086;&#1085;&#1089;&#1086;&#1088;&#1089;&#1082;&#1072;&#1103; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1072;</span></h2>
<p>&#1057;&#1087;&#1086;&#1085;&#1089;&#1086;&#1088;&#1089;&#1090;&#1074;&#1086;&#1084; &#1084;&#1099; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084; &#1072;&#1082;&#1090; &#1088;&#1077;&#1075;&#1091;&#1083;&#1103;&#1088;&#1085;&#1086;&#1075;&#1086; &#1087;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1076;&#1077;&#1085;&#1077;&#1075; &#1085;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; FreeCAD. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086; &#1082;&#1072;&#1082; &#1095;&#1072;&#1089;&#1090;&#1085;&#1086;&#1077; &#1083;&#1080;&#1094;&#1086;, &#1090;&#1072;&#1082; &#1080; &#1082;&#1086;&#1084;&#1087;&#1072;&#1085;&#1080;&#1103; &#1080;&#1083;&#1080; &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103;, &#1095;&#1077;&#1088;&#1077;&#1079; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1082;&#1072;&#1085;&#1072;&#1083;&#1099; &#1080;&#1083;&#1080; &#1087;&#1083;&#1072;&#1090;&#1092;&#1086;&#1088;&#1084;&#1099;, &#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1074;&#1072;&#1096;&#1080;&#1093; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1095;&#1090;&#1077;&#1085;&#1080;&#1081;. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1089;&#1087;&#1086;&#1085;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; FreeCAD &#1095;&#1077;&#1088;&#1077;&#1079; <a rel="nofollow" class="external text" href="https://www.freecad.org/sponsor.php">&#1089;&#1087;&#1086;&#1085;&#1089;&#1086;&#1088;&#1089;&#1082;&#1091;&#1102; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091;</a>.
</p><p>&#1057;&#1087;&#1086;&#1085;&#1089;&#1086;&#1088;&#1089;&#1090;&#1074;&#1086; FreeCAD &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1077;&#1075;&#1086; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072;&#1084; &#1088;&#1072;&#1089;&#1089;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1090;&#1100; &#1085;&#1072; &#1089;&#1090;&#1072;&#1073;&#1080;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1086;&#1090;&#1086;&#1082; &#1076;&#1086;&#1093;&#1086;&#1076;&#1086;&#1074;, &#1095;&#1090;&#1086; &#1076;&#1072;&#1077;&#1090; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; FPA &#1087;&#1083;&#1072;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1077;&#1083;&#1072; &#1085;&#1072;&#1087;&#1077;&#1088;&#1105;&#1076;, &#1072; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072;&#1084; FreeCAD - &#1073;&#1086;&#1083;&#1077;&#1077; &#1089;&#1077;&#1088;&#1100;&#1105;&#1079;&#1085;&#1086; &#1074;&#1082;&#1083;&#1072;&#1076;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; FreeCAD.
</p><p>&#1063;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1086;&#1097;&#1088;&#1080;&#1090;&#1100; &#1083;&#1102;&#1076;&#1077;&#1081; &#1080; &#1082;&#1086;&#1084;&#1087;&#1072;&#1085;&#1080;&#1080; &#1089;&#1087;&#1086;&#1085;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; FreeCAD, &#1084;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1083;&#1080; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1091;&#1088;&#1086;&#1074;&#1085;&#1080; &#1089;&#1087;&#1086;&#1085;&#1089;&#1086;&#1088;&#1089;&#1090;&#1074;&#1072;. &#1056;&#1077;&#1075;&#1091;&#1083;&#1103;&#1088;&#1085;&#1086; &#1078;&#1077;&#1088;&#1090;&#1074;&#1091;&#1103; &#1085;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;, &#1074;&#1099; &#1089;&#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1074;&#1072;&#1096;&#1077; &#1080;&#1084;&#1103;, &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1072;&#1085;&#1080;&#1080; &#1080;/&#1080;&#1083;&#1080; &#1083;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087; &#1085;&#1072; &#1089;&#1072;&#1081;&#1090;&#1077; FreeCAD, &#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1090;&#1086;&#1075;&#1086;, &#1082; &#1082;&#1072;&#1082;&#1086;&#1084;&#1091; &#1091;&#1088;&#1086;&#1074;&#1085;&#1102; &#1074;&#1099; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1089;&#1100;:
</p>
<ul><li>&hearts; &#1054;&#1073;&#1099;&#1095;&#1085;&#1099;&#1081; &#1089;&#1087;&#1086;&#1085;&#1089;&#1086;&#1088;: &#1086;&#1090; 1 USD / 1 EUR &#1074; &#1084;&#1077;&#1089;&#1103;&#1094;. &#1042;&#1072;&#1096;&#1077; &#1080;&#1084;&#1103; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; <a rel="nofollow" class="external text" href="https://www.freecad.org/sponsor.php">&#1089;&#1087;&#1086;&#1085;&#1089;&#1086;&#1088;&#1086;&#1074;</a>, &#1085;&#1086; &#1074;&#1099; &#1074;&#1089;&#1105; &#1088;&#1072;&#1074;&#1085;&#1086; &#1086;&#1095;&#1077;&#1085;&#1100; &#1087;&#1086;&#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1091;. &#1042;&#1084;&#1077;&#1089;&#1090;&#1077; &#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1077; &#1089;&#1087;&#1086;&#1085;&#1089;&#1086;&#1088;&#1099; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1085;&#1072; &#1087;&#1083;&#1072;&#1074;&#1091; &#1085;&#1077; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077;, &#1095;&#1077;&#1084; &#1082;&#1088;&#1091;&#1087;&#1085;&#1099;&#1077; &#1089;&#1087;&#1086;&#1085;&#1089;&#1086;&#1088;&#1099;.</li>
<li>&#129353; &#1041;&#1088;&#1086;&#1085;&#1079;&#1086;&#1074;&#1099;&#1081; &#1089;&#1087;&#1086;&#1085;&#1089;&#1086;&#1088;: &#1086;&#1090; 25 USD / 25 EUR &#1074; &#1084;&#1077;&#1089;&#1103;&#1094;. &#1055;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100; &#1074;&#1072;&#1096;&#1077; &#1080;&#1084;&#1103; &#1080;&#1083;&#1080; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1072;&#1085;&#1080;&#1080; &#1085;&#1072; <a rel="nofollow" class="external text" href="https://www.freecad.org/sponsor.php">&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; &#1089;&#1087;&#1086;&#1085;&#1089;&#1086;&#1088;&#1086;&#1074;</a>.</li>
<li>&#129352; &#1057;&#1077;&#1088;&#1077;&#1073;&#1088;&#1103;&#1085;&#1099;&#1081; &#1089;&#1087;&#1086;&#1085;&#1089;&#1086;&#1088;: &#1086;&#1090; 100 USD / 100 EUR &#1074; &#1084;&#1077;&#1089;&#1103;&#1094;. &#1055;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1088;&#1072;&#1079;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1074;&#1072;&#1096;&#1077; &#1080;&#1084;&#1103; &#1080;&#1083;&#1080; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1072;&#1085;&#1080;&#1080; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; <a rel="nofollow" class="external text" href="https://www.freecad.org/sponsor.php">&#1089;&#1087;&#1086;&#1085;&#1089;&#1086;&#1088;&#1086;&#1074;</a> &#1089;&#1086; &#1089;&#1089;&#1099;&#1083;&#1082;&#1086;&#1081; &#1085;&#1072; &#1074;&#1072;&#1096; &#1089;&#1072;&#1081;&#1090; &#1080; &#1086;&#1076;&#1085;&#1086;&#1089;&#1090;&#1088;&#1086;&#1095;&#1085;&#1099;&#1084; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1084; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103;.</li>
<li>&#129351; &#1047;&#1086;&#1083;&#1086;&#1090;&#1086;&#1081; &#1089;&#1087;&#1086;&#1085;&#1089;&#1086;&#1088;: &#1086;&#1090; 200 USD / 200 EUR &#1074; &#1084;&#1077;&#1089;&#1103;&#1094;. &#1055;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1079;&#1080;&#1090;&#1100; &#1074;&#1072;&#1096;&#1077; &#1080;&#1084;&#1103; &#1080;&#1083;&#1080; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1072;&#1085;&#1080;&#1080; &#1080; &#1083;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; &#1089;&#1087;&#1086;&#1085;&#1089;&#1086;&#1088;&#1086;&#1074; <a rel="nofollow" class="external autonumber" href="https://www.freecad.org/sponsor.php">[1]</a>, &#1089;&#1086; &#1089;&#1089;&#1099;&#1083;&#1082;&#1086;&#1081; &#1085;&#1072; &#1074;&#1072;&#1096; &#1089;&#1072;&#1081;&#1090; &#1080; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1084; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1084; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103;. &#1050;&#1086;&#1084;&#1087;&#1072;&#1085;&#1080;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1083;&#1080; FreeCAD &#1085;&#1072; &#1088;&#1072;&#1085;&#1085;&#1080;&#1093; &#1101;&#1090;&#1072;&#1087;&#1072;&#1093;, &#1090;&#1072;&#1082;&#1078;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077; &#1047;&#1086;&#1083;&#1086;&#1090;&#1099;&#1093; &#1089;&#1087;&#1086;&#1085;&#1089;&#1086;&#1088;&#1086;&#1074;.</li></ul>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>The FPA has a few <a rel="nofollow" class="external text" href="https://fpa.freecad.org/handbook/process/accepting-donations.html">ground rules</a> that define types of donation or sponsoring that can be accepted or not.
</p>
</div>
<p>&#1042;&#1084;&#1077;&#1089;&#1090;&#1086; &#1090;&#1086;&#1075;&#1086; &#1095;&#1090;&#1086;&#1073;&#1099; &#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1084;&#1077;&#1089;&#1103;&#1094;, &#1074;&#1072;&#1084;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1073;&#1091;&#1076;&#1077;&#1090; &#1091;&#1076;&#1086;&#1073;&#1085;&#1077;&#1077; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1077;&#1076;&#1080;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1077; &#1087;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1085;&#1072; &#1076;&#1074;&#1077;&#1085;&#1072;&#1076;&#1094;&#1072;&#1090;&#1100;, &#1076;&#1072;&#1089;&#1090; &#1074;&#1072;&#1084; &#1087;&#1088;&#1072;&#1074;&#1086; &#1074;&#1086;&#1081;&#1090;&#1080; &#1074; &#1089;&#1087;&#1086;&#1085;&#1089;&#1086;&#1088;&#1089;&#1082;&#1080;&#1081; &#1088;&#1077;&#1081;&#1090;&#1080;&#1085;&#1075;. &#1057;&#1076;&#1077;&#1083;&#1072;&#1081;&#1090;&#1077; &#1101;&#1090;&#1086; &#1073;&#1077;&#1079; &#1082;&#1086;&#1083;&#1077;&#1073;&#1072;&#1085;&#1080;&#1081;!
</p><p><span id="Jobs"></span>
</p>
<h2><span id=".D0.92.D0.B0.D0.BA.D0.B0.D0.BD.D1.81.D0.B8.D0.B8"></span><span class="mw-headline" id="&#1042;&#1072;&#1082;&#1072;&#1085;&#1089;&#1080;&#1080;">&#1042;&#1072;&#1082;&#1072;&#1085;&#1089;&#1080;&#1080;</span></h2>
<ul><li>&#1052;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1080;, &#1079;&#1072;&#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1074; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1080; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;; &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1091;&#1089;&#1082;&#1086;&#1088;&#1080;&#1090;&#1100; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1091; &#1080;&#1076;&#1077;&#1080; &#1080;&#1083;&#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;, &#1087;&#1086;&#1076;&#1091;&#1084;&#1072;&#1081;&#1090;&#1077; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1085;&#1072;&#1085;&#1103;&#1090;&#1100; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072;. &#1042;&#1072;&#1084; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1086;&#1080;&#1090; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1080;&#1076;&#1077;&#1102;, &#1086;&#1073;&#1089;&#1091;&#1076;&#1080;&#1090;&#1100; &#1077;&#1077; &#1085;&#1072; &#1092;&#1086;&#1088;&#1091;&#1084;&#1077; &#1080; &#1085;&#1072;&#1081;&#1090;&#1080; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;, &#1079;&#1072;&#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; &#1101;&#1090;&#1086;&#1084;. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1080;&#1090;&#1100; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091; &#1074; <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewforum.php?f=31">&#1055;&#1086;&#1076;&#1092;&#1086;&#1088;&#1091;&#1084; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081; &#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077;</a>.</li>
<li>&#1052;&#1086;&#1076;&#1077;&#1083;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1088;&#1080;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090;&#1089;&#1103;. &#1053;&#1077; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1086;&#1087;&#1099;&#1090;&#1085;&#1099;&#1081; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; FreeCAD &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1084;. &#1054;&#1087;&#1099;&#1090;&#1085;&#1099;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1087;&#1086;&#1084;&#1086;&#1095;&#1100; &#1074;&#1072;&#1084; &#1087;&#1077;&#1088;&#1077;&#1085;&#1077;&#1089;&#1090;&#1080; &#1074;&#1072;&#1096;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1099; &#1085;&#1072; FreeCAD, &#1095;&#1090;&#1086; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1087;&#1086;&#1087;&#1091;&#1083;&#1103;&#1088;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074; &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103;&#1093;. &#1057;&#1084;. <a href="../ru/FreeCAD_used_in_production.html" class="mw-redirect" title="FreeCAD used in production/ru">FreeCAD, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1081; &#1074; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1077;</a>.</li></ul>
<p><span id="The_FPA"></span>
</p>
<h2><span id=".D0.9E.D0.B1_.D0.B0.D1.81.D1.81.D0.BE.D1.86.D0.B8.D0.B0.D1.86.D0.B8.D0.B8_FPA"></span><span class="mw-headline" id="&#1054;&#1073;_&#1072;&#1089;&#1089;&#1086;&#1094;&#1080;&#1072;&#1094;&#1080;&#1080;_FPA">&#1054;&#1073; &#1072;&#1089;&#1089;&#1086;&#1094;&#1080;&#1072;&#1094;&#1080;&#1080; FPA</span></h2>
<div class="mw-translate-fuzzy">
<p><b>&#1040;&#1089;&#1089;&#1086;&#1094;&#1080;&#1072;&#1094;&#1080;&#1103; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; FreeCAD</b> (FPA) - &#1101;&#1090;&#1086; &#1085;&#1077;&#1082;&#1086;&#1084;&#1084;&#1077;&#1088;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1072;&#1089;&#1089;&#1086;&#1094;&#1080;&#1072;&#1094;&#1080;&#1103;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1072;&#1103; &#1074; 2022 &#1075;&#1086;&#1076;&#1091; &#1072;&#1076;&#1084;&#1080;&#1085;&#1080;&#1089;&#1090;&#1088;&#1072;&#1090;&#1086;&#1088;&#1072;&#1084;&#1080; &#1080; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1084;&#1080; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072;&#1084;&#1080; FreeCAD &#1080; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1072;&#1103; &#1074; &#1041;&#1077;&#1083;&#1100;&#1075;&#1080;&#1080;. &#1054;&#1085;&#1072; &#1086;&#1090;&#1074;&#1077;&#1095;&#1072;&#1077;&#1090; &#1079;&#1072; &#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1099;&#1081; &#1089;&#1073;&#1086;&#1088;, &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1091; &#1080; &#1088;&#1072;&#1089;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1076;&#1077;&#1085;&#1077;&#1075;, &#1089;&#1086;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; &#1074;&#1080;&#1076;&#1077; &#1087;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1081;. &#1041;&#1086;&#1083;&#1077;&#1077; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1080; &#1086;&#1090;&#1095;&#1105;&#1090;&#1099; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FPA">FPA</a>. &#1047;&#1072; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; <a rel="nofollow" class="external text" href="https://liberapay.com/FreeCAD">LiberaPay &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1099;&#1081; &#1089;&#1095;&#1077;&#1090;</a>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1077;&#1075;&#1086; &#1095;&#1083;&#1077;&#1085;&#1072;&#1084;&#1080;, &#1074;&#1089;&#1077; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1082;&#1072;&#1085;&#1072;&#1083;&#1099; &#1087;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1081; &#1074;&#1099;&#1096;&#1077; &#1086;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1080; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; FPA.
</p>
</div>
<p><span id="Tax_deductions"></span>
</p>
<h2><span id=".D0.9D.D0.B0.D0.BB.D0.BE.D0.B3.D0.BE.D0.B2.D1.8B.D0.B5_.D0.B2.D1.8B.D1.87.D0.B5.D1.82.D1.8B"></span><span class="mw-headline" id="&#1053;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1099;&#1077;_&#1074;&#1099;&#1095;&#1077;&#1090;&#1099;">&#1053;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1099;&#1077; &#1074;&#1099;&#1095;&#1077;&#1090;&#1099;</span></h2>
<p>FPA, &#1093;&#1086;&#1090;&#1103; &#1080; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077;&#1082;&#1086;&#1084;&#1084;&#1077;&#1088;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1077;&#1081;, &#1085;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1073;&#1083;&#1072;&#1075;&#1086;&#1090;&#1074;&#1086;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081;. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1083;&#1102;&#1076;&#1080; &#1080; &#1082;&#1086;&#1084;&#1087;&#1072;&#1085;&#1080;&#1080;, &#1076;&#1077;&#1083;&#1072;&#1102;&#1097;&#1080;&#1077; &#1087;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074; &#1087;&#1086;&#1083;&#1100;&#1079;&#1091; FPA, <a rel="nofollow" class="external text" href="https://finances.belgium.be/fr/particuliers/avantages_fiscaux/dons">&#1085;&#1077; &#1080;&#1084;&#1077;&#1102;&#1090; &#1087;&#1088;&#1072;&#1074;&#1072; &#1085;&#1072; &#1085;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1099;&#1081; &#1074;&#1099;&#1095;&#1077;&#1090;</a> &#1087;&#1086; &#1073;&#1077;&#1083;&#1100;&#1075;&#1080;&#1081;&#1089;&#1082;&#1086;&#1084;&#1091; &#1079;&#1072;&#1082;&#1086;&#1085;&#1086;&#1076;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1090;&#1074;&#1091;. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1074; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1089;&#1090;&#1088;&#1072;&#1085;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1089;&#1074;&#1086;&#1080; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1072; &#1080; &#1079;&#1072;&#1082;&#1086;&#1085;&#1099;, &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1102;&#1097;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1076;&#1072;&#1105;&#1090; &#1080;&#1093; &#1075;&#1088;&#1072;&#1078;&#1076;&#1072;&#1085;&#1072;&#1084; &#1087;&#1088;&#1072;&#1074;&#1086; &#1085;&#1072; &#1085;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1099;&#1081; &#1074;&#1099;&#1095;&#1077;&#1090;, &#1072; &#1095;&#1090;&#1086; &#1085;&#1077;&#1090;. &#1052;&#1099; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1084; &#1074;&#1072;&#1084; &#1086;&#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1080;&#1090;&#1100;&#1089;&#1103; &#1089; &#1079;&#1072;&#1082;&#1086;&#1085;&#1086;&#1076;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1090;&#1074;&#1086;&#1084; &#1074;&#1072;&#1096;&#1077;&#1081; &#1089;&#1090;&#1088;&#1072;&#1085;&#1099;.
</p><p>&#1042; &#1083;&#1102;&#1073;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; FPA &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1099;&#1076;&#1072;&#1090;&#1100; &#1082;&#1074;&#1080;&#1090;&#1072;&#1085;&#1094;&#1080;&#1102; &#1086; &#1087;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080;. <a rel="nofollow" class="external text" href="mailto:fpa@freecad.org">&#1053;&#1072;&#1087;&#1080;&#1096;&#1080;&#1090;&#1077; &#1085;&#1072;&#1084;</a> &#1089; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1086; &#1074;&#1072;&#1096;&#1077;&#1084; &#1087;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080;, &#1080; &#1084;&#1099; &#1089; &#1088;&#1072;&#1076;&#1086;&#1089;&#1090;&#1100;&#1102; &#1074;&#1099;&#1096;&#1083;&#1077;&#1084; &#1074;&#1072;&#1084; &#1082;&#1074;&#1080;&#1090;&#1072;&#1085;&#1094;&#1080;&#1102;.
</p>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><span typeof="mw:File"><a href="../index.php?title=User_hub.png&amp;filetimestamp=20190221145008&amp;.html" class="mw-file-description"><img src="../File/User_hub.png" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/User_hub.html" title="User hub/ru">&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b><a href="../ru/Getting_started.html" title="Getting started/ru">&#1053;&#1072;&#1095;&#1080;&#1085;&#1072;&#1102;&#1097;&#1080;&#1084;</a></b></li>
<li><b>&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072;:</b> <a href="../ru/Download.html" title="Download/ru">&#1047;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072;</a>, <a href="../ru/Installing_on_Windows.html" title="Installing on Windows/ru">Windows</a>, <a href="../ru/Installing_on_Linux.html" title="Installing on Linux/ru">Linux</a>, <a href="../ru/Installing_on_Mac.html" title="Installing on Mac/ru">Mac</a>, <a href="../ru/Installing_additional_components.html" title="Installing additional components/ru">
&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074;</a>, <a href="../ru/Compile_on_Docker.html" title="Compile on Docker/ru">Docker</a>, <a href="../ru/AppImage.html" title="AppImage/ru">AppImage</a>, <a href="../ru/Ubuntu_Snap.html" title="Ubuntu Snap/ru">Ubuntu Snap</a></li>
<li><b>&#1041;&#1072;&#1079;&#1086;&#1074;&#1072;&#1103;:</b> <a href="../ru/About_FreeCAD.html" title="About FreeCAD/ru">&#1054; FreeCAD</a>, <a href="../ru/Interface.html" title="Interface/ru">&#1048;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;</a>, <a href="../ru/Mouse_navigation.html" title="Mouse navigation/ru">&#1053;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1103; &#1084;&#1099;&#1096;&#1080;</a>, <a href="../ru/Selection_methods.html" title="Selection methods/ru">&#1052;&#1077;&#1090;&#1086;&#1076;&#1099; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103;</a>, <a href="../ru/Object_name.html" title="Object name/ru">&#1048;&#1084;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;</a>, <a href="../ru/Preferences_Editor.html" title="Preferences Editor/ru">&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;</a>, <a href="../ru/Workbenches.html" title="Workbenches/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>, <a href="../ru/Document_structure.html" title="Document structure/ru">&#1057;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;</a>, <a href="../ru/Property.html" title="Property/ru">&#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;</a>, <a href="../ru/Help_FreeCAD.html" title="Help FreeCAD/ru">&#1055;&#1086;&#1084;&#1086;&#1075;&#1080; FreeCAD</a>, <a class="mw-selflink selflink">&#1055;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</a></li></ul>
<hr>
<ul><li><b>&#1055;&#1086;&#1084;&#1086;&#1097;&#1100;:</b> <a href="../ru/Tutorials.html" title="Tutorials/ru">&#1059;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082;&#1080;</a>, <a href="../ru/Video_tutorials.html" title="Video tutorials/ru">&#1042;&#1080;&#1076;&#1077;&#1086; &#1091;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082;&#1080;</a></li>
<li><b><a href="../ru/Workbenches.html" title="Workbenches/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>:</b> <a href="../ru/Std_Base.html" title="Std Base/ru">Std Base</a>, <a href="../ru/Arch_Workbench.html" title="Arch Workbench/ru">Arch</a>, <a href="../ru/Assembly_Workbench.html" title="Assembly Workbench/ru">Assembly</a>, <a href="../ru/CAM_Workbench.html" title="CAM Workbench/ru">CAM</a>, <a href="../ru/Draft_Workbench.html" title="Draft Workbench/ru">Draft</a>, <a href="../ru/FEM_Workbench.html" title="FEM Workbench/ru">FEM</a>, <a href="../ru/Inspection_Workbench.html" title="Inspection Workbench/ru">Inspection</a>, <a href="../ru/Mesh_Workbench.html" title="Mesh Workbench/ru">Mesh</a>, <a href="../ru/OpenSCAD_Workbench.html" title="OpenSCAD Workbench/ru">OpenSCAD</a>, <a href="../ru/Part_Workbench.html" title="Part Workbench/ru">Part</a>, <a href="../ru/PartDesign_Workbench.html" title="PartDesign Workbench/ru">PartDesign</a>, <a href="../ru/Points_Workbench.html" title="Points Workbench/ru">Points</a>, <a href="../ru/Reverse_Engineering_Workbench.html" title="Reverse Engineering Workbench/ru">Reverse Engineering</a>, <a href="../ru/Robot_Workbench.html" title="Robot Workbench/ru">Robot</a>, <a href="../ru/Sketcher_Workbench.html" title="Sketcher Workbench/ru">Sketcher</a>, <a href="../ru/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/ru">Spreadsheet</a>, <a href="../ru/Surface_Workbench.html" title="Surface Workbench/ru">Surface</a>, <a href="../ru/TechDraw_Workbench.html" title="TechDraw Workbench/ru">TechDraw</a>, <a href="../ru/Testing.html" title="Testing/ru">Test Framework</a></li></ul>
<hr>
<ul><li><b><a href="../ru/Addon.html" title="Addon/ru">Addons</a>:</b> <a href="../ru/Std_AddonMgr.html" title="Std AddonMgr/ru">&#1052;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1081;</a>, <a href="../ru/External_workbenches.html" title="External workbenches/ru">&#1042;&#1085;&#1077;&#1096;&#1085;&#1080;&#1077; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>, <a href="../ru/Scripting_and_macros.html" title="Scripting and macros/ru">C&#1082;&#1088;&#1080;&#1087;&#1090;&#1099; &#1080; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1099;</a></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="../ru/User_hub.html" title="User hub/ru">&#1059;&#1075;&#1086;&#1083;&#1086;&#1082; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;</a>, <a href="../ru/Power_users_hub.html" title="Power users hub/ru">&#1059;&#1075;&#1086;&#1083;&#1086;&#1082; &#1086;&#1087;&#1099;&#1090;&#1085;&#1099;&#1093; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;</a>, <a href="../ru/Developer_hub.html" title="Developer hub/ru">&#1059;&#1075;&#1086;&#1083;&#1086;&#1082; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20251027090022
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.628 seconds
Real time usage: 2.400 seconds
Preprocessor visited node count: 77/1000000
Post&#8208;expand include size: 6166/2097152 bytes
Template argument size: 2238/2097152 bytes
Highest expansion depth: 4/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 5669/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    5.280      1 Template:Userdocnavi/ru
100.00%    5.280      1 -total
 55.66%    2.939      1 Template:Navigation_menu_2
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:219381-0!canonical and timestamp 20251027090022 and revision id 1678000. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>