<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Engine Block Tutorial/ru</span></h1><?xml encoding="UTF-8"><div class="mw-parser-output"><div class="mw-pt-languages noprint" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../de/Engine_Block_Tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Motorblock Tutorium (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Engine_Block_Tutorial.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Engine Block Tutorial (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/Engine_Block_Tutorial.html" class="mw-pt-progress mw-pt-progress--low" title="Engine Block Tutorial (33% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/Engine_Block_Tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Tutoriel pour cr&eacute;er un bloc moteur (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/Engine_Block_Tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Tutorial Blocco Motore (100% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Engine_Block_Tutorial.html" class="mw-pt-progress mw-pt-progress--stub" title="Poradnik: Blok silnika (8% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../ro/Engine_Block_Tutorial.html" class="mw-pt-progress mw-pt-progress--low" title="Tutorial Bloc Motor (25% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--med" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</span></li></ul></div>
<div style="text-align:center; background:#FDE0A8;margin:1em 7em;padding:0.5em 2em;border:2px solid #FF5706;">
<p>&#1069;&#1090;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1085;&#1077; &#1079;&#1072;&#1082;&#1086;&#1085;&#1095;&#1077;&#1085;&#1072;. &#1055;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1087;&#1086;&#1084;&#1086;&#1075;&#1080;&#1090;&#1077; &#1080; &#1074;&#1085;&#1077;&#1089;&#1080;&#1090;&#1077; &#1089;&#1074;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076; &#1074; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1091; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080;.
</p><p><a href="../ru/GuiCommand_model.html" title="GuiCommand model/ru">&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; Gui</a> &#1086;&#1073;&#1098;&#1103;&#1089;&#1085;&#1103;&#1077;&#1090;, &#1082;&#1072;&#1082; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1079;&#1072;&#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1099; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;. &#1055;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; <a href="../ru/Category;UnfinishedDocu.html" title="Category:UnfinishedDocu/ru"> Category:UnfinishedDocu/ru</a>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1085;&#1077;&#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1105;&#1085;&#1085;&#1099;&#1093; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;, &#1087;&#1086;&#1076;&#1086;&#1073;&#1085;&#1099;&#1093; &#1101;&#1090;&#1086;&#1081;. &#1057;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; <a href="../ru/Category;Command_Reference.html" title="Category:Command Reference/ru"> Category:Command Reference/ru</a> &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;.
</p><p>&#1057;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; <a href="../ru/WikiPages.html" title="WikiPages/ru">Wiki &#1057;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;</a>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1079;&#1085;&#1072;&#1090;&#1100; &#1086; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1074;&#1080;&#1082;&#1080;-&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;, &#1080; &#1079;&#1072;&#1081;&#1076;&#1080;&#1090;&#1077; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; <a href="../ru/Help_FreeCAD.html" title="Help FreeCAD/ru">&#1055;&#1086;&#1084;&#1086;&#1075;&#1080; FreeCAD</a>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1079;&#1085;&#1072;&#1090;&#1100; &#1086; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1072;&#1093;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084;&#1080; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1074;&#1085;&#1077;&#1089;&#1090;&#1080; &#1089;&#1074;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076;.
</p>
</div> 
<div class="mw-translate-fuzzy">
<table class="fcinfobox wikitable ct" style="width: 230px; float: right; margin-left: 1em">
<tbody><tr>
<td class="ctTitle" style="font-weight: bold; font-size: 125%;"><span typeof="mw:File"><span><img src="../File/Freecad.svg" decoding="async" width="32" height="32"></span></span> &#1056;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086;
</td></tr>
<tr>
<th class="ctOdd">&#1058;&#1077;&#1084;&#1072;
</th></tr>
<tr>
<td class="ctEven">Part Workbench
</td></tr>
<tr>
<th class="ctOdd">&#1059;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100;
</th></tr>
<tr>
<td class="ctEven">Beginner
</td></tr>
<tr>
<th class="ctOdd">&#1042;&#1088;&#1077;&#1084;&#1103; &#1076;&#1083;&#1103; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1103;
</th></tr>
<tr>
<td class="ctEven">
</td></tr>
<tr>
<th class="ctOdd">&#1040;&#1074;&#1090;&#1086;&#1088;&#1099;
</th></tr>
<tr>
<td class="ctEven">Andrewbuck40
</td></tr>
<tr>
<th class="ctOdd">FreeCAD &#1074;&#1077;&#1088;&#1089;&#1080;&#1103;
</th></tr>
<tr>
<td class="ctEven">0.14.3700
</td></tr>
<tr>
<th class="ctOdd">&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;
</th></tr>
<tr>
<td class="ctEven">
</td></tr>
<tr>
<th class="ctOdd">&#1057;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; &#1090;&#1072;&#1082;&#1078;&#1077;
</th></tr>
<tr>
<td class="ctEven"><i>None</i>
</td></tr>
<tr>
<td class="ctToc"><br><meta property="mw:PageProp/toc">
</td></tr></tbody></table>
</div>
<div class="mw-translate-fuzzy">
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../File/Engine_Block_Tutorial_-_Finished_Engine_Block.png" class="mw-file-description"><img src="../File/Engine_Block_Tutorial_-_Finished_Engine_Block.png" decoding="async" width="300" height="181"></a><figcaption></figcaption></figure>
</div>
<p><br>
&#1069;&#1090;&#1086; &#1074;&#1074;&#1086;&#1076;&#1085;&#1099;&#1081; &#1091;&#1088;&#1086;&#1082; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074; FreeCAD. &#1062;&#1077;&#1083;&#1100; &#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1091;&#1088;&#1086;&#1082;&#1072; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1042;&#1072;&#1084; &#1087;&#1088;&#1086;&#1089;&#1090;&#1099;&#1077; &#1090;&#1080;&#1087;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1076;&#1083;&#1103; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1076;&#1074;&#1086;&#1080;&#1095;&#1085;&#1099;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080;, &#1076;&#1074;&#1091;&#1084;&#1077;&#1088;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1080; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1076;&#1074;&#1091;&#1084;&#1077;&#1088;&#1085;&#1099;&#1093; &#1085;&#1072;&#1073;&#1088;&#1086;&#1089;&#1082;&#1086;&#1074; &#1074; &#1090;&#1088;&#1077;&#1093;&#1084;&#1077;&#1088;&#1085;&#1099;&#1077; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1075;&#1086; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072; &#1084;&#1099; &#1073;&#1091;&#1076;&#1077;&#1084; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1089;&#1090;&#1077;&#1081;&#1096;&#1080;&#1081; &#1073;&#1083;&#1086;&#1082; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1086;&#1074; &#1080; &#1082;&#1072;&#1088;&#1090;&#1077;&#1088;, &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1081; &#1074;&#1099;&#1096;&#1077;.
</p>
<div class="mw-translate-fuzzy">
<h2><span id=".D0.9D.D0.B0.D1.87.D0.B0.D0.BB.D0.BE"></span><span class="mw-headline" id="&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</span></h2>
<p>&#1063;&#1090;&#1086;&#1073;&#1099; &#1085;&#1072;&#1095;&#1072;&#1090;&#1100;, &#1086;&#1090;&#1082;&#1088;&#1086;&#1081;&#1090;&#1077; FreeCAD, &#1080; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; <i>&#1060;&#1072;&#1081;&#1083;-&gt;&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100;</i> &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;, &#1079;&#1072;&#1090;&#1077;&#1084; <i>&#1060;&#1072;&#1081;&#1083;-&gt;&#1057;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100;</i> &#1076;&#1083;&#1103; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1077;&#1075;&#1086; &#1075;&#1076;&#1077;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100; &#1085;&#1072; &#1042;&#1072;&#1096;&#1077;&#1084; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1077;. &#1071; &#1085;&#1072;&#1079;&#1074;&#1072;&#1083; &#1089;&#1074;&#1086;&#1081; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; '&#1044;&#1074;&#1080;&#1075;&#1072;&#1090;&#1077;&#1083;&#1100;'.  &#1042;&#1099; &#1091;&#1074;&#1080;&#1076;&#1080;&#1090;&#1077;, &#1095;&#1090;&#1086; "&#1076;&#1088;&#1077;&#1074;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;" &#1089; &#1083;&#1077;&#1074;&#1086;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099; &#1086;&#1082;&#1085;&#1072; &#1087;&#1086;&#1089;&#1083;&#1077; &#1077;&#1075;&#1086; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1082;&#1072;&#1078;&#1077;&#1090; &#1080;&#1084;&#1103; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;, &#1085;&#1072;&#1076; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1042;&#1099; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090;&#1077;. &#1059; &#1042;&#1072;&#1089; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086; &#1073;&#1086;&#1083;&#1077;&#1077; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086; &#1080; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085; &#1074; &#1082;&#1086;&#1088;&#1085;&#1077; &#1089;&#1074;&#1086;&#1077;&#1075;&#1086; &#1076;&#1088;&#1077;&#1074;&#1072; &#1074; &#1086;&#1082;&#1085;&#1077; &#1076;&#1088;&#1077;&#1074;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1074;.
</p>
</div>
<div class="mw-translate-fuzzy">
<h2><span id=".D0.AD.D1.81.D0.BA.D0.B8.D0.B7.D0.B8.D1.80.D0.BE.D0.B2.D0.B0.D0.BD.D0.B8.D0.B5_.D0.B1.D0.BB.D0.BE.D0.BA.D0.B0"></span><span class="mw-headline" id="&#1069;&#1089;&#1082;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;_&#1073;&#1083;&#1086;&#1082;&#1072;">&#1069;&#1089;&#1082;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1073;&#1083;&#1086;&#1082;&#1072;</span></h2>
<p>&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1085;&#1072;&#1095;&#1085;&#1105;&#1084; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091; &#1085;&#1072;&#1076; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100;&#1102;. &#1052;&#1099; &#1085;&#1072;&#1095;&#1085;&#1105;&#1084; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084;   Box &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1082;&#1086;&#1085;&#1090;&#1091;&#1088;&#1072; &#1073;&#1083;&#1086;&#1082;&#1072; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1086;&#1074;. &#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1085;&#1072;&#1084; &#1085;&#1072;&#1076;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1074; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100; <i>&#1076;&#1077;&#1090;&#1072;&#1083;&#1100;</i>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; <a href="../Part_Workbench.html" title="Part Workbench">Part Workbench</a>, &#1087;&#1077;&#1088;&#1077;&#1081;&#1076;&#1080;&#1090;&#1077; &#1085;&#1072;  &#1042;&#1080;&#1076;-&gt;&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;-&gt;Part. &#1042;&#1099; &#1091;&#1074;&#1080;&#1076;&#1080;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077; &#1074;&#1099;&#1073;&#1086;&#1088;&#1072; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; &#1042;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1077; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1085;&#1072;&#1073;&#1086;&#1088; &#1082;&#1085;&#1086;&#1087;&#1086;&#1082; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1075;&#1086; &#1090;&#1091;&#1083;&#1073;&#1072;&#1088;&#1072;. &#1055;&#1088;&#1086;&#1081;&#1076;&#1080;&#1090;&#1077; &#1095;&#1077;&#1088;&#1077;&#1079; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1086;&#1074; &#1076;&#1083;&#1103; &#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1089;&#1090;&#1074;&#1072; &#1089; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1086;&#1074;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1074;&#1077;&#1088;&#1085;&#1080;&#1090;&#1077;&#1089;&#1100; &#1074; &#1084;&#1086;&#1076;&#1091;&#1083;&#1100; &#1076;&#1077;&#1090;&#1072;&#1083;&#1077;&#1081;.
</p>
</div>
<div class="mw-translate-fuzzy">
<h3><span id=".D0.97.D0.B0.D0.B3.D0.BE.D1.82.D0.BE.D0.B2.D0.BA.D0.B0"></span><span class="mw-headline" id="&#1047;&#1072;&#1075;&#1086;&#1090;&#1086;&#1074;&#1082;&#1072;">&#1047;&#1072;&#1075;&#1086;&#1090;&#1086;&#1074;&#1082;&#1072;</span></h3>
<p>&#1042; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077; &#1076;&#1077;&#1090;&#1072;&#1083;&#1077;&#1081; &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1082;&#1085;&#1086;&#1087;&#1086;&#1082; &#1076;&#1083;&#1103; &#1087;&#1077;&#1088;&#1074;&#1080;&#1095;&#1085;&#1099;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1074;&#1088;&#1086;&#1076;&#1077; &#1082;&#1091;&#1073;&#1086;&#1074;, &#1089;&#1092;&#1077;&#1088;, &#1082;&#1086;&#1085;&#1091;&#1089;&#1086;&#1074; &#1080; &#1090;.&#1076;. &#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1050;&#1091;&#1073; (<span typeof="mw:File"><a href="../File/Part_Box.png" class="mw-file-description"><img src="../File/Part_Box.png" decoding="async" width="16" height="16"></a></span>) &#1076;&#1083;&#1103; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1082;&#1091;&#1073;&#1072;. &#1059; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1080;&#1079; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1087;&#1088;&#1080;&#1084;&#1080;&#1090;&#1080;&#1074;&#1086;&#1074; &#1077;&#1089;&#1090;&#1100; &#1085;&#1072;&#1073;&#1086;&#1088; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074;, &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093; &#1087;&#1088;&#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;. &#1045;&#1089;&#1083;&#1080; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077;, &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1074;&#1080;&#1076;&#1072; &#1087;&#1088;&#1080;&#1084;&#1080;&#1090;&#1080;&#1074;&#1086;&#1074;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1086;&#1085;&#1080; &#1080;&#1079; &#1089;&#1077;&#1073;&#1103; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090;. &#1048;&#1093; &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1089;&#1086; &#1089;&#1094;&#1077;&#1085;&#1099;, &#1074;&#1099;&#1073;&#1088;&#1072;&#1074; &#1080;&#1093; &#1080; &#1085;&#1072;&#1078;&#1072;&#1074; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1103;. &#1045;&#1089;&#1090;&#1100; &#1076;&#1074;&#1072; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1072; &#1074;&#1099;&#1073;&#1086;&#1088;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1083;&#1080;&#1073;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1082;&#1083;&#1080;&#1082; &#1083;&#1077;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; &#1084;&#1099;&#1096;&#1080; &#1074; &#1086;&#1082;&#1085;&#1077; &#1090;&#1088;&#1105;&#1093;&#1084;&#1077;&#1088;&#1085;&#1086;&#1075;&#1086; &#1074;&#1080;&#1076;&#1072;, &#1083;&#1080;&#1073;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1090;&#1086; &#1078;&#1077; &#1074; &#1076;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;. &#1048; &#1090;&#1072;&#1084;, &#1080; &#1090;&#1072;&#1084; &#1091;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; CTRL &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1088;&#1080;&#1073;&#1083;&#1080;&#1079;&#1080;&#1090;&#1100; &#1090;&#1088;&#1105;&#1093;&#1084;&#1077;&#1088;&#1085;&#1099;&#1081; &#1074;&#1080;&#1076; &#1087;&#1088;&#1086;&#1082;&#1088;&#1091;&#1095;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1082;&#1086;&#1083;&#1105;&#1089;&#1080;&#1082;&#1072; &#1084;&#1099;&#1096;&#1080;. &#1044;&#1083;&#1103; &#1089;&#1076;&#1074;&#1080;&#1075;&#1072; &#1074;&#1080;&#1076;&#1072; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1089;&#1088;&#1077;&#1076;&#1085;&#1102;&#1102; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1080; &#1087;&#1088;&#1086;&#1090;&#1072;&#1097;&#1080;&#1090;&#1077;. &#1044;&#1083;&#1103; &#1087;&#1086;&#1074;&#1086;&#1088;&#1086;&#1090;&#1072; &#1074;&#1080;&#1076;&#1072; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1080; &#1091;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1081;&#1090;&#1077; &#1089;&#1088;&#1077;&#1076;&#1085;&#1102;&#1102; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1080; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1083;&#1077;&#1074;&#1091;&#1102; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091;, &#1090;&#1086;&#1075;&#1076;&#1072; &#1087;&#1088;&#1086;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; &#1084;&#1099;&#1096;&#1100;&#1102; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1088;&#1072;&#1097;&#1072;&#1090;&#1100; &#1074;&#1080;&#1076;. &#1052;&#1086;&#1078;&#1085;&#1086; &#1090;&#1072;&#1082; &#1078;&#1077; &#1082;&#1083;&#1080;&#1082;&#1085;&#1091;&#1090;&#1100; &#1089;&#1088;&#1077;&#1076;&#1085;&#1077;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; &#1075;&#1076;&#1077;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100; &#1085;&#1072; &#1090;&#1088;&#1105;&#1093;&#1084;&#1077;&#1088;&#1085;&#1086;&#1084; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1077;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1090;&#1088;&#1105;&#1093;&#1084;&#1077;&#1088;&#1085;&#1099;&#1081; &#1074;&#1080;&#1076; &#1074;&#1088;&#1072;&#1097;&#1072;&#1083;&#1089;&#1103; &#1074;&#1086;&#1082;&#1088;&#1091;&#1075; &#1101;&#1090;&#1086;&#1081; &#1090;&#1086;&#1095;&#1082;&#1080;. &#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; 1-6 &#1080; &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; 0 &#1085;&#1072; &#1094;&#1080;&#1092;&#1088;&#1086;&#1074;&#1086;&#1081; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1077; &#1076;&#1072;&#1089;&#1090; &#1042;&#1072;&#1084; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1074;&#1080;&#1076;&#1099; &#1101;&#1090;&#1086;&#1081; &#1089;&#1094;&#1077;&#1085;&#1099; (&#1089;&#1074;&#1077;&#1088;&#1093;&#1091;, &#1089;&#1083;&#1077;&#1074;&#1072;, &#1072;&#1082;&#1089;&#1080;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1080; &#1090;&#1072;&#1082; &#1076;&#1072;&#1083;&#1077;&#1077;). &#1055;&#1086;&#1090;&#1088;&#1072;&#1090;&#1100;&#1090;&#1077; &#1087;&#1072;&#1088;&#1091; &#1084;&#1080;&#1085;&#1091;&#1090;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1089;&#1074;&#1086;&#1080;&#1090;&#1100;&#1089;&#1103; &#1089; &#1084;&#1072;&#1085;&#1080;&#1087;&#1091;&#1083;&#1103;&#1094;&#1080;&#1103;&#1084;&#1080; &#1074; &#1090;&#1088;&#1105;&#1093;&#1084;&#1077;&#1088;&#1085;&#1086;&#1084; &#1086;&#1082;&#1085;&#1077;.
</p>
</div>
<dl><dd><i>&#1057;&#1086;&#1087;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083;&#1099;: <a href="../ru/Mouse_navigation.html" title="Mouse navigation/ru">&#1053;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1103; &#1074; &#1090;&#1088;&#1105;&#1093;&#1084;&#1077;&#1088;&#1085;&#1086;&#1084; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1077;</a></i></dd></dl>
<div class="mw-translate-fuzzy">
<p>&#1055;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1074; &#1082;&#1091;&#1073; &#1080; &#1086;&#1089;&#1074;&#1086;&#1080;&#1074;&#1096;&#1080;&#1089;&#1100; &#1089; &#1088;&#1072;&#1073;&#1086;&#1090;&#1086;&#1081; &#1089; &#1084;&#1099;&#1096;&#1100;&#1102;, &#1085;&#1072;&#1095;&#1085;&#1105;&#1084; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1090;&#1100; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;. &#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1082;&#1091;&#1073;, &#1082;&#1083;&#1080;&#1082;&#1085;&#1091;&#1074; &#1087;&#1086; &#1085;&#1077;&#1084;&#1091; &#1074; &#1076;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;, &#1079;&#1072;&#1090;&#1077;&#1084; &#1082;&#1083;&#1080;&#1082;&#1085;&#1080;&#1090;&#1077; &#1087;&#1086; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; '&#1044;&#1072;&#1085;&#1085;&#1099;&#1077;' &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1085;&#1080;&#1078;&#1077; <i>&#1055;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1072; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;</i> (&#1087;&#1077;&#1088;&#1077;&#1081;&#1076;&#1080;&#1090;&#1077; <i>&#1042;&#1080;&#1076;-&gt;&#1055;&#1072;&#1085;&#1077;&#1083;&#1080;-&gt;&#1055;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;</i>, &#1077;&#1089;&#1083;&#1080; &#1042;&#1099; &#1079;&#1072;&#1082;&#1088;&#1099;&#1083;&#1080; &#1077;&#1075;&#1086;). &#1053;&#1072; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;, &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1074; &#1076;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;. &#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100;, &#1079;&#1072;&#1074;&#1080;&#1089;&#1103;&#1090; &#1086;&#1090; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082;&#1086;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;. &#1044;&#1083;&#1103; &#1082;&#1091;&#1073;&#1072; &#1101;&#1090;&#1086; &#1090;&#1088;&#1080; &#1074;&#1077;&#1082;&#1090;&#1086;&#1088;&#1072;, &#1086;&#1076;&#1080;&#1085; &#1076;&#1083;&#1103; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1080; &#1074; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1077;, &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1076;&#1083;&#1103; &#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080;, &#1072; &#1090;&#1088;&#1077;&#1090;&#1080;&#1081; &#1076;&#1083;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074;. &#1044;&#1083;&#1103; &#1089;&#1092;&#1077;&#1088;&#1099; &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1094;&#1077;&#1085;&#1090;&#1088;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1090;&#1086;&#1095;&#1082;&#1091; &#1080; &#1088;&#1072;&#1076;&#1080;&#1091;&#1089;, &#1091; &#1082;&#1086;&#1085;&#1091;&#1089;&#1072; - &#1088;&#1072;&#1076;&#1080;&#1091;&#1089;, &#1074;&#1099;&#1089;&#1086;&#1090;&#1091; &#1080; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1102;, &#1080; &#1090;&#1072;&#1082; &#1076;&#1072;&#1083;&#1077;&#1077;. &#1052;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1105;&#1084; &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081; 2-&#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1086;&#1074;&#1099;&#1081; &#1073;&#1083;&#1086;&#1082;, &#1090;&#1072;&#1082; &#1095;&#1090;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1080; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1080; &#1082;&#1091;&#1073;&#1072; (&#1091;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1042;&#1099; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1083;&#1080; XYZ &#1076;&#1083;&#1103; 'Position', &#1076;&#1083;&#1103; 'Axis' &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1083;&#1080; &#1086;&#1089;&#1080; &#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103; &#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1090;&#1072;&#1082;&#1080;&#1077;, &#1082;&#1072;&#1082; &#1085;&#1091;&#1078;&#1085;&#1086;):
</p>
</div>
<dl><dd><table class="wikitable" border="1">

<tbody><tr>
<td>X:  0,0 &#1084;&#1084;</td>
<td>&#1044;&#1083;&#1080;&#1085;&#1072;: 140,0 &#1084;&#1084;
</td></tr>
<tr>
<td>Y:  -40,0 &#1084;&#1084;</td>
<td>&#1064;&#1080;&#1088;&#1080;&#1085;&#1072;: 80,0 &#1084;&#1084;
</td></tr>
<tr>
<td>Z:  0,0 &#1084;&#1084;</td>
<td>&#1042;&#1099;&#1089;&#1086;&#1090;&#1072;: 110,0 &#1084;&#1084;
</td></tr>
</tbody></table></dd></dl>
<div class="mw-translate-fuzzy">
<p>&#1058;&#1077;&#1087;&#1077;&#1088;&#1100;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1072;&#1096; &#1073;&#1083;&#1086;&#1082; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1086;&#1074; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086; &#1086;&#1073;&#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1077;&#1085;, &#1085;&#1072;&#1084; &#1085;&#1072;&#1076;&#1086; &#1076;&#1072;&#1090;&#1100; &#1077;&#1084;&#1091; &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1086;&#1085;&#1103;&#1090;&#1085;&#1086;&#1077; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;. &#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1077;&#1075;&#1086; &#1074; &#1076;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1080; &#1083;&#1080;&#1073;&#1086; &#1082;&#1083;&#1080;&#1082;&#1085;&#1080;&#1090;&#1077; &#1087;&#1088;&#1072;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081;, &#1083;&#1080;&#1073;&#1086; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1085;&#1072; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1077; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1091; <i>F2</i>. &#1053;&#1072;&#1079;&#1086;&#1074;&#1080;&#1090;&#1077; &#1101;&#1090;&#1091; &#1076;&#1077;&#1090;&#1072;&#1083;&#1100; '&#1047;&#1072;&#1075;&#1086;&#1090;&#1086;&#1074;&#1082;&#1072;'.
</p>
</div>
<div class="mw-translate-fuzzy">
<h3><span id=".D0.9F.D0.B5.D1.80.D0.B2.D1.8B.D0.B9_.D1.86.D0.B8.D0.BB.D0.B8.D0.BD.D0.B4.D1.80"></span><span class="mw-headline" id="&#1055;&#1077;&#1088;&#1074;&#1099;&#1081;_&#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;">&#1055;&#1077;&#1088;&#1074;&#1099;&#1081; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;</span></h3>
<p>&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1084;&#1099; &#1074;&#1099;&#1088;&#1077;&#1078;&#1077;&#1084; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088; &#1085;&#1072;&#1089;&#1082;&#1074;&#1086;&#1079;&#1100; &#1073;&#1083;&#1086;&#1082;&#1072; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1086;&#1074;. &#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1084;&#1099; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1084; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088; &#1074; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100; &#1089; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1084;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1084;&#1099; &#1093;&#1086;&#1090;&#1080;&#1084; &#1087;&#1088;&#1086;&#1089;&#1074;&#1077;&#1088;&#1083;&#1080;&#1090;&#1100; &#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1084; &#1076;&#1074;&#1086;&#1080;&#1095;&#1085;&#1091;&#1102; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1102; "subtract" &#1074;&#1099;&#1088;&#1077;&#1079;&#1072;&#1085;&#1080;&#1103; &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083;&#1072; &#1080;&#1079; &#1073;&#1083;&#1086;&#1082;&#1072;. &#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1072; (<span typeof="mw:File"><a href="../File/Part_Cylinder.png" class="mw-file-description"><img src="../File/Part_Cylinder.png" decoding="async" width="16" height="16"></a></span>) &#1076;&#1083;&#1103; &#1077;&#1075;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103;, &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077; &#1077;&#1075;&#1086; &#1074; &#1076;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1077;&#1084;&#1091; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;:
</p>
</div>
<dl><dd><table class="wikitable" border="1">

<tbody><tr>
<td>X:  40,0 &#1084;&#1084;</td>
<td>&#1042;&#1099;&#1089;&#1086;&#1090;&#1072;: 110,0 &#1084;&#1084;
</td></tr>
<tr>
<td>Y:  0,0 &#1084;&#1084;</td>
<td>&#1056;&#1072;&#1076;&#1080;&#1091;&#1089;: 25,0 &#1084;&#1084;
</td></tr>
<tr>
<td>Z:  0,0 &#1084;&#1084;</td>
<td>
</td></tr>
</tbody></table></dd></dl>
<div class="mw-translate-fuzzy">
<p>&#1055;&#1086;&#1089;&#1083;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1099;&#1093; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1086;&#1082;&#1088;&#1091;&#1075;&#1083;&#1099;&#1077; &#1082;&#1086;&#1085;&#1094;&#1099; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1072; &#1089;&#1090;&#1072;&#1085;&#1091;&#1090; &#1074;&#1080;&#1076;&#1085;&#1099; &#1085;&#1072; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1081; &#1080; &#1085;&#1080;&#1078;&#1085;&#1077;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1077; &#1073;&#1083;&#1086;&#1082;&#1072; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1086;&#1074;. &#1053;&#1072;&#1079;&#1086;&#1074;&#1080;&#1090;&#1077; &#1101;&#1090;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; <i>&#1062;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088; 1</i>, &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1074; &#1077;&#1075;&#1086; &#1074; &#1076;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;.
</p>
</div>
<div class="mw-translate-fuzzy">
<h3><span id=".D0.92.D1.82.D0.BE.D1.80.D0.BE.D0.B9_.D1.86.D0.B8.D0.BB.D0.B8.D0.BD.D0.B4.D1.80"></span><span class="mw-headline" id="&#1042;&#1090;&#1086;&#1088;&#1086;&#1081;_&#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;">&#1042;&#1090;&#1086;&#1088;&#1086;&#1081; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;</span></h3>
<p>&#1052;&#1086;&#1078;&#1085;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088; &#1090;&#1072;&#1082; &#1078;&#1077; &#1082;&#1072;&#1082; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081;, &#1085;&#1086; &#1082;&#1091;&#1076;&#1072; &#1087;&#1088;&#1086;&#1097;&#1077; &#1089;&#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1091;&#1078;&#1077; &#1089;&#1076;&#1077;&#1083;&#1072;&#1085;&#1085;&#1086;&#1077; &#1076;&#1083;&#1103; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1077; &#1086;&#1090;&#1083;&#1080;&#1095;&#1080;&#1077; &#1084;&#1077;&#1078;&#1076;&#1091; &#1085;&#1080;&#1084;&#1080; &#1074; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1077; X. &#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; <i>&#1062;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088; 1</i> &#1074; &#1076;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1080; &#1087;&#1077;&#1088;&#1077;&#1081;&#1076;&#1080;&#1090;&#1077; &#1085;&#1072;<i>&#1055;&#1088;&#1072;&#1074;&#1082;&#1072;-&gt;&#1044;&#1091;&#1073;&#1083;&#1080;&#1082;&#1072;&#1090;</i>.  &#1042;&#1099; &#1091;&#1074;&#1080;&#1076;&#1080;&#1090;&#1077; &#1085;&#1086;&#1074;&#1099;&#1081; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088; &#1074; &#1076;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; (&#1089;&#1088;&#1072;&#1079;&#1091; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; <i>&#1062;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088; 2</i>), &#1085;&#1086; &#1077;&#1075;&#1086; &#1085;&#1077; &#1074;&#1080;&#1076;&#1085;&#1086; &#1074; &#1090;&#1088;&#1077;&#1093;&#1084;&#1077;&#1088;&#1085;&#1086;&#1084; &#1074;&#1080;&#1076;&#1077;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1086;&#1085; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1090;&#1072;&#1084; &#1078;&#1077;, &#1075;&#1076;&#1077; &#1080; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;. &#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; <i>&#1062;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088; 2</i> &#1074; &#1076;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1080; &#1087;&#1086;&#1084;&#1077;&#1085;&#1103;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1091; X &#1085;&#1072; 100 mm. &#1050;&#1072;&#1082; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1042;&#1099; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086; &#1074; &#1087;&#1086;&#1083;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1042;&#1099; &#1091;&#1074;&#1080;&#1076;&#1080;&#1090;&#1077; &#1082;&#1072;&#1082; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1089;&#1090;&#1080;&#1083;&#1089;&#1103; &#1074; &#1090;&#1088;&#1077;&#1093;&#1084;&#1077;&#1088;&#1085;&#1086;&#1084; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1077;. &#1050;&#1086;&#1075;&#1076;&#1072; &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086; &#1087;&#1086;&#1084;&#1077;&#1097;&#1105;&#1085;, &#1084;&#1086;&#1078;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1086;&#1075;&#1083;&#1103;&#1076;&#1077;&#1090;&#1100;, &#1082;&#1072;&#1082; &#1086;&#1085; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1080;&#1090;, &#1074;&#1099;&#1073;&#1088;&#1072;&#1074; <i>&#1047;&#1072;&#1075;&#1086;&#1090;&#1086;&#1074;&#1082;&#1091;</i> &#1074; &#1076;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1080; &#1085;&#1072;&#1078;&#1072;&#1074; &#1085;&#1072; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1077; <i>&#1055;&#1088;&#1086;&#1073;&#1077;&#1083;</i> &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1082;&#1088;&#1099;&#1090;&#1100; &#1077;&#1075;&#1086; (&#1089;&#1082;&#1088;&#1099;&#1090;&#1099;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1103;&#1090;&#1089;&#1103; &#1074; &#1076;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1089;&#1077;&#1088;&#1099;&#1084;&#1080;). &#1057;&#1082;&#1088;&#1086;&#1081;&#1090;&#1077; &#1074;&#1089;&#1077; &#1090;&#1088;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1086;&#1076;&#1080;&#1085; &#1079;&#1072; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084; &#1080; &#1079;&#1072;&#1090;&#1077;&#1084; &#1089;&#1076;&#1077;&#1083;&#1072;&#1081;&#1090;&#1077; &#1080;&#1093; &#1074;&#1080;&#1076;&#1080;&#1084;&#1099;&#1084;&#1080; &#1074;&#1085;&#1086;&#1074;&#1100;.
</p>
</div>
<p><span id="Boring_out_the_Cylinders"></span>
</p>
<h3><span id=".D0.92.D1.8B.D1.81.D0.B2.D0.B5.D1.80.D0.BB.D0.B8.D0.B2.D0.B0.D0.BD.D0.B8.D0.B5_.D1.86.D0.B8.D0.BB.D0.B8.D0.BD.D0.B4.D1.80.D0.BE.D0.B2"></span><span class="mw-headline" id="&#1042;&#1099;&#1089;&#1074;&#1077;&#1088;&#1083;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077;_&#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1086;&#1074;">&#1042;&#1099;&#1089;&#1074;&#1077;&#1088;&#1083;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1086;&#1074;</span></h3>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../File/Engine_Block_Tutorial_-_Bored_Block.png" class="mw-file-description"><img src="../File/Engine_Block_Tutorial_-_Bored_Block.png" decoding="async" width="300" height="181"></a><figcaption></figcaption></figure>
<div class="mw-translate-fuzzy">
<p>&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1086;&#1073;&#1072; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1072; &#1090;&#1072;&#1084;, &#1075;&#1076;&#1077; &#1086;&#1085;&#1080; &#1085;&#1091;&#1078;&#1085;&#1099; &#1076;&#1083;&#1103; &#1074;&#1099;&#1089;&#1074;&#1077;&#1088;&#1083;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080;&#1084;&#1080; &#1073;&#1083;&#1086;&#1082;&#1072; &#1085;&#1072; &#1085;&#1091;&#1078;&#1085;&#1099;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1101;&#1090;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100;, &#1084;&#1099; &#1073;&#1091;&#1076;&#1077;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; <i>&#1076;&#1074;&#1086;&#1080;&#1095;&#1085;&#1099;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080;</i> &#1085;&#1072;&#1076; &#1085;&#1072;&#1096;&#1080;&#1084;&#1080; &#1090;&#1088;&#1077;&#1084;&#1103; &#1087;&#1088;&#1080;&#1084;&#1080;&#1090;&#1080;&#1074;&#1072;&#1084;&#1080;. &#1052;&#1099; &#1085;&#1072;&#1095;&#1085;&#1105;&#1084; &#1089; &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103; &#1076;&#1074;&#1091;&#1093; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1086;&#1074;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1084;&#1099; &#1084;&#1086;&#1075;&#1083;&#1080; &#1074;&#1099;&#1095;&#1077;&#1089;&#1090;&#1100; &#1080;&#1093; &#1080;&#1079; &#1073;&#1083;&#1086;&#1082;&#1072; &#1082;&#1072;&#1082; &#1075;&#1088;&#1091;&#1087;&#1087;&#1091;.  &#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; <i>&#1062;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088; 1</i> &#1074; &#1076;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;, &#1079;&#1072;&#1090;&#1077;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; <i>CTRL+LeftClick</i> &#1076;&#1083;&#1103; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; <i>&#1062;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1072; 2</i>. &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1054;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103; (<span typeof="mw:File"><a href="../File/Part_Fuse.png" class="mw-file-description"><img src="../File/Part_Fuse.png" decoding="async" width="16" height="16"></a></span>) &#1076;&#1083;&#1103; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;.  &#1042; &#1076;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1074; &#1087;&#1086;&#1103;&#1074;&#1080;&#1090;&#1089;&#1103; &#1085;&#1086;&#1074;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1087;&#1086;&#1076; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; <i>Fusion</i>. &#1045;&#1089;&#1083;&#1080; &#1042;&#1099; &#1088;&#1072;&#1089;&#1082;&#1088;&#1086;&#1077;&#1090;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077;&#1084; &#1089;&#1090;&#1088;&#1077;&#1083;&#1082;&#1080; &#1074;&#1085;&#1080;&#1079; &#1074;&#1086;&#1079;&#1083;&#1077; &#1085;&#1077;&#1075;&#1086;, &#1042;&#1099; &#1091;&#1074;&#1080;&#1076;&#1080;&#1090;&#1077; &#1076;&#1074;&#1072; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1072;, &#1085;&#1086; &#1086;&#1085;&#1080; &#1089;&#1090;&#1072;&#1083;&#1080; &#1089;&#1077;&#1088;&#1099;&#1084;&#1080;. &#1055;&#1077;&#1088;&#1077;&#1080;&#1084;&#1077;&#1085;&#1091;&#1077;&#1084; <i>Fusion</i> &#1074;  <i>&#1062;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1099;</i>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1093; &#1073;&#1099;&#1083;&#1086; &#1083;&#1077;&#1075;&#1095;&#1077; &#1085;&#1072;&#1081;&#1090;&#1080; &#1087;&#1086;&#1090;&#1086;&#1084;. &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1085;&#1072;&#1095;&#1085;&#1105;&#1084; &#1074;&#1099;&#1089;&#1074;&#1077;&#1088;&#1083;&#1080;&#1074;&#1072;&#1090;&#1100; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1099;. &#1042;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077; <i>&#1047;&#1072;&#1075;&#1086;&#1090;&#1086;&#1074;&#1082;&#1091;</i> &#1080; <i>&#1079;&#1072;&#1090;&#1077;&#1084;</i> &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077; <i>&#1062;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1099;</i>, &#1087;&#1086;&#1090;&#1086;&#1084; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1054;&#1073;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100; (<span typeof="mw:File"><a href="../File/Part_Cut.png" class="mw-file-description"><img src="../File/Part_Cut.png" decoding="async" width="16" height="16"></a></span>). &#1044;&#1074;&#1072; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1086;&#1087;&#1103;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1103;&#1090;&#1089;&#1103;, &#1082;&#1072;&#1082; &#1101;&#1090;&#1086; &#1073;&#1099;&#1083;&#1086; &#1089; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1077;&#1081; &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103; &#1080; &#1077;&#1076;&#1080;&#1085;&#1099;&#1081; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1080;&#1088;&#1091;&#1102;&#1097;&#1080;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1073;&#1091;&#1076;&#1077;&#1090; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085; <i>Cut</i> (&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1085;&#1072;&#1076;&#1086; &#1087;&#1077;&#1088;&#1077;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; <i>&#1042;&#1099;&#1089;&#1074;&#1077;&#1088;&#1083;&#1077;&#1085;&#1099;&#1081; &#1073;&#1083;&#1086;&#1082;</i>). &#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <i>2</i> &#1085;&#1072; &#1094;&#1080;&#1092;&#1088;&#1086;&#1074;&#1086;&#1081; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1077; &#1080; &#1042;&#1099; &#1089;&#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1087;&#1088;&#1103;&#1084;&#1086; &#1089;&#1082;&#1074;&#1086;&#1079;&#1100; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1099; &#1085;&#1072; &#1076;&#1088;&#1091;&#1075;&#1091;&#1102; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1091; &#1073;&#1083;&#1086;&#1082;&#1072; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1086;&#1074;, &#1079;&#1072;&#1090;&#1077;&#1084; &#1087;&#1086;&#1082;&#1088;&#1091;&#1090;&#1080;&#1090;&#1077; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <i>MiddleClick+LeftClick+Drag</i> &#1076;&#1083;&#1103; &#1086;&#1073;&#1079;&#1086;&#1088;&#1072; &#1073;&#1083;&#1086;&#1082;&#1072; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1086;&#1074;. &#1057;&#1087;&#1088;&#1072;&#1074;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1080;&#1076;&#1085;&#1086; &#1082;&#1072;&#1082; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1080;&#1090; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1099;&#1081; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;, &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077; &#1095;&#1090;&#1086; &#1103; &#1088;&#1072;&#1089;&#1082;&#1088;&#1099;&#1083; &#1074;&#1080;&#1076; &#1076;&#1088;&#1077;&#1074;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1089;&#1083;&#1077;&#1074;&#1072;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1087;&#1088;&#1080;&#1084;&#1080;&#1090;&#1080;&#1074;&#1099; &#1080; &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1083; <i>&#1062;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088; 2</i> &#1076;&#1083;&#1103; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1080; <i>&#1044;&#1072;&#1085;&#1085;&#1099;&#1077;</i> &#1086;&#1082;&#1085;&#1072; <i>&#1055;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;</i>.
</p>
</div>
<h3><span id=".D0.9A.D0.BB.D1.8E.D1.87.D0.B5.D0.B2.D1.8B.D0.B5_.D0.BF.D1.80.D0.B5.D0.B8.D0.BC.D1.83.D1.89.D0.B5.D1.81.D1.82.D0.B2.D0.B0_.D0.BF.D0.B0.D1.80.D0.B0.D0.BC.D0.B5.D1.82.D1.80.D0.B8.D1.87.D0.B5.D1.81.D0.BA.D0.BE.D0.B3.D0.BE_.D0.BC.D0.BE.D0.B4.D0.B5.D0.BB.D0.B8.D1.80.D0.BE.D0.B2.D0.B0.D0.BD.D0.B8.D1.8F"></span><span class="mw-headline" id="&#1050;&#1083;&#1102;&#1095;&#1077;&#1074;&#1099;&#1077;_&#1087;&#1088;&#1077;&#1080;&#1084;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1072;_&#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086;_&#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;">&#1050;&#1083;&#1102;&#1095;&#1077;&#1074;&#1099;&#1077; &#1087;&#1088;&#1077;&#1080;&#1084;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1072; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</span></h3>
<p>&#1058;&#1077;&#1087;&#1077;&#1088;&#1100;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1086;&#1073;&#1072; &#1085;&#1072;&#1096;&#1080;&#1093; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1072; &#1074;&#1099;&#1089;&#1074;&#1077;&#1088;&#1083;&#1077;&#1085;&#1099;, &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1091;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1084;&#1080;&#1085;&#1091;&#1090;&#1082;&#1091;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1075;&#1083;&#1103;&#1076;&#1077;&#1090;&#1100; &#1087;&#1088;&#1077;&#1080;&#1084;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1072; &#1101;&#1090;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;. &#1044;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;, &#1085;&#1072; &#1082;&#1072;&#1082;&#1086;&#1084;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100; &#1101;&#1090;&#1072;&#1087;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1086;&#1082;&#1072;&#1078;&#1077;&#1090;&#1089;&#1103;, &#1095;&#1090;&#1086; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1099; &#1085;&#1072;&#1076;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1095;&#1091;&#1090;&#1100; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;. &#1055;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1085;&#1099;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103; &#1080; &#1086;&#1073;&#1088;&#1077;&#1079;&#1072;&#1085;&#1080;&#1103; &#1073;&#1099;&#1083;&#1080; &#1079;&#1072;&#1092;&#1080;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1099; &#1074; &#1076;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;, &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1086;&#1074; &#1080; FreeCAD &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1087;&#1077;&#1088;&#1077;&#1076;&#1077;&#1083;&#1072;&#1077;&#1090; &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; &#1080; &#1086;&#1073;&#1088;&#1077;&#1079;&#1072;&#1085;&#1080;&#1077; &#1080; &#1087;&#1088;&#1080;&#1076;&#1105;&#1090; &#1082; &#1085;&#1086;&#1074;&#1086;&#1084;&#1091; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1091; &#1076;&#1074;&#1080;&#1075;&#1072;&#1090;&#1077;&#1083;&#1103;. &#1055;&#1086;&#1080;&#1075;&#1088;&#1072;&#1081;&#1090;&#1077; &#1089; &#1088;&#1072;&#1076;&#1080;&#1091;&#1089;&#1086;&#1084; &#1080; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1077;&#1081; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1072; &#1080; &#1074;&#1077;&#1088;&#1085;&#1080;&#1090;&#1077;&#1089;&#1100; &#1082; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;&#1084; &#1087;&#1077;&#1088;&#1077;&#1076; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103; &#1082; &#1091;&#1088;&#1086;&#1082;&#1091;.
</p><p><span id="The_Crankcase"></span>
</p>
<h2><span id=".D0.9A.D0.B0.D1.80.D1.82.D0.B5.D1.80"></span><span class="mw-headline" id="&#1050;&#1072;&#1088;&#1090;&#1077;&#1088;">&#1050;&#1072;&#1088;&#1090;&#1077;&#1088;</span></h2>
<p><span id="Billet_and_Bearing_Caps"></span>
</p>
<h3><span id=".D0.97.D0.B0.D0.B3.D0.BE.D1.82.D0.BE.D0.B2.D0.BA.D0.B0_.D0.B8_.D0.BA.D1.80.D1.8B.D1.88.D0.BA.D0.B8_.D0.BF.D0.BE.D0.B4.D1.88.D0.B8.D0.BF.D0.BD.D0.B8.D0.BA.D0.BE.D0.B2"></span><span class="mw-headline" id="&#1047;&#1072;&#1075;&#1086;&#1090;&#1086;&#1074;&#1082;&#1072;_&#1080;_&#1082;&#1088;&#1099;&#1096;&#1082;&#1080;_&#1087;&#1086;&#1076;&#1096;&#1080;&#1087;&#1085;&#1080;&#1082;&#1086;&#1074;">&#1047;&#1072;&#1075;&#1086;&#1090;&#1086;&#1074;&#1082;&#1072; &#1080; &#1082;&#1088;&#1099;&#1096;&#1082;&#1080; &#1087;&#1086;&#1076;&#1096;&#1080;&#1087;&#1085;&#1080;&#1082;&#1086;&#1074;</span></h3>
<p>&#1044;&#1072;&#1083;&#1077;&#1077; &#1084;&#1099; &#1073;&#1091;&#1076;&#1077;&#1084; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1085;&#1072;&#1076; &#1082;&#1072;&#1088;&#1090;&#1077;&#1088;&#1086;&#1084; &#1087;&#1086;&#1076; &#1073;&#1083;&#1086;&#1082;&#1086;&#1084; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1086;&#1074;. &#1044;&#1086;&#1073;&#1072;&#1074;&#1100;&#1090;&#1077; &#1085;&#1086;&#1074;&#1099;&#1081; &#1082;&#1091;&#1073; (&#1087;&#1072;&#1088;&#1072;&#1083;&#1083;&#1077;&#1083;&#1077;&#1087;&#1080;&#1087;&#1077;&#1076;), &#1085;&#1072;&#1079;&#1074;&#1072;&#1074; &#1077;&#1075;&#1086; <b>&#1047;&#1072;&#1075;&#1086;&#1090;&#1086;&#1074;&#1082;&#1072; &#1050;&#1072;&#1088;&#1090;&#1077;&#1088;&#1072;</b>, &#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1088;&#1086;&#1087;&#1086;&#1088;&#1094;&#1080;&#1080;:
</p>
<dl><dd><table class="wikitable" border="1">

<tbody><tr>
<td>X:  0.0 mm</td>
<td>Length: 140.0 mm
</td></tr>
<tr>
<td>Y:  -50.0 mm</td>
<td>Width: 100.0 mm
</td></tr>
<tr>
<td>Z:  -85.0 mm</td>
<td>Height: 85.0 mm
</td></tr>
</tbody></table></dd></dl>
<div class="mw-translate-fuzzy">
<p>&#1063;&#1090;&#1086;&#1073;&#1099; &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1082;&#1072;&#1088;&#1090;&#1077;&#1088; &#1086;&#1090; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1076;&#1077;&#1090;&#1072;&#1083;&#1077;&#1081;, &#1087;&#1088;&#1080;&#1076;&#1072;&#1076;&#1080;&#1084; &#1077;&#1084;&#1091; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1094;&#1074;&#1077;&#1090;. &#1062;&#1074;&#1077;&#1090; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1087;&#1088;&#1072;&#1074;&#1099;&#1084; &#1082;&#1083;&#1080;&#1082;&#1086;&#1084; &#1074; &#1076;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1100; &#1094;&#1074;&#1077;&#1090; &#1089;&#1072;&#1084;&#1080; &#1080;&#1083;&#1080; &#1076;&#1072;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1091; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081;&#1085;&#1099;&#1081; &#1094;&#1074;&#1077;&#1090; (&#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081;&#1085;&#1099;&#1081; &#1094;&#1074;&#1077;&#1090; &#1074;&#1085;&#1086;&#1074;&#1100;, &#1077;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086;&#1090; &#1094;&#1074;&#1077;&#1090; &#1085;&#1077; &#1087;&#1086;&#1085;&#1088;&#1072;&#1074;&#1080;&#1083;&#1089;&#1103;). &#1044;&#1086;&#1073;&#1072;&#1074;&#1100;&#1090;&#1077; &#1077;&#1097;&#1105; &#1086;&#1076;&#1080;&#1085; &#1082;&#1091;&#1073; &#1087;&#1086;&#1076; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; <i>&#1042;&#1099;&#1077;&#1084;&#1082;&#1072; &#1087;&#1086;&#1076;&#1096;&#1080;&#1087;&#1085;&#1080;&#1082;&#1086;&#1074;</i>, &#1087;&#1088;&#1080;&#1076;&#1072;&#1081;&#1090;&#1077; &#1080;&#1084; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1080; &#1074;&#1099;&#1088;&#1077;&#1078;&#1100;&#1090;&#1077; <i>&#1042;&#1099;&#1077;&#1084;&#1082;&#1072; &#1087;&#1086;&#1076;&#1096;&#1080;&#1087;&#1085;&#1080;&#1082;&#1086;&#1074;</i> &#1080;&#1079; <i>&#1047;&#1072;&#1075;&#1086;&#1090;&#1086;&#1074;&#1082;&#1091; &#1050;&#1072;&#1088;&#1090;&#1077;&#1088;&#1072;</i> (&#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1074; &#1079;&#1072;&#1075;&#1086;&#1090;&#1086;&#1074;&#1082;&#1091; &#1087;&#1077;&#1088;&#1074;&#1086;&#1081;):
</p>
</div>
<p>Add another box called <b>Bearing carve</b>, give it the following properties, and then cut the <b>Bearing carve</b> away from the <b>Crankcase Billet</b> (i.e. select the billet first):
</p>
<dl><dd><table class="wikitable" border="1">

<tbody><tr>
<td>X:  0.0 mm</td>
<td>Length: 140.0 mm
</td></tr>
<tr>
<td>Y:  -40.0 mm</td>
<td>Width: 80.0 mm
</td></tr>
<tr>
<td>Z:  -85.0 mm</td>
<td>Height: 30.0 mm
</td></tr>
</tbody></table></dd></dl>
<div class="mw-translate-fuzzy">
<p>&#1055;&#1077;&#1088;&#1077;&#1080;&#1084;&#1077;&#1085;&#1091;&#1077;&#1084; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1074;&#1096;&#1080;&#1081;&#1089;&#1103; <i>Cut</i> &#1074; <i>&#1042;&#1099;&#1088;&#1077;&#1079;&#1072;&#1085;&#1085;&#1099;&#1081; &#1082;&#1072;&#1088;&#1090;&#1077;&#1088;</i>.
</p>
</div>
<div class="mw-translate-fuzzy">
<h3><span id=".D0.92.D1.8B.D1.80.D0.B5.D0.B7.D0.B0.D0.BD.D0.B8.D0.B5_.D1.88.D0.B5.D0.B9.D0.BA.D0.B8_.D0.B2.D0.B0.D0.BB.D0.B0"></span><span class="mw-headline" id="&#1042;&#1099;&#1088;&#1077;&#1079;&#1072;&#1085;&#1080;&#1077;_&#1096;&#1077;&#1081;&#1082;&#1080;_&#1074;&#1072;&#1083;&#1072;">&#1042;&#1099;&#1088;&#1077;&#1079;&#1072;&#1085;&#1080;&#1077; &#1096;&#1077;&#1081;&#1082;&#1080; &#1074;&#1072;&#1083;&#1072;</span></h3>
<p>&#1044;&#1072;&#1083;&#1077;&#1077; &#1084;&#1099; &#1074;&#1099;&#1088;&#1077;&#1078;&#1077;&#1084; &#1087;&#1086;&#1083;&#1091;&#1082;&#1088;&#1091;&#1075;&#1083;&#1086;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086; &#1076;&#1083;&#1103; &#1082;&#1086;&#1083;&#1077;&#1085;&#1095;&#1072;&#1090;&#1086;&#1075;&#1086; &#1074;&#1072;&#1083;&#1072; &#1076;&#1083;&#1103; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1074; &#1082;&#1072;&#1088;&#1090;&#1077;&#1088; &#1080; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086; &#1076;&#1083;&#1103; &#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103; &#1074;&#1072;&#1083;&#1072; &#1074; &#1082;&#1072;&#1088;&#1090;&#1077;&#1088;&#1077;.
&#1052;&#1099; &#1085;&#1072;&#1095;&#1085;&#1105;&#1084; &#1089; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1072;, &#1085;&#1086; &#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1072; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1074;&#1077;&#1088;&#1090;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103;, &#1085;&#1072;&#1084; &#1078;&#1077; &#1085;&#1091;&#1078;&#1085;&#1072; &#1075;&#1086;&#1088;&#1080;&#1079;&#1086;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103;.  &#1069;&#1090;&#1086; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;, &#1095;&#1090;&#1086; &#1085;&#1072;&#1084; &#1085;&#1072;&#1076;&#1086; &#1087;&#1086;&#1085;&#1103;&#1090;&#1100; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1072; &#1076;&#1083;&#1103; &#1077;&#1075;&#1086; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;&#1081; &#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080; &#1074; &#1076;&#1074;&#1080;&#1075;&#1072;&#1090;&#1077;&#1083;&#1077;. &#1043;&#1083;&#1103;&#1076;&#1103; &#1085;&#1072; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1084; &#1086;&#1089;&#1103;&#1084; &#1074; &#1087;&#1088;&#1072;&#1074;&#1086;&#1084; &#1085;&#1080;&#1078;&#1085;&#1077;&#1084; &#1091;&#1075;&#1083;&#1091; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1086;&#1082;&#1085;&#1072;, &#1084;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072;&#1084;&#1077;&#1090;&#1080;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1082;&#1086;&#1083;&#1077;&#1085;&#1095;&#1072;&#1090;&#1099;&#1081; &#1074;&#1072;&#1083; &#1083;&#1077;&#1078;&#1080;&#1090; &#1074;&#1076;&#1086;&#1083;&#1100; &#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1086;&#1089;&#1080; X. &#1069;&#1090;&#1086; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;, &#1095;&#1090;&#1086; &#1077;&#1075;&#1086; &#1085;&#1072;&#1076;&#1086; &#1087;&#1086;&#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100; &#1089; &#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1080; &#1085;&#1072; 90 &#1075;&#1088;&#1072;&#1076;&#1091;&#1089;&#1086;&#1074; &#1074;&#1086;&#1082;&#1088;&#1091;&#1075; &#1086;&#1089;&#1080;, &#1087;&#1072;&#1088;&#1072;&#1083;&#1083;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1082; &#1086;&#1089;&#1080; Y. &#1069;&#1090;&#1086; &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1085;&#1072;&#1084;, &#1082;&#1072;&#1082;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1085;&#1072;&#1076;&#1086; &#1074;&#1074;&#1077;&#1089;&#1090;&#1080; &#1076;&#1083;&#1103; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1072;. &#1089;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088; &#1087;&#1086;&#1076; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; <i>&#1042;&#1099;&#1077;&#1084;&#1082;&#1072; &#1082;&#1086;&#1083;&#1077;&#1085;&#1074;&#1072;&#1083;&#1072;</i> &#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1076;&#1083;&#1103; &#1085;&#1077;&#1075;&#1086; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; (&#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1085;&#1072;&#1084; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1085;&#1072;&#1076;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1082;&#1088;&#1086;&#1084;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1099; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1083;&#1080; &#1076;&#1083;&#1103; &#1089;&#1074;&#1077;&#1088;&#1083;&#1077;&#1085;&#1080;&#1103; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1086;&#1074;):
</p>
</div>
<dl><dd><table class="wikitable" border="1">

<tbody><tr>
<td>Axis X:  0.0 mm</td>
<td>Angle: 90.0 degrees
</td></tr>
<tr>
<td>Axis Y:  1.0 mm</td>
<td>
</td></tr>
<tr>
<td>Axis Z:  0.0 mm</td>
<td>
</td></tr>
<tr>
<td>Position X:  0.0 mm</td>
<td>Height: 140.0 mm
</td></tr>
<tr>
<td>Position Y:  0.0 mm</td>
<td>Radius: 20.0 mm
</td></tr>
<tr>
<td>Position Z:  -55.0 mm</td>
<td>
</td></tr>
</tbody></table></dd></dl>
<div class="mw-translate-fuzzy">
<p>&#1042;&#1099;&#1088;&#1077;&#1078;&#1100;&#1090;&#1077; &#1074;&#1099;&#1077;&#1084;&#1082;&#1091; &#1082;&#1086;&#1083;&#1077;&#1085;&#1095;&#1072;&#1090;&#1086;&#1075;&#1086; &#1074;&#1072;&#1083;&#1072; &#1080;&#1079; <i>&#1042;&#1099;&#1088;&#1077;&#1079;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1082;&#1072;&#1088;&#1090;&#1077;&#1088;&#1072;</i> &#1080; &#1087;&#1077;&#1088;&#1077;&#1080;&#1084;&#1077;&#1085;&#1091;&#1081;&#1090;&#1077; &#1080;&#1090;&#1086;&#1075;&#1086;&#1074;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1074; <i>&#1050;&#1072;&#1088;&#1090;&#1077;&#1088; &#1089; &#1096;&#1077;&#1081;&#1082;&#1086;&#1081; &#1074;&#1072;&#1083;&#1072;</i>.
</p>
</div>
<p><span id="Finishing_out_the_Crankcase"></span>
</p>
<h3><span id=".D0.97.D0.B0.D0.B2.D0.B5.D1.80.D1.88.D0.B5.D0.BD.D0.B8.D0.B5_.D0.BA.D0.B0.D1.80.D1.82.D0.B5.D1.80.D0.B0"></span><span class="mw-headline" id="&#1047;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1077;_&#1082;&#1072;&#1088;&#1090;&#1077;&#1088;&#1072;">&#1047;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1077; &#1082;&#1072;&#1088;&#1090;&#1077;&#1088;&#1072;</span></h3>
<div class="mw-translate-fuzzy">
<p>&#1055;&#1086;&#1076; &#1082;&#1086;&#1085;&#1077;&#1094; &#1084;&#1099; &#1074;&#1099;&#1088;&#1077;&#1078;&#1077;&#1084; 2 &#1092;&#1080;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1082;&#1086;&#1088;&#1086;&#1073;&#1082;&#1080;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1096;&#1072;&#1090;&#1091;&#1085;&#1099; &#1087;&#1086;&#1088;&#1096;&#1085;&#1077;&#1081; &#1084;&#1086;&#1075;&#1083;&#1080; &#1087;&#1088;&#1086;&#1093;&#1086;&#1076;&#1080;&#1090;&#1100; &#1086;&#1090; &#1082;&#1072;&#1088;&#1090;&#1077;&#1088;&#1072; &#1074; &#1073;&#1083;&#1086;&#1082; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1086;&#1074; &#1076;&#1074;&#1080;&#1075;&#1072;&#1090;&#1077;&#1083;&#1103;. &#1057;&#1076;&#1077;&#1083;&#1072;&#1081;&#1090;&#1077; &#1076;&#1074;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1087;&#1086;&#1076; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; <i>&#1050;&#1091;&#1073;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1074;&#1099;&#1088;&#1077;&#1079; 1</i> &#1080; <i>&#1050;&#1091;&#1073;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1074;&#1099;&#1088;&#1077;&#1079; 2</i> &#1089; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1084;&#1099;&#1084;&#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072;&#1084;&#1080;, &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; &#1080;&#1093; &#1074; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1087;&#1086;&#1076; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; <i>&#1050;&#1091;&#1073;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077;  &#1074;&#1099;&#1088;&#1077;&#1079;&#1099;</i>, &#1074;&#1099;&#1088;&#1091;&#1073;&#1080;&#1090;&#1100; &#1101;&#1090;&#1086;&#1090; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1080;&#1079; <i>&#1050;&#1072;&#1088;&#1090;&#1077;&#1088;&#1072; &#1089; &#1096;&#1077;&#1081;&#1082;&#1086;&#1081; &#1074;&#1072;&#1083;&#1072; </i>, &#1085;&#1072;&#1079;&#1074;&#1072;&#1074; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; <i>&#1050;&#1072;&#1088;&#1090;&#1077;&#1088;</i>. &#1053;&#1077; &#1079;&#1072;&#1073;&#1091;&#1076;&#1100;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1089;&#1082;&#1088;&#1099;&#1090;&#1100; <i>&#1042;&#1099;&#1089;&#1074;&#1077;&#1088;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1073;&#1083;&#1086;&#1082;</i>, &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1074; &#1077;&#1075;&#1086; &#1080; &#1085;&#1072;&#1078;&#1072;&#1074; &#1087;&#1088;&#1086;&#1073;&#1077;&#1083;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1080;&#1076;&#1077;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1076;&#1077;&#1083;&#1072;&#1077;&#1090;&#1077;; &#1090;&#1072;&#1082; &#1078;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1088;&#1086;&#1076;&#1091;&#1073;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; <i>&#1050;&#1091;&#1073;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1074;&#1099;&#1088;&#1077;&#1079; 1</i> &#1080; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1099; &#1061;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; &#1074;&#1099;&#1088;&#1077;&#1079;.
</p>
</div>
<dl><dd><table class="wikitable" border="1">

<tbody><tr>
<td>X:  15.0 mm</td>
<td>Length: 50.0 mm
</td></tr>
<tr>
<td>Y:  -25.0 mm</td>
<td>Width: 50.0 mm
</td></tr>
<tr>
<td>Z:  -55.0 mm</td>
<td>Height: 55.0 mm
</td></tr>
</tbody></table></dd></dl>
<dl><dd><table class="wikitable" border="1">

<tbody><tr>
<td>X:  75.0 mm</td>
<td>Length: 50.0 mm
</td></tr>
<tr>
<td>Y:  -25.0 mm</td>
<td>Width: 50.0 mm
</td></tr>
<tr>
<td>Z:  -55.0 mm</td>
<td>Height: 55.0 mm
</td></tr>
</tbody></table></dd></dl>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../File/Engine_Block_Tutorial_-_Crankcase.png" class="mw-file-description"><img src="../File/Engine_Block_Tutorial_-_Crankcase.png" decoding="async" width="300" height="181"></a><figcaption></figcaption></figure>
<p>&#1057;&#1087;&#1088;&#1072;&#1074;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1080;&#1076;&#1077;&#1090;&#1100;, &#1085;&#1072; &#1095;&#1090;&#1086; &#1087;&#1086;&#1093;&#1086;&#1078; &#1080;&#1090;&#1086;&#1075;. &#1044;&#1088;&#1077;&#1074;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1088;&#1072;&#1089;&#1082;&#1088;&#1099;&#1090;&#1086;, &#1090;&#1072;&#1082; &#1095;&#1090;&#1086; &#1074;&#1080;&#1076;&#1085;&#1072; &#1074;&#1089;&#1103; &#1080;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1103; &#1076;&#1074;&#1086;&#1080;&#1095;&#1085;&#1099;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;. &#1055;&#1086;&#1084;&#1085;&#1080;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1088;&#1086;&#1081;&#1090;&#1080; &#1089;&#1082;&#1074;&#1086;&#1079;&#1100; &#1101;&#1090;&#1086; &#1076;&#1088;&#1077;&#1074;&#1086; &#1080; &#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1076;&#1080;&#1072;&#1084;&#1077;&#1090;&#1088; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1086;&#1074;, &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1080;&#1083;&#1080; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1102; &#1082;&#1072;&#1088;&#1090;&#1077;&#1088;&#1072; &#1080; &#1090;&#1072;&#1082; &#1076;&#1072;&#1083;&#1077;&#1077; &#1073;&#1077;&#1079; &#1087;&#1077;&#1088;&#1077;&#1076;&#1077;&#1083;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074;&#1089;&#1077;&#1081; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; &#1089; &#1085;&#1091;&#1083;&#1103;. &#1052;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1080;&#1090;&#1100; &#1074;&#1099;&#1088;&#1077;&#1079;&#1072;&#1085;&#1080;&#1077; &#1082;&#1072;&#1088;&#1090;&#1077;&#1088;&#1072;, &#1085;&#1086; &#1087;&#1086;&#1082;&#1072; &#1101;&#1090;&#1086;&#1075;&#1086; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086;. &#1044;&#1072;&#1083;&#1077;&#1077; &#1084;&#1099; &#1087;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1076;&#1074;&#1091;&#1084;&#1077;&#1088;&#1085;&#1086;&#1075;&#1086; &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1073;&#1086;&#1083;&#1090;&#1086;&#1074; &#1080; &#1086;&#1073;&#1083;&#1077;&#1075;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074;&#1077;&#1089;&#1072; &#1087;&#1086;&#1088;&#1096;&#1085;&#1077;&#1074;&#1086;&#1075;&#1086; &#1073;&#1083;&#1086;&#1082;&#1072; &#1087;&#1091;&#1090;&#1105;&#1084; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1103; &#1083;&#1080;&#1096;&#1085;&#1077;&#1075;&#1086; &#1084;&#1077;&#1090;&#1072;&#1083;&#1083;&#1072; &#1080;&#1079; &#1079;&#1072;&#1075;&#1086;&#1090;&#1086;&#1074;&#1082;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1086;&#1089;&#1090;&#1072;&#1083;&#1089;&#1103; &#1074;&#1086;&#1082;&#1088;&#1091;&#1075; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1086;&#1074;.
</p>
<h2><span id=".D0.94.D0.B2.D1.83.D0.BC.D0.B5.D1.80.D0.BD.D0.BE.D0.B5_.D1.87.D0.B5.D1.80.D1.87.D0.B5.D0.BD.D0.B8.D0.B5_.D0.BA.D0.BE.D0.BD.D1.81.D1.82.D1.80.D1.83.D0.BA.D1.86.D0.B8.D0.B8_.D0.BF.D1.80.D0.BE.D0.BA.D0.BB.D0.B0.D0.B4.D0.BA.D0.B8_.D0.B3.D0.BE.D0.BB.D0.BE.D0.B2.D0.BA.D0.B8_.D1.86.D0.B8.D0.BB.D0.B8.D0.BD.D0.B4.D1.80.D0.BE.D0.B2"></span><span class="mw-headline" id="&#1044;&#1074;&#1091;&#1084;&#1077;&#1088;&#1085;&#1086;&#1077;_&#1095;&#1077;&#1088;&#1095;&#1077;&#1085;&#1080;&#1077;_&#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080;_&#1087;&#1088;&#1086;&#1082;&#1083;&#1072;&#1076;&#1082;&#1080;_&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1080;_&#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1086;&#1074;">&#1044;&#1074;&#1091;&#1084;&#1077;&#1088;&#1085;&#1086;&#1077; &#1095;&#1077;&#1088;&#1095;&#1077;&#1085;&#1080;&#1077; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080; &#1087;&#1088;&#1086;&#1082;&#1083;&#1072;&#1076;&#1082;&#1080; &#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1080; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1086;&#1074;</span></h2>
<p>For the head bolts and the shape of the engine block we will be using more boolean operations to "carve" away the parts of the block we don't want.  However, if we stop to think about it, every head bolt is going to look the same, it will cut all the way down into the crankcase, the only thing different will be where on the top of the head it is located.  This means we can simply "draw" the shape of the head gasket on the top of the engine, and then use that like a pattern to do the carving we want done.
</p>
<div class="mw-translate-fuzzy">
<h3><span id=".D0.9F.D0.B5.D1.80.D0.B5.D1.85.D0.BE.D0.B4_.D0.B2_.D1.80.D0.B5.D0.B6.D0.B8.D0.BC_.D0.B4.D0.B2.D1.83.D0.BC.D0.B5.D1.80.D0.BD.D0.BE.D0.B3.D0.BE_.D1.87.D0.B5.D1.80.D1.87.D0.B5.D0.BD.D0.B8.D1.8F"></span><span class="mw-headline" id="&#1055;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;_&#1074;_&#1088;&#1077;&#1078;&#1080;&#1084;_&#1076;&#1074;&#1091;&#1084;&#1077;&#1088;&#1085;&#1086;&#1075;&#1086;_&#1095;&#1077;&#1088;&#1095;&#1077;&#1085;&#1080;&#1103;">&#1055;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084; &#1076;&#1074;&#1091;&#1084;&#1077;&#1088;&#1085;&#1086;&#1075;&#1086; &#1095;&#1077;&#1088;&#1095;&#1077;&#1085;&#1080;&#1103;</span></h3>
<p>&#1044;&#1083;&#1103; &#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1085;&#1072;&#1084; &#1085;&#1072;&#1076;&#1086; &#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; &#1076;&#1074;&#1091;&#1084;&#1077;&#1088;&#1085;&#1086;&#1075;&#1086; &#1095;&#1077;&#1088;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086; &#1080;&#1079; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080;, &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; <i>2D Drafting</i> &#1080;&#1079; &#1085;&#1080;&#1089;&#1087;&#1072;&#1076;&#1072;&#1102;&#1097;&#1077;&#1075;&#1086; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1074;&#1074;&#1077;&#1088;&#1093;&#1091;, &#1075;&#1076;&#1077; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1086; <i>Part</i>. &#1045;&#1089;&#1083;&#1080; &#1085;&#1077; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1077;&#1075;&#1086; &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1080;&#1090;&#1100; (&#1085;&#1077; &#1074;&#1086; &#1074;&#1089;&#1077;&#1093; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072;&#1093; &#1086;&#1085; &#1077;&#1089;&#1090;&#1100;), &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; &#1080;&#1079; &#1084;&#1077;&#1085;&#1102; <i>&#1042;&#1080;&#1076;-&gt;&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;</i>. &#1061;&#1086;&#1090;&#1103; &#1091; &#1085;&#1072;&#1089; &#1076;&#1074;&#1091;&#1084;&#1077;&#1088;&#1085;&#1086;&#1077; &#1095;&#1077;&#1088;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1084;&#1099; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084; &#1077;&#1075;&#1086; &#1074; &#1090;&#1088;&#1105;&#1093;&#1084;&#1077;&#1088;&#1085;&#1086;&#1084; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1077;, &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1103; FreeCAD, &#1085;&#1072; &#1082;&#1072;&#1082;&#1086;&#1081; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1087;&#1088;&#1086;&#1077;&#1094;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1088;&#1080;&#1089;&#1091;&#1085;&#1086;&#1082;. &#1055;&#1086;&#1089;&#1083;&#1077; &#1074;&#1099;&#1073;&#1086;&#1088;&#1072; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; &#1076;&#1074;&#1091;&#1084;&#1077;&#1088;&#1085;&#1086;&#1075;&#1086; &#1095;&#1077;&#1088;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1103;&#1084;&#1086; &#1085;&#1072;&#1076; &#1074;&#1077;&#1088;&#1093;&#1085;&#1080;&#1084; &#1087;&#1088;&#1072;&#1074;&#1099;&#1084; &#1091;&#1075;&#1083;&#1086;&#1084; &#1090;&#1088;&#1105;&#1093;&#1084;&#1077;&#1088;&#1085;&#1086;&#1075;&#1086; &#1074;&#1080;&#1076;&#1072; After you have selected the 2D Drafting workbench just above the top-right corner of the 3D view and click on the leftmost button which will say one of the following {none, top, front, size, or d(..., ..., ...)}. &#1050;&#1086;&#1075;&#1076;&#1072; &#1042;&#1099; &#1077;&#1075;&#1086; &#1082;&#1083;&#1080;&#1082;&#1085;&#1080;&#1090;&#1077;, &#1085;&#1072; &#1083;&#1077;&#1074;&#1086;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1077; &#1101;&#1082;&#1088;&#1072;&#1085;&#1072; &#1087;&#1086;&#1103;&#1074;&#1080;&#1090;&#1089;&#1103; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1077; &#1087;&#1086;&#1083;&#1077; &#1076;&#1083;&#1103; &#1074;&#1074;&#1086;&#1076;&#1072; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080; &#1080; 5 &#1082;&#1085;&#1086;&#1087;&#1086;&#1082;: XY, XZ, YZ, &#1042;&#1080;&#1076; &#1080; None. &#1055;&#1077;&#1088;&#1074;&#1099;&#1077; &#1090;&#1088;&#1080; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1102;&#1090; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1077; &#1074;&#1077;&#1088;&#1093;&#1085;&#1080;&#1081;, &#1092;&#1088;&#1086;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1080; &#1073;&#1086;&#1082;&#1086;&#1074;&#1086;&#1081; &#1074;&#1080;&#1076;, &#1087;&#1088;&#1080; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1080; &#1085;&#1072; <i>&#1042;&#1080;&#1076;</i> &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1072; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1100;, &#1087;&#1077;&#1088;&#1087;&#1077;&#1085;&#1076;&#1080;&#1082;&#1091;&#1083;&#1103;&#1088;&#1085;&#1072;&#1103; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1102; &#1074;&#1079;&#1075;&#1083;&#1103;&#1076;&#1072; &#1082;&#1072;&#1084;&#1077;&#1088;&#1099; (&#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1100; &#1086;&#1073;&#1079;&#1086;&#1088;&#1072; &#1082;&#1072;&#1084;&#1077;&#1088;&#1099;), &#1072; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1103;&#1103; &#1085;&#1077; &#1087;&#1088;&#1086;&#1077;&#1094;&#1080;&#1088;&#1091;&#1077;&#1090; &#1085;&#1072; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1100; &#1080; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1090;&#1100; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1099; XYZ &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1088;&#1080;&#1089;&#1091;&#1077;&#1084;&#1086;&#1081; &#1090;&#1086;&#1095;&#1082;&#1080;. &#1053;&#1072;&#1084; &#1085;&#1072;&#1076;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080; &#1085;&#1072; 110 (&#1074;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; &#1080; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; Enter), &#1079;&#1072;&#1090;&#1077;&#1084; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; XY &#1076;&#1083;&#1103; &#1074;&#1099;&#1073;&#1086;&#1088;&#1072; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080; XY, &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1081; &#1085;&#1072; 110 mm &#1074;&#1099;&#1096;&#1077; &#1085;&#1091;&#1083;&#1103; &#1087;&#1086; &#1086;&#1089;&#1080; Z, &#1095;&#1090;&#1086; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1074;&#1077;&#1088;&#1093;&#1091; &#1073;&#1083;&#1086;&#1082;&#1072; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1086;&#1074;. &#1050;&#1086;&#1075;&#1076;&#1072; &#1084;&#1099; &#1091;&#1082;&#1072;&#1079;&#1072;&#1083;&#1080; FreeCAD &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1100; &#1076;&#1083;&#1103; &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1084;&#1099; &#1075;&#1086;&#1090;&#1086;&#1074;&#1099; &#1085;&#1072;&#1095;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1082;&#1083;&#1072;&#1076;&#1082;&#1080; &#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1080; &#1073;&#1083;&#1086;&#1082;&#1072; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1086;&#1074;.
</p>
</div>
<p>The last thing to do is set up the 3D view.  Even though all the drawings we produce will be projected into our defined 2D plane, we can look at the plane we are drawing on from any angle (including the other side of the plane so we draw "backwards").  Since we have told it the plane is the one co-planar to the top of the engine block, we should probably have the 3D view looking at that, or at least roughly in that direction.  Press the 2 key on the number pad to look at the top view (notice that on the num pad, adjacent keys are opposite views so 1 and 4 are front-rear, 2 and 5 are top-bottom, and 3 and 6 are right-left).  Once you are looking at the engine from the top down, you can center it by dragging the middle mouse button to pan the view.  Finally, the 2D drafting mode will allow us to snap parts of the drawing to the corners of the engine block, the center of the cylinders, etc, in order to make this work best we should hide the crankcase so the drawings snap only to the part we are working on (press spacebar to show/hide the selected object).
</p>
<h3><span class="mw-headline" id="Laying_Out_the_Head_Bolts">Laying Out the Head Bolts</span></h3>
<p>Now that the proper plane projection and view is set up we add 2d drawing elements in the same way we added primitives.  Click the <i>Add Circle</i> button (<span typeof="mw:File"><a href="../File/Draft_Circle.svg" class="mw-file-description"><img src="../File/Draft_Circle.svg" decoding="async" width="16" height="16"></a></span>) and move your mouse around in the 3D view.  You then need to tell FreeCAD the XY location for the center of the circle, and the radius, for both of these measurements you can either enter them with the mouse (following the instructions in the bottom left status bar), or you can type in the values in the text entry boxes that appear above the tree view.  Go ahead and add a couple random circles on the top of the engine, as well as a few not on the engine, i.e. just out in the empty space surrounding your view of the engine.  After you have done this, rotate the camera around the top of the engine block and look at the circles you drew, notice how they are "flat" in the plane we projected them into and this plane lines up with the top of the engine block; this will be important when we extrude the drawing to shape the engine.  Now that you see how to add 2D elements you can delete the test circles you added and we will start entering the actual head layout.  Note that if your circle disappears inside the engine block, your drawing projection plane is not properly set to XY mode, offset 110 mm.
</p><p>Adding drafting elements with the mouse is fast and easy, but it is not very precise.  For the actual bolt pattern we use the fact that moving the mouse will update the numbers in the text boxes just above the 3D view so we can see roughly the coordinates of where we want to place things.  Once we have these rough coordinates we can type in the real values we want for precise positioning.  Reset to the top view of the engine, click the <i>Add circle</i> button, and move your mouse around the top left corner of the engine block taking not of a good location for the head bolt.  It looks like X=10, Y=30, would be a good place for the circle (note the Z coordinate should be grayed out, if it is not you need to set the plane properly like in the previous section, pressing escape will cancel drawing the circle).
</p><p>Now that you see how to easily determine the coordinates of drawing elements you can easily design a bolt pattern or other 2 dimensional layout for a part such as fluid channels, circuit-board traces, etc.  For our 3 head bolts let's on this side of the engine, let's use the following coordinates.  Note that when you are typing in values to the boxes you can press enter to move on to the next box, and it is also a good idea to move your mouse out of the 3D view before you start typing in the coordinates as too much mouse movement will overwrite the numbers you have already entered in the text entry fields.  Also, on my system I had trouble with the typed in circles having their Z coordinates set to 12.5 for some reason, if this is a problem for you, you can set the drawing projection plane to <i>None</i> and then manually enter the Z coordinates for the circles to be 110.  Finally, when creating the circles, make sure to check the box labeled <i>Filled</i> otherwise when we extrude them later they will just create tubes like a toilet paper tube instead of a solid cylinder.
</p>
<dl><dd><table class="wikitable" border="1">

<tbody><tr>
<td>X1:  10</td>
<td>Y1:  25</td>
<td>Radius: 2.5 mm
</td></tr>
<tr>
<td>X2:  70</td>
<td>Y2:  25</td>
<td>Radius: 2.5 mm
</td></tr>
<tr>
<td>X3:  130</td>
<td>Y3:  25</td>
<td>Radius: 2.5 mm
</td></tr></tbody></table></dd></dl>
<div class="mw-translate-fuzzy">
<p>&#1053;&#1072;&#1079;&#1086;&#1074;&#1105;&#1084; &#1101;&#1090;&#1080; &#1082;&#1088;&#1091;&#1075;&#1080; <i>&#1041;&#1086;&#1083;&#1090; 1</i> - <i>&#1041;&#1086;&#1083;&#1090; 3</i>.
</p>
</div>
<div class="mw-translate-fuzzy">
<h3><span id=".D0.94.D1.80.D1.83.D0.B3.D0.B0.D1.8F_.D1.81.D1.82.D0.BE.D1.80.D0.BE.D0.BD.D0.B0_.D0.B1.D0.BB.D0.BE.D0.BA.D0.B0"></span><span class="mw-headline" id="&#1044;&#1088;&#1091;&#1075;&#1072;&#1103;_&#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1072;_&#1073;&#1083;&#1086;&#1082;&#1072;">&#1044;&#1088;&#1091;&#1075;&#1072;&#1103; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1072; &#1073;&#1083;&#1086;&#1082;&#1072;</span></h3>
<p>&#1058;&#1077;&#1087;&#1077;&#1088;&#1100;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1087;&#1077;&#1088;&#1074;&#1099;&#1077; &#1090;&#1088;&#1080; &#1073;&#1086;&#1083;&#1090;&#1072; &#1087;&#1086;&#1084;&#1077;&#1097;&#1077;&#1085;&#1099; &#1085;&#1072; &#1086;&#1076;&#1085;&#1086;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1077; &#1076;&#1074;&#1080;&#1075;&#1072;&#1090;&#1077;&#1083;&#1103;, &#1090;&#1088;&#1077;&#1073;&#1091;&#1102;&#1090;&#1089;&#1103; &#1077;&#1097;&#1105; &#1090;&#1088;&#1080; &#1073;&#1086;&#1083;&#1090;&#1072; &#1089; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1086;&#1087;&#1086;&#1083;&#1086;&#1078;&#1085;&#1086;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099;, &#1095;&#1090;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1090;&#1088;&#1077;&#1084;&#1103; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1072;&#1084;&#1080;:
</p>
<ul><li>&#1052;&#1086;&#1078;&#1085;&#1086; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1080;&#1090;&#1100; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1082;&#1088;&#1091;&#1078;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081; &#1082;&#1072;&#1082; &#1084;&#1099; &#1101;&#1090;&#1086; &#1076;&#1077;&#1083;&#1072;&#1083;&#1080; &#1076;&#1083;&#1103; &#1087;&#1077;&#1088;&#1074;&#1099;&#1093; &#1090;&#1088;&#1105;&#1093; &#1080; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1080;&#1085;&#1074;&#1077;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1091; Y, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1073;&#1086;&#1083;&#1090;&#1099; &#1089; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1086;&#1087;&#1086;&#1083;&#1086;&#1078;&#1085;&#1086;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099; &#1076;&#1074;&#1080;&#1075;&#1072;&#1090;&#1077;&#1083;&#1103;.</li>
<li>&#1052;&#1086;&#1078;&#1085;&#1086; &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1090;&#1088;&#1080; &#1091;&#1078;&#1077; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1099;&#1093;, &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; &#1074; &#1084;&#1077;&#1085;&#1102; <i>&#1055;&#1088;&#1072;&#1074;&#1082;&#1072; -&gt; &#1044;&#1091;&#1073;&#1083;&#1080;&#1082;&#1072;&#1090;</i> &#1080; &#1080;&#1085;&#1074;&#1077;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1099; Y &#1090;&#1088;&#1105;&#1093; &#1085;&#1086;&#1074;&#1099;&#1093; &#1086;&#1082;&#1088;&#1091;&#1078;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081;.</li>
<li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1079;&#1077;&#1088;&#1082;&#1072;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080;&#1079; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; Part.</li></ul>
</div>
<p>Since you should already know how to do the first and second way, we will choose the third way for this example model.  Each of the three methods has its own advantages and disadvantages, but a good operating rule is that simple models (like this one) probably should use the first or second methods, whereas models with lots of duplication and/or duplication of very complicated shapes/objects should probably use the third method.
</p><p>So even though it is a bit of overkill we will mirror these bolts as a demonstration.  Switch back to the part workbench (note that you can always switch to the <i>Complete</i> workbench to see all the tools at once if you would rather not switch back and forth (deprecated since v0.17)) by going to <b>View &rarr; Workbench</b>.  Select the three bolt circles in the tree view, and then press the mirror button (<span typeof="mw:File"><a href="../File/Part_Mirror.svg" class="mw-file-description"><img src="../File/Part_Mirror.svg" decoding="async" width="16" height="16"></a></span>). Once you press the mirror button you should notice a new display called the <i>Combo view</i> pop up on in the pane underneath the Tree view.  Many of the tools need additional input before they can run and the Combo view lets you enter these parameters.  You can make the Combo view larger by dragging the divider line separating it from the Property view up or down.  Select <b>Bolt 1</b> from the list on the Combo view and set the <i>mirror plane</i> to XZ, then press OK (do the same for bolts 2 and 3).
</p><p>At this point you should have a basic engine block with the cylinders bored out and the headbolt locations marked.
</p>
<h3><span class="mw-headline" id="Cutting_Down_the_Excess_Billet_Material_from_the_Block">Cutting Down the Excess Billet Material from the Block</span></h3>
<p>Now that we have holes marked out for headbolts (we could do the same thing for oil channels, water jackets, etc) we will want to "trim" the outside of the block billet down to a more suitable shape.  This will make the engine lighter, allow it to cool more easily, mean less steel must be used to cast the block.  Like the bolt pattern we will be laying out a 2 dimensional drawing outlining the shape we want on the finished product.  We could draw the spline curve directly with the mouse, or use the hybrid approach like we used for the circles where we used the mouse to find approximate coordinates and then typed in the true values we wanted.  A more interesting approach is to use the 2D drafting's <i>construction mode</i> to plot a few guide shapes to help us trace out a nice, symmetric, spline curve by snapping to our constructed guide shapes.
</p><p>As a guide we will draw two regular polygons for each cylinder, with the polygons concentric with the cylinder.  To begin, switch to the top view of the engine block, hide the crankcase, switch back to the 2D drafting workbench, select the reference plane offset to 110 mm and the XY plane mode (or the <i>None</i> mode if you prefer), and click the <i>Construction mode</i> button in the command bar (the construction mode button looks like a trowel and is located just above the top right corner of the 3D view).  Construction mode works just like the normal mode except any 2D drawing objects created while in construction mode get drawn in a different color and are automatically put into a separate group in the Tree view, this allows you to hide you guide drawings and leave behind only the real things like bolt hole markings by hiding the construction group, or to delete all of the guide objects by just deleting the group.
</p>
<dl><dd><i>&#1063;&#1080;&#1090;&#1072;&#1090;&#1100; &#1076;&#1072;&#1083;&#1077;&#1077;: <a href="../ru/Draft_ToggleConstructionMode.html" title="Draft ToggleConstructionMode/ru"> &#1056;&#1077;&#1078;&#1080;&#1084; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</a></i></dd></dl>
<p>Now that your drawing plane is properly set up and you are in construction mode, click the <i>Regular Polygon</i> button (<span typeof="mw:File"><a href="../File/Draft_Polygon.svg" class="mw-file-description"><img src="../File/Draft_Polygon.svg" decoding="async" width="16" height="16"></a></span>) and move your mouse along the edge of the left cylinder while holding down the CTRL button.  You should see that it is snapping a small black dot either to the edge of the cylinder, or to the center of the cylinder, depending on where your mouse is along the circumference.  Move so that the black dot snaps to the center of the cylinder and click the left mouse button.  This places the center of the polygon at the center of the cylinder, the program prompts us for the number of edges on the polygon and the radius it is inscribed in.  Investigating with the mouse a little bit looks like a radius of 30 is good (so type that in) and enter 14 for the number of side, but leave the <i>Filled</i> box unchecked this time.  If you can't get the snap to lock onto the center of the cylinder (I had trouble with mine) you can always enter the coordinates manually (X=40, Y=0, Z=110).  Add a second polygon, also centered on the left cylinder but this one should have 22 side and 45 mm radius.  Finally add the same two polygons over the right cylinder (centered at X=100, Y=0, Z=110).  When you are finished you should have two "figure-8's" surrounding the cylinders and head bolts.  (Note that currently the program does not actually prompt you for the number of edges so you will just have to set the center and radius and then change the number of faces in the Property view).
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../File/Engine_Block_Tutorial_-_Spline.png" class="mw-file-description"><img src="../File/Engine_Block_Tutorial_-_Spline.png" decoding="async" width="300" height="181"></a><figcaption></figcaption></figure>
<p>Now that we have our guide polygons in place we are ready to draw in the spline curve defining the outside shape of the engine block.  Since this curve will be part of the final object you can turn off construction mode by clicking the same button you pressed to turn it on.  Now click the <i>Add BSpline</i> button (<span typeof="mw:File"><a href="../File/Draft_BSpline.svg" class="mw-file-description"><img src="../File/Draft_BSpline.svg" decoding="async" width="16" height="16"></a></span>) and start drawing the BSpline by <i>CTRL+left clicking</i> on each place you want to add a control point for the spline curve.  You will want your first control point to be on the leftmost point of the inner guide polygon for the left cylinder.  Continue adding control points all along the spline curve until you click on the last point <i>before</i> the one you started drawing, then click the <i>Close</i> button up where you typed in the position and radius for the 2D circles we drew for the headbolts.  Clicking this close button finished drawing control points for the spline curve and joins the ends together to form a closed loop.  It is very important that you properly close loops like this if you plan to extrude them into solid objects like we will be with this one.  For open spline curves you can just click the <i>Finish</i> button instead of the Close button when you are finished drawing.  To the right you can see what you finished spline curve should look like just before you press the close button (notice I have drawn all but the last line segment and my mouse pointer is just about to click the <i>Close</i> button to finish the spline curve).  Also notice that I have checked the <i>Filled</i> box so the resulting spline curve will form a solid sheet, rather than just an empty ring, this must be done to extrude it into a solid shape that is capped on the ends.
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../File/Engine_Block_Tutorial_-_Spline_Edit_Mode.png" class="mw-file-description"><img src="../File/Engine_Block_Tutorial_-_Spline_Edit_Mode.png" decoding="async" width="300" height="181"></a><figcaption></figcaption></figure>
<p>The control points are not shown in that picture so I have added a second screenshot showing the finished spline in edit mode (click the <i>Edit mode</i> button to turn editing on or off for the selected object, make sure to turn it off when you are done editing it or just skip over this step if you are satisfied with your engine block shape).  Also, note that there is a discontinuity on the leftmost edge of the spline curve, even though it is closed properly, this is a bug in the program behavior and is currently being fixed, as a result your spline curve may look slightly different if you are running a newer version of the software than is available at this time.
</p><p><span id="Extruding_the_2D_Head_Design_into_our_3D_Model_to_Finish_the_Design"></span>
</p>
<h3><span id=".D0.92.D1.8B.D0.B4.D0.B0.D0.B2.D0.BB.D0.B8.D0.B2.D0.B0.D0.BD.D0.B8.D0.B5_.D0.B4.D0.B2.D1.83.D0.BC.D0.B5.D1.80.D0.BD.D0.BE.D0.B3.D0.BE_.D0.B4.D0.B8.D0.B7.D0.B0.D0.B9.D0.BD.D0.B0_.D0.B3.D0.BE.D0.BB.D0.BE.D0.B2.D0.BE.D0.BA_.D0.B2_.D0.BE.D0.B1.D1.8A.D0.B5.D0.BC.D0.BD.D1.83.D1.8E_.D0.BC.D0.BE.D0.B4.D0.B5.D0.BB.D1.8C_.D0.B4.D0.BB.D1.8F_.D0.B7.D0.B0.D0.B2.D0.B5.D1.80.D1.88.D0.B5.D0.BD.D0.B8.D1.8F_.D0.BF.D1.80.D0.BE.D0.B5.D0.BA.D1.82.D0.B0"></span><span class="mw-headline" id="&#1042;&#1099;&#1076;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077;_&#1076;&#1074;&#1091;&#1084;&#1077;&#1088;&#1085;&#1086;&#1075;&#1086;_&#1076;&#1080;&#1079;&#1072;&#1081;&#1085;&#1072;_&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;_&#1074;_&#1086;&#1073;&#1098;&#1077;&#1084;&#1085;&#1091;&#1102;_&#1084;&#1086;&#1076;&#1077;&#1083;&#1100;_&#1076;&#1083;&#1103;_&#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1103;_&#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;">&#1042;&#1099;&#1076;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; &#1076;&#1074;&#1091;&#1084;&#1077;&#1088;&#1085;&#1086;&#1075;&#1086; &#1076;&#1080;&#1079;&#1072;&#1081;&#1085;&#1072; &#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082; &#1074; &#1086;&#1073;&#1098;&#1077;&#1084;&#1085;&#1091;&#1102; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100; &#1076;&#1083;&#1103; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;</span></h3>
<p>Now we are closing in on the final design of the engine.  Return to the Part workbench and click the <i>Extrude sketch</i> button (<span typeof="mw:File"><a href="../File/Part_Extrude.svg" class="mw-file-description"><img src="../File/Part_Extrude.svg" decoding="async" width="16" height="16"></a></span>).  In the combo box that pops up, use <i>CTRL+LeftClick</i> to select the 6 head bolts and the spline curve for extrusion.  The default direction is the positive Z axis, we want the negative Z axis to extrude the head design "down" and into the engine block so set the direction to X=0, Y=0 and Z=-1, then type in 110 for the length (the height of the engine block).  After you get all the values entered and click OK the circles for the bolts will be extruded downward to for cylinders and the spline will be extruded downward to produce a sort of cylinder with "rippled" edges.  Select and hide the <b>Bored block</b> so you can see the extruded spline, then hide that object so you can see the 6 head bolt cylinders.  You see that very sophisticated 3D shapes can be made by starting with a 2D drawing and extruding parts of it downward.  We could even extrude different parts of the drawing by different amounts to do things like bore in bolt holes that just go part way through the block, but cut separate water jackets that go all the way through.  At this point all your extruded objects are just named "Extrude001..." so you will want to go through and name each of them so you can identify them in the next section (I will name mine <i>Head bolt bore 1</i> though <i>6</i> and name the spline <b>Extruded spline</b>, I suggest using the same names in your model as well).  Now that you have your extruded shapes it is just a few boolean operations now to produce the final block design.  Go through and show the major components (the <i>Bored block</i> and the <i>Crankcase</i>), and all your newly created extruded objects.
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../File/Engine_Block_Tutorial_-_Finished_Engine_Block.png" class="mw-file-description"><img src="../File/Engine_Block_Tutorial_-_Finished_Engine_Block.png" decoding="async" width="300" height="181"></a><figcaption></figcaption></figure>
<p>Now that we have 3D objects for the bore holes and the outer shape, we can use a few boolean operations to stitch the whole thing together.  Select your 6 extruded head bolts in the tree view and join them into a union (name the resulting object <b>Head bolt boreholes</b>).  Then select the <b>Bored block</b> and the <b>Head bolt boreholes</b> in that order and perform a cut (like you did when you bored out the cylinders), name the resulting <i>Cut</i> object <b>Block with headbolts</b>.  Finally, select the <b>Block with headbolts</b> and the <b>Extruded spline</b> and press the <i>Make intersection</i> button (<span typeof="mw:File"><a href="../File/Part_Common.svg" class="mw-file-description"><img src="../File/Part_Common.svg" decoding="async" width="16" height="16"></a></span>), and name the resulting object <b>Engine block</b>.
</p><p>Your final object should look like the picture on the right.
</p>
<div style="clear:both"></div>
<!-- 
NewPP limit report
Cached time: 20250616181708
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc, no&#8208;toc&#8208;conversion]
CPU time usage: 0.197 seconds
Real time usage: 0.594 seconds
Preprocessor visited node count: 137/1000000
Post&#8208;expand include size: 2006/2097152 bytes
Template argument size: 61/2097152 bytes
Highest expansion depth: 3/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1507/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   35.256      1 -total
 43.19%   15.226      1 Template:TutorialInfo/ru
 39.51%   13.929      1 Template:UnfinishedDocu/ru
  8.62%    3.038      1 Template:Clear
  6.33%    2.231      1 Template:MenuCommand
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:71055-0!canonical and timestamp 20250616181708 and revision id 1233457. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>