<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">FeaturePython methods/ru</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="ru" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-FeaturePython+methods&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/FeaturePython_methods.html" class="mw-pt-progress mw-pt-progress--med" title="FeaturePython Methoden (50% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../FeaturePython_methods.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="FeaturePython methods (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../fr/FeaturePython_methods.html" class="mw-pt-progress mw-pt-progress--med" title="M&eacute;thodes FeaturePython (62% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/FeaturePython_methods.html" class="mw-pt-progress mw-pt-progress--med" title="Metodi FeaturePython (62% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/FeaturePython_methods.html" class="mw-pt-progress mw-pt-progress--med" title="Metody FeaturePython (62% translated)" lang="pl" dir="ltr">polski</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--med" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</span></li></ul></div>
<div style="clear:right; margin-bottom: .5em; float: right; padding: .5em 0 .8em 1.4em; background: none;"><meta property="mw:PageProp/toc"></div>
<p><span id="Introduction"></span>
</p>
<h2><span id=".D0.92.D0.B2.D0.B5.D0.B4.D0.B5.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;">&#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;</span></h2>
<p>&#1044;&#1072;&#1085;&#1085;&#1072;&#1103; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1089;&#1087;&#1088;&#1072;&#1074;&#1086;&#1095;&#1085;&#1099;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1087;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1084; &#1087;&#1077;&#1088;&#1077;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1084;&#1099;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1085;&#1099;&#1093; &#1074; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103;&#1093;:  <a href="../ru/Create_a_FeaturePython_object_part_I.html" title="Create a FeaturePython object part I/ru">Create a FeaturePython object part I</a> &#1080; <a href="../ru/Scripted_objects.html" title="Scripted objects/ru">&#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1091;&#1077;&#1084;&#1099;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;</a>.
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h2><span class="mw-headline" id="Primary_reference">Primary reference</span></h2>
</div>
<div class="mw-translate-fuzzy">
<h2><span id=".D0.9E.D1.81.D0.BD.D0.BE.D0.B2.D0.BD.D0.B0.D1.8F_.D1.81.D1.81.D1.8B.D0.BB.D0.BA.D0.B0"></span><span class="mw-headline" id="&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103;_&#1089;&#1089;&#1099;&#1083;&#1082;&#1072;">&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072;</span></h2>
<p>&#1059;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1077; &#1085;&#1080;&#1078;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1074; ~ 99% &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;&#1074; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1086;&#1087;&#1099;&#1090;&#1085;&#1099;&#1084;&#1080; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;&#1084;&#1080; proxy &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; Python.
</p>
</div>
<table class="wikitable" cellpadding="5px" width="100%">
<tbody><tr>
<td style="width:25%"><code>execute(self, obj)</code>
</td>
<td style="width:25%">&#1042;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1087;&#1077;&#1088;&#1077;&#1088;&#1072;&#1089;&#1095;&#1077;&#1090;&#1072; FeaturePython (&#1080;&#1083;&#1080; &#1087;&#1077;&#1088;&#1077;&#1089;&#1095;&#1077;&#1090;&#1072; &#1074;&#1089;&#1077;&#1075;&#1086; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;)
</td>
<td style="width:50%">&#1053;&#1077; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1081;&#1090;&#1077; <code>recompute()</code> &#1080;&#1079; &#1101;&#1090;&#1086;&#1075;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; (&#1080;&#1083;&#1080; &#1083;&#1102;&#1073;&#1086;&#1075;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;, &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; &#1080;&#1079; <code>execute()</code>), &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1101;&#1090;&#1086; &#1074;&#1099;&#1079;&#1086;&#1074;&#1077;&#1090; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1085;&#1099;&#1081; &#1087;&#1077;&#1088;&#1077;&#1089;&#1095;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1088;&#1080;&#1074;&#1077;&#1089;&#1090;&#1080; &#1082; &#1079;&#1072;&#1094;&#1080;&#1082;&#1083;&#1080;&#1074;&#1072;&#1085;&#1080;&#1102;.
</td></tr>
<tr>
<td><code>onBeforeChange(self, obj, prop)</code>
</td>
<td>&#1042;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1077;&#1088;&#1077;&#1076; &#1090;&#1077;&#1084;, &#1082;&#1072;&#1082; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1086;
</td>
<td><code>prop</code> - &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1084;&#1086;&#1075;&#1086; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;, &#1085;&#1086; &#1085;&#1077; &#1089;&#1072;&#1084; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;. &#1048;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1086;&#1090;&#1084;&#1077;&#1085;&#1077;&#1085;&#1086;. &#1041;&#1091;&#1076;&#1091;&#1097;&#1077;&#1077;/&#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1085;&#1077; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099; &#1076;&#1083;&#1103; &#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1103; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;.
</td></tr>
<tr>
<td><code>onChanged(self, obj, prop)</code>
</td>
<td>&#1042;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1089;&#1083;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1073;&#1099;&#1083;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1086;
</td>
<td><code>prop</code> - &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1087;&#1086;&#1076;&#1083;&#1077;&#1078;&#1080;&#1090; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1102;, &#1085;&#1086; &#1085;&#1077; &#1089;&#1072;&#1084; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;.
</td></tr>
<tr>
<td><code>onDocumentRestored(self, obj)</code>
</td>
<td>&#1042;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1089;&#1083;&#1077; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &#1080;&#1083;&#1080; &#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; FeaturePython.
</td>
<td>&#1048;&#1085;&#1086;&#1075;&#1076;&#1072; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1085;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; FeaturePython &#1080;&#1079; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1080;&#1083;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089; &#1080;&#1079; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; FeaturePython &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1085;&#1072;&#1088;&#1091;&#1096;&#1077;&#1085;&#1099;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1082;&#1083;&#1072;&#1089;&#1089; <code>__init__()</code> &#1084;&#1077;&#1090;&#1086;&#1076; &#1085;&#1077; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1088;&#1077;&#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;. &#1044;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; <code>self.Object = obj</code> &#1080;&#1083;&#1080; <code>obj.Proxy = self</code> &#1082;&#1072;&#1082; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1086; &#1088;&#1077;&#1096;&#1072;&#1077;&#1090; &#1101;&#1090;&#1080; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;.
</td></tr></tbody></table>
<p>&#1053;&#1077;&#1088;&#1077;&#1076;&#1082;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1090;&#1086;&#1083;&#1082;&#1085;&#1091;&#1090;&#1100;&#1089;&#1103; &#1089; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1077;&#1081;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1099;&#1077; &#1074;&#1099;&#1079;&#1086;&#1074;&#1099; (callbacks) Python &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1102;&#1090;&#1089;&#1103; &#1085;&#1077; &#1090;&#1072;&#1082;, &#1082;&#1072;&#1082; &#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1083;&#1086; &#1073;&#1099;. &#1053;&#1072;&#1095;&#1080;&#1085;&#1072;&#1102;&#1097;&#1080;&#1077; &#1074; &#1101;&#1090;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1074;&#1077;&#1088;&#1077;&#1085;&#1099;, &#1095;&#1090;&#1086; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086;&#1075;&#1086; &#1074;&#1099;&#1079;&#1086;&#1074;&#1072; FeaturePython &#1085;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1093;&#1088;&#1091;&#1087;&#1082;&#1086;&#1081; &#1080;&#1083;&#1080; &#1089;&#1083;&#1086;&#1084;&#1072;&#1085;&#1085;&#1086;&#1081;. &#1053;&#1077;&#1080;&#1079;&#1084;&#1077;&#1085;&#1085;&#1086;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1099;&#1077; &#1074;&#1099;&#1079;&#1086;&#1074;&#1099; &#1085;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103;, &#1101;&#1090;&#1086; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1080;&#1079;-&#1079;&#1072; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1087;&#1086;&#1090;&#1077;&#1088;&#1103;&#1085;&#1072; &#1080;&#1083;&#1080; &#1085;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1072; &#1074; &#1073;&#1072;&#1079;&#1086;&#1074;&#1086;&#1084; &#1082;&#1086;&#1076;&#1077;. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1082;&#1072;&#1078;&#1077;&#1090;&#1089;&#1103;, &#1095;&#1090;&#1086; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1099;&#1077; &#1074;&#1099;&#1079;&#1086;&#1074;&#1099; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1073;&#1077;&#1079; &#1086;&#1073;&#1098;&#1103;&#1089;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;, &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1089;&#1089;&#1099;&#1083;&#1086;&#1082; &#1085;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;/proxy &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1074; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086;&#1084; &#1074;&#1099;&#1079;&#1086;&#1074;&#1077; <code>onDocumentRestored()</code> (&#1082;&#1072;&#1082; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1074; &#1087;&#1077;&#1088;&#1074;&#1086;&#1081; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1077; &#1074;&#1099;&#1096;&#1077;) &#1084;&#1086;&#1078;&#1077;&#1090; &#1086;&#1073;&#1083;&#1077;&#1075;&#1095;&#1080;&#1090;&#1100; &#1101;&#1090;&#1080; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;. &#1055;&#1086;&#1082;&#1072; &#1074;&#1099; &#1085;&#1077; &#1086;&#1089;&#1074;&#1086;&#1080;&#1090;&#1077;&#1089;&#1100; &#1089; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1086;&#1081; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086;&#1075;&#1086; &#1074;&#1099;&#1079;&#1086;&#1074;&#1072;, &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1074; &#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1100; print() &#1074; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1099;&#1081; &#1074;&#1099;&#1079;&#1086;&#1074; &#1076;&#1083;&#1103; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081; &#1074; &#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1100; &#1074; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1077; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080;.
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h2><span class="mw-headline" id="Additional_methods">Additional methods</span></h2>
</div>
<div class="mw-translate-fuzzy">
<h2><span id=".D0.94.D0.BE.D0.BF.D0.BE.D0.BB.D0.BD.D0.B8.D1.82.D0.B5.D0.BB.D1.8C.D0.BD.D1.8B.D0.B5_.D0.BC.D0.B5.D1.82.D0.BE.D0.B4.D1.8B"></span><span class="mw-headline" id="&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077;_&#1084;&#1077;&#1090;&#1086;&#1076;&#1099;">&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;</span></h2>
<p>&#1055;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1099;&#1077; &#1085;&#1080;&#1078;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1099; &#1076;&#1083;&#1103; <b>&#1087;&#1088;&#1086;&#1076;&#1074;&#1080;&#1085;&#1091;&#1090;&#1086;&#1075;&#1086;</b> &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; proxy &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; Python, &#1082;&#1072;&#1082; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1086; &#1074; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;&#1074; &#1086;&#1085;&#1080; &#1074;&#1072;&#1084; &#1085;&#1077; &#1087;&#1086;&#1085;&#1072;&#1076;&#1086;&#1073;&#1103;&#1090;&#1089;&#1103;.
</p>
</div>
<ul><li>mustExecute</li>
<li>getViewProviderName</li>
<li>getSubObject</li>
<li>getSubObjects</li>
<li>getLinkedObject</li>
<li>hasChildElement</li>
<li>isElementVisible</li>
<li>canLinkProperties</li>
<li>allowDuplicateLabel</li>
<li>redirectSubName</li>
<li>canLoadPartial</li>
<li>onBeforeChangeLabel</li></ul>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h2><span class="mw-headline" id="Determining_available_Python_methods">Determining available Python methods</span></h2>
</div>
<div class="mw-translate-fuzzy">
<h2><span id=".D0.9E.D0.BF.D1.80.D0.B5.D0.B4.D0.B5.D0.BB.D0.B5.D0.BD.D0.B8.D0.B5_.D0.B2.D1.81.D0.B5.D1.85_.D0.B4.D0.BE.D1.81.D1.82.D1.83.D0.BF.D0.BD.D1.8B.D1.85_Python_.D0.BC.D0.B5.D1.82.D0.BE.D0.B4.D0.BE.D0.B2"></span><span class="mw-headline" id="&#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077;_&#1074;&#1089;&#1077;&#1093;_&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1093;_Python_&#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074;">&#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074;&#1089;&#1077;&#1093; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1093; Python &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074;</span></h2>
<p>&#1042; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1082; &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1084;&#1086;&#1084;&#1091; &#1082;&#1083;&#1072;&#1089;&#1089;&#1091; &#1085;&#1077; &#1072;&#1082;&#1090;&#1091;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1072;, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1089;&#1072;&#1084;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1082;&#1072;&#1082;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099; &#1074; &#1085;&#1077;&#1084; , &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1074;&#1096;&#1080;&#1089;&#1100; &#1082; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1084;&#1091; C++ &#1082;&#1086;&#1076;&#1091;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1074; <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/blob/76e74294894bbce46d006e149315c6274d206278/src/App/FeaturePython.h#L161-L351">&#1082;&#1083;&#1072;&#1089;&#1089;&#1077; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1077; FeaturePython</a> &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1099; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1074;&#1099;&#1079;&#1086;&#1074;&#1099;, &#1074; &#1074;&#1080;&#1076;&#1077;: <code>imp-&gt;&lt;&#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;&gt;()</code>.
</p>
</div>
<p>&#1050;&#1072;&#1078;&#1076;&#1086;&#1084;&#1091; &#1080;&#1079; &#1085;&#1080;&#1093; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1099;&#1081; &#1084;&#1077;&#1090;&#1086;&#1076; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1081; &#1074; Python.
</p><p>&#1050; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1091;, <code>imp-&gt;execute()</code> <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/blob/76e74294894bbce46d006e149315c6274d206278/src/App/FeaturePython.h#L193">&#1074; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077; 193</a> &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; <code>execute</code> &#1084;&#1077;&#1090;&#1086;&#1076; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1074; Python &#1082;&#1086;&#1076;&#1077;.
</p><p>&#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; <code>getPyObject()</code> &#1080; <code>init()</code> &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1086;&#1089;&#1086;&#1073;&#1099;&#1084;&#1080; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1084;&#1080; &#1080; &#1085;&#1077; &#1087;&#1086;&#1076;&#1083;&#1077;&#1078;&#1072;&#1090; &#1087;&#1086;&#1076;&#1086;&#1073;&#1085;&#1086;&#1084;&#1091; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1091; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103;.
</p><p><span id="See_also"></span>
</p>
<h2><span id=".D0.A1.D0.BC.D0.BE.D1.82.D1.80.D0.B8.D1.82.D0.B5_.D1.82.D0.B0.D0.BA.D0.B6.D0.B5"></span><span class="mw-headline" id="&#1057;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077;_&#1090;&#1072;&#1082;&#1078;&#1077;">&#1057;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; &#1090;&#1072;&#1082;&#1078;&#1077;</span></h2>
<div lang="en" dir="ltr" class="mw-content-ltr">
<ul><li><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/blob/76e74294894bbce46d006e149315c6274d206278/src/App/FeaturePython.h#L44-L86">FreeCAD GitHub: FeaturePython.h - public API</a></li>
<li><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/blob/76e74294894bbce46d006e149315c6274d206278/src/App/FeaturePython.h#L167">FreeCAD GitHub: FeaturePythonT template class</a></li>
<li><a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?f=22&amp;t=49194">FreeCAD Forum Discussion: Scripted Objects Complete Method Reference</a></li></ul>
</div>
<p><br>
</p>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><span typeof="mw:File"><a href="../index.php?title=Power_user_hub.png&amp;filetimestamp=20200511213015&amp;.html" class="mw-file-description"><img src="../File/Power_user_hub.png" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="128" data-file-height="128"></a></span> <a href="../ru/Power_users_hub.html" title="Power users hub/ru">Power user documentation</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b>FreeCAD scripting:</b> <a href="../ru/Python.html" title="Python/ru">Python</a>, <a href="../ru/Introduction_to_Python.html" title="Introduction to Python/ru">Introduction to Python</a>, <a href="../ru/Python_scripting_tutorial.html" title="Python scripting tutorial/ru">Python scripting tutorial</a>, <a href="../ru/FreeCAD_Scripting_Basics.html" title="FreeCAD Scripting Basics/ru">FreeCAD Scripting Basics</a></li></ul>
<hr>
<ul><li><b>Modules:</b> <a href="../ru/Builtin_modules.html" title="Builtin modules/ru">Builtin modules</a>, <a href="../ru/Units.html" title="Units/ru">Units</a>, <a href="../ru/Quantity.html" title="Quantity/ru">Quantity</a></li>
<li><b>Workbenches:</b> <a href="../ru/Workbench_creation.html" title="Workbench creation/ru">Workbench creation</a>, <a href="../ru/Gui_Command.html" title="Gui Command/ru">Gui Commands</a>, <a href="../ru/Command.html" title="Command/ru">Commands</a>, <a href="../ru/Installing_more_workbenches.html" title="Installing more workbenches/ru">Installing more workbenches</a></li>
<li><b>Meshes and Parts:</b> <a href="../ru/Mesh_Scripting.html" title="Mesh Scripting/ru">Mesh Scripting</a>, <a href="../ru/Topological_data_scripting.html" title="Topological data scripting/ru">Topological data scripting</a>, <a href="../ru/Mesh_to_Part.html" title="Mesh to Part/ru">Mesh to Part</a>, <a href="../ru/PythonOCC.html" title="PythonOCC/ru">PythonOCC</a></li></ul>
<hr>
<ul><li><b>Parametric objects:</b> <a href="../ru/Scripted_objects.html" title="Scripted objects/ru">Scripted objects</a>, <a href="../ru/Viewprovider.html" title="Viewprovider/ru">Viewproviders</a> <small>(<a href="../ru/Custom_icon_in_tree_view.html" title="Custom icon in tree view/ru">Custom icon in tree view</a>)</small></li>
<li><b>Scenegraph:</b> <a href="../ru/Scenegraph.html" title="Scenegraph/ru">Coin (Inventor) scenegraph</a>, <a href="../ru/Pivy.html" title="Pivy/ru">Pivy</a></li>
<li><b>Graphical interface:</b> <a href="../ru/Interface_creation.html" title="Interface creation/ru">Interface creation</a>, <a href="../ru/Dialog_creation.html" title="Dialog creation/ru">Interface creation completely in Python</a> <small>(<a href="../index.php?title=Dialog_creation_with_various_widgets/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation with various widgets/ru (page does not exist)">1</a>, <a href="../index.php?title=Dialog_creation_reading_and_writing_files/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation reading and writing files/ru (page does not exist)">2</a>, <a href="../index.php?title=Dialog_creation_setting_colors/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation setting colors/ru (page does not exist)">3</a>, <a href="../index.php?title=Dialog_creation_image_and_animated_GIF/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation image and animated GIF/ru (page does not exist)">4</a>, <a href="../index.php?title=PySide_usage_snippets/ru&amp;action=edit&amp;redlink=1.html" class="new" title="PySide usage snippets/ru (page does not exist)">5</a>)</small>, <a href="../ru/PySide.html" title="PySide/ru">PySide</a>, PySide examples <a href="../ru/PySide_Beginner_Examples.html" title="PySide Beginner Examples/ru">beginner</a>, <a href="../ru/PySide_Intermediate_Examples.html" title="PySide Intermediate Examples/ru">intermediate</a>, <a href="../ru/PySide_Advanced_Examples.html" title="PySide Advanced Examples/ru">advanced</a></li>
<li><b>Macros:</b> <a href="../ru/Macros.html" title="Macros/ru">Macros</a>, <a href="../ru/How_to_install_macros.html" title="How to install macros/ru">How to install macros</a></li>
<li><b>Embedding:</b> <a href="../ru/Embedding_FreeCAD.html" title="Embedding FreeCAD/ru">Embedding FreeCAD</a>, <a href="../ru/Embedding_FreeCADGui.html" title="Embedding FreeCADGui/ru">Embedding FreeCADGui</a></li></ul>
<hr>
<ul><li><b>Other:</b> <a href="../ru/Expressions.html" title="Expressions/ru">Expressions</a>, <a href="../ru/Code_snippets.html" title="Code snippets/ru">Code snippets</a>, <a href="../ru/Line_drawing_function.html" title="Line drawing function/ru">Line drawing function</a>, <a href="../ru/FreeCAD_vector_math_library.html" title="FreeCAD vector math library/ru">FreeCAD vector math library</a> <small>(deprecated)</small></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="../ru/User_hub.html" title="User hub/ru">User hub</a>, <a href="../ru/Power_users_hub.html" title="Power users hub/ru">Power users hub</a>, <a href="../ru/Developer_hub.html" title="Developer hub/ru">Developer hub</a></li></ul></div>
    </div></div>
<div style="clear:both"></div>
<!-- 
NewPP limit report
Cached time: 20251115095352
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.046 seconds
Real time usage: 0.061 seconds
Preprocessor visited node count: 185/1000000
Post&#8208;expand include size: 6707/2097152 bytes
Template argument size: 2416/2097152 bytes
Highest expansion depth: 5/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1368/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   14.774      1 -total
 52.79%    7.799      1 Template:Powerdocnavi/ru
 16.93%    2.502      1 Template:Navigation_menu_2
 13.83%    2.043      1 Template:Clear
 13.26%    1.959     12 Template:Incode
 12.64%    1.868      1 Template:TOCright
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:302933-0!canonical and timestamp 20251115095352 and revision id 1691128. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>