<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">FreeCAD Scripting Basics/ru</span></h1><?xml encoding="UTF-8"><div class="mw-parser-output"><div class="mw-pt-languages noprint" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../id/FreeCAD_Scripting_Basics.html" class="mw-pt-progress mw-pt-progress--stub" title="FreeCAD Scripting Basics (2% translated)" lang="id" dir="ltr">Bahasa Indonesia</a></li>
<li><a href="../de/FreeCAD_Scripting_Basics.html" class="mw-pt-progress mw-pt-progress--complete" title="Grundlagen der Skripterstellung in FreeCAD (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../FreeCAD_Scripting_Basics.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="FreeCAD Scripting Basics (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../tr/FreeCAD_Scripting_Basics.html" class="mw-pt-progress mw-pt-progress--stub" title="FreeCAD Scripting Basics (2% translated)" lang="tr" dir="ltr">T&uuml;rk&ccedil;e</a></li>
<li><a href="../es/FreeCAD_Scripting_Basics.html" class="mw-pt-progress mw-pt-progress--complete" title="B&aacute;sicos de Guionizaci&oacute;n FreeCAD (96% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/FreeCAD_Scripting_Basics.html" class="mw-pt-progress mw-pt-progress--complete" title="FreeCAD D&eacute;buter avec les scripts (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/FreeCAD_Scripting_Basics.html" class="mw-pt-progress mw-pt-progress--complete" title="Script di base per FreeCAD (100% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/FreeCAD_Scripting_Basics.html" class="mw-pt-progress mw-pt-progress--complete" title="Podstawy tworzenia skrypt&oacute;w FreeCAD (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt/FreeCAD_Scripting_Basics.html" class="mw-pt-progress mw-pt-progress--stub" title="Conceitos b&aacute;sicos de programa&ccedil;&atilde;o em FreeCAD (2% translated)" lang="pt" dir="ltr">portugu&ecirc;s</a></li>
<li><a href="../pt-br/FreeCAD_Scripting_Basics.html" class="mw-pt-progress mw-pt-progress--stub" title="FreeCAD No&ccedil;&otilde;es b&aacute;sicas de programa&ccedil;&atilde;o (2% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../ro/FreeCAD_Scripting_Basics.html" class="mw-pt-progress mw-pt-progress--stub" title="FreeCAD Scripting Basics (16% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><a href="../sv/FreeCAD_Scripting_Basics.html" class="mw-pt-progress mw-pt-progress--stub" title="FreeCAD Scripting Basics (14% translated)" lang="sv" dir="ltr">svenska</a></li>
<li><a href="../cs/FreeCAD_Scripting_Basics.html" class="mw-pt-progress mw-pt-progress--stub" title="FreeCAD Scripting Basics/cs (0% translated)" lang="cs" dir="ltr">&#269;e&scaron;tina</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</span></li>
<li><a href="../zh-cn/FreeCAD_Scripting_Basics.html" class="mw-pt-progress mw-pt-progress--stub" title="FreeCAD&#33050;&#26412;&#22522;&#30784; (6% translated)" lang="zh-Hans-CN" dir="ltr">&#20013;&#25991;&#65288;&#20013;&#22269;&#22823;&#38470;&#65289;</a></li>
<li><a href="../ja/FreeCAD_Scripting_Basics.html" class="mw-pt-progress mw-pt-progress--stub" title="FreeCAD&#12473;&#12463;&#12522;&#12503;&#12486;&#12451;&#12531;&#12464;&#12398;&#22522;&#30990; (6% translated)" lang="ja" dir="ltr">&#26085;&#26412;&#35486;</a></li>
<li><a href="../ko/FreeCAD_Scripting_Basics.html" class="mw-pt-progress mw-pt-progress--low" title="FreeCAD &#49828;&#53356;&#47549;&#53944; &#44592;&#52488; (28% translated)" lang="ko" dir="ltr">&#54620;&#44397;&#50612;</a></li></ul></div>
<div class="mw-translate-fuzzy">
<div class="docnav" style="background-color: #ececef; border: 1px solid #a2a9b1; padding: 2px 10px; margin: 10px 0; line-height: 1; clear: both; overflow: hidden;">
    <div style="margin: 4px 0; float: left;"><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-left.svg" decoding="async" width="16" height="16"></span></span> <a href="../ru/Python_scripting_tutorial.html" title="Python scripting tutorial/ru">Python scripting tutorial</a></div>
    <div style="margin: 4px 0; float: right;"><a href="../ru/Topological_data_scripting.html" title="Topological data scripting/ru">Topological data scripting</a>
 <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-right.svg" decoding="async" width="16" height="16"></span></span></div>
    <div style="text-align:center"><a href="../ru/Online_Help_Toc.html" title="Online Help Toc/ru">&#1054;&#1075;&#1083;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;</a> <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Online_Help_Toc.svg" decoding="async" width="24" height="24"></span></span></div>
</div>
</div>
<div style="clear:right; margin-bottom: .5em; float: right; padding: .5em 0 .8em 1.4em; background: none;"><meta property="mw:PageProp/toc"></div>
<p><span id="Python_scripting_in_FreeCAD"></span>
</p>
<h2><span id=".D0.9D.D0.B0.D0.BF.D0.B8.D1.81.D0.B0.D0.BD.D0.B8.D0.B5_.D1.81.D1.86.D0.B5.D0.BD.D0.B0.D1.80.D0.B8.D0.B5.D0.B2_Python_.D0.B2_FreeCAD"></span><span class="mw-headline" id="&#1053;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;_&#1089;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1077;&#1074;_Python_&#1074;_FreeCAD">&#1053;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1089;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1077;&#1074; Python &#1074; FreeCAD</span></h2>
<p>FreeCAD &#1089; &#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085; &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1073;&#1099;&#1090;&#1100; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1080;&#1088;&#1091;&#1077;&#1084;&#1099;&#1084; &#1089;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1103;&#1084;&#1080; Python. &#1055;&#1086;&#1095;&#1090;&#1080; &#1074;&#1089;&#1077; &#1095;&#1072;&#1089;&#1090;&#1080; FreeCAD, &#1090;&#1072;&#1082;&#1080;&#1077; &#1082;&#1072;&#1082; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1089;&#1094;&#1077;&#1085;&#1099;, &#1080; &#1076;&#1072;&#1078;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1103; &#1074; &#1086;&#1082;&#1085;&#1077; 3D &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1072; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099; &#1080;&#1079; &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; Python &#1080;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1077;&#1090;&#1072;&#1090;&#1086;&#1088;&#1072; &#1080;&#1083;&#1080; &#1080;&#1079; &#1089;&#1074;&#1086;&#1080;&#1093; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1093; &#1089;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1077;&#1074;. &#1050;&#1072;&#1082; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;, FreeCAD &#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;, &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1086;&#1076;&#1085;&#1086;&#1081; &#1080;&#1079; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1075;&#1083;&#1091;&#1073;&#1086;&#1082;&#1086; &#1085;&#1072;&#1089;&#1090;&#1088;&#1072;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1081; &#1080;&#1085;&#1078;&#1077;&#1085;&#1077;&#1088;&#1085;&#1099;&#1093; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;, &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1093; &#1089;&#1077;&#1075;&#1086;&#1076;&#1085;&#1103;.
</p><p>&#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1085;&#1077; &#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1099; &#1089; Python, &#1084;&#1099; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1084; &#1042;&#1072;&#1084; &#1080;&#1089;&#1082;&#1072;&#1090;&#1100; &#1091;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082;&#1080; &#1087;&#1086; &#1080;&#1085;&#1090;&#1077;&#1088;&#1085;&#1077;&#1090;&#1091;, &#1080; &#1073;&#1077;&#1075;&#1083;&#1086; &#1074;&#1079;&#1075;&#1083;&#1103;&#1085;&#1091;&#1090;&#1100; &#1085;&#1072; &#1077;&#1075;&#1086; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1091;. Python &#1101;&#1090;&#1086; &#1086;&#1095;&#1077;&#1085;&#1100; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1103;&#1079;&#1099;&#1082; &#1076;&#1083;&#1103; &#1086;&#1073;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091;, &#1086;&#1085; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1089;&#1088;&#1072;&#1079;&#1091; &#1079;&#1072;&#1087;&#1091;&#1097;&#1077;&#1085; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1080;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1080;&#1090;&#1072;&#1090;&#1086;&#1088;&#1072;, &#1075;&#1076;&#1077; &#1080; &#1087;&#1088;&#1086;&#1089;&#1090;&#1072;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1080; &#1075;&#1086;&#1090;&#1086;&#1074;&#1072;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1072; "&#1085;&#1072; &#1083;&#1077;&#1090;&#1091;", &#1073;&#1077;&#1079; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1095;&#1090;&#1086;-&#1083;&#1080;&#1073;&#1086;. FreeCAD &#1080;&#1084;&#1077;&#1077;&#1090; &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1099;&#1081; &#1074; Python &#1080;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1080;&#1090;&#1072;&#1090;&#1086;&#1088;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1085;&#1077; &#1074;&#1080;&#1076;&#1080;&#1090;&#1077; &#1086;&#1082;&#1085;&#1086; &#1089; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1100;&#1102; <b>&#1050;&#1086;&#1085;&#1089;&#1086;&#1083;&#1100; Python</b>, &#1082;&#1072;&#1082; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1085;&#1080;&#1078;&#1077;, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1072;&#1082;&#1090;&#1080;&#1074;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1095;&#1077;&#1088;&#1077;&#1079; <b>&#1042;&#1080;&#1076; &rarr; &#1055;&#1072;&#1085;&#1077;&#1083;&#1080; &rarr; &#1050;&#1086;&#1085;&#1089;&#1086;&#1083;&#1100; Python</b>.
</p><p><span id="The_interpreter"></span>
</p>
<h3><span id=".D0.98.D0.BD.D1.82.D0.B5.D1.80.D0.BF.D1.80.D0.B5.D1.82.D0.B0.D1.82.D0.BE.D1.80"></span><span class="mw-headline" id="&#1048;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1077;&#1090;&#1072;&#1090;&#1086;&#1088;">&#1048;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1077;&#1090;&#1072;&#1090;&#1086;&#1088;</span></h3>
<p>&#1042; &#1080;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1077;&#1090;&#1072;&#1090;&#1086;&#1088;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084; &#1074; &#1074;&#1072;&#1096;&#1077;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103;&#1084; Python, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1099;&#1084; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103;&#1084; FreeCAD, &#1080; &#1074;&#1089;&#1077;&#1084; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103;&#1084; FreeCAD &#1095;&#1090;&#1086; &#1074;&#1099; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1087;&#1086;&#1079;&#1078;&#1077;. &#1057;&#1082;&#1088;&#1080;&#1085;&#1096;&#1086;&#1090; &#1085;&#1080;&#1078;&#1077; &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1080;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1077;&#1090;&#1072;&#1090;&#1086;&#1088; Python:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Screenshot_pythoninterpreter.jpg&amp;filetimestamp=20090202153113&amp;.html" class="mw-file-description" title="The FreeCAD Python interpreter"><img alt="The FreeCAD Python interpreter" src="../File/Screenshot_pythoninterpreter.jpg" decoding="async" width="614" height="228"></a></span>
</p><p>&#1042; &#1080;&#1085;&#1090;&#1077;&#1087;&#1088;&#1080;&#1090;&#1072;&#1090;&#1086;&#1088;&#1077;, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100; &#1082;&#1086;&#1076; Python &#1080; &#1087;&#1088;&#1086;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; &#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;. FreeCAD &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1086;&#1095;&#1077;&#1085;&#1100; &#1091;&#1076;&#1086;&#1073;&#1085;&#1099;&#1081; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1076;&#1083;&#1103; &#1086;&#1089;&#1074;&#1086;&#1077;&#1085;&#1080;&#1103; &#1084;&#1080;&#1088;&#1072; FreeCAD: &#1050;&#1086;&#1075;&#1076;&#1072; &#1074;&#1099; &#1074;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077; &#1080;&#1084;&#1103; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1087;&#1086;&#1089;&#1083;&#1077; &#1090;&#1086;&#1095;&#1082;&#1080; &#1089;&#1088;&#1072;&#1079;&#1091; &#1078;&#1077; &#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; (&#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1074;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1095;&#1090;&#1086;-&#1090;&#1086; &#1080;&#1079; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;), &#1086;&#1082;&#1085;&#1086; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1072;, &#1075;&#1076;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100;&#1089;&#1103; &#1084;&#1077;&#1078;&#1076;&#1091; &#1080;&#1084;&#1077;&#1102;&#1097;&#1080;&#1084;&#1080;&#1089;&#1103; &#1087;&#1086;&#1076;&#1082;&#1083;&#1072;&#1089;&#1089;&#1072;&#1084;&#1080; &#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;&#1084;&#1080;. &#1055;&#1088;&#1080; &#1074;&#1099;&#1073;&#1086;&#1088;&#1077; &#1077;&#1089;&#1083;&#1080; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090;, &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090; &#1089;&#1087;&#1088;&#1072;&#1074;&#1082;&#1072;, &#1090;&#1086; &#1086;&#1085; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103;:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Screenshot_classbrowser.jpg&amp;filetimestamp=20090202153040&amp;.html" class="mw-file-description" title="The FreeCAD class browser"><img alt="The FreeCAD class browser" src="../File/Screenshot_classbrowser.jpg" decoding="async" width="614" height="228"></a></span>
</p><p>&#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1086; &#1085;&#1072;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; <code>App.</code> &#1080;&#1083;&#1080; <code>Gui.</code>  &#1087;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090;. &#1044;&#1088;&#1091;&#1075;&#1086;&#1081;, &#1073;&#1086;&#1083;&#1077;&#1077; &#1086;&#1073;&#1097;&#1080;&#1081; Python &#1084;&#1077;&#1090;&#1086;&#1076; &#1080;&#1079;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1075;&#1086; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1081; &#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; <code>print(dir())</code>. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1074;&#1074;&#1086;&#1076; <code>print(dir())</code> &#1074;&#1099;&#1074;&#1077;&#1076;&#1077;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1074;&#1089;&#1077;&#1093; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1081;, &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085;&#1085;&#1099;&#1093; &#1074; FreeCAD. <code>print(dir(App))</code> &#1087;&#1086;&#1082;&#1072;&#1078;&#1077;&#1090; &#1074;&#1072;&#1084; &#1074;&#1089;&#1077;, &#1095;&#1090;&#1086; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; App &#1084;&#1086;&#1076;&#1091;&#1083;&#1100; &#1080; &#1090;.&#1076;.
</p><p>&#1045;&#1097;&#1077; &#1086;&#1076;&#1085;&#1072; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1072;&#1103; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100; &#1080;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1080;&#1090;&#1072;&#1090;&#1086;&#1088;&#1072; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072;&#1079;&#1072;&#1076; &#1087;&#1086; &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1080; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1080; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1100; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1082;&#1086;&#1076;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077;  &#1074;&#1099; &#1091;&#1078;&#1077; &#1085;&#1072;&#1073;&#1088;&#1072;&#1083;&#1080; &#1088;&#1072;&#1085;&#1077;&#1077;. &#1044;&#1083;&#1103; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086; &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1080; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;, &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; <span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px;">Up arrow</span> &#1080;&#1083;&#1080; <span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px;">Down arrow</span>.
</p><p>&#1065;&#1077;&#1083;&#1082;&#1085;&#1091;&#1074; &#1087;&#1088;&#1072;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; &#1084;&#1099;&#1096;&#1080; &#1074; &#1086;&#1082;&#1085;&#1077; &#1080;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1080;&#1090;&#1072;&#1090;&#1086;&#1088;&#1072;, &#1091; &#1074;&#1072;&#1089; &#1090;&#1072;&#1082;&#1078;&#1077; &#1077;&#1089;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1086;&#1087;&#1094;&#1080;&#1081;, &#1090;&#1072;&#1082;&#1080;&#1093; &#1082;&#1072;&#1082; &#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1074;&#1089;&#1077;&#1081; &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1080; (&#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086; &#1076;&#1083;&#1103; &#1101;&#1082;&#1089;&#1087;&#1077;&#1088;&#1080;&#1084;&#1077;&#1085;&#1090;&#1072; &#1095;&#1090;&#1086;-&#1090;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1089;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1081; &#1101;&#1090;&#1086;&#1075;&#1086;), &#1080;&#1083;&#1080; &#1074;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1080;&#1084;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072; &#1089; &#1087;&#1086;&#1083;&#1085;&#1099;&#1084; &#1087;&#1091;&#1090;&#1077;&#1084;.
</p>
<p><a href="#top">&#1085;&#1072;&#1074;&#1077;&#1088;&#1093;</a></p>
<h3><span class="mw-headline" id="Python_Help">Python Help</span></h3>
<p>&#1042; &#1084;&#1077;&#1085;&#1102; <b>&#1057;&#1087;&#1088;&#1072;&#1074;&#1082;&#1072;</b>, &#1074;&#1099; &#1085;&#1072;&#1081;&#1076;&#1077;&#1090;&#1077; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083; <b>&#1040;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1089;&#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1072;&#1103; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; python</b>, &#1087;&#1088;&#1080; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1080;&#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1086;&#1090;&#1082;&#1088;&#1086;&#1077;&#1090;&#1089;&#1103; &#1086;&#1082;&#1085;&#1086; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1072;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1077;&#1075;&#1086; &#1087;&#1086;&#1083;&#1085;&#1091;&#1102;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1077;&#1084;&#1091;&#1102; &#1074; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;, &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1102; &#1074;&#1089;&#1077;&#1093; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1081; Python, &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1093; &#1074; &#1080;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1077;&#1090;&#1072;&#1090;&#1086;&#1088;&#1077; FreeCAD,  &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1099;&#1093; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103;&#1093; Python &#1080; FreeCAD, &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1081; &#1080; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1081; FreeCAD. &#1044;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072; &#1083;&#1080; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1090; &#1086;&#1090; &#1090;&#1086;&#1075;&#1086;, &#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1091;&#1089;&#1080;&#1083;&#1080;&#1081; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1080;&#1083; &#1082; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1102; &#1089;&#1074;&#1086;&#1077;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072;, &#1085;&#1086;, &#1082;&#1072;&#1082; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1086; Python &#1084;&#1086;&#1076;&#1091;&#1083;&#1080; &#1080;&#1084;&#1077;&#1102;&#1090; &#1088;&#1077;&#1087;&#1091;&#1090;&#1072;&#1094;&#1080;&#1102; &#1093;&#1086;&#1088;&#1086;&#1096;&#1086; &#1079;&#1072;&#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1042;&#1072;&#1096;&#1077; &#1086;&#1082;&#1085;&#1086; FreeCAD &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1086;&#1089;&#1090;&#1072;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1076;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086; &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1083;&#1072;. &#1042; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077; <b>&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1087;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1102; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1074; &#1085;&#1072; Python</b>  &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1101;&#1090;&#1086;&#1090; &#1074;&#1080;&#1082;&#1080;-&#1088;&#1072;&#1079;&#1076;&#1077;&#1083; <a href="../ru/Power_users_hub.html" title="Power users hub/ru">Power users hub</a>.
</p>
<p><a href="#top">&#1085;&#1072;&#1074;&#1077;&#1088;&#1093;</a></p>
<p><span id="Built-in_modules"></span>
</p>
<h2><span id=".D0.92.D1.81.D1.82.D1.80.D0.BE.D0.B5.D0.BD.D1.8B.D0.B5_.D0.BC.D0.BE.D0.B4.D1.83.D0.BB.D0.B8"></span><span class="mw-headline" id="&#1042;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1099;&#1077;_&#1084;&#1086;&#1076;&#1091;&#1083;&#1080;">&#1042;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1099;&#1077; &#1084;&#1086;&#1076;&#1091;&#1083;&#1080;</span></h2>
<p>&#1055;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; FreeCAD &#1089;&#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085; &#1089; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072; &#1073;&#1077;&#1079; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; (Graphical User Interface, GUI), &#1087;&#1086;&#1095;&#1090;&#1080; &#1074;&#1089;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1099; &#1085;&#1072; &#1076;&#1074;&#1077; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099;: &#1041;&#1072;&#1079;&#1086;&#1074;&#1072;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; <code>App</code>, &#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072;, &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; <code>Gui</code>. &#1069;&#1090;&#1080; &#1076;&#1074;&#1072; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; &#1084;&#1086;&#1078;&#1085;&#1086; &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1080;&#1079; &#1089;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1077;&#1074;, &#1074;&#1085;&#1077; &#1080;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1077;&#1090;&#1072;&#1090;&#1086;&#1088;&#1072;, &#1087;&#1086;&#1076; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1103;&#1084;&#1080; <code>FreeCAD</code> &#1080; <code>FreeCADGui</code> &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;.
</p>
<ul><li>&#1042; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077; <code>App</code> &#1074;&#1099; &#1085;&#1072;&#1081;&#1076;&#1077;&#1090;&#1077; &#1074;&#1089;&#1077;, &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1086;&#1077; &#1089; &#1089;&#1072;&#1084;&#1080;&#1084; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084;, &#1090;&#1072;&#1082;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1082;&#1072;&#1082; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1080;&#1103; &#1080;&#1083;&#1080; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1080;&#1103; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1082;&#1072;&#1082; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1075;&#1086; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &#1080;&#1083;&#1080; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1077;&#1075;&#1086; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1103;.</li></ul>
<ul><li>&#1042; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077; <code>Gui</code> &#1074;&#1099; &#1085;&#1072;&#1081;&#1076;&#1077;&#1090;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1076;&#1083;&#1103; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1080; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072;, &#1090;&#1072;&#1082;&#1080;&#1084;&#1080; &#1082;&#1072;&#1082; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1080; &#1080; &#1080; &#1080;&#1093; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1080;, &#1095;&#1090;&#1086; &#1073;&#1086;&#1083;&#1077;&#1077; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1086;, &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1075;&#1086; FreeCAD.</li></ul>
<p>&#1055;&#1077;&#1088;&#1077;&#1083;&#1080;&#1089;&#1090;&#1099;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1075;&#1086; &#1101;&#1090;&#1080;&#1093; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1081; &#1085;&#1077; &#1089;&#1083;&#1080;&#1096;&#1082;&#1086;&#1084; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1086;&#1085;&#1080; &#1088;&#1072;&#1089;&#1090;&#1091;&#1090; &#1076;&#1086;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086; &#1089; &#1088;&#1072;&#1079;&#1074;&#1080;&#1090;&#1080;&#1077;&#1084; FreeCAD. &#1053;&#1086; &#1076;&#1074;&#1072; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1072; (&#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1080; &#1089;&#1087;&#1088;&#1072;&#1074;&#1082;&#1072; Python) &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1090;&#1100; &#1074;&#1072;&#1089; &#1087;&#1086;&#1083;&#1085;&#1086;&#1081; &#1080; &#1072;&#1082;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1077;&#1081; &#1074; &#1083;&#1102;&#1073;&#1086;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;.
</p>
<p><a href="#top">&#1085;&#1072;&#1074;&#1077;&#1088;&#1093;</a></p>
<p><span id="The_App_and_Gui_objects"></span>
</p>
<h3><span id=".D0.9E.D0.B1.D1.8A.D0.B5.D0.BA.D1.82.D1.8B_.D0.BC.D0.BE.D0.B4.D1.83.D0.BB.D0.B5.D0.B9_App_.D0.B8_Gui"></span><span class="mw-headline" id="&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;_&#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1081;_App_&#1080;_Gui">&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1081; App &#1080; Gui</span></h3>
<p>&#1050;&#1072;&#1082; &#1084;&#1099; &#1091;&#1078;&#1077; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1083;&#1080;, &#1074; FreeCAD, &#1074;&#1089;&#1105; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1084;&#1077;&#1078;&#1076;&#1091; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1084; &#1080; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084;. &#1069;&#1090;&#1086; &#1087;&#1086;&#1076;&#1088;&#1072;&#1079;&#1091;&#1084;&#1077;&#1074;&#1072;&#1077;&#1090; &#1080; 3D-&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1102;&#1097;&#1080;&#1084; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;&#1084; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; (&#1086;&#1076;&#1085;&#1072; &#1080;&#1079; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081; FreeCAD) &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; <code>App</code>, &#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1090;&#1086;, &#1082;&#1072;&#1082; &#1086;&#1085;&#1080; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1099; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085;&#1077; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; <code>Gui</code>. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1082;&#1091;&#1073; &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1102;&#1090; &#1077;&#1075;&#1086;, &#1090;&#1072;&#1082;&#1080;&#1077; &#1082;&#1072;&#1082; &#1096;&#1080;&#1088;&#1080;&#1085;&#1072;, &#1076;&#1083;&#1080;&#1085;&#1072;, &#1074;&#1099;&#1089;&#1086;&#1090;&#1072;, &#1086;&#1085;&#1080; &#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1089;&#1103; &#1074; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1077; <code>App</code>, &#1072; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1090;&#1072;&#1082;&#1080;&#1077; &#1082;&#1072;&#1082; &#1094;&#1074;&#1077;&#1090;&#1072; &#1075;&#1088;&#1072;&#1085;&#1077;&#1081;, &#1088;&#1077;&#1078;&#1080;&#1084; &#1086;&#1090;&#1088;&#1080;&#1089;&#1086;&#1074;&#1082;&#1080;, &#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1089;&#1103; &#1074; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1084; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1077; <code>Gui</code>.
</p><p>&#1069;&#1090;&#1086;&#1090; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1077;&#1090; &#1086;&#1095;&#1077;&#1085;&#1100; &#1096;&#1080;&#1088;&#1086;&#1082;&#1080;&#1084; &#1089;&#1087;&#1077;&#1082;&#1090;&#1088;&#1086;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;, &#1082;&#1072;&#1082; &#1089; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072;&#1084;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1100;&#1102; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1081;, &#1085;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1079;&#1072;&#1073;&#1086;&#1090;&#1080;&#1090;&#1100;&#1089;&#1103; &#1086; &#1082;&#1072;&#1082;&#1086;&#1081;-&#1083;&#1080;&#1073;&#1086; &#1074;&#1080;&#1079;&#1091;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;, &#1080;&#1083;&#1080; &#1076;&#1072;&#1078;&#1077; &#1087;&#1077;&#1088;&#1077;&#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1103; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1085;&#1077;-&#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;, &#1090;&#1072;&#1082;&#1080;&#1093; &#1082;&#1072;&#1082; &#1089;&#1087;&#1080;&#1089;&#1082;&#1080;, &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1080;&#1083;&#1080; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1085;&#1099;&#1081; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;.
</p><p>&#1044;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; <code>App</code> &#1074; &#1074;&#1072;&#1096;&#1077;&#1084; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; <code>Gui</code>. &#1060;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1080; &#1089;&#1072;&#1084; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; <code>App</code> &#1080; <code>Gui</code>. &#1069;&#1090;&#1086;, &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1088;&#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1077; FreeCAD &#1089; &#1087;&#1086;&#1083;&#1085;&#1099;&#1084; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1086;&#1084;. &#1042; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072; &#1085;&#1077;&#1090;, &#1090;&#1072;&#1082; &#1095;&#1090;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; <code>App</code>. &#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1095;&#1072;&#1089;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; <code>Gui</code> &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1085;&#1086;&#1074;&#1072; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1088;&#1072;&#1079; &#1082;&#1086;&#1075;&#1076;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; <code>App</code> &#1086;&#1090;&#1084;&#1077;&#1095;&#1077;&#1085; &#1082;&#1072;&#1082; "&#1087;&#1086;&#1076;&#1083;&#1077;&#1078;&#1072;&#1097;&#1080;&#1081; &#1087;&#1077;&#1088;&#1077;&#1089;&#1095;&#1105;&#1090;&#1091;" (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1077;&#1075;&#1086; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1083;&#1089;&#1103;), &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1099; &#1084;&#1086;&#1075;&#1083;&#1080; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1085;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1077; <code>Gui</code> &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1086;&#1090;&#1077;&#1088;&#1103;&#1085;&#1099;.
</p><p>&#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1095;&#1072;&#1089;&#1090;&#1080; <code>App</code> &#1095;&#1077;&#1075;&#1086;-&#1083;&#1080;&#1073;&#1086;, &#1074;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077;:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">myObject</span> <span class="o">=</span> <span class="n">App</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">getObject</span><span class="p">(</span><span class="s2">"ObjectName"</span><span class="p">)</span>
</pre></div>
<p>&#1075;&#1076;&#1077; <code>"ObjectName"</code> &#1101;&#1090;&#1086; &#1080;&#1084;&#1103; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;. &#1042;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1074;&#1074;&#1077;&#1089;&#1090;&#1080;:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">myObject</span> <span class="o">=</span> <span class="n">App</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">ObjectName</span>
</pre></div>
<p>&#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1095;&#1072;&#1089;&#1090;&#1080; <code>Gui</code> &#1090;&#1086;&#1075;&#1086; &#1078;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;, &#1074;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077;:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">myViewObject</span> <span class="o">=</span> <span class="n">Gui</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">getObject</span><span class="p">(</span><span class="s2">"ObjectName"</span><span class="p">)</span>
</pre></div>
<p>&#1075;&#1076;&#1077; <code>"ObjectName"</code> - &#1080;&#1084;&#1103; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;. &#1042;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1074;&#1074;&#1077;&#1089;&#1090;&#1080;:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">myViewObject</span> <span class="o">=</span> <span class="n">App</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">ObjectName</span><span class="o">.</span><span class="n">ViewObject</span>
</pre></div>
<p>&#1045;&#1089;&#1083;&#1080; &#1084;&#1099; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1084;&#1089;&#1103; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1080; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072; &#1085;&#1077;&#1090;, &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1103;&#1103; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072; &#1074;&#1077;&#1088;&#1085;&#1077;&#1090; <code>None</code>.
</p>
<p><a href="#top">&#1085;&#1072;&#1074;&#1077;&#1088;&#1093;</a></p>
<p><span id="The_Document_objects"></span>
</p>
<h3><span id=".D0.9E.D0.B1.D1.8A.D0.B5.D0.BA.D1.82.D1.8B_.D0.B4.D0.BE.D0.BA.D1.83.D0.BC.D0.B5.D0.BD.D1.82.D0.B0"></span><span class="mw-headline" id="&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;_&#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;">&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;</span></h3>
<p>&#1042; FreeCAD &#1074;&#1089;&#1105;, &#1085;&#1072;&#1076; &#1095;&#1077;&#1084; &#1074;&#1099; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090;&#1077;, &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1074;&#1072;&#1096;&#1091; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1102; &#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085; &#1074; &#1092;&#1072;&#1081;&#1083;. &#1054;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;, &#1090;&#1072;&#1082;&#1078;&#1077; &#1082;&#1072;&#1082; &#1080; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1103;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1080;&#1077;&#1089;&#1103; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1085;&#1077;&#1075;&#1086;, &#1080;&#1084;&#1077;&#1077;&#1090; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; <code>App</code> &#1080; <code>Gui</code>. &#1054;&#1073;&#1098;&#1077;&#1082;&#1090; <code>App</code> &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1092;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1091;&#1102; &#1042;&#1072;&#1084;&#1080; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1102;, &#1074; &#1090;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1082;&#1072;&#1082; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; <code>Gui</code> &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080;&#1079; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1086;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1082;&#1086;&#1085;, &#1082;&#1072;&#1078;&#1076;&#1086;&#1077; &#1080;&#1079; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074;&#1072;&#1096;&#1077;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1084; &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1086;&#1084; &#1080;&#1083;&#1080; &#1090;&#1086;&#1095;&#1082;&#1086;&#1081; &#1079;&#1088;&#1077;&#1085;&#1080;&#1103;. &#1069;&#1090;&#1080; &#1074;&#1080;&#1076;&#1099; &#1074;&#1093;&#1086;&#1076;&#1103;&#1090; &#1074; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; <code>Gui</code> &#1074;&#1072;&#1096;&#1077;&#1075;&#1086; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;.
</p><p>&#1063;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1095;&#1072;&#1089;&#1090;&#1080; <code>App</code> &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1075;&#1086; (&#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1075;&#1086;) &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;, &#1074;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077;:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">myDocument</span> <span class="o">=</span> <span class="n">App</span><span class="o">.</span><span class="n">ActiveDocument</span>
</pre></div>
<p>&#1063;&#1090;&#1086;&#1073;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1081; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;, &#1074;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077;:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">myDocument</span> <span class="o">=</span> <span class="n">App</span><span class="o">.</span><span class="n">newDocument</span><span class="p">(</span><span class="s2">"Document Name"</span><span class="p">)</span>
</pre></div>
<p>&#1063;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1095;&#1072;&#1089;&#1090;&#1080; <code>Gui</code> &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1075;&#1086; (&#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1075;&#1086;) &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;, &#1074;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077;:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">myGuiDocument</span> <span class="o">=</span> <span class="n">Gui</span><span class="o">.</span><span class="n">ActiveDocument</span>
</pre></div>
<p>&#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1084;&#1091; &#1074;&#1080;&#1076;&#1091;, &#1074;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077;:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">myView</span> <span class="o">=</span> <span class="n">Gui</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">ActiveView</span>
</pre></div>
<p><a href="#top">&#1085;&#1072;&#1074;&#1077;&#1088;&#1093;</a></p>
<p><span id="Using_additional_modules"></span>
</p>
<h2><span id=".D0.98.D1.81.D0.BF.D0.BE.D0.BB.D1.8C.D0.B7.D0.BE.D0.B2.D0.B0.D0.BD.D0.B8.D0.B5_.D0.B4.D0.BE.D0.BF.D0.BE.D0.BB.D0.BD.D0.B8.D1.82.D0.B5.D0.BB.D1.8C.D0.BD.D1.8B.D1.85_.D0.BC.D0.BE.D0.B4.D1.83.D0.BB.D0.B5.D0.B9"></span><span class="mw-headline" id="&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;_&#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093;_&#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1081;">&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1081;</span></h2>
<div class="mw-translate-fuzzy">
<p>&#1052;&#1086;&#1076;&#1091;&#1083;&#1080; <code>FreeCAD</code> &#1080; <code>FreeCADGui</code> &#1086;&#1090;&#1074;&#1077;&#1095;&#1072;&#1102;&#1090; &#1079;&#1072; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1080; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084;&#1080; &#1074; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1077; FreeCAD. &#1054;&#1085;&#1080; &#1085;&#1077; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077;&#1084; &#1080;&#1083;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080;. &#1069;&#1090;&#1086; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1072; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1103; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1090;&#1080;&#1087;&#1086;&#1074;, &#1080; &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1086;&#1085;&#1072; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103;&#1084;&#1080;, &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1080;&#1079; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1086;&#1090;&#1074;&#1077;&#1095;&#1072;&#1077;&#1090; &#1079;&#1072; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084; &#1090;&#1080;&#1087;&#1086;&#1084; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, <a href="../ru/Part_Workbench.html" title="Part Workbench/ru">&#1052;&#1086;&#1076;&#1091;&#1083;&#1100; Part</a> &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1103;&#1076;&#1088;&#1086; OpenCascade &#1080; &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1080; &#1084;&#1072;&#1085;&#1080;&#1087;&#1091;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1077;&#1081; &#1090;&#1080;&#1087;&#1072; <a rel="nofollow" class="external text" href="http://en.wikipedia.org/wiki/Boundary_representation">B-rep</a>. &#1042; &#1090;&#1086; &#1078;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; <a href="../ru/Mesh_Workbench.html" title="Mesh Workbench/ru">&#1052;&#1086;&#1076;&#1091;&#1083;&#1100; Mesh</a> &#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1080; &#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1090;&#1080;&#1087;&#1072; &#1089;&#1077;&#1090;&#1082;&#1072;. &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, FreeCAD &#1084;&#1086;&#1078;&#1077;&#1090; &#1086;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1090;&#1100; &#1089;&#1072;&#1084;&#1099;&#1077; &#1088;&#1072;&#1079;&#1085;&#1099;&#1077; &#1090;&#1080;&#1087;&#1099; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1089;&#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; &#1086;&#1076;&#1085;&#1086;&#1084; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1077;, &#1080; &#1085;&#1086;&#1074;&#1099;&#1077; &#1090;&#1080;&#1087;&#1099; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1083;&#1077;&#1075;&#1082;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1099; &#1074; &#1073;&#1091;&#1076;&#1091;&#1097;&#1077;&#1084;.
</p>
</div>
<p><a href="#top">&#1085;&#1072;&#1074;&#1077;&#1088;&#1093;</a></p>
<p><span id="Creating_objects"></span>
</p>
<h3><span id=".D0.A1.D0.BE.D0.B7.D0.B4.D0.B0.D0.BD.D0.B8.D0.B5_.D0.BE.D0.B1.D1.8A.D0.B5.D0.BA.D1.82.D0.BE.D0.B2"></span><span class="mw-headline" id="&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077;_&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;">&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;</span></h3>
<p>&#1050;&#1072;&#1078;&#1076;&#1099;&#1081; &#1084;&#1086;&#1076;&#1091;&#1083;&#1100; &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1074;&#1086;&#1081; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1089;&#1074;&#1086;&#1077;&#1081; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080;, &#1085;&#1086; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1086;&#1085;&#1080; &#1074;&#1089;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1074; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1077;. &#1053;&#1086; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; FreeCAD &#1090;&#1072;&#1082;&#1078;&#1077; &#1079;&#1085;&#1072;&#1077;&#1090; &#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1093; &#1090;&#1080;&#1087;&#1072;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084;&#1099;&#1093; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103;&#1084;&#1080;:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">FreeCAD</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">supportedTypes</span><span class="p">()</span>
</pre></div>
<p>&#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1080;&#1090; &#1074;&#1089;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1076;&#1072;&#1074;&#1072;&#1081;&#1090;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1076;&#1080;&#1084; &#1089;&#1077;&#1090;&#1082;&#1091; (&#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1091;&#1102; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1084; <code>Mesh</code>) &#1080; &#1076;&#1077;&#1090;&#1072;&#1083;&#1100; (&#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1091;&#1102; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1084; <code>Part</code>):
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">myMesh</span> <span class="o">=</span> <span class="n">FreeCAD</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">addObject</span><span class="p">(</span><span class="s2">"Mesh::Feature"</span><span class="p">,</span> <span class="s2">"myMeshName"</span><span class="p">)</span>
<span class="n">myPart</span> <span class="o">=</span> <span class="n">FreeCAD</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">addObject</span><span class="p">(</span><span class="s2">"Part::Feature"</span><span class="p">,</span> <span class="s2">"myPartName"</span><span class="p">)</span>
</pre></div>
<p>&#1055;&#1077;&#1088;&#1074;&#1099;&#1081; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090; - &#1101;&#1090;&#1086; &#1090;&#1080;&#1087; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;, &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; - &#1080;&#1084;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;. &#1053;&#1072;&#1096;&#1080; &#1076;&#1074;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1103;&#1090; &#1087;&#1086;&#1095;&#1090;&#1080; &#1086;&#1076;&#1080;&#1085;&#1072;&#1082;&#1086;&#1074;&#1086;: &#1086;&#1085;&#1080; &#1077;&#1097;&#1077; &#1085;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090; &#1085;&#1080;&#1082;&#1072;&#1082;&#1086;&#1081; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080;, &#1080; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1080;&#1093; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; &#1086;&#1076;&#1080;&#1085;&#1072;&#1082;&#1086;&#1074;&#1099;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1074;&#1099; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1103;&#1077;&#1090;&#1077; &#1080;&#1093; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <code>dir(myMesh)</code> &#1080; <code>dir(myPart)</code>. &#1047;&#1072; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086;, <code>myMesh</code> &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; <code>Mesh</code>, &#1072; <code>myPart</code> - &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; <code>Shape</code>. &#1047;&#1076;&#1077;&#1089;&#1100; &#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1089;&#1103; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; Mesh &#1080; Part. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1076;&#1072;&#1074;&#1072;&#1081;&#1090;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1076;&#1080;&#1084; &#1082;&#1091;&#1073; <code>Part</code> &#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1084; &#1077;&#1075;&#1086; &#1074; &#1085;&#1072;&#1096;&#1077;&#1084; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1077; <code>myPart</code>:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="kn">import</span> <span class="nn">Part</span>
<span class="n">cube</span> <span class="o">=</span> <span class="n">Part</span><span class="o">.</span><span class="n">makeBox</span><span class="p">(</span><span class="mi">2</span><span class="p">,</span> <span class="mi">2</span><span class="p">,</span> <span class="mi">2</span><span class="p">)</span>
<span class="n">myPart</span><span class="o">.</span><span class="n">Shape</span> <span class="o">=</span> <span class="n">cube</span>
</pre></div>
<p>&#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1086;&#1087;&#1099;&#1090;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1082;&#1091;&#1073; &#1074; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1077; <code>Mesh</code> &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; <code>myMesh</code>, &#1086;&#1085; &#1074;&#1077;&#1088;&#1085;&#1077;&#1090; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1077; &#1085;&#1077;&#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1090;&#1080;&#1087;&#1072;. &#1069;&#1090;&#1086; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1080;&#1079;-&#1079;&#1072; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1082;&#1072;&#1078;&#1076;&#1086;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1099; &#1076;&#1083;&#1103; &#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1090;&#1080;&#1087;&#1072;. &#1042; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1077; <code>Mesh</code> &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1086; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; <code>Mesh</code>. &#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1081; &#1090;&#1072;&#1082;&#1078;&#1077; &#1080;&#1084;&#1077;&#1102;&#1090; &#1103;&#1088;&#1083;&#1099;&#1082; &#1076;&#1083;&#1103; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1074;&#1086;&#1077;&#1081; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080; &#1074; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="kn">import</span> <span class="nn">Part</span>
<span class="n">cube</span> <span class="o">=</span> <span class="n">Part</span><span class="o">.</span><span class="n">makeBox</span><span class="p">(</span><span class="mi">2</span><span class="p">,</span> <span class="mi">2</span><span class="p">,</span> <span class="mi">2</span><span class="p">)</span>
<span class="n">Part</span><span class="o">.</span><span class="n">show</span><span class="p">(</span><span class="n">cube</span><span class="p">)</span>
</pre></div>
<p><a href="#top">&#1085;&#1072;&#1074;&#1077;&#1088;&#1093;</a></p>
<p><span id="Modifying_objects"></span>
</p>
<h3><span id=".D0.98.D0.B7.D0.BC.D0.B5.D0.BD.D0.B5.D0.BD.D0.B8.D0.B5_.D0.BE.D0.B1.D1.8A.D0.B5.D0.BA.D1.82.D0.BE.D0.B2"></span><span class="mw-headline" id="&#1048;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;_&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;">&#1048;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;</span></h3>
<p>&#1052;&#1086;&#1076;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1090;&#1072;&#1082; &#1078;&#1077;:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="kn">import</span> <span class="nn">Part</span>
<span class="n">cube</span> <span class="o">=</span> <span class="n">Part</span><span class="o">.</span><span class="n">makeBox</span><span class="p">(</span><span class="mi">2</span><span class="p">,</span> <span class="mi">2</span><span class="p">,</span> <span class="mi">2</span><span class="p">)</span>
<span class="n">myPart</span><span class="o">.</span><span class="n">Shape</span> <span class="o">=</span> <span class="n">cube</span>
</pre></div>
<p>&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1076;&#1072;&#1074;&#1072;&#1081;&#1090;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1084; &#1092;&#1086;&#1088;&#1084;&#1091; &#1085;&#1072; &#1073;&#1086;&#1083;&#1100;&#1096;&#1091;&#1102;:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">biggercube</span> <span class="o">=</span> <span class="n">Part</span><span class="o">.</span><span class="n">makeBox</span><span class="p">(</span><span class="mi">5</span><span class="p">,</span> <span class="mi">5</span><span class="p">,</span> <span class="mi">5</span><span class="p">)</span>
<span class="n">myPart</span><span class="o">.</span><span class="n">Shape</span> <span class="o">=</span> <span class="n">biggercube</span>
</pre></div>
<p><a href="#top">&#1085;&#1072;&#1074;&#1077;&#1088;&#1093;</a></p>
<p><span id="Querying_objects"></span>
</p>
<h3><span id=".D0.97.D0.B0.D0.BF.D1.80.D0.BE.D1.81_.D0.BE.D0.B1.D1.8A.D0.B5.D0.BA.D1.82.D0.BE.D0.B2"></span><span class="mw-headline" id="&#1047;&#1072;&#1087;&#1088;&#1086;&#1089;_&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;">&#1047;&#1072;&#1087;&#1088;&#1086;&#1089; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;</span></h3>
<p>&#1042;&#1099; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1085;&#1072; &#1090;&#1080;&#1087; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">myObj</span> <span class="o">=</span> <span class="n">FreeCAD</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">getObject</span><span class="p">(</span><span class="s2">"myObjectName"</span><span class="p">)</span>
<span class="nb">print</span><span class="p">(</span><span class="n">myObj</span><span class="o">.</span><span class="n">TypeId</span><span class="p">)</span>
</pre></div>
<p>&#1080;&#1083;&#1080; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100;, &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1083;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1085;&#1099;&#1084; &#1086;&#1090; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; (&#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080;, &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1089;&#1077;&#1090;&#1082;&#1080; &#1080; &#1090;.&#1076;.):
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="nb">print</span><span class="p">(</span><span class="n">myObj</span><span class="o">.</span><span class="n">isDerivedFrom</span><span class="p">(</span><span class="s2">"Part::Feature"</span><span class="p">))</span>
</pre></div>
<p>&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1074;&#1099; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1095;&#1072;&#1090;&#1100; &#1080;&#1075;&#1088;&#1072;&#1090;&#1100; &#1089; FreeCAD! &#1053;&#1072;&#1089;&#1095;&#1105;&#1090; &#1087;&#1086;&#1083;&#1085;&#1086;&#1075;&#1086; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1074;&#1089;&#1077;&#1093; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1093; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1081; &#1080; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1093; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; &#1074; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077; <a href="../Category;API.html" title="Category:API">Category:API</a>.
</p>
<p><a href="#top">&#1085;&#1072;&#1074;&#1077;&#1088;&#1093;</a></p>
<div class="mw-translate-fuzzy">
<div class="docnav" style="background-color: #ececef; border: 1px solid #a2a9b1; padding: 2px 10px; margin: 10px 0; line-height: 1; clear: both; overflow: hidden;">
    <div style="margin: 4px 0; float: left;"><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-left.svg" decoding="async" width="16" height="16"></span></span> <a href="../ru/Python_scripting_tutorial.html" title="Python scripting tutorial/ru">Python scripting tutorial</a></div>
    <div style="margin: 4px 0; float: right;"><a href="../ru/Topological_data_scripting.html" title="Topological data scripting/ru">Topological data scripting</a>
 <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-right.svg" decoding="async" width="16" height="16"></span></span></div>
    <div style="text-align:center"><a href="../ru/Online_Help_Toc.html" title="Online Help Toc/ru">&#1054;&#1075;&#1083;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;</a> <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Online_Help_Toc.svg" decoding="async" width="24" height="24"></span></span></div>
</div>
</div>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: #fefefe;"><span typeof="mw:File"><a href="../index.php?title=Power_user_hub.png&amp;filetimestamp=20200511213015&amp;.html" class="mw-file-description"><img src="../File/Power_user_hub.png" decoding="async" width="24" height="24"></a></span> <a href="../ru/Power_users_hub.html" title="Power users hub/ru">Power user documentation</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid #aaaaaa; text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: #fefefe;">
<ul><li><b>FreeCAD scripting:</b> <a href="../ru/Python.html" title="Python/ru">Python</a>, <a href="../ru/Introduction_to_Python.html" title="Introduction to Python/ru">Introduction to Python</a>, <a href="../ru/Python_scripting_tutorial.html" title="Python scripting tutorial/ru">Python scripting tutorial</a>, <a class="mw-selflink selflink">FreeCAD Scripting Basics</a></li></ul>
<hr>
<ul><li><b>Modules:</b> <a href="../ru/Builtin_modules.html" title="Builtin modules/ru">Builtin modules</a>, <a href="../ru/Units.html" title="Units/ru">Units</a>, <a href="../index.php?title=Quantity/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Quantity/ru (page does not exist)">Quantity</a></li>
<li><b>Workbenches:</b> <a href="../ru/Workbench_creation.html" title="Workbench creation/ru">Workbench creation</a>, <a href="../ru/Gui_Command.html" title="Gui Command/ru">Gui Commands</a>, <a href="../ru/Command.html" title="Command/ru">Commands</a>, <a href="../ru/Installing_more_workbenches.html" title="Installing more workbenches/ru">Installing more workbenches</a></li>
<li><b>Meshes and Parts:</b> <a href="../ru/Mesh_Scripting.html" title="Mesh Scripting/ru">Mesh Scripting</a>, <a href="../ru/Topological_data_scripting.html" title="Topological data scripting/ru">Topological data scripting</a>, <a href="../ru/Mesh_to_Part.html" title="Mesh to Part/ru">Mesh to Part</a>, <a href="../ru/PythonOCC.html" title="PythonOCC/ru">PythonOCC</a></li></ul>
<hr>
<ul><li><b>Parametric objects:</b> <a href="../ru/Scripted_objects.html" title="Scripted objects/ru">Scripted objects</a>, <a href="../ru/Viewprovider.html" title="Viewprovider/ru">Viewproviders</a> <small>(<a href="../index.php?title=Custom_icon_in_tree_view/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Custom icon in tree view/ru (page does not exist)">Custom icon in tree view</a>)</small></li>
<li><b>Scenegraph:</b> <a href="../ru/Scenegraph.html" title="Scenegraph/ru">Coin (Inventor) scenegraph</a>, <a href="../ru/Pivy.html" title="Pivy/ru">Pivy</a></li>
<li><b>Graphical interface:</b> <a href="../ru/Interface_creation.html" title="Interface creation/ru">Interface creation</a>, <a href="../ru/Dialog_creation.html" title="Dialog creation/ru">Interface creation completely in Python</a> <small>(<a href="../index.php?title=Dialog_creation_with_various_widgets/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation with various widgets/ru (page does not exist)">1</a>, <a href="../index.php?title=Dialog_creation_reading_and_writing_files/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation reading and writing files/ru (page does not exist)">2</a>, <a href="../index.php?title=Dialog_creation_setting_colors/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation setting colors/ru (page does not exist)">3</a>, <a href="../index.php?title=Dialog_creation_image_and_animated_GIF/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation image and animated GIF/ru (page does not exist)">4</a>, <a href="../index.php?title=PySide_usage_snippets/ru&amp;action=edit&amp;redlink=1.html" class="new" title="PySide usage snippets/ru (page does not exist)">5</a>)</small>, <a href="../ru/PySide.html" title="PySide/ru">PySide</a>, PySide examples <a href="../ru/PySide_Beginner_Examples.html" title="PySide Beginner Examples/ru">beginner</a>, <a href="../ru/PySide_Intermediate_Examples.html" title="PySide Intermediate Examples/ru">intermediate</a>, <a href="../ru/PySide_Advanced_Examples.html" title="PySide Advanced Examples/ru">advanced</a></li>
<li><b>Macros:</b> <a href="../ru/Macros.html" title="Macros/ru">Macros</a>, <a href="../ru/How_to_install_macros.html" title="How to install macros/ru">How to install macros</a></li>
<li><b>Embedding:</b> <a href="../ru/Embedding_FreeCAD.html" title="Embedding FreeCAD/ru">Embedding FreeCAD</a>, <a href="../ru/Embedding_FreeCADGui.html" title="Embedding FreeCADGui/ru">Embedding FreeCADGui</a></li></ul>
<hr>
<ul><li><b>Other:</b> <a href="../ru/Expressions.html" title="Expressions/ru">Expressions</a>, <a href="../ru/Code_snippets.html" title="Code snippets/ru">Code snippets</a>, <a href="../ru/Line_drawing_function.html" title="Line drawing function/ru">Line drawing function</a>, <a href="../ru/FreeCAD_vector_math_library.html" title="FreeCAD vector math library/ru">FreeCAD vector math library</a> <small>(deprecated)</small></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="../ru/User_hub.html" title="User hub/ru">User hub</a>, <a href="../ru/Power_users_hub.html" title="Power users hub/ru">Power users hub</a>, <a href="../ru/Developer_hub.html" title="Developer hub/ru">Developer hub</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20250621221807
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc, no&#8208;toc&#8208;conversion]
CPU time usage: 0.183 seconds
Real time usage: 0.296 seconds
Preprocessor visited node count: 762/1000000
Post&#8208;expand include size: 11552/2097152 bytes
Template argument size: 4035/2097152 bytes
Highest expansion depth: 5/100
Expensive parser function count: 16/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 11146/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   39.014      1 -total
 23.21%    9.057      1 Template:Powerdocnavi/ru
 19.31%    7.533     16 Template:Code
 11.51%    4.491      9 Template:Top
  8.47%    3.305      2 Template:Docnav/ru
  7.97%    3.108     51 Template:Incode
  5.94%    2.319      1 Template:Navigation_menu_2
  5.31%    2.070      2 Template:KEY
  3.09%    1.207      4 Template:MenuCommand
  2.67%    1.043      1 Template:TOCright
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:986-0!canonical and timestamp 20250621221807 and revision id 1594634. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>