<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Frequently asked questions/ru</span></h1><?xml encoding="UTF-8"><div class="mw-parser-output"><div class="mw-pt-languages noprint" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../de/Frequently_asked_questions.html" class="mw-pt-progress mw-pt-progress--high" title="H&auml;ufig gestellte Fragen (78% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Frequently_asked_questions.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Frequently asked questions (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/Frequently_asked_questions.html" class="mw-pt-progress mw-pt-progress--med" title="PREGUNTAS FRECUENTES (50% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/Frequently_asked_questions.html" class="mw-pt-progress mw-pt-progress--complete" title="Foire aux questions (85% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../hr/Frequently_asked_questions.html" class="mw-pt-progress mw-pt-progress--stub" title="Frequently asked questions/hr (1% translated)" lang="hr" dir="ltr">hrvatski</a></li>
<li><a href="../it/Frequently_asked_questions.html" class="mw-pt-progress mw-pt-progress--complete" title="Domande frequenti (85% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Frequently_asked_questions.html" class="mw-pt-progress mw-pt-progress--complete" title="Najcz&#281;&#347;ciej zadawane pytania (85% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt-br/Frequently_asked_questions.html" class="mw-pt-progress mw-pt-progress--high" title="Perguntas mais freq&uuml;entes (64% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--med" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</span></li>
<li><a href="../ja/Frequently_asked_questions.html" class="mw-pt-progress mw-pt-progress--stub" title="FAQ (1% translated)" lang="ja" dir="ltr">&#26085;&#26412;&#35486;</a></li>
<li><a href="../ko/Frequently_asked_questions.html" class="mw-pt-progress mw-pt-progress--med" title="&#51088;&#51452;&#54616;&#45716; &#51656;&#47928; (41% translated)" lang="ko" dir="ltr">&#54620;&#44397;&#50612;</a></li></ul></div>
<div class="docnav" style="background-color: #ececef; border: 1px solid #a2a9b1; padding: 2px 10px; margin: 10px 0; line-height: 1; clear: both; overflow: hidden;">
    <div style="margin: 4px 0; float: left;"><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-left.svg" decoding="async" width="16" height="16"></span></span> <a href="../ru/Import_Export.html" title="Import Export/ru">&#1048;&#1084;&#1087;&#1086;&#1088;&#1090; &#1080; &#1069;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;</a></div>
    <div style="margin: 4px 0; float: right;"><a href="../ru/Tutorials.html" title="Tutorials/ru">&#1059;&#1095;&#1077;&#1073;&#1085;&#1099;&#1077; &#1087;&#1086;&#1089;&#1086;&#1073;&#1080;&#1103;</a>
 <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-right.svg" decoding="async" width="16" height="16"></span></span></div>
    <div style="text-align:center"><a href="../ru/Online_Help_Toc.html" title="Online Help Toc/ru">&#1054;&#1075;&#1083;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;</a> <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Online_Help_Toc.svg" decoding="async" width="24" height="24"></span></span></div>
</div>
<div class="mw-translate-fuzzy">
<p>&#1053;&#1072; &#1101;&#1090;&#1086;&#1081; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1089;&#1103; &#1086;&#1090;&#1074;&#1077;&#1090;&#1099; &#1085;&#1072; &#1089;&#1072;&#1084;&#1099;&#1077; &#1095;&#1072;&#1089;&#1090;&#1086; &#1079;&#1072;&#1076;&#1072;&#1074;&#1072;&#1077;&#1084;&#1099;&#1077; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099; &#1085;&#1072; &#1092;&#1086;&#1088;&#1091;&#1084;&#1077; FreeCAD. &#1045;&#1089;&#1083;&#1080; &#1091; &#1074;&#1072;&#1089; &#1077;&#1089;&#1090;&#1100; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1080;&#1083;&#1080; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;, &#1082;&#1072;&#1089;&#1072;&#1102;&#1097;&#1080;&#1081;&#1089;&#1103; FreeCAD, &#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1091;&#1081;&#1090;&#1077; &#1085;&#1072;&#1081;&#1090;&#1080; &#1085;&#1072; &#1085;&#1077;&#1075;&#1086; &#1086;&#1090;&#1074;&#1077;&#1090; &#1085;&#1072; &#1101;&#1090;&#1086;&#1081; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077;. &#1047;&#1072;&#1090;&#1077;&#1084;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1085;&#1077; &#1089;&#1084;&#1086;&#1075;&#1083;&#1080; &#1085;&#1072;&#1081;&#1090;&#1080; &#1086;&#1090;&#1074;&#1077;&#1090; &#1085;&#1072; &#1074;&#1072;&#1096; &#1089;&#1087;&#1077;&#1094;&#1080;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;, &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077;&#1089;&#1100; &#1085;&#1072; <a rel="nofollow" class="external text" href="http://forum.freecadweb.org/viewforum.php?f=3">&#1092;&#1086;&#1088;&#1091;&#1084; FreeCAD</a>!
</p>
</div>
<p><span id="Installation"></span>
</p>
<meta property="mw:PageProp/toc">
<h2><span id=".D0.A3.D1.81.D1.82.D0.B0.D0.BD.D0.BE.D0.B2.D0.BA.D0.B0"></span><span class="mw-headline" id="&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072;">&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072;</span></h2>
<p><span id="What_is_the_easiest_way_to_install_FreeCAD_on_my_system?"></span>
</p>
<h3><span id=".D0.9A.D0.B0.D0.BA_.D0.BF.D1.80.D0.BE.D1.89.D0.B5_.D0.B2.D1.81.D0.B5.D0.B3.D0.BE_.D1.83.D1.81.D1.82.D0.B0.D0.BD.D0.BE.D0.B2.D0.B8.D1.82.D1.8C_FreeCAD_.D0.B2_.D0.BC.D0.BE.D0.B5.D0.B9_.D1.81.D0.B8.D1.81.D1.82.D0.B5.D0.BC.D0.B5.3F"></span><span class="mw-headline" id="&#1050;&#1072;&#1082;_&#1087;&#1088;&#1086;&#1097;&#1077;_&#1074;&#1089;&#1077;&#1075;&#1086;_&#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100;_FreeCAD_&#1074;_&#1084;&#1086;&#1077;&#1081;_&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077;?">&#1050;&#1072;&#1082; &#1087;&#1088;&#1086;&#1097;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; FreeCAD &#1074; &#1084;&#1086;&#1077;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077;?</span></h3>
<p>&#1045;&#1089;&#1083;&#1080; &#1042;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1077; Windows &#1080;&#1083;&#1080; macOS, &#1090;&#1086; &#1089;&#1072;&#1084;&#1099;&#1081; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1076;&#1083;&#1103; &#1042;&#1072;&#1089; - &#1087;&#1077;&#1088;&#1077;&#1081;&#1090;&#1080; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; <a href="../ru/Download.html" title="Download/ru">&#1047;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080;</a>, &#1075;&#1076;&#1077; &#1074;&#1099; &#1085;&#1072;&#1081;&#1076;&#1105;&#1090;&#1077; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1075;&#1086;&#1090;&#1086;&#1074;&#1099;&#1093; &#1076;&#1083;&#1103; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074;. &#1045;&#1089;&#1083;&#1080; &#1042;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1077; Debian, Fedora, Ubuntu &#1080;&#1083;&#1080; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074;, &#1090;&#1086; FreeCAD &#1091;&#1078;&#1077; &#1074;&#1082;&#1083;&#1102;&#1095;&#1105;&#1085; &#1074; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1077; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1080; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;. &#1053;&#1072; Ubuntu &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; FreeCAD &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; <a href="../Installing_on_Linux.html#Stable_PPA_version" title="Installing on Linux">PPA &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1081;</a>. &#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1089;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1077; &#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1076;&#1083;&#1103; &#1074;&#1072;&#1096;&#1077;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; (<a href="../ru/Installing_on_Windows.html" title="Installing on Windows/ru">Windows</a>, <a href="../ru/Installing_on_Linux.html" title="Installing on Linux/ru">Linux</a> &#1080;&#1083;&#1080; <a href="../ru/Installing_on_Mac.html" title="Installing on Mac/ru">Mac</a>).
</p><p><span id="What_are_the_prerequisites_for_running_FreeCAD?"></span>
</p>
<h3><span id=".D0.9A.D0.B0.D0.BA.D0.B8.D0.B5_.D1.81.D0.B8.D1.81.D1.82.D0.B5.D0.BC.D0.BD.D1.8B.D0.B5_.D1.82.D1.80.D0.B5.D0.B1.D0.BE.D0.B2.D0.B0.D0.BD.D0.B8.D1.8F_.D0.B4.D0.BB.D1.8F_.D0.B7.D0.B0.D0.BF.D1.83.D1.81.D0.BA.D0.B0_FreeCAD.3F"></span><span class="mw-headline" id="&#1050;&#1072;&#1082;&#1080;&#1077;_&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1099;&#1077;_&#1090;&#1088;&#1077;&#1073;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;_&#1076;&#1083;&#1103;_&#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;_FreeCAD?">&#1050;&#1072;&#1082;&#1080;&#1077; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1099;&#1077; &#1090;&#1088;&#1077;&#1073;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072; FreeCAD?</span></h3>
<p>&#1042; &#1086;&#1090;&#1083;&#1080;&#1095;&#1080;&#1077; &#1086;&#1090; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1072; 3D CAD &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;, FreeCAD &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1077;&#1079; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1085;&#1072; &#1089;&#1072;&#1084;&#1099;&#1093; &#1089;&#1082;&#1088;&#1086;&#1084;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072;&#1093; &mdash; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1086;&#1085; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1085;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072;&#1093; Pentium IV &#1080; Intel Core2 Solo. &#1045;&#1089;&#1083;&#1080; &#1085;&#1072; &#1074;&#1072;&#1096;&#1077;&#1084; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1072; &#1089;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1072;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1072;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;, &#1089;&#1082;&#1086;&#1088;&#1077;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086;, FreeCAD &#1073;&#1091;&#1076;&#1077;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100;. &#1045;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077;&#1084; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1074;&#1072;&#1096;&#1072; &#1074;&#1080;&#1076;&#1077;&#1086;&#1082;&#1072;&#1088;&#1090;&#1072; &#1080;&#1083;&#1080; &#1095;&#1080;&#1087;&#1089;&#1077;&#1090; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1090;&#1100; <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/OpenGL">OpenGL</a>, &#1078;&#1077;&#1083;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1085;&#1077; &#1089;&#1090;&#1072;&#1088;&#1096;&#1077; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 2.0. &#1042; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1085;&#1086;&#1074;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077;&#1089;&#1100; &#1082; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1091; <a class="mw-selflink-fragment" href="#Troubleshooting">&#1059;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;</a> FAQ.
</p><p><span id="Multithreading"></span>
</p>
<h4><span id=".D0.9C.D0.BD.D0.BE.D0.B3.D0.BE.D0.BF.D0.BE.D1.82.D0.BE.D1.87.D0.BD.D0.BE.D1.81.D1.82.D1.8C"></span><span class="mw-headline" id="&#1052;&#1085;&#1086;&#1075;&#1086;&#1087;&#1086;&#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;">&#1052;&#1085;&#1086;&#1075;&#1086;&#1087;&#1086;&#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;</span></h4>
<div class="mw-translate-fuzzy">
<p>&#1041;&#1072;&#1079;&#1086;&#1074;&#1086;&#1077; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1103;&#1076;&#1088;&#1086; FreeCAD, &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1103;&#1103; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; <a rel="nofollow" class="external text" href="http://ru.wikipedia.org/wiki/Open_Cascade_Technology">OpenCASCADE Technology</a> (OCCT), <a rel="nofollow" class="external text" href="https://forum.freecadweb.org/viewtopic.php?f=4&amp;t=17501&amp;p=173095&amp;hilit=Multithread#p173095">&#1074; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1077;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1080;&#1084;&#1077;&#1077;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1095;&#1072;&#1089;&#1090;&#1080;&#1095;&#1085;&#1091;&#1102; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1091; &#1084;&#1085;&#1086;&#1075;&#1086;&#1087;&#1086;&#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080;</a>. &#1055;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086;&#1089;&#1090;&#1080; &#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; <a href="../ru/Multithreading.html" title="Multithreading/ru">&#1084;&#1085;&#1086;&#1075;&#1086;&#1087;&#1086;&#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;</a>.
</p>
</div>
<p><span id="What_if_I_want_to_compile_FreeCAD_myself?"></span>
</p>
<h3><span id=".D0.A7.D1.82.D0.BE.2C_.D0.B5.D1.81.D0.BB.D0.B8_.D0.AF_.D1.85.D0.BE.D1.87.D1.83_.D1.81.D0.BA.D0.BE.D0.BC.D0.BF.D0.B8.D0.BB.D0.B8.D1.80.D0.BE.D0.B2.D0.B0.D1.82.D1.8C_FreeCAD_.D1.81.D0.B0.D0.BC.D0.BE.D1.81.D1.82.D0.BE.D1.8F.D1.82.D0.B5.D0.BB.D1.8C.D0.BD.D0.BE.3F"></span><span class="mw-headline" id="&#1063;&#1090;&#1086;,_&#1077;&#1089;&#1083;&#1080;_&#1071;_&#1093;&#1086;&#1095;&#1091;_&#1089;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;_FreeCAD_&#1089;&#1072;&#1084;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;?">&#1063;&#1090;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1071; &#1093;&#1086;&#1095;&#1091; &#1089;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; FreeCAD &#1089;&#1072;&#1084;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;?</span></h3>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>The source code of FreeCAD is always available in the project source code repository. Compiling FreeCAD yourself allows you to use the most recent features being developed, but requires a bit of computer knowledge, although the procedure is fairly simple. Access to the source code is explained <a href="../Compile_on_Linux.html#Getting_the_source" title="Compile on Linux">here</a>, and we have detailed instructions for compiling on <a href="../Compile_on_Windows.html" title="Compile on Windows">Windows</a>, <a href="../Compile_on_Linux.html" title="Compile on Linux">Linux</a> and <a href="../Compile_on_MacOS.html" title="Compile on MacOS">macOS</a>.
</p>
</div>
<p><span id="FreeCAD_tells_me_some_module_or_application_is_missing"></span>
</p>
<h3><span id="FreeCAD_.D1.81.D0.BE.D0.BE.D0.B1.D1.89.D0.B0.D0.B5.D1.82.2C_.D1.87.D1.82.D0.BE_.D0.BA.D0.B0.D0.BA.D0.BE.D0.B9-.D1.82.D0.BE_.D0.BC.D0.BE.D0.B4.D1.83.D0.BB.D1.8C_.D0.B8.D0.BB.D0.B8_.D0.BF.D1.80.D0.B8.D0.BB.D0.BE.D0.B6.D0.B5.D0.BD.D0.B8.D0.B5_.D0.BE.D1.82.D1.81.D1.83.D1.82.D1.81.D1.82.D0.B2.D1.83.D0.B5.D1.82"></span><span class="mw-headline" id="FreeCAD_&#1089;&#1086;&#1086;&#1073;&#1097;&#1072;&#1077;&#1090;,_&#1095;&#1090;&#1086;_&#1082;&#1072;&#1082;&#1086;&#1081;-&#1090;&#1086;_&#1084;&#1086;&#1076;&#1091;&#1083;&#1100;_&#1080;&#1083;&#1080;_&#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;_&#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090;">FreeCAD &#1089;&#1086;&#1086;&#1073;&#1097;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1082;&#1072;&#1082;&#1086;&#1081;-&#1090;&#1086; &#1084;&#1086;&#1076;&#1091;&#1083;&#1100; &#1080;&#1083;&#1080; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090;</span></h3>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>FreeCAD depends on a lot of things to offer all its functionality. All the main required components are usually bundled within your FreeCAD installation or provided by your package manager, so normally you have nothing to worry about. If you installed FreeCAD from unofficial sources, however, or compiled FreeCAD yourself, some piece might be missing, which is not critical to FreeCAD itself, but might cause some functionality to be unavailable. Some specific file formats such as Collada or DWG also require extra components, which cannot be bundled into FreeCAD, and must be installed by yourself separately.
</p>
</div> 
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>All those components and the appropriate way to install them are listed on the <a href="../Extra_python_modules.html" title="Extra python modules">Extra python modules</a> page.
</p>
</div>
<p><span id="Troubleshooting"></span>
</p>
<h2><span id=".D0.A3.D1.81.D1.82.D1.80.D0.B0.D0.BD.D0.B5.D0.BD.D0.B8.D0.B5_.D0.BF.D1.80.D0.BE.D0.B1.D0.BB.D0.B5.D0.BC"></span><span class="mw-headline" id="&#1059;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077;_&#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;">&#1059;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;</span></h2>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span class="mw-headline" id="Known_OS-specific_issues">Known OS-specific issues</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Find known OS-specific issues in this <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=30573">forum thread</a>
</p>
</div>
<p><span id="FreeCAD_doesn't_start_at_all"></span>
</p>
<h3><span id="FreeCAD_.D0.B2.D0.BE.D0.BE.D0.B1.D1.89.D0.B5_.D0.BD.D0.B5_.D0.B7.D0.B0.D0.BF.D1.83.D1.81.D0.BA.D0.B0.D0.B5.D1.82.D1.81.D1.8F"></span><span class="mw-headline" id="FreeCAD_&#1074;&#1086;&#1086;&#1073;&#1097;&#1077;_&#1085;&#1077;_&#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090;&#1089;&#1103;">FreeCAD &#1074;&#1086;&#1086;&#1073;&#1097;&#1077; &#1085;&#1077; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090;&#1089;&#1103;</span></h3>
<div class="mw-translate-fuzzy">
<p>&#1055;&#1088;&#1080;&#1095;&#1080;&#1085; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1084;&#1085;&#1086;&#1075;&#1086;, &#1089;&#1082;&#1086;&#1088;&#1077;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086;, &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1082;&#1072;&#1082;&#1072;&#1103;-&#1090;&#1086; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072;. &#1055;&#1086;&#1087;&#1088;&#1086;&#1073;&#1091;&#1081;&#1090;&#1077; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; FreeCAD &#1080;&#1079; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1072;&#1083;&#1072; (&#1074;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">freecad</span> &#1074; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1072;&#1083;&#1072;, <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">FreeCAD</span> &#1074; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1093;) &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100;, &#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1083;&#1080; &#1082;&#1072;&#1082;&#1080;&#1077;-&#1083;&#1080;&#1073;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093;. &#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1081;&#1090;&#1077; &#1086;&#1089;&#1090;&#1072;&#1074;&#1096;&#1091;&#1102;&#1089;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1101;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1076;&#1072;&#1090;&#1100; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1089;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;. &#1045;&#1089;&#1083;&#1080; &#1085;&#1080;&#1095;&#1077;&#1075;&#1086; &#1085;&#1077; &#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1077;&#1090;, &#1088;&#1072;&#1089;&#1089;&#1082;&#1072;&#1078;&#1080;&#1090;&#1077; &#1086;&#1073; &#1101;&#1090;&#1086;&#1084; &#1085;&#1072;  <a rel="nofollow" class="external autonumber" href="http://forum.freecadweb.org/forum">[1]</a>, &#1085;&#1072;&#1074;&#1077;&#1088;&#1085;&#1103;&#1082;&#1072; &#1085;&#1072;&#1081;&#1076;&#1105;&#1090;&#1089;&#1103; &#1082;&#1090;&#1086;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100;, &#1082;&#1090;&#1086; &#1089;&#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1072;&#1084; &#1087;&#1086;&#1084;&#1086;&#1095;&#1100;.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>On some older Windows XP systems you may get an error message like this: <i>The application can't start, because the side-by-side configuration is wrong. The reinstallation of the application may solve the problem.</i> The reason for this problem is that on your system either the CRT runtime libraries are missing or the version installed is too old because FreeCAD was linked against a newer version. In this case you have to install the <i>Microsoft Visual C++ Redistributable Package</i> which you'll find at Microsoft. See also the corresponding <a rel="nofollow" class="external text" href="http://forum.freecad.org/viewtopic.php?f=3&amp;t=1298&amp;p=9961">forum message</a>.
</p>
</div>
<p><span id="FreeCAD_starts_normally,_but_not_all_icons_are_displayed,_some_of_them_are_replaced_by_a_black_'X'"></span>
</p>
<h3><span id="FreeCAD_.D0.B7.D0.B0.D0.BF.D1.83.D1.81.D0.BA.D0.B0.D0.B5.D1.82.D1.81.D1.8F_.D0.BD.D0.BE.D1.80.D0.BC.D0.B0.D0.BB.D1.8C.D0.BD.D0.BE.2C_.D0.BD.D0.BE_.D0.BD.D0.B5_.D0.B2.D1.81.D0.B5_.D0.B8.D0.BA.D0.BE.D0.BD.D0.BA.D0.B8_.D0.BE.D1.82.D0.BE.D0.B1.D1.80.D0.B0.D0.B6.D0.B0.D1.8E.D1.82.D1.81.D1.8F.2C_.D0.BD.D0.B5.D0.BA.D0.BE.D1.82.D0.BE.D1.80.D1.8B.D0.B5_.D0.B8.D0.B7_.D0.BD.D0.B8.D1.85_.D0.B7.D0.B0.D0.BC.D0.B5.D0.BD.D0.B5.D0.BD.D1.8B_.D0.BD.D0.B0_.D1.87.D0.B5.D1.80.D0.BD.D1.8B.D0.B5_.D0.B7.D0.BD.D0.B0.D1.87.D0.BA.D0.B8_.27X.27"></span><span class="mw-headline" id="FreeCAD_&#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090;&#1089;&#1103;_&#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;,_&#1085;&#1086;_&#1085;&#1077;_&#1074;&#1089;&#1077;_&#1080;&#1082;&#1086;&#1085;&#1082;&#1080;_&#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1102;&#1090;&#1089;&#1103;,_&#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077;_&#1080;&#1079;_&#1085;&#1080;&#1093;_&#1079;&#1072;&#1084;&#1077;&#1085;&#1077;&#1085;&#1099;_&#1085;&#1072;_&#1095;&#1077;&#1088;&#1085;&#1099;&#1077;_&#1079;&#1085;&#1072;&#1095;&#1082;&#1080;_'X'">FreeCAD &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;, &#1085;&#1086; &#1085;&#1077; &#1074;&#1089;&#1077; &#1080;&#1082;&#1086;&#1085;&#1082;&#1080; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1102;&#1090;&#1089;&#1103;, &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1079; &#1085;&#1080;&#1093; &#1079;&#1072;&#1084;&#1077;&#1085;&#1077;&#1085;&#1099; &#1085;&#1072; &#1095;&#1077;&#1088;&#1085;&#1099;&#1077; &#1079;&#1085;&#1072;&#1095;&#1082;&#1080; 'X'</span></h3>
<p>&#1053;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1095;&#1072;&#1089;&#1090;&#1080; FreeCAD &#1079;&#1072;&#1074;&#1080;&#1089;&#1103;&#1090; &#1086;&#1090; &#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1075;&#1086; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; Python &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; Pivy. &#1042; Windows pivy &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1072; &#1074; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1086;&#1095;&#1085;&#1099;&#1081; &#1087;&#1072;&#1082;&#1077;&#1090; FreeCAD. &#1042; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1093; Debian/Ubuntu &#1087;&#1072;&#1082;&#1077;&#1090; python-pivy &#1074;&#1093;&#1086;&#1076;&#1080;&#1090; &#1074; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1077; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1080;. &#1042; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1093; &#1074; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1074;&#1072;&#1084;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1087;&#1088;&#1080;&#1076;&#1105;&#1090;&#1089;&#1103; &#1089;&#1072;&#1084;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1089;&#1086;&#1073;&#1080;&#1088;&#1072;&#1090;&#1100; pivy. &#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086;, &#1093;&#1086;&#1090;&#1103; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1085;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1073;&#1077;&#1079; pivy, &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1095;&#1072;&#1089;&#1090;&#1080; FreeCAD &#1073;&#1091;&#1076;&#1091;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;.
</p><p><span id="I_have_display_problems,_the_3D_view_doesn't_behave_correctly,_there_is_garbage_when_I_move/rotate_the_view,_etc."></span>
</p>
<h3><span id=".D0.9F.D1.80.D0.BE.D0.B1.D0.BB.D0.B5.D0.BC.D1.8B_.D1.81_.D0.BE.D1.82.D0.BE.D0.B1.D1.80.D0.B0.D0.B6.D0.B5.D0.BD.D0.B8.D0.B5.D0.BC.2C_3D-.D0.92.D0.B8.D0.B4_.D1.80.D0.B0.D0.B1.D0.BE.D1.82.D0.B0.D0.B5.D1.82_.D0.BD.D0.B5.D0.BA.D0.BE.D1.80.D1.80.D0.B5.D0.BA.D1.82.D0.BD.D0.BE.2C_.D0.BF.D1.80.D0.B8_.D0.B5.D0.B3.D0.BE_.D0.BF.D0.B5.D1.80.D0.B5.D0.BC.D0.B5.D1.89.D0.B5.D0.BD.D0.B8.D0.B8_.D0.B8.D0.BB.D0.B8_.D0.BF.D0.BE.D0.B2.D0.BE.D1.80.D0.BE.D1.82.D0.B5_.D0.BF.D0.BE.D1.8F.D0.B2.D0.BB.D1.8F.D1.8E.D1.82.D1.81.D1.8F_.D0.B0.D1.80.D1.82.D0.B5.D1.84.D0.B0.D0.BA.D1.82.D1.8B_.D0.B8_.D1.82..D0.B4."></span><span class="mw-headline" id="&#1055;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;_&#1089;_&#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084;,_3D-&#1042;&#1080;&#1076;_&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090;_&#1085;&#1077;&#1082;&#1086;&#1088;&#1088;&#1077;&#1082;&#1090;&#1085;&#1086;,_&#1087;&#1088;&#1080;_&#1077;&#1075;&#1086;_&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1080;_&#1080;&#1083;&#1080;_&#1087;&#1086;&#1074;&#1086;&#1088;&#1086;&#1090;&#1077;_&#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103;_&#1072;&#1088;&#1090;&#1077;&#1092;&#1072;&#1082;&#1090;&#1099;_&#1080;_&#1090;.&#1076;.">&#1055;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; &#1089; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084;, 3D-&#1042;&#1080;&#1076; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1085;&#1077;&#1082;&#1086;&#1088;&#1088;&#1077;&#1082;&#1090;&#1085;&#1086;, &#1087;&#1088;&#1080; &#1077;&#1075;&#1086; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1080; &#1080;&#1083;&#1080; &#1087;&#1086;&#1074;&#1086;&#1088;&#1086;&#1090;&#1077; &#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1072;&#1088;&#1090;&#1077;&#1092;&#1072;&#1082;&#1090;&#1099; &#1080; &#1090;.&#1076;.</span></h3>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>FreeCAD depends on OpenGL for displaying 3D contents, and therefore requires a working OpenGL environment. On some systems, OpenGL is not activated by default, and you might need to install or upgrade your graphics drivers. This problems happens most often on Linux systems or on virtual systems. If you are on a Linux-based system, try the following steps:
</p>
<ul><li>verify that your computer has a 3D-capable graphics board</li>
<li>type <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">glxinfo</span> in a terminal window, and check in the output that Direct Rendering is set to "yes", and that the OpenGL vendor/renderer/version matches your graphics card.</li>
<li>install other OpenGL-based software (<a rel="nofollow" class="external text" href="http://www.blender.org">Blender</a>, for example) and check if it runs and displays correctly.</li></ul>
</div>
<p><span id="FreeCAD_crashes_on_startup"></span>
</p>
<h3><span id="FreeCAD_.D0.B2.D1.8B.D0.BB.D0.B5.D1.82.D0.B0.D0.B5.D1.82_.D0.BF.D1.80.D0.B8_.D0.B7.D0.B0.D0.BF.D1.83.D1.81.D0.BA.D0.B5"></span><span class="mw-headline" id="FreeCAD_&#1074;&#1099;&#1083;&#1077;&#1090;&#1072;&#1077;&#1090;_&#1087;&#1088;&#1080;_&#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1077;">FreeCAD &#1074;&#1099;&#1083;&#1077;&#1090;&#1072;&#1077;&#1090; &#1087;&#1088;&#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1077;</span></h3>
<p>&#1057;&#1073;&#1086;&#1081; &#1084;&#1086;&#1078;&#1077;&#1090; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1085;&#1072; &#1073;&#1086;&#1083;&#1077;&#1077; &#1089;&#1077;&#1088;&#1100;&#1077;&#1079;&#1085;&#1091;&#1102; &#1086;&#1096;&#1080;&#1073;&#1082;&#1091; &#1080;&#1083;&#1080; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1091; &#1074; &#1074;&#1072;&#1096;&#1077;&#1081; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080;. &#1041;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1089;&#1073;&#1086;&#1077;&#1074; &#1087;&#1088;&#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1077; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1087;&#1086; &#1086;&#1076;&#1085;&#1086;&#1081; &#1080;&#1079; &#1076;&#1074;&#1091;&#1093; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;:
</p><p><span id="OpenGL_drivers_are_not_installed,_or_not_working_properly"></span>
</p>
<h4><span id="OpenGL_.D0.B4.D1.80.D0.B0.D0.B9.D0.B2.D0.B5.D1.80_.D0.BD.D0.B5_.D1.83.D1.81.D1.82.D0.B0.D0.BD.D0.BE.D0.B2.D0.BB.D0.B5.D0.BD_.D0.B8.D0.BB.D0.B8_.D1.80.D0.B0.D0.B1.D0.BE.D1.82.D0.B0.D0.B5.D1.82_.D0.BD.D0.B5_.D0.BF.D1.80.D0.B0.D0.B2.D0.B8.D0.BB.D1.8C.D0.BD.D0.BE"></span><span class="mw-headline" id="OpenGL_&#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;_&#1085;&#1077;_&#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;_&#1080;&#1083;&#1080;_&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090;_&#1085;&#1077;_&#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;">OpenGL &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088; &#1085;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085; &#1080;&#1083;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1085;&#1077; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;</span></h4>
<p>&#1069;&#1090;&#1086; &#1086;&#1095;&#1077;&#1085;&#1100; &#1095;&#1072;&#1089;&#1090;&#1072;&#1103; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1072; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;. &#1045;&#1105; &#1089;&#1080;&#1084;&#1087;&#1090;&#1086;&#1084;&#1099; - &#1089;&#1073;&#1086;&#1081; FreeCAD &#1087;&#1088;&#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1077;, &#1080;&#1083;&#1080; &#1074;&#1089;&#1103;&#1082;&#1080;&#1081; &#1088;&#1072;&#1079;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1042;&#1099; &#1086;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1077;&#1090;&#1077; 3D &#1074;&#1080;&#1076; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1087;&#1088;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1080; &#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;). &#1055;&#1086;&#1089;&#1090;&#1072;&#1088;&#1072;&#1081;&#1090;&#1077;&#1089;&#1100; &#1074;&#1099;&#1103;&#1089;&#1085;&#1080;&#1090;&#1100;, &#1082;&#1072;&#1082;&#1086;&#1081; &#1091; &#1074;&#1072;&#1089; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1095;&#1080;&#1087;, &#1079;&#1072;&#1090;&#1077;&#1084; &#1074;&#1099;&#1103;&#1089;&#1085;&#1080;&#1090;&#1077;, &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1083;&#1080; &#1086;&#1085; <a rel="nofollow" class="external text" href="http://ru.wikipedia.org/wiki/OpenGL">OpenGL</a> (&#1089;&#1072;&#1084;&#1099;&#1077; &#1087;&#1086;&#1089;&#1083;&#1077;&#1078;&#1085;&#1080;&#1077; - &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090;), &#1079;&#1072;&#1090;&#1077;&#1084; &#1085;&#1072;&#1081;&#1076;&#1080;&#1090;&#1077; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1099;&#1081; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088; &#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1077;&#1075;&#1086;. &#1061;&#1086;&#1088;&#1086;&#1096;&#1080;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100;, &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1083;&#1080; OpenGL - &#1087;&#1086;&#1087;&#1099;&#1090;&#1072;&#1090;&#1100;&#1089;&#1103; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1076;&#1088;&#1091;&#1075;&#1086;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;, &#1077;&#1075;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1097;&#1077;&#1077;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; <a rel="nofollow" class="external text" href="http://www.blender.org">blender</a>.
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>And as a general tip to get some more information about crashes with FreeCAD you can start it with the program parameter <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">--write-log</span>. This will create the file <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">FreeCAD.log</span> in <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">$XDG_CONFIG_HOME/FreeCAD</span> (<span style="font-size:small;color:green;">0.20 and above</span>) or <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">$HOME/.FreeCAD</span> (<span style="font-size:small;color:blue;">0.19 and below</span>) on Linux, or <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">$HOME/Library/Preferences/FreeCAD</span> on macOS, or <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">%APPDATA%/FreeCAD</span> on Windows systems.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>In some rare cases you may have a graphic driver installed that doesn't fit to your graphic card. We had a case where the user's laptop had an Intel on-board graphic but some ATI drivers were installed. Refer to forum thread in German <a rel="nofollow" class="external text" href="http://forum.freecad.org/viewtopic.php?f=13&amp;t=5160&amp;start=10#p41042">FreeCAD startet nicht</a>. After removing the files and re-installing the correct driver FreeCAD started to work.
</p>
</div>
<p><span id="Some_library,_needed_by_FreeCAD,_is_not_present_on_your_system,_or_wasn't_found_by_FreeCAD"></span>
</p>
<h4><span id=".D0.91.D0.B8.D0.B1.D0.BB.D0.B8.D0.BE.D1.82.D0.B5.D0.BA.D0.B0.2C_.D0.BD.D1.83.D0.B6.D0.BD.D0.B0.D1.8F_.D0.B4.D0.BB.D1.8F_.D1.80.D0.B0.D0.B1.D0.BE.D1.82.D1.8B_FreeCAD.2C_.D0.BE.D1.82.D1.81.D1.83.D1.82.D1.81.D1.82.D0.B2.D1.83.D0.B5.D1.82_.D0.B2_.D1.81.D0.B8.D1.81.D1.82.D0.B5.D0.BC.D0.B5_.D0.B8.D0.BB.D0.B8_.D0.BD.D0.B5_.D0.BD.D0.B0.D0.B9.D0.B4.D0.B5.D0.BD.D0.B0"></span><span class="mw-headline" id="&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072;,_&#1085;&#1091;&#1078;&#1085;&#1072;&#1103;_&#1076;&#1083;&#1103;_&#1088;&#1072;&#1073;&#1086;&#1090;&#1099;_FreeCAD,_&#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090;_&#1074;_&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077;_&#1080;&#1083;&#1080;_&#1085;&#1077;_&#1085;&#1072;&#1081;&#1076;&#1077;&#1085;&#1072;">&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072;, &#1085;&#1091;&#1078;&#1085;&#1072;&#1103; &#1076;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; FreeCAD, &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1080;&#1083;&#1080; &#1085;&#1077; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;&#1072;</span></h4>
<p>&#1069;&#1090;&#1072; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; &#1076;&#1074;&#1077; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1099;: &#1083;&#1080;&#1073;&#1086; &#1082;&#1072;&#1082;&#1072;&#1103;-&#1090;&#1086; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; FreeCAD &#1085;&#1077; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1083;&#1080;&#1073;&#1086; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; &#1077;&#1089;&#1090;&#1100;, &#1085;&#1086; &#1073;&#1086;&#1083;&#1077;&#1077; &#1089;&#1090;&#1072;&#1088;&#1072;&#1103; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103;, &#1095;&#1077;&#1084; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; FreeCAD, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1087;&#1088;&#1080; &#1087;&#1086;&#1087;&#1099;&#1090;&#1082;&#1077; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; FreeCAD &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1089;&#1073;&#1086;&#1081;, &#1090;. &#1082;. FreeCAD &#1087;&#1099;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102; &#1080;&#1079; &#1101;&#1090;&#1086;&#1081; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1074; &#1085;&#1077;&#1081; &#1085;&#1077;&#1090;. &#1058;&#1080;&#1087;&#1080;&#1095;&#1085;&#1099;&#1081; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;: &#1082;&#1086;&#1075;&#1076;&#1072; &#1074; &#1074;&#1072;&#1096;&#1077;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1099; Qt3 &#1080; Qt4, FreeCAD &#1084;&#1086;&#1078;&#1077;&#1090; &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1080;&#1090;&#1100; Qt4, &#1085;&#1086;, &#1077;&#1089;&#1083;&#1080; Qt &#1085;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1095;&#1072;&#1089;&#1090;&#1080; Qt3 &#1074;&#1089;&#1105; &#1077;&#1097;&#1105; &#1084;&#1086;&#1075;&#1091;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103;, &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1103; &#1089;&#1073;&#1086;&#1080;.
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Please review the installing procedure (<a href="../Installing_on_Windows.html" title="Installing on Windows">Windows</a>, <a href="../Installing_on_Linux.html" title="Installing on Linux">Linux</a> or <a href="../Installing_on_Mac.html" title="Installing on Mac">Mac</a>), make sure you installed all the required libraries (on most Linux systems this is done automatically), and check what is the minimum version number for each of the components.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>If everything seems correct, describe the problem on the <a rel="nofollow" class="external text" href="http://forum.freecad.org/">forum</a> or <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/issues">submit a bug</a>. If you are on a Linux system, it is easy to do a debug backtrace, which provides very useful information about the crash to the developers:
</p>
<ul><li>in a terminal, type: <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">gdb freecad</span> (assuming package gdb is installed)</li>
<li>inside gdb, type <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">run</span></li>
<li>after the crash, type <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">bt</span> to get the backtrace, that you can include in your bug report.</li></ul>
</div>
<p><span id="FreeCAD_freezes_after_startup"></span>
</p>
<h3><span id="FreeCAD_.D0.B7.D0.B0.D0.B2.D0.B8.D1.81.D0.B0.D0.B5.D1.82_.D0.BF.D0.BE.D1.81.D0.BB.D0.B5_.D0.B7.D0.B0.D0.BF.D1.83.D1.81.D0.BA.D0.B0"></span><span class="mw-headline" id="FreeCAD_&#1079;&#1072;&#1074;&#1080;&#1089;&#1072;&#1077;&#1090;_&#1087;&#1086;&#1089;&#1083;&#1077;_&#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;">FreeCAD &#1079;&#1072;&#1074;&#1080;&#1089;&#1072;&#1077;&#1090; &#1087;&#1086;&#1089;&#1083;&#1077; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;</span></h3>
<p>&#1055;&#1088;&#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1077; FreeCAD &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089; &#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1095;&#1090;&#1080; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086;, &#1085;&#1086; &#1086;&#1085; &#1079;&#1072;&#1074;&#1080;&#1089;&#1072;&#1077;&#1090; &#1080; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1086;&#1082;&#1086;&#1083;&#1086; 99%. &#1058;&#1072;&#1082;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1088;&#1086;&#1080;&#1079;&#1086;&#1081;&#1090;&#1080; &#1085;&#1072; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1084; &#1089;&#1090;&#1086;&#1083;&#1077; KDE &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1090;&#1077;&#1084;&#1099; Oxygen. &#1055;&#1088;&#1080;&#1095;&#1080;&#1085;&#1086;&#1081; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072; &#1074; &#1090;&#1077;&#1084;&#1077; Oxygen, &#1074;&#1099;&#1073;&#1086;&#1088; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1090;&#1077;&#1084;&#1099; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1088;&#1077;&#1096;&#1080;&#1090;&#1100; &#1101;&#1090;&#1091; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1091;.
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span class="mw-headline" id="FreeCAD_crashes_on_creating_a_new_document_or_opening_a_file">FreeCAD crashes on creating a new document or opening a file</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>If FreeCAD crashes when it creates a new 3D view, try launching FreeCAD from a terminal. If a message error appears when the crash occurs, mentioning <span style="font-weight:normal; font-family:monospace, Consolas, Courier New, Courier; border: 1px solid #d8d8d8; padding: 2px 5px 2px 5px;">Assertion Failed</span>, and a component name beginning with "So" (<span style="font-weight:normal; font-family:monospace, Consolas, Courier New, Courier; border: 1px solid #d8d8d8; padding: 2px 5px 2px 5px;">SoBase</span>, <span style="font-weight:normal; font-family:monospace, Consolas, Courier New, Courier; border: 1px solid #d8d8d8; padding: 2px 5px 2px 5px;">SoFieldContainer</span>, etc.), the chances are very high, especially if you are on Linux, that FreeCAD is trying to use two different versions of the Coin library, which causes the crash.
To verify if that is indeed the problem, try the following:
</p>
<ul><li>Locate the FreeCAD executable (usually in <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">/usr/lib/FreeCAD/bin</span>)</li>
<li>Run the command <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">ldd FreeCAD</span> from a terminal</li>
<li>Note down the version of the <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">libCoin.so</span> library that FreeCAD is using (for example <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">libCoin.so.60</span>)</li>
<li>Locate the <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">libSoQt.so</span> library (usually in <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">/usr/lib</span>)</li>
<li>run <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">ldd libSoQt.so</span> and check if it links to the same Coin version as FreeCAD</li></ul>
<p>If there is any difference, either FreeCAD or SoQt must be recompiled (better to recompile the one that uses the oldest Coin version). The normal behavior is to try to contact the people responsible for packaging either SoQt or FreeCAD and kindly ask them to consider recompiling.
If you want to undertake that step for yourself, and it is not possible to recompile SoQt because it breaks other applications on your system, you can force FreeCAD to compile with the required Coin version with <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">./configure --with-coin=DIR</span>. But you have to make sure that the correct development package of this Coin version is installed.
</p>
</div>
<p><span id="FreeCAD_crashes_after_Edit_&rarr;_Alignment"></span>
</p>
<h3><span id="FreeCAD_.D0.B2.D1.8B.D0.BB.D0.B5.D1.82.D0.B0.D0.B5.D1.82_.D0.BF.D0.BE.D1.81.D0.BB.D0.B5_.D0.BA.D0.BE.D0.BC.D0.B0.D0.BD.D0.B4.D1.8B_.D0.9F.D1.80.D0.B0.D0.B2.D0.BA.D0.B0_.E2.86.92_.D0.92.D1.8B.D1.80.D0.B0.D0.B2.D0.BD.D0.B8.D0.B2.D0.B0.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="FreeCAD_&#1074;&#1099;&#1083;&#1077;&#1090;&#1072;&#1077;&#1090;_&#1087;&#1086;&#1089;&#1083;&#1077;_&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;_&#1055;&#1088;&#1072;&#1074;&#1082;&#1072;_&rarr;_&#1042;&#1099;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077;">FreeCAD &#1074;&#1099;&#1083;&#1077;&#1090;&#1072;&#1077;&#1090; &#1087;&#1086;&#1089;&#1083;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1055;&#1088;&#1072;&#1074;&#1082;&#1072; &rarr; &#1042;&#1099;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077;</span></h3>
<p>&#1054;&#1096;&#1080;&#1073;&#1082;&#1072; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1074; <span style="font-weight:normal; font-family:monospace, Consolas, Courier New, Courier; border: 1px solid #d8d8d8; padding: 2px 5px 2px 5px;">vbo_save_playback_vertex_list()</span>. &#1069;&#1090;&#1086; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1074; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;&#1077; &#1087;&#1083;&#1086;&#1093;&#1072;&#1103; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; VBO. &#1063;&#1090;&#1086;&#1073;&#1099; &#1080;&#1079;&#1073;&#1077;&#1078;&#1072;&#1090;&#1100; &#1082;&#1101;&#1096;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074;&#1099;&#1079;&#1086;&#1074;&#1086;&#1074; OpenGL, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1086;&#1087;&#1099;&#1090;&#1072;&#1090;&#1100;&#1089;&#1103; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1091;&#1102; &#1089;&#1088;&#1077;&#1076;&#1099; <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">  IV_SEPARATOR_MAX_CACHES = 0 </span> &#1080; &#1087;&#1077;&#1088;&#1077;&#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; FreeCAD.
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span id="I_cannot_change_numeric_values_in_FreeCAD.27s_properties_panels"></span><span class="mw-headline" id="I_cannot_change_numeric_values_in_FreeCAD's_properties_panels">I cannot change numeric values in FreeCAD's properties panels</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<figure class="mw-halign-left" typeof="mw:File"><a href="../index.php?title=Jj62l.png&amp;filetimestamp=20130423090237&amp;.html" class="mw-file-description" title="language options"><img alt="language options" src="../File/Jj62l.png" decoding="async" width="480" height="297"></a><figcaption>language options</figcaption></figure>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>You most likely have bad windows regional settings set-up. Please check if you have the same symbol for decimal separator and digit grouping symbol in your regional settings. If you do, <a rel="nofollow" class="external text" href="http://forum.freecad.org/viewtopic.php?f=4&amp;t=2655&amp;p=20046#p20041">adapt your system settings</a> to use different characters for the digit grouping symbol and decimal separator. Note that it is not mandatory to have dot as decimal separator. It is mandatory to use different symbols in these two settings.
</p>
<div style="clear:both"></div>
</div>
<p><span id="FreeCAD_was_running_normally,_and_suddenly_it_doesn't_start_anymore"></span>
</p>
<h3><span id="FreeCAD_.D1.80.D0.B0.D0.B1.D0.BE.D1.82.D0.B0.D0.BB_.D0.BD.D0.BE.D1.80.D0.BC.D0.B0.D0.BB.D1.8C.D0.BD.D0.BE.2C_.D0.BD.D0.BE_.D0.B2.D0.B4.D1.80.D1.83.D0.B3_.D0.BF.D0.B5.D1.80.D0.B5.D1.81.D1.82.D0.B0.D0.BB_.D0.B7.D0.B0.D0.BF.D1.83.D1.81.D0.BA.D0.B0.D1.82.D1.8C.D1.81.D1.8F"></span><span class="mw-headline" id="FreeCAD_&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1083;_&#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;,_&#1085;&#1086;_&#1074;&#1076;&#1088;&#1091;&#1075;_&#1087;&#1077;&#1088;&#1077;&#1089;&#1090;&#1072;&#1083;_&#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1090;&#1100;&#1089;&#1103;">FreeCAD &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1083; &#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;, &#1085;&#1086; &#1074;&#1076;&#1088;&#1091;&#1075; &#1087;&#1077;&#1088;&#1077;&#1089;&#1090;&#1072;&#1083; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1090;&#1100;&#1089;&#1103;</span></h3>
<p>&#1044;&#1072;&#1085;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1088;&#1086;&#1080;&#1079;&#1086;&#1081;&#1090;&#1080;, &#1077;&#1089;&#1083;&#1080; &#1091; &#1074;&#1072;&#1089; &#1073;&#1099;&#1083;&#1072; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1072; &#1073;&#1086;&#1083;&#1077;&#1077; &#1089;&#1090;&#1072;&#1088;&#1072;&#1103; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103; FreeCAD, &#1080; &#1074;&#1099; &#1086;&#1073;&#1085;&#1086;&#1074;&#1080;&#1083;&#1080; &#1077;&#1105; &#1076;&#1086; &#1073;&#1086;&#1083;&#1077;&#1077; &#1085;&#1086;&#1074;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080;. &#1042; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1077; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1092;&#1072;&#1081;&#1083;&#1099; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080; FreeCAD &#1084;&#1086;&#1075;&#1083;&#1080; &#1073;&#1099;&#1090;&#1100; &#1087;&#1086; &#1082;&#1072;&#1082;&#1086;&#1081;-&#1090;&#1086; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1077; &#1087;&#1086;&#1074;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1099;, &#1080; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; FreeCAD &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1093; &#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1080; &#1085;&#1077; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090;&#1089;&#1103;. &#1056;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1080;&#1090; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1101;&#1090;&#1080; &#1092;&#1072;&#1081;&#1083;&#1099; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080;, &#1095;&#1090;&#1086;&#1073;&#1099; FreeCAD &#1079;&#1072;&#1085;&#1086;&#1074;&#1086; &#1080;&#1093; &#1074;&#1086;&#1089;&#1089;&#1086;&#1079;&#1076;&#1072;&#1083; &#1087;&#1088;&#1080; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1077;.
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<ul><li>On Windows: Open the file explorer, and write <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">%APPDATA%\FreeCAD</span> as the file path. Once there, delete the files <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">user.cfg</span> and <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">system.cfg</span></li>
<li>On Linux: Navigate to <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">/home/USERNAME/.local/share/FreeCAD</span> (<span style="font-size:small;color:green;">0.20 and above</span>) or <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">/home/USERNAME/.FreeCAD</span> (<span style="font-size:small;color:blue;">0.19 and below</span>) and delete the files <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">user.cfg</span> and <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">system.cfg</span></li>
<li>On Mac: Navigate to <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">/Users/USERNAME/Library/Preferences/FreeCAD</span> and delete the files <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">user.cfg</span> and <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">system.cfg</span></li></ul>
</div>
<p>&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; FreeCAD &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100;&#1089;&#1103; &#1089;&#1086; &#1089;&#1073;&#1088;&#1086;&#1089;&#1086;&#1084; &#1074;&#1089;&#1077;&#1093; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082;.
</p><p><br>
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>There is a <a href="../Macro_findConfigFiles.html" title="Macro findConfigFiles">Macro findConfigFiles</a> available to help in locating your configuration files. It can be installed using the Addon Manager in the Tools menu. <b>Tools &rarr; Addon Manager &rarr; Macros &rarr; findConfigFiles</b>. The macro will find your config file folder, copy it to the clipboard, and (attempt to) open that location with your default file browser. It makes no changes to your files or settings.
</p>
</div>
<p><span id="Using_FreeCAD"></span>
</p>
<h2><span id=".D0.98.D1.81.D0.BF.D0.BE.D0.BB.D1.8C.D0.B7.D0.BE.D0.B2.D0.B0.D0.BD.D0.B8.D0.B5_FreeCAD"></span><span class="mw-headline" id="&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;_FreeCAD">&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; FreeCAD</span></h2>
<p><span id="Is_FreeCAD_really_free?_Even_for_commercial_use?"></span>
</p>
<h3><span id="FreeCAD_.D0.B4.D0.B5.D0.B9.D1.81.D1.82.D0.B2.D0.B8.D1.82.D0.B5.D0.BB.D1.8C.D0.BD.D0.BE_.D0.B1.D0.B5.D1.81.D0.BF.D0.BB.D0.B0.D1.82.D0.BD.D1.8B.D0.B9.3F_.D0.94.D0.B0.D0.B6.D0.B5_.D0.B4.D0.BB.D1.8F_.D0.BA.D0.BE.D0.BC.D0.BC.D0.B5.D1.80.D1.87.D0.B5.D1.81.D0.BA.D0.BE.D0.B3.D0.BE_.D0.B8.D1.81.D0.BF.D0.BE.D0.BB.D1.8C.D0.B7.D0.BE.D0.B2.D0.B0.D0.BD.D0.B8.D1.8F.3F"></span><span class="mw-headline" id="FreeCAD_&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;_&#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1099;&#1081;?_&#1044;&#1072;&#1078;&#1077;_&#1076;&#1083;&#1103;_&#1082;&#1086;&#1084;&#1084;&#1077;&#1088;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086;_&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;?">FreeCAD &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1099;&#1081;? &#1044;&#1072;&#1078;&#1077; &#1076;&#1083;&#1103; &#1082;&#1086;&#1084;&#1084;&#1077;&#1088;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;?</span></h3>
<div class="mw-translate-fuzzy">
<p>FreeCAD &#1101;&#1090;&#1086; <a rel="nofollow" class="external text" href="http://ru.wikipedia.org/wiki/Open-source_software">&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084; &#1082;&#1086;&#1076;&#1086;&#1084;</a>, &#1080; &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1077;&#1075;&#1086; &#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1089;&#1077;&#1073;&#1103; &#1080;&#1083;&#1080; &#1074; &#1082;&#1086;&#1084;&#1084;&#1077;&#1088;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1094;&#1077;&#1083;&#1103;&#1093;, &#1085;&#1086;, &#1090;&#1072;&#1082;&#1078;&#1077;, &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1103;&#1090;&#1100;, &#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1093; &#1089; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084; &#1082;&#1086;&#1076;&#1086;&#1084;. &#1042; &#1086;&#1073;&#1097;&#1077;&#1084;, &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1089; &#1085;&#1080;&#1084; (&#1087;&#1086;&#1095;&#1090;&#1080;) &#1074;&#1089;&#1105;, &#1095;&#1090;&#1086; &#1079;&#1072;&#1093;&#1086;&#1090;&#1080;&#1090;&#1077;. &#1057;&#1084;. &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; <a href="../ru/License.html" title="License/ru">&#1051;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1103;</a> &#1076;&#1083;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;.
</p>
</div>
<p><span id="How_do_I_rotate_the_3D_view?"></span>
</p>
<h3><span id=".D0.9A.D0.B0.D0.BA_.D1.8F_.D0.BC.D0.BE.D0.B3.D1.83_.D0.BF.D0.BE.D0.B2.D0.B5.D1.80.D0.BD.D1.83.D1.82.D1.8C_3D_.D0.B2.D0.B8.D0.B4.3F"></span><span class="mw-headline" id="&#1050;&#1072;&#1082;_&#1103;_&#1084;&#1086;&#1075;&#1091;_&#1087;&#1086;&#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100;_3D_&#1074;&#1080;&#1076;?">&#1050;&#1072;&#1082; &#1103; &#1084;&#1086;&#1075;&#1091; &#1087;&#1086;&#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100; 3D &#1074;&#1080;&#1076;?</span></h3>
<div class="mw-translate-fuzzy">
<center>
<ul class="gallery mw-gallery-traditional">
		<li class="gallerybox" style="width: 335px">
			<div class="thumb" style="width: 330px; height: 230px;"><span typeof="mw:File"><a href="../index.php?title=Style_of_navigation.png&amp;filetimestamp=20240425200410&amp;.html" class="mw-file-description" title="&#1054;&#1090; &#1087;&#1088;&#1072;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1084;&#1099;&#1096;&#1080;"><img alt="&#1054;&#1090; &#1087;&#1088;&#1072;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1084;&#1099;&#1096;&#1080;" src="../File/Style_of_navigation.png" decoding="async" width="165" height="200"></a></span></div>
			<div class="gallerytext">
<p>&#1054;&#1090; <span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px;">&#1087;&#1088;&#1072;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080;</span> &#1084;&#1099;&#1096;&#1080;
</p>
			</div>
		</li>
		<li class="gallerybox" style="width: 335px">
			<div class="thumb" style="width: 330px; height: 230px;"><span typeof="mw:File"><a href="../index.php?title=Style_of_navigation_menu.png&amp;filetimestamp=20240425201620&amp;.html" class="mw-file-description" title="&#1048;&#1079; &#1084;&#1077;&#1085;&#1102; &#1055;&#1088;&#1072;&#1074;&#1082;&#1072; &rarr; &#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &rarr;"><img alt="&#1048;&#1079; &#1084;&#1077;&#1085;&#1102; &#1055;&#1088;&#1072;&#1074;&#1082;&#1072; &rarr; &#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &rarr;" src="../File/Style_of_navigation_menu.png" decoding="async" width="300" height="198"></a></span></div>
			<div class="gallerytext">
<p>&#1048;&#1079; &#1084;&#1077;&#1085;&#1102; <b>&#1055;&#1088;&#1072;&#1074;&#1082;&#1072; &rarr; &#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &rarr;</b>
</p>
			</div>
		</li>
</ul>
</center>
<div style="clear:both"></div>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>FreeCAD has several different <a href="../Mouse_navigation.html" title="Mouse navigation">navigation modes</a> available, that can be set in the preferences settings dialog or changed by right-clicking in the 3D view. For full details about the modes, see the <a href="../Mouse_navigation.html" title="Mouse navigation">Mouse navigation</a> page.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span id="What_can_I_do_with_FreeCAD.3F_Where_do_I_start.3F"></span><span class="mw-headline" id="What_can_I_do_with_FreeCAD?_Where_do_I_start?">What can I do with FreeCAD? Where do I start?</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Head to the <a href="../Getting_started.html" title="Getting started">Getting started</a> page for a quick description of the tools you can use. There is also a new <a href="../Tutorials.html" title="Tutorials">Tutorials</a> section containing a few resources. The <a href="../User_hub.html" title="User hub">User hub</a> section contains more detailed information about the different workbenches of FreeCAD. Note that since FreeCAD is relatively new, its user interface is still very bare and doesn't feature many tools. But much more advanced functionality is already available to you from <a href="../Power_users_hub.html" title="Power users hub">Python scripting</a>.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span id="Is_there_documentation_for_newcomers.3F_How_can_I_learn_to_use_FreeCAD.3F"></span><span class="mw-headline" id="Is_there_documentation_for_newcomers?_How_can_I_learn_to_use_FreeCAD?">Is there documentation for newcomers? How can I learn to use FreeCAD?</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>There is a lot of documentation spread in different places, both on and outside the FreeCAD website. You might want to start with the <a href="../Getting_started.html" title="Getting started">Getting started</a> page. The <a href="../Tutorials.html" title="Tutorials">Tutorials</a> section contains many specialized tutorial pages to help you getting started with the different workbenches. The <a href="../Manual;Introduction.html" title="Manual:Introduction">Manual:Introduction</a> is a general, complete user-oriented guide to FreeCAD. The <a href="../User_hub.html" title="User hub">User hub</a> section of this wiki lists all pages aimed at end users. On external sites like <a rel="nofollow" class="external text" href="https://www.youtube.com/results?search_query=freecad">Youtube</a>, you will also find a load of video tutorials created by users. And, last but not least, the <a rel="nofollow" class="external text" href="https://forum.freecad.org">forum</a> contains a lot of replies to questions asked by other newcomers.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span id="I_want_to_import.2Fexport_data_in_format_XYZ_to.2Ffrom_FreeCAD._How_do_I_do_that.3F"></span><span class="mw-headline" id="I_want_to_import/export_data_in_format_XYZ_to/from_FreeCAD._How_do_I_do_that?">I want to import/export data in format XYZ to/from FreeCAD. How do I do that?</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Please refer to the <a href="../FreeCAD_Howto_Import_Export.html" title="FreeCAD Howto Import Export">FreeCAD Howto Import Export</a> page. Maybe your questions are already answered there.
</p>
</div>
<p><span id="Where_can_I_find_workarounds_for_features_that_FreeCAD_currently_does_not_support?"></span>
</p>
<h3><span id=".D0.93.D0.B4.D0.B5_.D0.BC.D0.BE.D0.B6.D0.BD.D0.BE_.D0.BD.D0.B0.D0.B9.D1.82.D0.B8_.D0.B2.D0.B0.D1.80.D0.B8.D0.B0.D0.BD.D1.82.D1.8B_.D1.80.D0.B5.D1.88.D0.B5.D0.BD.D0.B8.D0.B9_.D0.B4.D0.BB.D1.8F_.D0.BD.D0.B5.D0.B4.D0.BE.D1.81.D1.82.D0.B0.D1.8E.D1.89.D0.B8.D1.85_.D0.B2.D0.BE.D0.B7.D0.BC.D0.BE.D0.B6.D0.BD.D0.BE.D1.81.D1.82.D0.B5.D0.B9_FreeCAD.3F"></span><span class="mw-headline" id="&#1043;&#1076;&#1077;_&#1084;&#1086;&#1078;&#1085;&#1086;_&#1085;&#1072;&#1081;&#1090;&#1080;_&#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1099;_&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1081;_&#1076;&#1083;&#1103;_&#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1102;&#1097;&#1080;&#1093;_&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081;_FreeCAD?">&#1043;&#1076;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1081;&#1090;&#1080; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1099; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1081; &#1076;&#1083;&#1103; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1102;&#1097;&#1080;&#1093; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081; FreeCAD?</span></h3>
<p>&#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077;&#1089;&#1100; &#1082; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; <a href="../ru/Workarounds.html" title="Workarounds/ru">&#1086;&#1073;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077; &#1087;&#1091;&#1090;&#1080; &#1076;&#1083;&#1103; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1079;&#1072;&#1076;&#1072;&#1095;</a>.
</p><p><span id="Working_with_Part_geometry"></span>
</p>
<h2><span id=".D0.A0.D0.B0.D0.B1.D0.BE.D1.82.D0.B0_.D1.81_.D0.B3.D0.B5.D0.BE.D0.BC.D0.B5.D1.82.D1.80.D0.B8.D0.B5.D0.B9_.D0.94.D0.B5.D1.82.D0.B0.D0.BB.D0.B8"></span><span class="mw-headline" id="&#1056;&#1072;&#1073;&#1086;&#1090;&#1072;_&#1089;_&#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1077;&#1081;_&#1044;&#1077;&#1090;&#1072;&#1083;&#1080;">&#1056;&#1072;&#1073;&#1086;&#1090;&#1072; &#1089; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1077;&#1081; &#1044;&#1077;&#1090;&#1072;&#1083;&#1080;</span></h2>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span id="How_do_I_extrude_stuff_into_solids.3F_I_don.27t_get_the_right_result"></span><span class="mw-headline" id="How_do_I_extrude_stuff_into_solids?_I_don't_get_the_right_result">How do I extrude stuff into solids? I don't get the right result</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>The theory is simple: Lines (or wires), when extruded, form faces. Faces, when extruded, form solids.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>If you extrude something and the result is not a solid, then the something was not a face. If you have lines and you want to extrude a solid from them, you must first select lines that form a closed perimeter (select several objects by pressing <span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px;">Ctrl</span>), join them into a wire (<a href="../Draft_Upgrade.html" title="Draft Upgrade">Draft Upgrade</a> tool), then make a face from that wire (<span typeof="mw:File"><a href="../index.php?title=Draft_Upgrade.svg&amp;filetimestamp=20210319102935&amp;.html" class="mw-file-description"><img src="../File/Draft_Upgrade.svg" decoding="async" width="16" height="16"></a></span> <a href="../Draft_Upgrade.html" title="Draft Upgrade">Draft Upgrade</a> tool again). There you are, if all went well you can now extrude it to a solid.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Now, there can be many little twists that make you obtain the wrong result. The best way to make sure is to check what's inside the object you are extruding. Objects contents can be easily explored with python. Assuming for example you have an object called "Wire", you could type this into the Python console:
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">obj</span> <span class="o">=</span> <span class="n">FreeCAD</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">Wire</span>
<span class="n">shp</span> <span class="o">=</span> <span class="n">obj</span><span class="o">.</span><span class="n">Shape</span>
<span class="nb">print</span> <span class="n">shp</span><span class="o">.</span><span class="n">Faces</span>
<span class="nb">print</span> <span class="n">shp</span><span class="o">.</span><span class="n">Wires</span>
<span class="k">if</span> <span class="n">shp</span><span class="o">.</span><span class="n">Wires</span><span class="p">:</span>
    <span class="k">for</span> <span class="n">w</span> <span class="ow">in</span> <span class="n">shp</span><span class="o">.</span><span class="n">Wires</span><span class="p">:</span>
        <span class="nb">print</span> <span class="n">w</span><span class="o">.</span><span class="n">isClosed</span><span class="p">()</span>
</pre></div>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>The above code retrieves the shape from an object, shows the faces and wires your object has (if any), and, if there are wires, prints if those wires are closed. If you don't have any face, you won't get a solid. If there is no closed wire, it won't become a face. If you are interested, there is more info about what you can check with Python on the <a href="../Topological_data_scripting.html" title="Topological data scripting">part scripting</a> page. If you cannot join several lines into a wire, the most probable cause is that their endpoints don't meet, there must be small gaps between (some of) them. There, I'm afraid, my experience tells me the quickest way would be to redraw a wire on top of them.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span id="My_boolean_operations_fail.2C_or_give_weird_results"></span><span class="mw-headline" id="My_boolean_operations_fail,_or_give_weird_results">My boolean operations fail, or give weird results</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Like all solid modeling kernels, the <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Open_CASCADE_Technology">Open CASCADE</a> geometric modeling kernel used in FreeCAD for Part geometry, although probably the best open-source geometry kernel available, has flaws and limitations. Boolean operations (fusion, subtraction, intersection) are complicated operations, and often give strange results. This is a current limitation we have no way to solve at once, so your best path is to try obtaining the desired result by modeling another way. For example, problems with primitives such as cylinder can often be solved by using an extruded circle instead. Coplanar surfaces between parts can cause trouble, as well as surface tangency. As a general rule, if a shape doesn't work, try remodeling it a different way. In 99% of the cases at the end you will manage to obtain the result you want.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>To understand boolean operations better, see these articles:
</p>
<ul><li><a rel="nofollow" class="external free" href="https://wiki.mcneel.com/rhino/booleanfaq">https://wiki.mcneel.com/rhino/booleanfaq</a></li>
<li><a rel="nofollow" class="external free" href="https://dev.opencascade.org/doc/overview/html/specification__boolean_operations.html#autotoc_md293">https://dev.opencascade.org/doc/overview/html/specification__boolean_operations.html#autotoc_md293</a></li></ul>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span id="When_I_export_.28or_view.29_my_model.2C_the_holes_are_filled_in"></span><span class="mw-headline" id="When_I_export_(or_view)_my_model,_the_holes_are_filled_in">When I export (or view) my model, the holes are filled in</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Don't use <span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px;">Ctrl</span> + <span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px;">A</span> (Select All) to export everything from the hierarchy tree. If the model is of one single item, try selecting only the newest item (usually the last one) in the hierarchy tree.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>As we create a model in the <a href="../PartDesign_Workbench.html" title="PartDesign Workbench">PartDesign Workbench</a>, each feature takes the shape of the last one and adds or removes something, creating linear dependencies from feature to feature as the model is created. Hence a "Cut" feature is not only the cut hole itself, but the whole part with the cut. This is why the user usually should only have the newest item (feature) in the model tree visible, because otherwise the phases of the model overlay each other, and holes are filled in by the earlier model features.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>To toggle visibility of an object on or off, select it in the hierarchy tree and press <span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px;">spacebar</span> on your keyboard. Usually everything but the last item in the hierarchy tree should be greyed out and therefore not visible in the <a href="../3D_view.html" title="3D view">3D view</a>.
</p>
</div>
<p><span id="My_parametric_objects_break_when_I_modify_their_base_sketches"></span>
</p>
<h3><span id=".D0.9F.D0.B0.D1.80.D0.B0.D0.BC.D0.B5.D1.82.D1.80.D0.B8.D1.87.D0.B5.D1.81.D0.BA.D0.B8.D0.B5_.D0.BE.D0.B1.D1.8A.D0.B5.D0.BA.D1.82.D1.8B_.D0.BB.D0.BE.D0.BC.D0.B0.D1.8E.D1.82.D1.81.D1.8F.2C_.D0.BF.D0.BE.D1.81.D0.BB.D0.B5_.D0.B8.D0.B7.D0.BC.D0.B5.D0.BD.D0.B5.D0.BD.D0.B8.D1.8F_.D0.B8.D1.85_.D0.B1.D0.B0.D0.B7.D0.BE.D0.B2.D1.8B.D1.85_.D1.8D.D1.81.D0.BA.D0.B8.D0.B7.D0.BE.D0.B2"></span><span class="mw-headline" id="&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077;_&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;_&#1083;&#1086;&#1084;&#1072;&#1102;&#1090;&#1089;&#1103;,_&#1087;&#1086;&#1089;&#1083;&#1077;_&#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;_&#1080;&#1093;_&#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1093;_&#1101;&#1089;&#1082;&#1080;&#1079;&#1086;&#1074;">&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1083;&#1086;&#1084;&#1072;&#1102;&#1090;&#1089;&#1103;, &#1087;&#1086;&#1089;&#1083;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1080;&#1093; &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1093; &#1101;&#1089;&#1082;&#1080;&#1079;&#1086;&#1074;</span></h3>
<div class="mw-translate-fuzzy">
<p>&#1042;&#1099; &#1089;&#1090;&#1086;&#1083;&#1082;&#1085;&#1091;&#1083;&#1080;&#1089;&#1100; &#1089; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1086;&#1081; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;. &#1042; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1077;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1101;&#1090;&#1086; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; FreeCAD &#1076;&#1083;&#1103; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1102;&#1097;&#1080;&#1093; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;. &#1054;&#1085;&#1072; &#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1074;&#1086; &#1074;&#1089;&#1077;&#1084; FreeCAD, &#1085;&#1086; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1079;&#1072;&#1084;&#1077;&#1090;&#1085;&#1072; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; <a href="../ru/Sketcher_Workbench.html" title="Sketcher Workbench/ru">&#1101;&#1089;&#1082;&#1080;&#1079;&#1086;&#1074;</a>. &#1054;&#1073;&#1098;&#1103;&#1089;&#1085;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1077;: &#1087;&#1088;&#1080; &#1087;&#1077;&#1088;&#1077;&#1088;&#1072;&#1089;&#1095;&#1077;&#1090;&#1077; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; (&#1088;&#1077;&#1073;&#1088;&#1072;, &#1075;&#1088;&#1072;&#1085;&#1080;...) &#1087;&#1077;&#1088;&#1077;&#1089;&#1090;&#1088;&#1072;&#1080;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1076;&#1088;&#1091;&#1075;&#1086;&#1084; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077;, &#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1072; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1093; &#1074; &#1085;&#1077;&#1084; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1081; (constraints). &#1054;&#1085;&#1080; &#1079;&#1072;&#1085;&#1086;&#1074;&#1086; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1102;&#1090; &#1080;&#1084;&#1077;&#1085;&#1072; (Edge1, Edge2... Face1, Face2... &#1080; &#1090;.&#1076;.). &#1041;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081; (&#1074;&#1099;&#1076;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077;, &#1089;&#1082;&#1088;&#1091;&#1075;&#1083;&#1077;&#1085;&#1080;&#1077; &#1080; &#1090;.&#1076;.) &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1072;&#1085;&#1099; &#1082; &#1089;&#1090;&#1072;&#1088;&#1099;&#1084; &#1080;&#1084;&#1077;&#1085;&#1072;&#1084;. &#1058;.&#1077;. &#1087;&#1088;&#1080; &#1087;&#1077;&#1088;&#1077;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1080; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1086;&#1073;&#1088;&#1072;&#1097;&#1072;&#1090;&#1100;&#1089;&#1103; &#1082; &#1080;&#1084;&#1077;&#1085;&#1072;&#1084; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1099;&#1083;&#1080; &#1079;&#1072;&#1083;&#1086;&#1078;&#1077;&#1085;&#1099; &#1074; &#1085;&#1080;&#1093; &#1080;&#1079;&#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086;, &#1072; &#1085;&#1077; &#1082; &#1090;&#1077;&#1084;, &#1095;&#1090;&#1086; &#1073;&#1099;&#1083;&#1080; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1099; &#1079;&#1072;&#1085;&#1086;&#1074;&#1086; &#1091;&#1078;&#1077; &#1087;&#1086;&#1089;&#1083;&#1077; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1095;&#1090;&#1086; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1090; &#1082; &#1085;&#1077;&#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;&#1084;&#1091; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1091;.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p><span style="font-size:small;"><a href="../Release_notes_1.0.html" title="Release notes 1.0">introduced in 1.0</a></span>: The TNP mitigation code is implemented but it doesn't eliminate the problem entirely and the users should still follow the good practices listed below:
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<ul><li>Know that sketches are highly sensitive to the problem. Referencing a specific edge of a sketch, or a face of an object built on a sketch, such as a <a href="../PartDesign_Pad.html" title="PartDesign Pad">PartDesign Pad</a>, is dangerous, unless you are pretty confident that these sketches will not change over time or the sketch is very simple. A Pad built on a simple rectangular sketch, for example, will likely be safe as it will generate only one face, so there is no order problem.</li>
<li>Prefer other kinds of objects such as <a href="../Part_Workbench.html" title="Part Workbench">Part</a> or <a href="../Draft_Workbench.html" title="Draft Workbench">Draft</a> when possible. These objects are always built the same way, and therefore their geometric components usually follow the same order each time they are rebuilt. They are much less susceptible to toponaming problems.</li>
<li>To attach further objects onto the faces of sketch-based geometry, prefer using <a href="../PartDesign_Plane.html" title="PartDesign Plane">Datum geometry</a>. These invisible "helper objects" don't depend on sketch geometry, and therefore stay stable over time.</li></ul>
</div>
<p><span id="Contributing_to_FreeCAD"></span>
</p>
<h2><span id=".D0.9A.D0.B0.D0.BA_.D0.B2.D0.BD.D0.B5.D1.81.D1.82.D0.B8_.D1.81.D0.B2.D0.BE.D0.B9_.D0.B2.D0.BA.D0.BB.D0.B0.D0.B4_.D0.B2_.D1.80.D0.B0.D0.B7.D0.B2.D0.B8.D1.82.D0.B8.D0.B5_FreeCAD"></span><span class="mw-headline" id="&#1050;&#1072;&#1082;_&#1074;&#1085;&#1077;&#1089;&#1090;&#1080;_&#1089;&#1074;&#1086;&#1081;_&#1074;&#1082;&#1083;&#1072;&#1076;_&#1074;_&#1088;&#1072;&#1079;&#1074;&#1080;&#1090;&#1080;&#1077;_FreeCAD">&#1050;&#1072;&#1082; &#1074;&#1085;&#1077;&#1089;&#1090;&#1080; &#1089;&#1074;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076; &#1074; &#1088;&#1072;&#1079;&#1074;&#1080;&#1090;&#1080;&#1077; FreeCAD</span></h2>
<p><span id="FreeCAD_is_such_a_great_program!_How_can_I_help?"></span>
</p>
<h3><span id=".D0.A7.D0.B5.D0.BC_.D0.BC.D0.BE.D0.B6.D0.BD.D0.BE_.D0.BF.D0.BE.D0.BC.D0.BE.D1.87.D1.8C_.D0.B4.D0.BB.D1.8F_.D1.80.D0.B0.D0.B7.D0.B2.D0.B8.D1.82.D0.B8.D1.8F_FreeCAD.3F"></span><span class="mw-headline" id="&#1063;&#1077;&#1084;_&#1084;&#1086;&#1078;&#1085;&#1086;_&#1087;&#1086;&#1084;&#1086;&#1095;&#1100;_&#1076;&#1083;&#1103;_&#1088;&#1072;&#1079;&#1074;&#1080;&#1090;&#1080;&#1103;_FreeCAD?">&#1063;&#1077;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1084;&#1086;&#1095;&#1100; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1074;&#1080;&#1090;&#1080;&#1103; FreeCAD?</span></h3>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>There are a lot of different ways to help, even if you are not a programmer. Here are a couple of things you can do:
</p>
<ul><li>Give some feedback to the FreeCAD developers: It is always useful to know what people think, what they found good, what they miss, etc. Drop a note on the <a rel="nofollow" class="external text" href="http://forum.freecad.org/">forum</a> giving your opinion or make a request in our <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/issues">Issues section</a>!</li>
<li>Help with writing documentation: The documentation we have here on this site is sometimes very limited. If you discovered something that is not well documented, add your knowledge there!</li>
<li>Help others newcomers: Hang around the forum, and help new people to solve basic questions, like how do I install, how do I add a cube, etc.</li>
<li><a href="../Help_FreeCAD.html#Translate_the_documentation" title="Help FreeCAD">Translate the documentation</a> into your own language</li>
<li><a href="../Help_FreeCAD.html#Translate_FreeCAD" title="Help FreeCAD">Translate FreeCAD</a> into your own language</li>
<li>Write <a href="../Tutorials.html" title="Tutorials">Tutorials</a>, or record video tutorials: Tutorials are a very easy way for newcomers to learn a new software. If you did some nice stuff, why not show other people how to do it?</li>
<li>Contribute with assets and examples: We are still missing good example files in FreeCAD. If you created something good, share it with us!</li>
<li><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/issues">Submit bugs</a>: It is very important to have all possible bugs fixed. If you find one, report it as clearly as possible, so we can understand exactly what's happening.</li>
<li>Try to do some Python coding: You never programmed before but you want to try? Python is easy. Read our <a href="../Introduction_to_Python.html" title="Introduction to Python">introduction to Python</a>, but beware, you might get addicted quickly!</li>
<li>See the <a href="../Help_FreeCAD.html" title="Help FreeCAD">Help FreeCAD</a> page for more details on how to contribute.</li></ul>
</div>
<p><span id="How_can_I_get_edit_permission_on_the_wiki?"></span>
</p>
<h3><span id=".D0.9A.D0.B0.D0.BA_.D0.BF.D0.BE.D0.BB.D1.83.D1.87.D0.B8.D1.82.D1.8C_.D0.B4.D0.BE.D1.81.D1.82.D1.83.D0.BF_.D0.BA_.D1.80.D0.B5.D0.B4.D0.B0.D0.BA.D1.82.D0.B8.D1.80.D0.BE.D0.B2.D0.B0.D0.BD.D0.B8.D1.8E_.D0.B2.D0.B8.D0.BA.D0.B8.3F"></span><span class="mw-headline" id="&#1050;&#1072;&#1082;_&#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100;_&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;_&#1082;_&#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1102;_&#1074;&#1080;&#1082;&#1080;?">&#1050;&#1072;&#1082; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1102; &#1074;&#1080;&#1082;&#1080;?</span></h3>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>See the <a href="../Help_FreeCAD.html#Work_on_the_documentation" title="Help FreeCAD">Work on the documentation</a> page paragraph for more details on how to contribute.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span id="Does_FreeCAD_participate_in_Google_Summer_of_Code.3F"></span><span class="mw-headline" id="Does_FreeCAD_participate_in_Google_Summer_of_Code?">Does FreeCAD participate in Google Summer of Code?</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Yes. Beginning in 2016, FreeCAD participates in Google Summer of Code. See <a href="../Google_Summer_of_Code_2020.html" title="Google Summer of Code 2020">Google Summer of Code 2020</a> for information on past editions, and <a rel="nofollow" class="external text" href="http://forum.freecad.org/viewtopic.php?f=8&amp;t=13838">Google Summer Of Code 2016</a> in the forum for the original announcement.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span id="I_want_to_start_translating_the_wiki_in_my_own_language._What_do_I_do.3F"></span><span class="mw-headline" id="I_want_to_start_translating_the_wiki_in_my_own_language._What_do_I_do?">I want to start translating the wiki in my own language. What do I do?</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>This wiki is hosting a lot of contents. The most up-to-date and interesting material is gathered in the <a href="../Online_Help_Toc.html" title="Online Help Toc">manual</a>.
</p>
</div> 
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>See the <a href="../Help_FreeCAD.html#Work_on_the_documentation" title="Help FreeCAD">Translate the documentation</a> page paragraph for more details on how to translate the wiki.
</p>
</div>
<p><span id="Can_I_buy_swag?"></span>
</p>
<h3><span id=".D0.9C.D0.BE.D0.B6.D0.BD.D0.BE_.D0.BB.D0.B8_.D0.BF.D1.80.D0.B8.D0.BE.D0.B1.D1.80.D0.B5.D1.81.D1.82.D0.B8_.D0.BC.D0.B5.D1.80.D1.87.3F"></span><span class="mw-headline" id="&#1052;&#1086;&#1078;&#1085;&#1086;_&#1083;&#1080;_&#1087;&#1088;&#1080;&#1086;&#1073;&#1088;&#1077;&#1089;&#1090;&#1080;_&#1084;&#1077;&#1088;&#1095;?">&#1052;&#1086;&#1078;&#1085;&#1086; &#1083;&#1080; &#1087;&#1088;&#1080;&#1086;&#1073;&#1088;&#1077;&#1089;&#1090;&#1080; &#1084;&#1077;&#1088;&#1095;?</span></h3>
<p>FreeCAD &#1085;&#1077; &#1087;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090; "&#1092;&#1080;&#1088;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077;" &#1089;&#1091;&#1074;&#1077;&#1085;&#1080;&#1088;&#1099; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1079;&#1072;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1076;&#1083;&#1103; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;. &#1053;&#1086; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1093; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1089;&#1072;&#1084;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;. &#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080; &#1089;&#1084;. &#1085;&#1072; &#1085;&#1072;&#1096;&#1077;&#1081; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; <a href="../ru/Swag.html" title="Swag/ru">&#1057;&#1091;&#1074;&#1077;&#1085;&#1080;&#1088;&#1099;</a>.
</p><p><span id="Licensing,_copying_and_reuse"></span>
</p>
<h2><span id=".D0.9B.D0.B8.D1.86.D0.B5.D0.BD.D0.B7.D0.B8.D1.80.D0.BE.D0.B2.D0.B0.D0.BD.D0.B8.D0.B5.2C_.D0.B0.D0.B2.D1.82.D0.BE.D1.80.D1.81.D0.BA.D0.B8.D0.B5_.D0.BF.D1.80.D0.B0.D0.B2.D0.B0_.D0.B8_.D0.B8.D1.81.D0.BF.D0.BE.D0.BB.D1.8C.D0.B7.D0.BE.D0.B2.D0.B0.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1051;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;,_&#1072;&#1074;&#1090;&#1086;&#1088;&#1089;&#1082;&#1080;&#1077;_&#1087;&#1088;&#1072;&#1074;&#1072;_&#1080;_&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;">&#1051;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;, &#1072;&#1074;&#1090;&#1086;&#1088;&#1089;&#1082;&#1080;&#1077; &#1087;&#1088;&#1072;&#1074;&#1072; &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;</span></h2>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span id="Do_I_have_to_pay_something_to_use_FreeCAD.3F"></span><span class="mw-headline" id="Do_I_have_to_pay_something_to_use_FreeCAD?">Do I have to pay something to use FreeCAD?</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>No. FreeCAD is totally free to use, to download, to redistribute, or to modify. It is <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Open_source">open-source software</a>, published under the terms of the <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/GNU_Lesser_General_Public_License">GNU Lesser General Public License 2.1</a>, which guarantees you those freedoms and, even more important, guarantees you that these freedoms will never be taken from you.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span id="Can_I_reuse_any_part_of_the_FreeCAD_artwork_or_pieces_of_the_website.3F"></span><span class="mw-headline" id="Can_I_reuse_any_part_of_the_FreeCAD_artwork_or_pieces_of_the_website?">Can I  reuse any part of the FreeCAD artwork or pieces of the website?</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Sure. All the artwork (icons, banners, etc.) of FreeCAD are licensed LGPL, same as the FreeCAD code. Help yourself on the <a href="../Artwork.html" title="Artwork">Artwork</a> page. The website is a standard MediaWiki site, all graphic elements can freely be reused, and if you are curious about how to tweak the MediaWiki software like we did, look for the special Common css and js pages.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span id="Can_I_reuse_pieces_of_FreeCAD_in_another_application.3F"></span><span class="mw-headline" id="Can_I_reuse_pieces_of_FreeCAD_in_another_application?">Can I reuse pieces of FreeCAD in another application?</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Yes, you can use the core parts of FreeCAD in other applications as long as you comply with the terms of the LGPL. Third party libraries, <a href="../External_workbenches.html" title="External workbenches">external workbenches</a>, and <a href="../Macros.html" title="Macros">macros</a> may be subject to their own license terms, so please consult with their authors. More details on the <a href="../License.html" title="License">License</a> page.
</p>
</div>
<p><br>
</p>
<div class="docnav" style="background-color: #ececef; border: 1px solid #a2a9b1; padding: 2px 10px; margin: 10px 0; line-height: 1; clear: both; overflow: hidden;">
    <div style="margin: 4px 0; float: left;"><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-left.svg" decoding="async" width="16" height="16"></span></span> <a href="../ru/Import_Export.html" title="Import Export/ru">&#1048;&#1084;&#1087;&#1086;&#1088;&#1090; &#1069;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;</a></div>
    <div style="margin: 4px 0; float: right;"><a href="../ru/Tutorials.html" title="Tutorials/ru">&#1057;&#1073;&#1086;&#1088;&#1085;&#1080;&#1082; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074; &#1087;&#1086; &#1086;&#1073;&#1091;&#1095;&#1077;&#1085;&#1080;&#1102;</a>
 <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-right.svg" decoding="async" width="16" height="16"></span></span></div>
    <div style="text-align:center"><a href="../ru/Online_Help_Toc.html" title="Online Help Toc/ru">Index</a> <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Online_Help_Toc.svg" decoding="async" width="24" height="24"></span></span></div>
</div>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: #fefefe;"><span typeof="mw:File"><a href="../index.php?title=User_hub.png&amp;filetimestamp=20190221145008&amp;.html" class="mw-file-description"><img src="../File/User_hub.png" decoding="async" width="24" height="24"></a></span> <a href="../ru/User_hub.html" title="User hub/ru">&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid #aaaaaa; text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: #fefefe;">
<ul><li><b><a href="../ru/Getting_started.html" title="Getting started/ru">&#1053;&#1072;&#1095;&#1080;&#1085;&#1072;&#1102;&#1097;&#1080;&#1084;</a></b></li>
<li><b>&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072;:</b> <a href="../ru/Download.html" title="Download/ru">&#1047;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072;</a>, <a href="../ru/Installing_on_Windows.html" title="Installing on Windows/ru">Windows</a>, <a href="../ru/Installing_on_Linux.html" title="Installing on Linux/ru">Linux</a>, <a href="../ru/Installing_on_Mac.html" title="Installing on Mac/ru">Mac</a>, <a href="../ru/Installing_additional_components.html" title="Installing additional components/ru">
&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074;</a>, <a href="../ru/Compile_on_Docker.html" title="Compile on Docker/ru">Docker</a>, <a href="../ru/AppImage.html" title="AppImage/ru">AppImage</a>, <a href="../ru/Ubuntu_Snap.html" title="Ubuntu Snap/ru">Ubuntu Snap</a></li>
<li><b>&#1041;&#1072;&#1079;&#1086;&#1074;&#1072;&#1103;:</b> <a href="../ru/About_FreeCAD.html" title="About FreeCAD/ru">&#1054; FreeCAD</a>, <a href="../ru/Interface.html" title="Interface/ru">&#1048;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;</a>, <a href="../ru/Mouse_navigation.html" title="Mouse navigation/ru">&#1053;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1103; &#1084;&#1099;&#1096;&#1080;</a>, <a href="../ru/Selection_methods.html" title="Selection methods/ru">&#1052;&#1077;&#1090;&#1086;&#1076;&#1099; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103;</a>, <a href="../ru/Object_name.html" title="Object name/ru">&#1048;&#1084;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;</a>, <a href="../ru/Preferences_Editor.html" title="Preferences Editor/ru">&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;</a>, <a href="../ru/Workbenches.html" title="Workbenches/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>, <a href="../ru/Document_structure.html" title="Document structure/ru">&#1057;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;</a>, <a href="../ru/Property.html" title="Property/ru">&#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;</a>, <a href="../ru/Help_FreeCAD.html" title="Help FreeCAD/ru">&#1055;&#1086;&#1084;&#1086;&#1075;&#1080; FreeCAD</a>, <a href="../ru/Donate.html" title="Donate/ru">&#1055;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</a></li></ul>
<hr>
<ul><li><b>&#1055;&#1086;&#1084;&#1086;&#1097;&#1100;:</b> <a href="../ru/Tutorials.html" title="Tutorials/ru">&#1059;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082;&#1080;</a>, <a href="../ru/Video_tutorials.html" title="Video tutorials/ru">&#1042;&#1080;&#1076;&#1077;&#1086; &#1091;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082;&#1080;</a></li>
<li><b><a href="../ru/Workbenches.html" title="Workbenches/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>:</b> <a href="../ru/Std_Base.html" title="Std Base/ru">Std Base</a>, <a href="../ru/Arch_Workbench.html" title="Arch Workbench/ru">Arch</a>, <a href="../ru/Assembly_Workbench.html" title="Assembly Workbench/ru">Assembly</a>, <a href="../ru/CAM_Workbench.html" title="CAM Workbench/ru">CAM</a>, <a href="../ru/Draft_Workbench.html" title="Draft Workbench/ru">Draft</a>, <a href="../ru/FEM_Workbench.html" title="FEM Workbench/ru">FEM</a>, <a href="../ru/Inspection_Workbench.html" title="Inspection Workbench/ru">Inspection</a>, <a href="../ru/Mesh_Workbench.html" title="Mesh Workbench/ru">Mesh</a>, <a href="../ru/OpenSCAD_Workbench.html" title="OpenSCAD Workbench/ru">OpenSCAD</a>, <a href="../ru/Part_Workbench.html" title="Part Workbench/ru">Part</a>, <a href="../ru/PartDesign_Workbench.html" title="PartDesign Workbench/ru">PartDesign</a>, <a href="../ru/Points_Workbench.html" title="Points Workbench/ru">Points</a>, <a href="../ru/Reverse_Engineering_Workbench.html" title="Reverse Engineering Workbench/ru">Reverse Engineering</a>, <a href="../ru/Robot_Workbench.html" title="Robot Workbench/ru">Robot</a>, <a href="../ru/Sketcher_Workbench.html" title="Sketcher Workbench/ru">Sketcher</a>, <a href="../ru/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/ru">Spreadsheet</a>, <a href="../ru/Surface_Workbench.html" title="Surface Workbench/ru">Surface</a>, <a href="../ru/TechDraw_Workbench.html" title="TechDraw Workbench/ru">TechDraw</a>, <a href="../ru/Testing.html" title="Testing/ru">Test Framework</a></li></ul>
<hr>
<ul><li><b><a href="../ru/Addon.html" title="Addon/ru">Addons</a>:</b> <a href="../ru/Std_AddonMgr.html" title="Std AddonMgr/ru">&#1052;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1081;</a>, <a href="../ru/External_workbenches.html" title="External workbenches/ru">&#1042;&#1085;&#1077;&#1096;&#1085;&#1080;&#1077; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>, <a href="../ru/Scripting_and_macros.html" title="Scripting and macros/ru">C&#1082;&#1088;&#1080;&#1087;&#1090;&#1099; &#1080; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1099;</a></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="../ru/User_hub.html" title="User hub/ru">&#1059;&#1075;&#1086;&#1083;&#1086;&#1082; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;</a>, <a href="../ru/Power_users_hub.html" title="Power users hub/ru">&#1059;&#1075;&#1086;&#1083;&#1086;&#1082; &#1086;&#1087;&#1099;&#1090;&#1085;&#1099;&#1093; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;</a>, <a href="../ru/Developer_hub.html" title="Developer hub/ru">&#1059;&#1075;&#1086;&#1083;&#1086;&#1082; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20250625205524
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc, no&#8208;toc&#8208;conversion]
CPU time usage: 0.097 seconds
Real time usage: 0.143 seconds
Preprocessor visited node count: 707/1000000
Post&#8208;expand include size: 14225/2097152 bytes
Template argument size: 3712/2097152 bytes
Highest expansion depth: 5/100
Expensive parser function count: 1/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 5171/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   45.666      1 -total
 18.21%    8.318      1 Template:Docnav/ru
 12.75%    5.822      1 Template:Userdocnavi/ru
  7.65%    3.493      2 Template:Clear
  5.56%    2.539      1 Template:Navigation_menu_2
  4.84%    2.211      1 Template:Code
  4.00%    1.828     20 Template:FileName
  3.78%    1.728     11 Template:SystemInput
  3.34%    1.526      2 Template:MenuCommand
  3.21%    1.468      2 Template:VersionPlus
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:247388-0!canonical and timestamp 20250625205524 and revision id 1596375. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>