<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Help FreeCAD/ru</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="ru" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Help+FreeCAD&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--high" title="FreeCAD Unterst&uuml;tzen (94% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Help_FreeCAD.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Help FreeCAD (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../tr/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="FreeCAD'e yard&#305;m edin (19% translated)" lang="tr" dir="ltr">T&uuml;rk&ccedil;e</a></li>
<li><a href="../es/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="Ayuda a FreeCAD (68% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--complete" title="Contribuer &agrave; FreeCAD (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../hr/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="Pomozite FreeCAD-u (61% translated)" lang="hr" dir="ltr">hrvatski</a></li>
<li><a href="../it/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--complete" title="Contribuire a FreeCAD (100% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--complete" title="Pom&oacute;&#380; w rozwoju FreeCAD (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--low" title="Ajudar o FreeCAD (3% translated)" lang="pt" dir="ltr">portugu&ecirc;s</a></li>
<li><a href="../pt-br/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="Ajude o FreeCAD (68% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../ro/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="Help FreeCAD (32% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><a href="../fi/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--low" title="Auta FreeCADi&auml; (3% translated)" lang="fi" dir="ltr">suomi</a></li>
<li><a href="../sv/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--low" title="Help FreeCAD (6% translated)" lang="sv" dir="ltr">svenska</a></li>
<li><a href="../cs/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--low" title="Help FreeCAD (3% translated)" lang="cs" dir="ltr">&#269;e&scaron;tina</a></li>
<li><a href="../bg/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--low" title="Help FreeCAD/bg (0% translated)" lang="bg" dir="ltr">&#1073;&#1098;&#1083;&#1075;&#1072;&#1088;&#1089;&#1082;&#1080;</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</span></li>
<li><a href="../uk/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--low" title="Help FreeCAD (3% translated)" lang="uk" dir="ltr">&#1091;&#1082;&#1088;&#1072;&#1111;&#1085;&#1089;&#1100;&#1082;&#1072;</a></li>
<li><a href="../zh-cn/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="&#24110;&#21161;FreeCAD (52% translated)" lang="zh-Hans-CN" dir="ltr">&#20013;&#25991;&#65288;&#20013;&#22269;&#22823;&#38470;&#65289;</a></li>
<li><a href="../zh-tw/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="&#24171;&#21161;FreeCAD (16% translated)" lang="zh-Hant-TW" dir="ltr">&#20013;&#25991;&#65288;&#33274;&#28771;&#65289;</a></li>
<li><a href="../ja/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="FreeCAD&#12408;&#12398;&#36002;&#29486; (19% translated)" lang="ja" dir="ltr">&#26085;&#26412;&#35486;</a></li>
<li><a href="../ko/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="FreeCAD &#46037;&#44592; (35% translated)" lang="ko" dir="ltr">&#54620;&#44397;&#50612;</a></li></ul></div>
<div style="clear:right; margin-bottom: .5em; float: right; padding: .5em 0 .8em 1.4em; background: none;"><meta property="mw:PageProp/toc"></div>
<p><span id="Introduction"></span>
</p>
<h2><span id=".D0.92.D1.81.D1.82.D1.83.D0.BF.D0.BB.D0.B5.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1042;&#1089;&#1090;&#1091;&#1087;&#1083;&#1077;&#1085;&#1080;&#1077;">&#1042;&#1089;&#1090;&#1091;&#1087;&#1083;&#1077;&#1085;&#1080;&#1077;</span></h2>
<p>&#1045;&#1089;&#1083;&#1080; &#1074;&#1072;&#1084; &#1085;&#1088;&#1072;&#1074;&#1080;&#1090;&#1089;&#1103; FreeCAD &#1080; &#1074;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1087;&#1086;&#1084;&#1086;&#1095;&#1100; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1091;, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1084;&#1085;&#1086;&#1075;&#1086;&#1077;, &#1085;&#1077;&#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086; &#1086;&#1090; &#1090;&#1086;&#1075;&#1086;, &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1083;&#1080; &#1074;&#1099; &#1080;&#1085;&#1074;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1088;&#1077;&#1084;&#1103; &#1080;&#1083;&#1080; &#1076;&#1077;&#1085;&#1100;&#1075;&#1080;, &#1091;&#1084;&#1077;&#1077;&#1090;&#1077; &#1083;&#1080; &#1074;&#1099; &#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1082;&#1086;&#1076; &#1080;&#1083;&#1080; &#1085;&#1077;&#1090;.
</p><p><span id="Donate_money"></span>
</p>
<h2><span id=".D0.9F.D0.BE.D0.B6.D0.B5.D1.80.D1.82.D0.B2.D1.83.D0.B9.D1.82.D0.B5_.D0.B4.D0.B5.D0.BD.D1.8C.D0.B3.D0.B8"></span><span class="mw-headline" id="&#1055;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1091;&#1081;&#1090;&#1077;_&#1076;&#1077;&#1085;&#1100;&#1075;&#1080;">&#1055;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1091;&#1081;&#1090;&#1077; &#1076;&#1077;&#1085;&#1100;&#1075;&#1080;</span></h2>
<p>&#1061;&#1086;&#1090;&#1103; FreeCAD &#1085;&#1077; &#1085;&#1091;&#1078;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1076;&#1077;&#1085;&#1100;&#1075;&#1072;&#1093; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1074;&#1080;&#1090;&#1080;&#1103;, &#1087;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1084;&#1086;&#1075;&#1091;&#1090; &#1087;&#1086;&#1084;&#1086;&#1095;&#1100; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1091; &#1088;&#1072;&#1079;&#1074;&#1080;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1076;&#1072;&#1083;&#1100;&#1096;&#1077; &#1080; &#1073;&#1099;&#1089;&#1090;&#1088;&#1077;&#1077;. &#1053;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; <a href="../ru/Donate.html" title="Donate/ru">&#1087;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100;</a> &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1099; &#1074;&#1089;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1077; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1099; &#1087;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1076;&#1077;&#1085;&#1077;&#1075; &#1085;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;.
</p><p><span id="Work_on_the_documentation"></span>
</p>
<h2><span id=".D0.A0.D0.B0.D0.B1.D0.BE.D1.82.D0.B0_.D0.BD.D0.B0.D0.B4_.D0.B4.D0.BE.D0.BA.D1.83.D0.BC.D0.B5.D0.BD.D1.82.D0.B0.D1.86.D0.B8.D0.B5.D0.B9"></span><span class="mw-headline" id="&#1056;&#1072;&#1073;&#1086;&#1090;&#1072;_&#1085;&#1072;&#1076;_&#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1077;&#1081;">&#1056;&#1072;&#1073;&#1086;&#1090;&#1072; &#1085;&#1072;&#1076; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1077;&#1081;</span></h2>
<p>&#1055;&#1086;&#1084;&#1086;&#1075;&#1080;&#1090;&#1077; &#1085;&#1072;&#1084; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100;, &#1082;&#1086;&#1088;&#1088;&#1077;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1103;&#1090;&#1100; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1102;. &#1048;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1081;&#1090;&#1077; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080;, &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1103;&#1081;&#1090;&#1077; &#1080;&#1083;&#1080; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1081;&#1090;&#1077; &#1085;&#1077;&#1087;&#1086;&#1085;&#1103;&#1090;&#1085;&#1099;&#1077; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1081;&#1090;&#1077; &#1085;&#1086;&#1074;&#1099;&#1077; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;, &#1077;&#1089;&#1083;&#1080; &#1090;&#1077;&#1084;&#1072; &#1091;&#1087;&#1091;&#1097;&#1077;&#1085;&#1072;, &#1080; &#1090;&#1072;&#1082; &#1076;&#1072;&#1083;&#1077;&#1077;. &#1042;&#1085;&#1077;&#1089;&#1090;&#1080; &#1089;&#1074;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076; &#1074; &#1088;&#1072;&#1079;&#1074;&#1080;&#1090;&#1080;&#1077; &#1074;&#1080;&#1082;&#1080; FreeCAD &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;, &#1085;&#1072; <a href="../ru/WikiPages.html" title="WikiPages/ru">WikiPages</a> &#1074;&#1099; &#1085;&#1072;&#1081;&#1076;&#1105;&#1090;&#1077; &#1086;&#1073;&#1097;&#1080;&#1077; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1072;&#1094;&#1080;&#1080;, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1076;&#1083;&#1103; &#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1072;. &#1044;&#1083;&#1103; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074;&#1080;&#1082;&#1080; &#1074;&#1072;&#1084; &#1087;&#1086;&#1085;&#1072;&#1076;&#1086;&#1073;&#1080;&#1090;&#1089;&#1103; &#1074;&#1080;&#1082;&#1080;-&#1072;&#1082;&#1082;&#1072;&#1091;&#1085;&#1090; &#1089; &#1087;&#1088;&#1072;&#1074;&#1072;&#1084;&#1080; &laquo;&#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;&#1072;&raquo; (&#1074;&#1080;&#1082;&#1080; &#1079;&#1072;&#1097;&#1080;&#1097;&#1077;&#1085;&#1072; &#1086;&#1090; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1074;&#1086; &#1080;&#1079;&#1073;&#1077;&#1078;&#1072;&#1085;&#1080;&#1077; &#1089;&#1087;&#1072;&#1084;&#1072;). &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1080;&#1090;&#1100; &#1091;&#1095;&#1077;&#1090;&#1085;&#1091;&#1102; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; <a rel="nofollow" class="external text" href="http://forum.freecad.org/viewtopic.php?f=21&amp;t=6830">&#1085;&#1072; &#1092;&#1086;&#1088;&#1091;&#1084;&#1077;</a> &#1080;&#1083;&#1080; &#1085;&#1072; <a rel="nofollow" class="external text" href="https://wiki.freecad.org/Help#Chat">&#1082;&#1072;&#1085;&#1072;&#1083;&#1077; IRC</a>. &#1053;&#1086; &#1091;&#1095;&#1090;&#1080;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1082;&#1072;&#1085;&#1072;&#1083; IRC &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1085;&#1077; &#1090;&#1072;&#1082; &#1086;&#1090;&#1079;&#1099;&#1074;&#1095;&#1080;&#1074;, &#1082;&#1072;&#1082; &#1092;&#1086;&#1088;&#1091;&#1084;.
<a rel="nofollow" class="external text" href="https://forum.freecad.org">&#1054;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1092;&#1086;&#1088;&#1091;&#1084; FreeCAD</a> &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1075;&#1083;&#1072;&#1074;&#1085;&#1099;&#1084; &#1084;&#1077;&#1089;&#1090;&#1086;&#1084; &#1076;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1079;&#1072;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099; &#1080; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1090;&#1100; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103;, &#1101;&#1090;&#1086; &#1087;&#1086;&#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1086;&#1087;&#1099;&#1090; &#1080; &#1079;&#1085;&#1072;&#1085;&#1080;&#1103; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1072;.
</p><p>&#1053;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1077;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1078;&#1076;&#1091;&#1090; &#1074;&#1072;&#1096;&#1077;&#1081; &#1087;&#1086;&#1084;&#1086;&#1097;&#1080;:
</p>
<ul><li>&#1053;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; <a href="../Category;Command_Reference.html" title="Category:Command Reference"> Category:Command Reference</a> &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1099; &#1080; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1099; &#1074;&#1089;&#1077; <a href="../ru/Command.html" title="Command/ru"> &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;</a> FreeCAD. &#1041;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1080;&#1079; &#1085;&#1080;&#1093; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090; &#1084;&#1072;&#1083;&#1086; &#1080;&#1083;&#1080; &#1074;&#1086;&#1086;&#1073;&#1097;&#1077; &#1085;&#1080;&#1082;&#1072;&#1082;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;. &#1055;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077;&#1089;&#1100; &#1082; <a href="../ru/WikiPages.html" title="WikiPages/ru">&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;&#1084; Wiki</a> &#1076;&#1083;&#1103; &#1086;&#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072;&#1084;&#1080; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1077;&#1090;&#1100; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;.</li>
<li>&#1057;&#1077;&#1082;&#1094;&#1080;&#1080; <a href="../ru/Tutorials.html" title="Tutorials/ru">&#1059;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082;&#1080;</a> &#1085;&#1091;&#1078;&#1085;&#1099; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1083;&#1080; &#1095;&#1090;&#1086;-&#1090;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1085;&#1086;&#1077; &#1074; FreeCAD, &#1087;&#1086;&#1095;&#1077;&#1084;&#1091; &#1073;&#1099; &#1085;&#1077; &#1079;&#1072;&#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;, &#1082;&#1072;&#1082; &#1074;&#1099; &#1101;&#1090;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1083;&#1080; &#1076;&#1083;&#1103; &#1087;&#1086;&#1090;&#1086;&#1084;&#1082;&#1086;&#1074;?</li>
<li>&#1053;&#1072; &#1089;&#1072;&#1081;&#1090;&#1077; FreeCAD <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/issues">&laquo;bug tracker&raquo;</a> &#1087;&#1086; &#1090;&#1077;&#1075;&#1091; <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/issues?q=is%3Aopen+is%3Aissue+label%3Adocumentation">&laquo;documentation&raquo;</a> &#1077;&#1089;&#1090;&#1100; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1077; &#1090;&#1080;&#1082;&#1077;&#1090;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1085;&#1077; &#1087;&#1086;&#1084;&#1077;&#1096;&#1072;&#1083;&#1086; &#1073;&#1099; &#1085;&#1077;&#1084;&#1085;&#1086;&#1075;&#1086; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1103;.</li></ul>
<p><span id="Share_your_FreeCAD_knowledge"></span>
</p>
<h2><span id=".D0.9F.D0.BE.D0.B4.D0.B5.D0.BB.D0.B8.D1.82.D0.B5.D1.81.D1.8C_.D1.81.D0.B2.D0.BE.D0.B8.D0.BC.D0.B8_.D0.B7.D0.BD.D0.B0.D0.BD.D0.B8.D1.8F.D0.BC.D0.B8_FreeCAD"></span><span class="mw-headline" id="&#1055;&#1086;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077;&#1089;&#1100;_&#1089;&#1074;&#1086;&#1080;&#1084;&#1080;_&#1079;&#1085;&#1072;&#1085;&#1080;&#1103;&#1084;&#1080;_FreeCAD">&#1055;&#1086;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077;&#1089;&#1100; &#1089;&#1074;&#1086;&#1080;&#1084;&#1080; &#1079;&#1085;&#1072;&#1085;&#1080;&#1103;&#1084;&#1080; FreeCAD</span></h2>
<p>&#1057;&#1086;&#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; FreeCAD &#1087;&#1086;&#1082;&#1072; &#1077;&#1097;&#1105; &#1085;&#1077;&#1074;&#1077;&#1083;&#1080;&#1082;&#1086;, &#1085;&#1086; &#1091;&#1078;&#1077; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090; &#1074; &#1089;&#1077;&#1073;&#1103; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1087;&#1099;&#1090;&#1085;&#1099;&#1093; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1076;&#1077;&#1083;&#1072;&#1102;&#1090; &#1086;&#1095;&#1077;&#1085;&#1100; &#1074;&#1072;&#1078;&#1085;&#1091;&#1102; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091;, &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1103; &#1085;&#1086;&#1074;&#1080;&#1095;&#1082;&#1072;&#1084;, &#1082;&#1072;&#1082; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1086;&#1081;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1085;&#1072;&#1095;&#1085;&#1105;&#1090;&#1077; &#1095;&#1091;&#1074;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1077;&#1073;&#1103; &#1082;&#1086;&#1084;&#1092;&#1086;&#1088;&#1090;&#1085;&#1086; &#1074; FreeCAD, &#1074;&#1072;&#1096;&#1080; &#1079;&#1085;&#1072;&#1085;&#1080;&#1103; &#1084;&#1086;&#1075;&#1091;&#1090; &#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;&#1089;&#1103; &#1086;&#1095;&#1077;&#1085;&#1100; &#1094;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; &#1076;&#1083;&#1103; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093;, &#1080; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077;
&#1074;&#1085;&#1077;&#1089;&#1090;&#1080; &#1089;&#1074;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076;, &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1074; &#1090;&#1072;&#1082;&#1080;&#1077; &#1074;&#1072;&#1078;&#1085;&#1099;&#1077; &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083;&#1099;, &#1082;&#1072;&#1082;:
</p>
<ul><li>&#1055;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1074;&#1099; &#1076;&#1077;&#1083;&#1072;&#1077;&#1090;&#1077; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; FreeCAD, &#1085;&#1072; &#1092;&#1086;&#1088;&#1091;&#1084;&#1077; <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewforum.php?f=24">Users Showcase</a>. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100; &#1089;&#1082;&#1088;&#1080;&#1085;&#1096;&#1086;&#1090;&#1099;, &#1072; &#1077;&#1097;&#1105; &#1083;&#1091;&#1095;&#1096;&#1077; - &#1087;&#1088;&#1080;&#1082;&#1088;&#1077;&#1087;&#1083;&#1103;&#1090;&#1100; &#1092;&#1072;&#1081;&#1083;&#1099; FreeCAD, &#1095;&#1090;&#1086;&#1073;&#1099; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1083;&#1102;&#1076;&#1080; &#1084;&#1086;&#1075;&#1083;&#1080; &#1080;&#1079;&#1091;&#1095;&#1080;&#1090;&#1100; &#1080;&#1093; &#1080; &#1087;&#1086;&#1085;&#1103;&#1090;&#1100;, &#1082;&#1072;&#1082; &#1074;&#1099; &#1101;&#1090;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1083;&#1080;.</li>
<li>&#1047;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1090;&#1100; <a rel="nofollow" class="external text" href="https://www.youtube.com/user/FreeCADNews">&#1074;&#1080;&#1076;&#1077;&#1086;</a>, &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1077;, &#1082;&#1072;&#1082; &#1074;&#1099; &#1089;&#1076;&#1077;&#1083;&#1072;&#1083;&#1080; &#1095;&#1090;&#1086;-&#1090;&#1086; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1086;&#1077; &#1074;&#1086; FreeCAD. &#1069;&#1090;&#1080; &#1074;&#1080;&#1076;&#1077;&#1086; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1086;&#1090;&#1083;&#1080;&#1095;&#1085;&#1086; &#1076;&#1077;&#1084;&#1086;&#1085;&#1089;&#1090;&#1088;&#1080;&#1088;&#1091;&#1102;&#1090; &#1085;&#1086;&#1074;&#1099;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080;.</li>
<li>&#1055;&#1080;&#1089;&#1072;&#1090;&#1100; <a href="../ru/Tutorials.html" title="Tutorials/ru">&#1059;&#1095;&#1077;&#1073;&#1085;&#1099;&#1077; &#1087;&#1086;&#1089;&#1086;&#1073;&#1080;&#1103;</a>, &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1103; &#1080;&#1083;&#1080; &#1086;&#1073;&#1091;&#1095;&#1072;&#1103; &#1095;&#1077;&#1084;&#1091;-&#1090;&#1086; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1086;&#1084;&#1091;. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1091;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082;&#1080; &#1074; &#1089;&#1074;&#1086;&#1105;&#1084; &#1073;&#1083;&#1086;&#1075;&#1077;, &#1087;&#1088;&#1103;&#1084;&#1086; &#1085;&#1072; &#1085;&#1072;&#1096;&#1077;&#1081; &#1074;&#1080;&#1082;&#1080; &#1080;&#1083;&#1080; &#1076;&#1072;&#1078;&#1077; &#1085;&#1072; &#1092;&#1086;&#1088;&#1091;&#1084;&#1077;.</li>
<li>&#1055;&#1091;&#1073;&#1083;&#1080;&#1082;&#1091;&#1081;&#1090;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1074; &#1089;&#1086;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1077;&#1090;&#1080; &#1089; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084; &#1082;&#1086;&#1076;&#1086;&#1084; <a rel="nofollow" class="external text" href="https://joinmastodon.org/">Mastodon</a> (&#1080; <a rel="nofollow" class="external text" href="https://fosstodon.org/@FreeCAD">follow FreeCAD</a> &#1090;&#1072;&#1084;), &#1074; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077; <a rel="nofollow" class="external text" href="https://www.facebook.com/groups/416491481766626">Facebook</a> &#1080;&#1083;&#1080; &#1074; <a rel="nofollow" class="external text" href="https://twitter.com">Twitter</a> (&#1080; <a rel="nofollow" class="external text" href="https://twitter.com/FreeCADNews">follow FreeCAD</a> &#1079;&#1076;&#1077;&#1089;&#1100;). &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1093;&#1101;&#1096;&#1090;&#1077;&#1075;&#1080; #FreeCAD, #MadeWithFreeCAD &#1080;&#1083;&#1080; #fc3d, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1072;&#1096;&#1080; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;, &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089; FreeCAD, &#1073;&#1099;&#1083;&#1086; &#1083;&#1077;&#1075;&#1095;&#1077; &#1085;&#1072;&#1081;&#1090;&#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;&#1084; FreeCAD.</li>
<li>&#1055;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1086; FreeCAD &#1085;&#1072; <a rel="nofollow" class="external text" href="https://www.reddit.com/search/?q=freecad&amp;type=link&amp;sort=new">Reddit</a>, <a rel="nofollow" class="external text" href="https://3dprinting.stackexchange.com/search?tab=newest&amp;q=freecad">3dprinting.stackexchange</a>, <a rel="nofollow" class="external text" href="https://stackoverflow.com/search?q=freecad">StackOverflow</a>... &#1057;&#1090;&#1072;&#1088;&#1072;&#1081;&#1090;&#1077;&#1089;&#1100; &#1086;&#1090;&#1074;&#1077;&#1095;&#1072;&#1090;&#1100; &#1085;&#1072; &#1085;&#1080;&#1093; &#1080; &#1091;&#1095;&#1072;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103;&#1093;, &#1076;&#1077;&#1083;&#1103;&#1089;&#1100; &#1089;&#1074;&#1086;&#1080;&#1084; &#1086;&#1087;&#1099;&#1090;&#1086;&#1084; &#1080; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081;.</li>
<li>&#1055;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1081;&#1090;&#1077; &#1085;&#1072; IRC-&#1082;&#1072;&#1085;&#1072;&#1083;&#1077; FreeCAD &#1080;&#1083;&#1080; <a rel="nofollow" class="external text" href="https://www.freecad.org/wiki/Help#Chat">&#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1095;&#1072;&#1090;-&#1075;&#1088;&#1091;&#1087;&#1087;&#1072;&#1093;</a>.</li></ul>
<p><span id="Translate_FreeCAD"></span>
</p>
<h2><span id=".D0.9F.D0.B5.D1.80.D0.B5.D0.B2.D0.B5.D0.B4.D0.B8.D1.82.D0.B5_FreeCAD"></span><span class="mw-headline" id="&#1055;&#1077;&#1088;&#1077;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077;_FreeCAD">&#1055;&#1077;&#1088;&#1077;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; FreeCAD</span></h2>
<p>&#1055;&#1077;&#1088;&#1077;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; FreeCAD &#1085;&#1072; &#1089;&#1074;&#1086;&#1081; &#1103;&#1079;&#1099;&#1082;. &#1042;&#1089;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1099;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072; FreeCAD &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1083;&#1077;&#1075;&#1082;&#1086; &#1087;&#1077;&#1088;&#1077;&#1074;&#1077;&#1076;&#1077;&#1085;&#1099; &#1085;&#1072; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1103;&#1079;&#1099;&#1082;&#1080;. &#1042;&#1089;&#1077;, &#1095;&#1090;&#1086; &#1085;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086;, &#1101;&#1090;&#1086; &#1082;&#1090;&#1086;-&#1090;&#1086;, &#1082;&#1090;&#1086; &#1079;&#1085;&#1072;&#1077;&#1090; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1103;&#1079;&#1099;&#1082; &#1080; &#1075;&#1086;&#1090;&#1086;&#1074; &#1087;&#1086;&#1084;&#1086;&#1095;&#1100;! &#1042;&#1089;&#1077; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1099; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099; &#1086;&#1085;&#1083;&#1072;&#1081;&#1085; &#1085;&#1072; <a rel="nofollow" class="external text" href="https://crowdin.net/project/freecad">Crowdin</a>.
</p><p>&#1055;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1077;&#1077; &#1086; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1077; &#1089;&#1084;&#1086;&#1090;&#1088;&#1080; &#1074; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077; <a href="../ru/Localisation.html" title="Localisation/ru">&#1051;&#1086;&#1082;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103;</a>.
</p><p><span id="Translate_the_documentation"></span>
</p>
<h2><span id=".D0.9F.D0.B5.D1.80.D0.B5.D0.B2.D0.B5.D0.B4.D0.B8.D1.82.D0.B5_.D0.B4.D0.BE.D0.BA.D1.83.D0.BC.D0.B5.D0.BD.D1.82.D0.B0.D1.86.D0.B8.D1.8E"></span><span class="mw-headline" id="&#1055;&#1077;&#1088;&#1077;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077;_&#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1102;">&#1055;&#1077;&#1088;&#1077;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1102;</span></h2>
<p>&#1055;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100; &#1083;&#1077;&#1075;&#1082;&#1086;, &#1074;&#1080;&#1082;&#1080; FreeCAD &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1087;&#1083;&#1072;&#1075;&#1080;&#1085; &#1076;&#1083;&#1103; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100; &#1073;&#1072;&#1079;&#1086;&#1074;&#1091;&#1102; &#1072;&#1085;&#1075;&#1083;&#1080;&#1081;&#1089;&#1082;&#1091;&#1102; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; &#1085;&#1072; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1103;&#1079;&#1099;&#1082;&#1080;.
</p><p>&#1055;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1077;&#1077; &#1086; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1077; &#1089;&#1084;. <a href="../Localisation.html#Translating_the_wiki" title="Localisation">Localisation#Translating the wiki</a>.
</p><p>&#1055;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1091;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1099; &#1089; &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1084;&#1080; &#1074;&#1080;&#1082;&#1080;-&#1088;&#1072;&#1079;&#1084;&#1077;&#1090;&#1082;&#1080;; &#1076;&#1083;&#1103; &#1089;&#1087;&#1088;&#1072;&#1074;&#1082;&#1080; &#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; <a href="../Help;Editing.html" title="Help:Editing">&#1055;&#1086;&#1084;&#1086;&#1097;&#1100;:&#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;</a>.
</p><p>&#1047;&#1072;&#1090;&#1077;&#1084; &#1087;&#1077;&#1088;&#1077;&#1081;&#1076;&#1080;&#1090;&#1077; &#1085;&#1072; <a href="../WikiPages.html" title="WikiPages">WikiPages</a> &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1080;&#1090;&#1100;&#1089;&#1103; &#1089;&#1086; &#1089;&#1090;&#1080;&#1083;&#1077;&#1084;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1084; &#1074; &#1101;&#1090;&#1086;&#1081; &#1074;&#1080;&#1082;&#1080;, &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1082;&#1086;&#1075;&#1076;&#1072; &#1088;&#1077;&#1095;&#1100; &#1080;&#1076;&#1077;&#1090; &#1086; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1072;&#1093;.
</p><p><span id="Help_others_to_know_FreeCAD"></span>
</p>
<h2><span id=".D0.9F.D0.BE.D0.BC.D0.BE.D0.B3.D0.B8.D1.82.D0.B5_.D0.B4.D1.80.D1.83.D0.B3.D0.B8.D0.BC_.D1.83.D0.B7.D0.BD.D0.B0.D1.82.D1.8C_.D0.BE_FreeCAD"></span><span class="mw-headline" id="&#1055;&#1086;&#1084;&#1086;&#1075;&#1080;&#1090;&#1077;_&#1076;&#1088;&#1091;&#1075;&#1080;&#1084;_&#1091;&#1079;&#1085;&#1072;&#1090;&#1100;_&#1086;_FreeCAD">&#1055;&#1086;&#1084;&#1086;&#1075;&#1080;&#1090;&#1077; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084; &#1091;&#1079;&#1085;&#1072;&#1090;&#1100; &#1086; FreeCAD</span></h2>
<ul><li>&#1055;&#1086;&#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090;&#1077; &#1086; FreeCAD &#1089; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1083;&#1102;&#1076;&#1100;&#1084;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1079;&#1072;&#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1086;&#1074;&#1072;&#1085;&#1099;</li>
<li>&#1053;&#1072;&#1081;&#1076;&#1080;&#1090;&#1077; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1086;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; FreeCAD &#1080; &#1079;&#1072;&#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1089;&#1086; &#1089;&#1085;&#1080;&#1084;&#1082;&#1072;&#1084;&#1080; &#1101;&#1082;&#1088;&#1072;&#1085;&#1072;. FreeCAD &#1086;&#1095;&#1077;&#1085;&#1100; &#1084;&#1086;&#1083;&#1086;&#1076;, &#1080; &#1085;&#1077; &#1084;&#1085;&#1086;&#1075;&#1080;&#1077; &#1083;&#1102;&#1076;&#1080; &#1074;&#1080;&#1076;&#1103;&#1090;, &#1095;&#1090;&#1086; &#1086;&#1085;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1089; &#1085;&#1080;&#1084; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1091;&#1078;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1077;&#1089;&#1100; &#1087;&#1086;&#1082;&#1083;&#1086;&#1085;&#1085;&#1080;&#1082;&#1086;&#1084; FreeCAD, &#1074;&#1099; &#1085;&#1072;&#1074;&#1077;&#1088;&#1085;&#1103;&#1082;&#1072; &#1079;&#1085;&#1072;&#1077;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; FreeCAD. &#1055;&#1086;&#1084;&#1086;&#1075;&#1080;&#1090;&#1077; &#1085;&#1072;&#1084; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;!</li>
<li>&#1055;&#1086;&#1089;&#1077;&#1097;&#1072;&#1081;&#1090;&#1077; &#1092;&#1086;&#1088;&#1091;&#1084;, &#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1081;&#1090;&#1077; &#1085;&#1086;&#1074;&#1080;&#1095;&#1082;&#1072;&#1084; &#1088;&#1077;&#1096;&#1072;&#1090;&#1100; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099;</li>
<li>&#1055;&#1080;&#1096;&#1080;&#1090;&#1077; &#1087;&#1086;&#1089;&#1086;&#1073;&#1080;&#1103;, &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1081;&#1090;&#1077; &#1074;&#1080;&#1076;&#1077;&#1086; &#1080; &#1090;.&#1076;., &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1097;&#1077;&#1077;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1076;&#1077;&#1083;&#1072;&#1077;&#1090;&#1077; &#1089; FreeCAD</li>
<li>&#1055;&#1086;&#1084;&#1086;&#1075;&#1072;&#1081;&#1090;&#1077; &#1089; &#1092;&#1072;&#1081;&#1083;&#1072;&#1084;&#1080;, &#1095;&#1077;&#1088;&#1090;&#1077;&#1078;&#1072;&#1084;&#1080; &#1080; &#1090;.&#1076;. &#1053;&#1072;&#1084; &#1074;&#1089;&#1077; &#1077;&#1097;&#1077; &#1085;&#1077; &#1093;&#1074;&#1072;&#1090;&#1072;&#1077;&#1090; &#1093;&#1086;&#1088;&#1086;&#1096;&#1080;&#1093; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1086;&#1074; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; FreeCAD</li>
<li>&#1055;&#1086;&#1084;&#1086;&#1075;&#1080;&#1090;&#1077; &#1087;&#1088;&#1086;&#1076;&#1074;&#1080;&#1085;&#1091;&#1090;&#1100; FreeCAD &#1085;&#1072; GitHub <a rel="nofollow" class="external text" href="https://help.github.com/articles/be-social/#watch-a-project">"Starring" and "Watching"</a> <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD">&#1056;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1081; FreeCAD</a></li></ul>
<p><span id="Report_bugs_and_ask_for_interesting_features"></span>
</p>
<h2><span id=".D0.A1.D0.BE.D0.BE.D0.B1.D1.89.D0.B0.D0.B9.D1.82.D0.B5_.D0.BE.D0.B1_.D0.BE.D1.88.D0.B8.D0.B1.D0.BA.D0.B0.D1.85_.D0.B8_.D0.B7.D0.B0.D0.BF.D1.80.D0.B0.D1.88.D0.B8.D0.B2.D0.B0.D0.B9.D1.82.D0.B5_.D0.B8.D0.BD.D1.82.D0.B5.D1.80.D0.B5.D1.81.D0.BD.D1.8B.D0.B5_.D1.84.D1.83.D0.BD.D0.BA.D1.86.D0.B8.D0.B8"></span><span class="mw-headline" id="&#1057;&#1086;&#1086;&#1073;&#1097;&#1072;&#1081;&#1090;&#1077;_&#1086;&#1073;_&#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093;_&#1080;_&#1079;&#1072;&#1087;&#1088;&#1072;&#1096;&#1080;&#1074;&#1072;&#1081;&#1090;&#1077;_&#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1099;&#1077;_&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;">&#1057;&#1086;&#1086;&#1073;&#1097;&#1072;&#1081;&#1090;&#1077; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093; &#1080; &#1079;&#1072;&#1087;&#1088;&#1072;&#1096;&#1080;&#1074;&#1072;&#1081;&#1090;&#1077; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1099;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;</span></h2>
<p>&#1040;&#1085;&#1075;&#1083;&#1080;&#1081;&#1089;&#1082;&#1080;&#1081; &#1103;&#1079;&#1099;&#1082;
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=Bugreport-workflow.png&amp;filetimestamp=20170609105123&amp;.html" class="mw-file-description"><img src="../File/Bugreport-workflow.png" decoding="async" width="871" height="83" class="mw-file-element" data-file-width="871" data-file-height="83"></a><figcaption></figcaption></figure>
<p>&#1056;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081; &#1103;&#1079;&#1099;&#1082;
</p>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=Bugreport-workflow_ru.svg&amp;filetimestamp=20210801203943&amp;.html" class="mw-file-description"><img src="../File/Bugreport-workflow_ru.svg" decoding="async" width="871" height="83" class="mw-file-element" data-file-width="871" data-file-height="83"></a><figcaption></figcaption></figure>
<p>&#1053;&#1077;&#1089;&#1084;&#1086;&#1090;&#1088;&#1103; &#1085;&#1072; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1072;&#1090;&#1100; &#1086; &#1074;&#1099;&#1103;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093; &#1080; &#1087;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1084; &#1085;&#1072; <b><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/issues">FreeCAD Issue Tracker &#1085;&#1072; GitHub (&#1058;&#1088;&#1077;&#1082;&#1077;&#1088; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; FreeCAD &#1085;&#1072; GitHub)</a></b>, &#1087;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1087;&#1091;&#1073;&#1083;&#1080;&#1082;&#1091;&#1081;&#1090;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093; &#1080; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1099; &#1085;&#1072; &#1085;&#1086;&#1074;&#1099;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1074; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077; &#1055;&#1086;&#1084;&#1086;&#1097;&#1100;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1089;&#1101;&#1082;&#1086;&#1085;&#1086;&#1084;&#1080;&#1090;&#1100; &#1074;&#1088;&#1077;&#1084;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074; (&#1088;&#1072;&#1073;&#1086;&#1090;&#1072; &#1089; &#1090;&#1088;&#1091;&#1076;&#1085;&#1086;&#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1077;&#1084;&#1099;&#1084;&#1080; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1084;&#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1086;&#1090;&#1085;&#1080;&#1084;&#1072;&#1090;&#1100; &#1084;&#1085;&#1086;&#1075;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;) &#1080; &#1080;&#1079;&#1073;&#1077;&#1078;&#1072;&#1090;&#1100; &#1088;&#1072;&#1079;&#1086;&#1095;&#1072;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1081; &#1080;&#1079;-&#1079;&#1072; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1074;&#1072;&#1096; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089; &#1085;&#1077; &#1073;&#1099;&#1083; &#1088;&#1077;&#1096;&#1105;&#1085; &#1090;&#1072;&#1082;, &#1082;&#1072;&#1082; &#1074;&#1072;&#1084; &#1093;&#1086;&#1090;&#1077;&#1083;&#1086;&#1089;&#1100; &#1073;&#1099;, &#1087;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1081;&#1090;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1077;:
</p>
<ul><li>&#1047;&#1072;&#1087;&#1088;&#1086;&#1089;&#1099; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093; &#1080; &#1085;&#1086;&#1074;&#1099;&#1093; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1103;&#1093; &#1086;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1086;&#1076;&#1085;&#1086;&#1084; &#1090;&#1088;&#1077;&#1082;&#1077;&#1088;&#1077;. &#1055;&#1088;&#1086;&#1089;&#1090;&#1086; &#1086;&#1090;&#1084;&#1077;&#1090;&#1100;&#1090;&#1077; &#1089;&#1074;&#1086;&#1081; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089; &#1082;&#1072;&#1082; <i>&#1086;&#1096;&#1080;&#1073;&#1082;&#1072; (bug)</i> (&#1090;&#1086;, &#1095;&#1090;&#1086; &#1085;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1090;&#1072;&#1082;, &#1082;&#1072;&#1082; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086;) &#1080;&#1083;&#1080; <i>&#1085;&#1086;&#1074;&#1072;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; (feature)</i> (&#1090;&#1086;, &#1095;&#1077;&#1075;&#1086; &#1085;&#1077;&#1090;, &#1085;&#1086; &#1074;&#1099; &#1089;&#1095;&#1080;&#1090;&#1072;&#1077;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1073;&#1099;&#1083;&#1086; &#1073;&#1099; &#1085;&#1077;&#1087;&#1083;&#1086;&#1093;&#1086; &#1080;&#1084;&#1077;&#1090;&#1100;).</li>
<li>&#1061;&#1086;&#1090;&#1103; &#1087;&#1077;&#1088;&#1074;&#1086;&#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086; &#1073;&#1099;&#1083;&#1072; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099; &#1072;&#1085;&#1086;&#1085;&#1080;&#1084;&#1085;&#1086;, &#1082; &#1089;&#1086;&#1078;&#1072;&#1083;&#1077;&#1085;&#1080;&#1102;, &#1101;&#1090;&#1086; &#1087;&#1088;&#1080;&#1096;&#1083;&#1086;&#1089;&#1100; &#1086;&#1090;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1080;&#1079;-&#1079;&#1072; &#1089;&#1087;&#1072;&#1084;&#1072;. &#1058;&#1077;&#1087;&#1077;&#1088;&#1100;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100;/&#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1079;&#1072;&#1103;&#1074;&#1082;&#1080;, &#1074;&#1072;&#1084; &#1087;&#1088;&#1080;&#1076;&#1105;&#1090;&#1089;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1091;&#1095;&#1105;&#1090;&#1085;&#1091;&#1102; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100;. &#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1074;&#1099; &#1073;&#1091;&#1076;&#1077;&#1090;&#1077; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1090;&#1100; &#1091;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1082;&#1090;&#1086;-&#1090;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1079;&#1072;&#1084;&#1077;&#1090;&#1082;&#1080; &#1082; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1077;. &#1042;&#1086; &#1084;&#1085;&#1086;&#1075;&#1080;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1091;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1073;&#1091;&#1076;&#1077;&#1090; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1090;&#1100;&#1089;&#1103; &#1101;&#1090;&#1086;&#1081; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1086;&#1081;, &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1086;&#1090; &#1074;&#1072;&#1089;.</li>
<li>&#1055;&#1088;&#1080; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1080; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1077; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1074;&#1072;&#1078;&#1085;&#1099;&#1084; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1084; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1080; &#1077;&#1105;. &#1054;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1091;&#1082;&#1072;&#1078;&#1080;&#1090;&#1077; &#1090;&#1086;&#1095;&#1085;&#1099;&#1077; &#1096;&#1072;&#1075;&#1080;, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1076;&#1083;&#1103; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082; &#1084;&#1086;&#1075; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1090;&#1086; &#1078;&#1077; &#1089;&#1072;&#1084;&#1086;&#1077; &#1080; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072; &#1087;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1080; &#1085;&#1072; &#1077;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1077;. &#1045;&#1089;&#1083;&#1080; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; &#1085;&#1077; &#1074;&#1080;&#1076;&#1080;&#1090; &#1086;&#1096;&#1080;&#1073;&#1082;&#1091;, &#1086;&#1085; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1077;&#1105; &#1091;&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100;.</li>
<li>&#1058;&#1072;&#1082;&#1078;&#1077; &#1091;&#1082;&#1072;&#1078;&#1080;&#1090;&#1077; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1084;&#1086;&#1095;&#1100; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072;&#1084; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1091;: &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1091;&#1102; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; FreeCAD, &#1090;&#1086;&#1095;&#1085;&#1091;&#1102; &#1074;&#1077;&#1088;&#1089;&#1080;&#1102; FreeCAD &#1080; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080;. &#1055;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1086;&#1087;&#1091;&#1073;&#1083;&#1080;&#1082;&#1091;&#1081;&#1090;&#1077; &#1074;&#1089;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; <i>&#1089;&#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1085;&#1072; &#1076;&#1086;&#1089;&#1082;&#1091; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1081;</i> &#1074; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1077; &#1057;&#1087;&#1088;&#1072;&#1074;&#1082;&#1072; (&#1084;&#1077;&#1085;&#1102;) &rarr; &#1086; FreeCAD.</li>
<li>&#1053;&#1077;&#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086; &#1086;&#1090; &#1090;&#1086;&#1075;&#1086;, &#1085;&#1072;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;&#1099; &#1091;&#1074;&#1077;&#1088;&#1077;&#1085;&#1099;, &#1095;&#1090;&#1086; &#1085;&#1072;&#1096;&#1083;&#1080; &#1086;&#1096;&#1080;&#1073;&#1082;&#1091;, &#1087;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1072;&#1081;&#1090;&#1077; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080; &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1085;&#1072; &#1092;&#1086;&#1088;&#1091;&#1084;&#1077; <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewforum.php?f=3">Help (&#1055;&#1086;&#1084;&#1086;&#1097;&#1100;)</a>.</li>
<li>&#1055;&#1088;&#1077;&#1078;&#1076;&#1077; &#1095;&#1077;&#1084; &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089; &#1085;&#1072; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;, &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1072;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1089; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;&#1084;&#1080; &#1085;&#1072; &#1092;&#1086;&#1088;&#1091;&#1084;&#1077; <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewforum.php?f=8">Open discussion forum (&#1060;&#1086;&#1088;&#1091;&#1084; &#1076;&#1083;&#1103; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1093; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074;/&#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074;)</a>, &#1090;&#1072;&#1082; &#1074;&#1099; &#1089;&#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1073;&#1086;&#1083;&#1077;&#1077; &#1089;&#1086;&#1083;&#1080;&#1076;&#1085;&#1086;&#1077; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;, &#1091; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1096;&#1072;&#1085;&#1089;&#1086;&#1074; &#1079;&#1072;&#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1086;&#1074;&#1072;&#1090;&#1100; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1074; &#1077;&#1075;&#1086; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080;.</li>
<li>&#1055;&#1086;&#1084;&#1085;&#1080;&#1090;&#1077;, &#1095;&#1090;&#1086; FreeCAD &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1076;&#1086;&#1073;&#1088;&#1086;&#1074;&#1086;&#1083;&#1100;&#1094;&#1072;&#1084;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090; &#1089;&#1074;&#1086;&#1105; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1076;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1085;&#1072;&#1076; &#1085;&#1080;&#1084;. &#1061;&#1086;&#1090;&#1103; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1089;&#1090;&#1072;&#1088;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1079;&#1086; &#1074;&#1089;&#1077;&#1093; &#1089;&#1080;&#1083; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1083;&#1091;&#1095;&#1096;&#1077;&#1077; &#1080;&#1079; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1093; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;, &#1074;&#1072;&#1096; &#1086;&#1090;&#1095;&#1077;&#1090; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085; &#1089; &#1085;&#1080;&#1079;&#1082;&#1080;&#1084; &#1087;&#1088;&#1080;&#1086;&#1088;&#1080;&#1090;&#1077;&#1090;&#1086;&#1084; &#1080;&#1083;&#1080; &#1086;&#1090;&#1084;&#1077;&#1085;&#1105;&#1085;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;, &#1072; &#1074;&#1072;&#1096; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1086;&#1090;&#1083;&#1086;&#1078;&#1077;&#1085; &#1080;&#1083;&#1080; &#1076;&#1072;&#1078;&#1077; &#1086;&#1090;&#1082;&#1083;&#1086;&#1085;&#1105;&#1085;, &#1077;&#1089;&#1083;&#1080; &#1085;&#1080; &#1086;&#1076;&#1080;&#1085; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; &#1085;&#1077; &#1079;&#1072;&#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1086;&#1074;&#1072;&#1085; &#1074; &#1077;&#1105; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1080;&#1083;&#1080; &#1077;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090; &#1085;&#1077;&#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1105;&#1084;&#1072; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;.</li></ul>
<p><span id="Triage_bugs"></span>
</p>
<h2><span id=".D0.A1.D0.BE.D1.80.D1.82.D0.B8.D1.80.D0.BE.D0.B2.D0.BA.D0.B0_.D0.BE.D1.88.D0.B8.D0.B1.D0.BE.D0.BA"></span><span class="mw-headline" id="&#1057;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1082;&#1072;_&#1086;&#1096;&#1080;&#1073;&#1086;&#1082;">&#1057;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1082;&#1072; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082;</span></h2>
<p>&#1045;&#1078;&#1077;&#1085;&#1077;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086; &#1085;&#1072; <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/issues">GitHub</a> &#1087;&#1088;&#1080;&#1093;&#1086;&#1076;&#1103;&#1090; &#1076;&#1077;&#1089;&#1103;&#1090;&#1082;&#1080; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093;. &#1058;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1084;&#1085;&#1086;&#1075;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1080;&#1093;, &#1088;&#1072;&#1089;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1087;&#1086; &#1082;&#1072;&#1090;&#1077;&#1075;&#1086;&#1088;&#1080;&#1103;&#1084;, &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100;, &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1084;&#1072; &#1083;&#1080; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072;, &#1087;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100;, &#1084;&#1086;&#1078;&#1085;&#1086; &#1083;&#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1082;&#1072;&#1082;&#1080;&#1077;-&#1090;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1099;&#1077; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103;, &#1080;&#1083;&#1080; &#1087;&#1086;&#1087;&#1088;&#1086;&#1089;&#1080;&#1090;&#1100; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1072;, &#1086;&#1087;&#1091;&#1073;&#1083;&#1080;&#1082;&#1086;&#1074;&#1072;&#1074;&#1096;&#1077;&#1075;&#1086; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1091;, &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;. &#1055;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1100; &#1074; &#1089;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1082;&#1077; &#1086;&#1095;&#1077;&#1085;&#1100; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;, &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1079;&#1072;&#1081;&#1076;&#1080;&#1090;&#1077; &#1085;&#1072; <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/issues">GitHub</a> &#1080; &#1085;&#1072;&#1095;&#1085;&#1080;&#1090;&#1077; &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1083;&#1102;&#1073;&#1099;&#1077; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093;, &#1087;&#1086; &#1074;&#1072;&#1096;&#1077;&#1084;&#1091; &#1084;&#1085;&#1077;&#1085;&#1080;&#1102;, &#1074;&#1099; &#1084;&#1086;&#1075;&#1083;&#1080; &#1073;&#1099; &#1087;&#1086;&#1084;&#1086;&#1095;&#1100;!
</p><p><span id="Design_artwork"></span>
</p>
<h2><span id=".D0.93.D1.80.D0.B0.D1.84.D0.B8.D1.87.D0.B5.D1.81.D0.BA.D0.B8.D0.B9_.D0.94.D0.B8.D0.B7.D0.B0.D0.B9.D0.BD"></span><span class="mw-headline" id="&#1043;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081;_&#1044;&#1080;&#1079;&#1072;&#1081;&#1085;">&#1043;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1044;&#1080;&#1079;&#1072;&#1081;&#1085;</span></h2>
<p>&#1057;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; <a href="../ru/Artwork.html" title="Artwork/ru">&#1050;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075; &#1093;&#1091;&#1076;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1093; &#1088;&#1072;&#1073;&#1086;&#1090;</a>, &#1072; &#1090;&#1072;&#1082; &#1078;&#1077; <a href="../ru/Artwork_Guidelines.html" title="Artwork Guidelines/ru">&#1056;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086; &#1093;&#1091;&#1076;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1084;&#1091; &#1086;&#1092;&#1086;&#1088;&#1084;&#1083;&#1077;&#1085;&#1080;&#1102;</a> &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1079;&#1085;&#1072;&#1090;&#1100; &#1086; &#1090;&#1086;&#1084;, &#1082;&#1072;&#1082; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1080;&#1082;&#1086;&#1085;&#1082;&#1080; &#1076;&#1083;&#1103; FreeCAD.
</p><p><span id="Write_code"></span>
</p>
<h2><span id=".D0.9D.D0.B0.D0.BF.D0.B8.D1.88.D0.B8.D1.82.D0.B5_.D0.BA.D0.BE.D0.B4"></span><span class="mw-headline" id="&#1053;&#1072;&#1087;&#1080;&#1096;&#1080;&#1090;&#1077;_&#1082;&#1086;&#1076;">&#1053;&#1072;&#1087;&#1080;&#1096;&#1080;&#1090;&#1077; &#1082;&#1086;&#1076;</span></h2>
<p>&#1055;&#1080;&#1089;&#1072;&#1090;&#1100; &#1082;&#1086;&#1076; &#1076;&#1083;&#1103; FreeCAD &#1085;&#1077;&#1089;&#1083;&#1086;&#1078;&#1085;&#1086;, &#1080; &#1074;&#1072;&#1084; &#1085;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1085;&#1080;&#1082;&#1072;&#1082;&#1080;&#1093; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1081;, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1095;&#1072;&#1090;&#1100; &#1087;&#1088;&#1103;&#1084;&#1086; &#1089;&#1077;&#1081;&#1095;&#1072;&#1089; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1085;&#1072;&#1076; &#1090;&#1077;&#1084;, &#1095;&#1090;&#1086; &#1074;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1080;&#1090;&#1100; &#1087;&#1072;&#1090;&#1095; &#1085;&#1072; <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/issues">issue tracker (&#1090;&#1088;&#1077;&#1082;&#1077;&#1088; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074;)</a> &#1080;&#1083;&#1080; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1080;&#1090;&#1100; &#1089;&#1083;&#1080;&#1103;&#1085;&#1080;&#1077; &#1080;&#1079; <a rel="nofollow" class="external text" href="https://github.com/FreeCAD">git branch (&#1074;&#1077;&#1090;&#1082;&#1072; git)</a>. &#1063;&#1090;&#1086;&#1073;&#1099; &#1080;&#1079;&#1073;&#1077;&#1078;&#1072;&#1090;&#1100; &#1075;&#1086;&#1083;&#1086;&#1074;&#1085;&#1086;&#1081; &#1073;&#1086;&#1083;&#1080;, &#1074;&#1072;&#1084; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1103;:
</p>
<ul><li>&#1048;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1086; &#1090;&#1086;&#1084; <a href="../ru/Developer_hub.html#Compiling_FreeCAD" title="Developer hub/ru">&#1082;&#1072;&#1082; &#1089;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; FreeCAD</a> &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;.</li>
<li>&#1055;&#1088;&#1077;&#1078;&#1076;&#1077; &#1095;&#1077;&#1084; &#1087;&#1088;&#1080;&#1089;&#1090;&#1091;&#1087;&#1080;&#1090;&#1100; &#1082; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1102; &#1082;&#1086;&#1076;&#1072; &#1076;&#1083;&#1103; FreeCAD, &#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1079;&#1085;&#1072;&#1090;&#1100;, &#1082;&#1072;&#1082; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; FreeCAD. &#1069;&#1090;&#1086; &#1082;&#1072;&#1078;&#1077;&#1090;&#1089;&#1103; &#1086;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1099;&#1084;, &#1085;&#1086; &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1085;&#1077; &#1079;&#1085;&#1072;&#1077;&#1090;&#1077;, &#1082;&#1072;&#1082; &#1086;&#1085; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100;, &#1074;&#1099; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090;&#1077; &#1079;&#1085;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1080; &#1082;&#1072;&#1082; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080;.</li>
<li>&#1055;&#1086;&#1095;&#1090;&#1080; &#1074;&#1089;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1083;&#1080;&#1073;&#1086; &#1085;&#1072; Python, &#1083;&#1080;&#1073;&#1086; &#1085;&#1072; C ++. &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1074;&#1089;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1087;&#1086;&#1095;&#1090;&#1080; &#1086;&#1076;&#1080;&#1085;&#1072;&#1082;&#1086;&#1074;&#1086; &#1085;&#1072; &#1086;&#1073;&#1086;&#1080;&#1093; &#1103;&#1079;&#1099;&#1082;&#1072;&#1093;. &#1052;&#1099; &#1087;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1077;&#1084; &#1074;&#1072;&#1084; &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; <a href="../ru/Power_users_hub.html" title="Power users hub/ru">&#1074; &#1059;&#1075;&#1086;&#1083;&#1082;&#1077; &#1086;&#1087;&#1099;&#1090;&#1085;&#1099;&#1093; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;</a>, &#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1089;&#1086;&#1073;&#1080;&#1088;&#1072;&#1077;&#1090;&#1077;&#1089;&#1100; &#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1082;&#1086;&#1076; &#1085;&#1072; C ++, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1086;&#1085; &#1076;&#1072;&#1089;&#1090; &#1074;&#1072;&#1084; &#1093;&#1086;&#1088;&#1086;&#1096;&#1080;&#1081; &#1086;&#1073;&#1079;&#1086;&#1088; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074;.</li>
<li>&#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1089;&#1086;&#1073;&#1080;&#1088;&#1072;&#1077;&#1090;&#1077;&#1089;&#1100; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1074; C ++, &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1091;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1073;&#1077;&#1079; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; &#1089;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; FreeCAD.</li>
<li>&#1055;&#1088;&#1077;&#1079;&#1077;&#1085;&#1090;&#1091;&#1081;&#1090;&#1077; &#1089;&#1077;&#1073;&#1103; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072;&#1084;. FreeCAD - &#1101;&#1090;&#1086; &#1087;&#1088;&#1077;&#1078;&#1076;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086; &#1089;&#1086;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;, &#1084;&#1099; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1072;&#1077;&#1084; &#1084;&#1085;&#1086;&#1075;&#1080;&#1077; &#1074;&#1077;&#1097;&#1080; &#1085;&#1072; <a rel="nofollow" class="external text" href="http://forum.freecad.org">&#1092;&#1086;&#1088;&#1091;&#1084;&#1077;</a>, &#1087;&#1088;&#1077;&#1078;&#1076;&#1077; &#1095;&#1077;&#1084; &#1080;&#1093; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;, &#1080; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1083;&#1091;&#1095;&#1096;&#1077; &#1086;&#1073;&#1089;&#1091;&#1076;&#1080;&#1090;&#1100; &#1089;&#1074;&#1086;&#1080; &#1080;&#1076;&#1077;&#1080; &#1080; &#1088;&#1072;&#1089;&#1089;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1083;&#1102;&#1076;&#1103;&#1084;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1087;&#1083;&#1072;&#1085;&#1080;&#1088;&#1091;&#1077;&#1090;&#1077; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100;, &#1087;&#1088;&#1077;&#1078;&#1076;&#1077; &#1095;&#1077;&#1084; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086; &#1085;&#1072; &#1089;&#1072;&#1084;&#1086;&#1084; &#1076;&#1077;&#1083;&#1077;. &#1059; &#1085;&#1072;&#1089; &#1090;&#1072;&#1082;&#1078;&#1077; &#1077;&#1089;&#1090;&#1100; IRC-&#1082;&#1072;&#1085;&#1072;&#1083; <a rel="nofollow" class="external autonumber" href="https://wiki.freecad.org/Help#Chat">[1]</a>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1089;&#1080;&#1085;&#1093;&#1088;&#1086;&#1085;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085; &#1089; &#1085;&#1072;&#1096;&#1080;&#1084; &#1082;&#1072;&#1085;&#1072;&#1083;&#1086;&#1084; <a rel="nofollow" class="external text" href="https://matrix.to/#/#FreeCAD_FreeCAD:gitter.im">Matrix</a>, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1082;&#1072;&#1085;&#1072;&#1083; <a rel="nofollow" class="external text" href="https://discord.gg/w2cTKGzccC">Discord</a>.</li>
<li>&#1057; 2016 &#1075;&#1086;&#1076;&#1072; FreeCAD &#1090;&#1072;&#1082;&#1078;&#1077; &#1091;&#1095;&#1072;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1074; <a href="../Google_Summer_of_Code_2020.html" title="Google Summer of Code 2020">&#1051;&#1077;&#1090;&#1085;&#1080;&#1081; &#1082;&#1086;&#1076; Google 2020</a>. &#1053;&#1077; &#1079;&#1072;&#1073;&#1091;&#1076;&#1100;&#1090;&#1077; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100; &#1085;&#1072;&#1096;&#1080; &#1080;&#1076;&#1077;&#1080; &#1090;&#1072;&#1084;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1079;&#1072;&#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1086;&#1074;&#1072;&#1085;&#1099; &#1074; &#1091;&#1095;&#1072;&#1089;&#1090;&#1080;&#1080; &#1074; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1074;&#1099;&#1087;&#1091;&#1089;&#1082;&#1077;.</li>
<li>&#1042;&#1089;&#1105; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1080; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; FreeCAD &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1086; &#1085;&#1077; &#1074; &#1089;&#1072;&#1084;&#1086;&#1084; &#1082;&#1086;&#1076;&#1077; FreeCAD, &#1072; &#1074; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103;&#1093;, &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1072;&#1093; &#1080; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1103;&#1093;. &#1042; &#1089;&#1086;&#1074;&#1086;&#1082;&#1091;&#1087;&#1085;&#1086;&#1089;&#1090;&#1080; &#1101;&#1090;&#1072; &#1101;&#1082;&#1086;&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1080; &#1076;&#1077;&#1083;&#1072;&#1077;&#1090; FreeCAD &#1084;&#1086;&#1097;&#1085;&#1099;&#1084;. &#1047;&#1072;&#1095;&#1072;&#1089;&#1090;&#1091;&#1102; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072; &#1085;&#1072;&#1076; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084; &#1087;&#1088;&#1086;&#1097;&#1077;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077; &#1082;&#1086;&#1076;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1085;&#1091;&#1078;&#1085;&#1086; &#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1080; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1090;&#1100;, &#1080; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077; &#1083;&#1102;&#1076;&#1077;&#1081; &#1074;&#1086;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1086; &#1074; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091;. &#1055;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD-addons">&#1056;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1081; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1081;</a> &#1080; <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD-macros">&#1056;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1081; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1086;&#1074;</a>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1076;&#1077;&#1080;!</li></ul>
<p><span id="Create_models"></span>
</p>
<h2><span id=".D0.A1.D0.BE.D0.B7.D0.B4.D0.B0.D0.B2.D0.B0.D0.B9.D1.82.D0.B5_.D0.BC.D0.BE.D0.B4.D0.B5.D0.BB.D0.B8"></span><span class="mw-headline" id="&#1057;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1081;&#1090;&#1077;_&#1084;&#1086;&#1076;&#1077;&#1083;&#1080;">&#1057;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1081;&#1090;&#1077; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;</span></h2>
<p>&#1042; FreeCAD &#1077;&#1089;&#1090;&#1100; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD-library">Models</a>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1072; &#1080; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1072; &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093;. &#1055;&#1086;&#1095;&#1077;&#1084;&#1091; &#1073;&#1099; &#1085;&#1077; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1090;&#1091;&#1076;&#1072; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1075;&#1083;&#1080; &#1073;&#1099; &#1073;&#1099;&#1090;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1099; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080;? &#1054;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1081;&#1090;&#1077; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; &#1089;&#1072;&#1084;&#1080; &#1089; &#1085;&#1091;&#1083;&#1103;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; &#1073;&#1099;&#1083;&#1072; &#1085;&#1072; 100% &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1072; &#1086;&#1090; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1093; &#1079;&#1072;&#1097;&#1080;&#1097;&#1105;&#1085;&#1085;&#1099;&#1093; &#1072;&#1074;&#1090;&#1086;&#1088;&#1089;&#1082;&#1080;&#1084; &#1087;&#1088;&#1072;&#1074;&#1086;&#1084; &#1080;&#1083;&#1080; &#1085;&#1077;&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074;.
</p><p><br>
</p>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><span typeof="mw:File"><a href="../index.php?title=User_hub.png&amp;filetimestamp=20190221145008&amp;.html" class="mw-file-description"><img src="../File/User_hub.png" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/User_hub.html" title="User hub/ru">&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b><a href="../ru/Getting_started.html" title="Getting started/ru">&#1053;&#1072;&#1095;&#1080;&#1085;&#1072;&#1102;&#1097;&#1080;&#1084;</a></b></li>
<li><b>&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072;:</b> <a href="../ru/Download.html" title="Download/ru">&#1047;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072;</a>, <a href="../ru/Installing_on_Windows.html" title="Installing on Windows/ru">Windows</a>, <a href="../ru/Installing_on_Linux.html" title="Installing on Linux/ru">Linux</a>, <a href="../ru/Installing_on_Mac.html" title="Installing on Mac/ru">Mac</a>, <a href="../ru/Installing_additional_components.html" title="Installing additional components/ru">
&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074;</a>, <a href="../ru/Compile_on_Docker.html" title="Compile on Docker/ru">Docker</a>, <a href="../ru/AppImage.html" title="AppImage/ru">AppImage</a>, <a href="../ru/Ubuntu_Snap.html" title="Ubuntu Snap/ru">Ubuntu Snap</a></li>
<li><b>&#1041;&#1072;&#1079;&#1086;&#1074;&#1072;&#1103;:</b> <a href="../ru/About_FreeCAD.html" title="About FreeCAD/ru">&#1054; FreeCAD</a>, <a href="../ru/Interface.html" title="Interface/ru">&#1048;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;</a>, <a href="../ru/Mouse_navigation.html" title="Mouse navigation/ru">&#1053;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1103; &#1084;&#1099;&#1096;&#1080;</a>, <a href="../ru/Selection_methods.html" title="Selection methods/ru">&#1052;&#1077;&#1090;&#1086;&#1076;&#1099; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103;</a>, <a href="../ru/Object_name.html" title="Object name/ru">&#1048;&#1084;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;</a>, <a href="../ru/Preferences_Editor.html" title="Preferences Editor/ru">&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;</a>, <a href="../ru/Workbenches.html" title="Workbenches/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>, <a href="../ru/Document_structure.html" title="Document structure/ru">&#1057;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;</a>, <a href="../ru/Property.html" title="Property/ru">&#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;</a>, <a class="mw-selflink selflink">&#1055;&#1086;&#1084;&#1086;&#1075;&#1080; FreeCAD</a>, <a href="../ru/Donate.html" title="Donate/ru">&#1055;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</a></li></ul>
<hr>
<ul><li><b>&#1055;&#1086;&#1084;&#1086;&#1097;&#1100;:</b> <a href="../ru/Tutorials.html" title="Tutorials/ru">&#1059;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082;&#1080;</a>, <a href="../ru/Video_tutorials.html" title="Video tutorials/ru">&#1042;&#1080;&#1076;&#1077;&#1086; &#1091;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082;&#1080;</a></li>
<li><b><a href="../ru/Workbenches.html" title="Workbenches/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>:</b> <a href="../ru/Std_Base.html" title="Std Base/ru">Std Base</a>, <a href="../ru/Arch_Workbench.html" title="Arch Workbench/ru">Arch</a>, <a href="../ru/Assembly_Workbench.html" title="Assembly Workbench/ru">Assembly</a>, <a href="../ru/CAM_Workbench.html" title="CAM Workbench/ru">CAM</a>, <a href="../ru/Draft_Workbench.html" title="Draft Workbench/ru">Draft</a>, <a href="../ru/FEM_Workbench.html" title="FEM Workbench/ru">FEM</a>, <a href="../ru/Inspection_Workbench.html" title="Inspection Workbench/ru">Inspection</a>, <a href="../ru/Mesh_Workbench.html" title="Mesh Workbench/ru">Mesh</a>, <a href="../ru/OpenSCAD_Workbench.html" title="OpenSCAD Workbench/ru">OpenSCAD</a>, <a href="../ru/Part_Workbench.html" title="Part Workbench/ru">Part</a>, <a href="../ru/PartDesign_Workbench.html" title="PartDesign Workbench/ru">PartDesign</a>, <a href="../ru/Points_Workbench.html" title="Points Workbench/ru">Points</a>, <a href="../ru/Reverse_Engineering_Workbench.html" title="Reverse Engineering Workbench/ru">Reverse Engineering</a>, <a href="../ru/Robot_Workbench.html" title="Robot Workbench/ru">Robot</a>, <a href="../ru/Sketcher_Workbench.html" title="Sketcher Workbench/ru">Sketcher</a>, <a href="../ru/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/ru">Spreadsheet</a>, <a href="../ru/Surface_Workbench.html" title="Surface Workbench/ru">Surface</a>, <a href="../ru/TechDraw_Workbench.html" title="TechDraw Workbench/ru">TechDraw</a>, <a href="../ru/Testing.html" title="Testing/ru">Test Framework</a></li></ul>
<hr>
<ul><li><b><a href="../ru/Addon.html" title="Addon/ru">Addons</a>:</b> <a href="../ru/Std_AddonMgr.html" title="Std AddonMgr/ru">&#1052;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1081;</a>, <a href="../ru/External_workbenches.html" title="External workbenches/ru">&#1042;&#1085;&#1077;&#1096;&#1085;&#1080;&#1077; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>, <a href="../ru/Scripting_and_macros.html" title="Scripting and macros/ru">C&#1082;&#1088;&#1080;&#1087;&#1090;&#1099; &#1080; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1099;</a></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="../ru/User_hub.html" title="User hub/ru">&#1059;&#1075;&#1086;&#1083;&#1086;&#1082; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;</a>, <a href="../ru/Power_users_hub.html" title="Power users hub/ru">&#1059;&#1075;&#1086;&#1083;&#1086;&#1082; &#1086;&#1087;&#1099;&#1090;&#1085;&#1099;&#1093; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;</a>, <a href="../ru/Developer_hub.html" title="Developer hub/ru">&#1059;&#1075;&#1086;&#1083;&#1086;&#1082; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20251009171137
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.086 seconds
Real time usage: 0.146 seconds
Preprocessor visited node count: 93/1000000
Post&#8208;expand include size: 6295/2097152 bytes
Template argument size: 2238/2097152 bytes
Highest expansion depth: 4/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 3711/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    9.069      1 -total
 67.23%    6.097      1 Template:Userdocnavi/ru
 38.64%    3.504      1 Template:Navigation_menu_2
 29.82%    2.704      1 Template:TOCright
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:64406-0!canonical and timestamp 20251009171137 and revision id 1659522. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>