<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Macro Snip/ru</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="ru" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Macro+Snip&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/Macro_Snip.html" class="mw-pt-progress mw-pt-progress--complete" title="Makro Snip (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Macro_Snip.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Macro Snip (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../fr/Macro_Snip.html" class="mw-pt-progress mw-pt-progress--complete" title="Macro Snip (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/Macro_Snip.html" class="mw-pt-progress mw-pt-progress--med" title="Macro Snip (42% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Macro_Snip.html" class="mw-pt-progress mw-pt-progress--low" title="Makrodefinicja: Wycinek (4% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt-br/Macro_Snip.html" class="mw-pt-progress mw-pt-progress--low" title="Macro de Corte (8% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</span></li></ul></div>
<table class="fcinfobox wikitable ct" width="100%" style="float: right; width: 230px; margin-left: 10px;">
<tbody><tr>
<td class="ctTitle" style="font-weight: bold; font-size: 125%;">
<p><span typeof="mw:File"><a href="../index.php?title=Snip.png&amp;filetimestamp=20190803232007&amp;.html" class="mw-file-description"><img src="../File/Snip.png" decoding="async" width="32" height="31" class="mw-file-element" data-file-width="44" data-file-height="42"></a></span><span> </span>
&#1052;&#1072;&#1082;&#1088;&#1086;&#1089; Snip (&#1054;&#1073;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100;)
</p>
</td></tr>
<tr>
<th class="ctOdd">&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;
</th></tr>
<tr>
<td class="ctEven left macro-description">&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1101;&#1090;&#1086;&#1090; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089; &#1076;&#1083;&#1103; &#1091;&#1076;&#1086;&#1073;&#1089;&#1090;&#1074;&#1072; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1089;&#1082;&#1088;&#1080;&#1085;&#1096;&#1086;&#1090;&#1086;&#1074; &#1085;&#1072; &#1092;&#1086;&#1088;&#1091;&#1084;&#1077; FreeCAD.<br>&#1051;&#1091;&#1095;&#1096;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1101;&#1090;&#1086;&#1090; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089; &#1085;&#1072; &#1074;&#1072;&#1096;&#1091; &#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1093; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1086;&#1074; &#1076;&#1083;&#1103; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;&#1075;&#1086; &#1080; &#1083;&#1077;&#1075;&#1082;&#1086;&#1075;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072;.<br>&#1055;&#1088;&#1080; &#1087;&#1091;&#1073;&#1083;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080; &#1085;&#1072; &#1092;&#1086;&#1088;&#1091;&#1084;&#1077; FreeCAD &#1095;&#1072;&#1089;&#1090;&#1086; &#1073;&#1099;&#1074;&#1072;&#1077;&#1090; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086; &#1080;&#1084;&#1077;&#1090;&#1100; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1100; &#1089;&#1082;&#1088;&#1080;&#1085;&#1096;&#1086;&#1090;&#1099;. &#1055;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1086; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1091;&#1090;&#1086;&#1084;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1079;&#1072;&#1076;&#1072;&#1095;&#1072;. &#1069;&#1090;&#1086;&#1090; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089; &#1087;&#1088;&#1080;&#1079;&#1074;&#1072;&#1085; &#1085;&#1077;&#1084;&#1085;&#1086;&#1075;&#1086; &#1091;&#1087;&#1088;&#1086;&#1089;&#1090;&#1080;&#1090;&#1100; &#1101;&#1090;&#1091; &#1079;&#1072;&#1076;&#1072;&#1095;&#1091;.<br>&#1052;&#1072;&#1082;&#1088;&#1086;&#1089; &#1084;&#1086;&#1078;&#1077;&#1090; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1089;&#1082;&#1088;&#1080;&#1085;&#1096;&#1086;&#1090;&#1099; &#1080;&#1083;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1089;&#1082;&#1088;&#1080;&#1085;&#1096;&#1086;&#1090;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1091;&#1078;&#1077; &#1073;&#1099;&#1083;&#1080; &#1089;&#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1099; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1099;&#1081; &#1073;&#1091;&#1092;&#1077;&#1088; &#1086;&#1073;&#1084;&#1077;&#1085;&#1072;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1085;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;, &#1091;&#1078;&#1077; &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1097;&#1077;&#1077;&#1089;&#1103; &#1074; &#1073;&#1091;&#1092;&#1077;&#1088;&#1077; &#1086;&#1073;&#1084;&#1077;&#1085;&#1072;, &#1079;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1091; Shift &#1074;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1074;&#1099;&#1079;&#1086;&#1074;&#1072; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1072;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1089;&#1082;&#1088;&#1080;&#1085;&#1096;&#1086;&#1090;&#1072;, &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1090;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1080; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074;&#1089;&#1087;&#1083;&#1099;&#1074;&#1072;&#1102;&#1097;&#1077;&#1075;&#1086; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1075;&#1086; &#1086;&#1082;&#1085;&#1072;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1097;&#1105;&#1083;&#1082;&#1085;&#1080;&#1090;&#1077; OK. &#1045;&#1089;&#1083;&#1080; &#1097;&#1105;&#1083;&#1082;&#1085;&#1091;&#1090;&#1100; OK, &#1084;&#1072;&#1082;&#1088;&#1086;&#1089; &#1087;&#1086;&#1087;&#1099;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1089;&#1082;&#1088;&#1080;&#1085;&#1096;&#1086;&#1090; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1101;&#1082;&#1088;&#1072;&#1085;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;. &#1057;&#1072;&#1084; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1086;&#1083;&#1091;&#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1099;&#1084;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1074;&#1099; &#1089;&#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1077;&#1075;&#1086; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077;.<br><br>&#1052;&#1072;&#1082;&#1088;&#1086;&#1089; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080;&nbsp;: 1.3<br>&#1044;&#1072;&#1090;&#1072; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1081; &#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080;&nbsp;: 2024.07.23<br>FreeCAD &#1074;&#1077;&#1088;&#1089;&#1080;&#1103;&nbsp;: All<br>&#1057;&#1082;&#1072;&#1095;&#1072;&#1090;&#1100;&nbsp;: <a rel="nofollow" class="external text" href="https://wiki.freecad.org/images/a/a0/Snip.png">ToolBar Icon</a><br>&#1072;&#1074;&#1090;&#1086;&#1088;&nbsp;: TheMarkster<br>
</td></tr>
<tr>
<th class="ctOdd">&#1040;&#1074;&#1090;&#1086;&#1088;
</th></tr>
<tr>
<td class="ctEven macro-author"><a href="../index.php?title=User;TheMarkster&amp;action=edit&amp;redlink=1.html" class="new" title="User:TheMarkster (page does not exist)">TheMarkster</a>
</td></tr>
<tr>
<th class="ctOdd">&#1057;&#1082;&#1072;&#1095;&#1072;&#1090;&#1100;
</th></tr>
<tr>
<td class="ctEven macro-download"><a rel="nofollow" class="external text" href="https://wiki.freecad.org/images/a/a0/Snip.png">ToolBar Icon</a>
</td></tr>
<tr>
<th class="ctOdd">&#1057;&#1089;&#1099;&#1083;&#1082;&#1080;
</th></tr>
<tr>
<td class="ctEven macro-Links"><a href="../ru/Macros_recipes.html" title="Macros recipes/ru">&#1052;&#1072;&#1082;&#1088;&#1086;&#1089;&#1099; &#1088;&#1077;&#1094;&#1077;&#1087;&#1090;&#1099;</a><br><a href="../ru/How_to_install_macros.html" title="How to install macros/ru">&#1050;&#1072;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1099;</a><br><a href="../ru/Customize_Toolbars.html" title="Customize Toolbars/ru">&#1050;&#1072;&#1082; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;</a>
</td></tr>
<tr>
<th class="ctOdd">&#1042;&#1077;&#1088;&#1089;&#1080;&#1103;
</th></tr>
<tr>
<td class="ctEven macro-version">1.3
</td></tr>
<tr>
<th class="ctOdd">&#1044;&#1072;&#1090;&#1072; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1081; &#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080;
</th></tr>
<tr>
<td class="ctEven macro-date">2024.07.23
</td></tr>
<tr>
<th class="ctOdd">&#1042;&#1077;&#1088;&#1089;&#1080;&#1080; FreeCAD
</th></tr>
<tr>
<td class="ctEven FreeCAD-version">All
</td></tr>
<tr>
<th class="ctOdd">&#1057;&#1086;&#1095;&#1077;&#1090;&#1072;&#1085;&#1080;&#1077; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;
</th></tr>
<tr>
<td class="ctEven">&#1053;&#1072; Windows: Windows Key + Shift + S<br>
<p>&#1053;&#1072; Mac: Command + Shift + 4<br>
&#1053;&#1072; Linux: gnome-screenshot utility<br>
</p>
</td></tr>
<tr>
<th class="ctOdd">&#1057;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; &#1090;&#1072;&#1082;&#1078;&#1077;
</th></tr>
<tr>
<td class="ctEven"><a href="../ru/Macro_Copy3DViewToClipboard.html" title="Macro Copy3DViewToClipboard/ru">&#1052;&#1072;&#1082;&#1088;&#1086;&#1089; Copy3DViewToClipboard</a>, <a href="../ru/Macro_Screen_Wiki.html" title="Macro Screen Wiki/ru">&#1052;&#1072;&#1082;&#1088;&#1086;&#1089; Screen Wiki (&#1057;&#1085;&#1080;&#1084;&#1086;&#1082; &#1076;&#1083;&#1103; &#1042;&#1080;&#1082;&#1080;)</a>
</td></tr>
<tr>
<th class="ctOdd">
</th></tr>
<tr>
<td class="ctToc"><br><meta property="mw:PageProp/toc">
</td></tr>
</tbody></table>
<p><span id="Description"></span>
</p>
<h2><span id=".D0.9E.D0.BF.D0.B8.D1.81.D0.B0.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;">&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;</span></h2>
<p>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1101;&#1090;&#1086;&#1090; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1083;&#1077;&#1075;&#1082;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100; &#1089;&#1082;&#1088;&#1080;&#1085;&#1096;&#1086;&#1090;&#1099; &#1085;&#1072; <a rel="nofollow" class="external text" href="https://forum.freecad.org">&#1060;&#1086;&#1088;&#1091;&#1084;&#1077; FreeCAD</a>.
</p><p>&#1051;&#1091;&#1095;&#1096;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1101;&#1090;&#1086;&#1090; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089; &#1085;&#1072; &#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1093; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1086;&#1074; &#1076;&#1083;&#1103; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;&#1075;&#1086; &#1080; &#1083;&#1077;&#1075;&#1082;&#1086;&#1075;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072;.
</p><p>&#1055;&#1088;&#1080; &#1087;&#1091;&#1073;&#1083;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080; &#1085;&#1072; &#1092;&#1086;&#1088;&#1091;&#1084;&#1077; FreeCAD &#1095;&#1072;&#1089;&#1090;&#1086; &#1073;&#1099;&#1074;&#1072;&#1077;&#1090; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086; &#1080;&#1084;&#1077;&#1090;&#1100; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1100; &#1089;&#1082;&#1088;&#1080;&#1085;&#1096;&#1086;&#1090;&#1099;. &#1055;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1086; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1091;&#1090;&#1086;&#1084;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1079;&#1072;&#1076;&#1072;&#1095;&#1072;. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1101;&#1090;&#1086;&#1090; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089; &#1087;&#1088;&#1080;&#1079;&#1074;&#1072;&#1085; &#1085;&#1077;&#1084;&#1085;&#1086;&#1075;&#1086; &#1091;&#1087;&#1088;&#1086;&#1089;&#1090;&#1080;&#1090;&#1100; &#1101;&#1090;&#1091; &#1079;&#1072;&#1076;&#1072;&#1095;&#1091;.
</p><p><span id="Usage"></span>
</p>
<h2><span id=".D0.9F.D1.80.D0.B8.D0.BC.D0.B5.D0.BD.D0.B5.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1055;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;">&#1055;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;</span></h2>
<p>&#1052;&#1072;&#1082;&#1088;&#1086;&#1089; &#1084;&#1086;&#1078;&#1077;&#1090; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1089;&#1082;&#1088;&#1080;&#1085;&#1096;&#1086;&#1090;&#1099;, &#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1089;&#1082;&#1088;&#1080;&#1085;&#1096;&#1086;&#1090;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1091;&#1078;&#1077; &#1073;&#1099;&#1083;&#1080; &#1089;&#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1099; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1099;&#1081; &#1073;&#1091;&#1092;&#1077;&#1088; &#1086;&#1073;&#1084;&#1077;&#1085;&#1072;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1085;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;, &#1091;&#1078;&#1077; &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1097;&#1077;&#1077;&#1089;&#1103; &#1074; &#1073;&#1091;&#1092;&#1077;&#1088;&#1077; &#1086;&#1073;&#1084;&#1077;&#1085;&#1072;, &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1091; <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">Shift</span> &#1087;&#1088;&#1080; &#1074;&#1099;&#1079;&#1086;&#1074;&#1077; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1072;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1089;&#1082;&#1088;&#1080;&#1085;&#1096;&#1086;&#1090;&#1072;, &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1090;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1080; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074;&#1089;&#1087;&#1083;&#1099;&#1074;&#1072;&#1102;&#1097;&#1077;&#1075;&#1086; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1072;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1097;&#1105;&#1083;&#1082;&#1085;&#1080;&#1090;&#1077; <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">OK</span>. &#1045;&#1089;&#1083;&#1080; &#1097;&#1105;&#1083;&#1082;&#1085;&#1091;&#1090;&#1100; <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">OK</span>, &#1084;&#1072;&#1082;&#1088;&#1086;&#1089; &#1087;&#1086;&#1087;&#1099;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1089;&#1082;&#1088;&#1080;&#1085;&#1096;&#1086;&#1090; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1101;&#1082;&#1088;&#1072;&#1085;&#1072;, &#1087;&#1086;&#1082;&#1088;&#1099;&#1090;&#1086;&#1081; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1099;&#1084; &#1086;&#1082;&#1085;&#1086;&#1084;. &#1057;&#1072;&#1084; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075; &#1087;&#1086;&#1083;&#1091;&#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1077;&#1085;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1077;&#1075;&#1086; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077;.
</p><p><span typeof="mw:File"><a href="../index.php?title=Snip-Screenshot1.png&amp;filetimestamp=20190804000200&amp;.html" class="mw-file-description"><img src="../File/Snip-Screenshot1.png" decoding="async" width="600" height="331" class="mw-file-element" data-file-width="1631" data-file-height="899"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">&#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; &#1087;&#1086;&#1083;&#1091;&#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;. &#1041;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1086; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1101;&#1082;&#1088;&#1072;&#1085;&#1072; &#1087;&#1086;&#1076; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1084;.</p>
<p>&#1055;&#1086;&#1089;&#1083;&#1077; &#1090;&#1086;&#1075;&#1086; &#1082;&#1072;&#1082; &#1074;&#1099; &#1097;&#1105;&#1083;&#1082;&#1085;&#1077;&#1090;&#1077; <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">OK</span>, &#1084;&#1072;&#1082;&#1088;&#1086;&#1089; &#1089;&#1076;&#1077;&#1083;&#1072;&#1077;&#1090; &#1089;&#1085;&#1080;&#1084;&#1086;&#1082; &#1101;&#1082;&#1088;&#1072;&#1085;&#1072; &#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090; &#1077;&#1075;&#1086; &#1074;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1084; &#1092;&#1072;&#1081;&#1083;&#1077;. &#1047;&#1072;&#1090;&#1077;&#1084; &#1086;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1080;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072;. &#1048;&#1079; &#1085;&#1077;&#1075;&#1086; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1097;&#1080;&#1090;&#1100; &#1092;&#1072;&#1081;&#1083; &#1085;&#1072; &#1092;&#1086;&#1088;&#1091;&#1084; &#1074; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1091;&#1102; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1074;&#1099; &#1085;&#1072;&#1073;&#1080;&#1088;&#1072;&#1077;&#1090;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090; &#1076;&#1083;&#1103; &#1089;&#1074;&#1086;&#1077;&#1075;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;. &#1055;&#1086;&#1089;&#1083;&#1077; &#1086;&#1090;&#1084;&#1077;&#1085;&#1099; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1072; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; &#1089;&#1082;&#1088;&#1080;&#1085;&#1096;&#1086;&#1090;&#1072; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;. &#1042;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1100; &#1092;&#1072;&#1081;&#1083; &#1089;&#1082;&#1088;&#1080;&#1085;&#1096;&#1086;&#1090;&#1072; &#1074; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077;, &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1086;&#1081; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1076;&#1083;&#1103; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1080;&#1103; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">.png</span> (&#1074; Windows &#1101;&#1090;&#1086;, &#1082;&#1072;&#1082; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1086;, Paint). &#1069;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1082; &#1089;&#1085;&#1080;&#1084;&#1082;&#1091; &#1101;&#1082;&#1088;&#1072;&#1085;&#1072; &#1082;&#1072;&#1082;&#1080;&#1077;-&#1090;&#1086; &#1087;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1103; &#1080;&#1083;&#1080;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1086;&#1090;&#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1086;&#1073;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100;.
</p><p><span typeof="mw:File"><a href="../index.php?title=Snip-Screenshot2.png&amp;filetimestamp=20190804000814&amp;.html" class="mw-file-description"><img src="../File/Snip-Screenshot2.png" decoding="async" width="600" height="389" class="mw-file-element" data-file-width="1149" data-file-height="744"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">&#1069;&#1090;&#1086; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1080;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1087;&#1086;&#1089;&#1083;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1089;&#1082;&#1088;&#1080;&#1085;&#1096;&#1086;&#1090;&#1072;. &#1048;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1097;&#1080;&#1090;&#1100; &#1085;&#1072; &#1092;&#1086;&#1088;&#1091;&#1084; &#1080;&#1083;&#1080; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1100; &#1077;&#1075;&#1086; &#1076;&#1083;&#1103; &#1076;&#1072;&#1083;&#1100;&#1085;&#1077;&#1081;&#1096;&#1077;&#1081; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1086;&#1084; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1080; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1076;&#1083;&#1103; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1080;&#1103; png-&#1092;&#1072;&#1081;&#1083;&#1086;&#1074;. &#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1097;&#1105;&#1083;&#1082;&#1085;&#1091;&#1090;&#1100; &#1087;&#1088;&#1072;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; &#1084;&#1099;&#1096;&#1080; &#1087;&#1086; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1102; &#1080; <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">Open with...</span> &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1076;&#1088;&#1091;&#1075;&#1086;&#1075;&#1086; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086; &#1074;&#1072;&#1096;&#1077;&#1084;&#1091; &#1074;&#1099;&#1073;&#1086;&#1088;&#1091;.</p>
<p>&#1045;&#1089;&#1083;&#1080; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089; &#1085;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1074; &#1074;&#1072;&#1096;&#1077;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1089;&#1082;&#1088;&#1080;&#1085;&#1096;&#1086;&#1090;&#1086;&#1074;, &#1086;&#1085; &#1074;&#1089;&#1077; &#1088;&#1072;&#1074;&#1085;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1086;&#1083;&#1077;&#1079;&#1077;&#1085; &#1076;&#1083;&#1103; &#1089;&#1082;&#1088;&#1080;&#1085;&#1096;&#1086;&#1090;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1099; &#1089;&#1076;&#1077;&#1083;&#1072;&#1083;&#1080; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1055;&#1088;&#1086;&#1089;&#1090;&#1086; &#1089;&#1082;&#1086;&#1087;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; &#1089;&#1082;&#1088;&#1080;&#1085;&#1096;&#1086;&#1090; &#1074; &#1073;&#1091;&#1092;&#1077;&#1088; &#1086;&#1073;&#1084;&#1077;&#1085;&#1072;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1077; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;. &#1054;&#1085; &#1089;&#1086;&#1079;&#1076;&#1072;&#1089;&#1090; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; &#1080; &#1086;&#1090;&#1082;&#1088;&#1086;&#1077;&#1090; &#1077;&#1075;&#1086; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075; &#1074; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1077; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1080;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072;. &#1053;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1089;&#1082;&#1088;&#1080;&#1085;&#1096;&#1086;&#1090;&#1086;&#1074;:
</p>
<dl><dd>Windows: Windows Key + <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">Shift</span> + <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">S</span></dd>
<dd>MacOS: <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">Command</span> + <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">Shift</span> + <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">4</span></dd>
<dd>Linux: gnome-screenshot utility</dd></dl>
<p><span id="Parameters"></span>
</p>
<h2><span id=".D0.9F.D0.B0.D1.80.D0.B0.D0.BC.D0.B5.D1.82.D1.80.D1.8B"></span><span class="mw-headline" id="&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;">&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;</span></h2>
<p>&#1052;&#1072;&#1082;&#1088;&#1086;&#1089; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <b>&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &rarr; &#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074;... &rarr; Plugins &rarr; Snip_Macro</b>
</p>
<dl><dd><code>LastX</code>, <code>LastY</code>, <code>LastWidth</code>, <code>LastHeight</code>: &#1084;&#1077;&#1089;&#1090;&#1086;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1087;&#1086;&#1083;&#1103; &#1076;&#1083;&#1103; &#1079;&#1072;&#1093;&#1074;&#1072;&#1090;&#1072; &#1087;&#1088;&#1080; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080;</dd>
<dd><code>WindowOpacity</code> (0.85): &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1084;&#1077;&#1078;&#1076;&#1091; 0,0 (&#1085;&#1077;&#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1099;&#1081;) &#1080; 1,0 (&#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1099;&#1081;)</dd>
<dd><code>SnipDelay</code> (0.5): &#1074;&#1088;&#1077;&#1084;&#1103; (&#1074; &#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1072;&#1093;) &#1079;&#1072;&#1076;&#1077;&#1088;&#1078;&#1082;&#1080; &#1084;&#1077;&#1078;&#1076;&#1091; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1080;&#1077;&#1084; &#1086;&#1082;&#1085;&#1072; &#1089;&#1085;&#1080;&#1084;&#1082;&#1072; &#1080; &#1089;&#1072;&#1084;&#1080;&#1084; &#1089;&#1085;&#1080;&#1084;&#1082;&#1086;&#1084;</dd>
<dd><code>DesiredWidth</code> (0): &#1078;&#1077;&#1083;&#1072;&#1077;&#1084;&#1072;&#1103; &#1096;&#1080;&#1088;&#1080;&#1085;&#1072; (&#1074; &#1087;&#1080;&#1082;&#1089;&#1077;&#1083;&#1103;&#1093;), &#1080;&#1075;&#1085;&#1086;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103;, &#1077;&#1089;&#1083;&#1080; 0 -- &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1091;&#1077;&#1090; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1076;&#1086; &#1078;&#1077;&#1083;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072; &#1089; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1089;&#1086;&#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1103; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;</dd>
<dd><code>ScaleFactor</code> (1.0): &#1078;&#1077;&#1083;&#1072;&#1077;&#1084;&#1099;&#1081; &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1085;&#1099;&#1081; &#1082;&#1086;&#1101;&#1092;&#1092;&#1080;&#1094;&#1080;&#1077;&#1085;&#1090;, (&#1087;&#1077;&#1088;&#1077;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; DesiredWidth, &#1077;&#1089;&#1083;&#1080; ScaleFactor &#1085;&#1077; 1.0) -- &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1091;&#1077;&#1090; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1080; &#1089; &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1085;&#1099;&#1084; &#1082;&#1086;&#1101;&#1092;&#1092;&#1080;&#1094;&#1080;&#1077;&#1085;&#1090;&#1086;&#1084;</dd></dl>
<p><code>Last (&#1055;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1077;)</code> &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1089;&#1073;&#1088;&#1072;&#1089;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1086;&#1084; &#1087;&#1088;&#1080; &#1082;&#1072;&#1078;&#1076;&#1086;&#1084; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1077;. &#1058;&#1072;&#1082; &#1086;&#1085; &#1086;&#1090;&#1089;&#1083;&#1077;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090;, &#1082;&#1091;&#1076;&#1072; &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1087;&#1086;&#1083;&#1077; &#1076;&#1083;&#1103; &#1089;&#1085;&#1080;&#1084;&#1082;&#1072; - &#1074; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1077; &#1084;&#1077;&#1089;&#1090;&#1086;, &#1075;&#1076;&#1077; &#1086;&#1085;&#1086; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1083;&#1086;&#1089;&#1100;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; &#1076;&#1077;&#1083;&#1072;&#1083; &#1089;&#1082;&#1088;&#1080;&#1085;&#1096;&#1086;&#1090;.
</p><p><code>WindowOpacity</code> &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; - &#1101;&#1090;&#1086; &#1085;&#1077;&#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100; &#1088;&#1072;&#1084;&#1082;&#1080; &#1076;&#1083;&#1103; &#1089;&#1085;&#1080;&#1084;&#1082;&#1072;.
</p><p><code>SnipDelay</code> &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1085;&#1077;&#1084;&#1085;&#1086;&#1075;&#1086; &#1091;&#1089;&#1082;&#1086;&#1088;&#1080;&#1090;&#1100; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091;, &#1085;&#1086; &#1077;&#1089;&#1083;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089;&#1083;&#1080;&#1096;&#1082;&#1086;&#1084; &#1084;&#1072;&#1083;&#1086;, &#1090;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1085;&#1085;&#1099;&#1081; &#1089;&#1082;&#1088;&#1080;&#1085;&#1096;&#1086;&#1090; &#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1100; &#1089;&#1072;&#1084;&#1086; &#1086;&#1082;&#1085;&#1086; &#1089;&#1085;&#1080;&#1084;&#1082;&#1072;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1087;&#1077;&#1088;&#1077;&#1076; &#1090;&#1077;&#1084;, &#1082;&#1072;&#1082; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1089;&#1082;&#1088;&#1080;&#1085;&#1096;&#1086;&#1090;, &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1087;&#1088;&#1086;&#1081;&#1090;&#1080; &#1074;&#1088;&#1077;&#1084;&#1103;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1100; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;.
</p><p><code>DesiredWidth</code> &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1091;&#1077;&#1090; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1076;&#1086; &#1078;&#1077;&#1083;&#1072;&#1077;&#1084;&#1086;&#1081; &#1096;&#1080;&#1088;&#1080;&#1085;&#1099;, &#1077;&#1089;&#1083;&#1080; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1085; &#1085;&#1077; &#1088;&#1072;&#1074;&#1077;&#1085; 0 (&#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;), &#1074; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1085;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1077;&#1089;&#1083;&#1080; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1078;&#1077;&#1083;&#1072;&#1077;&#1084;&#1091;&#1102; &#1096;&#1080;&#1088;&#1080;&#1085;&#1091; 800, &#1090;&#1086; &#1074;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1077; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1096;&#1080;&#1088;&#1080;&#1085;&#1086;&#1081; 800 &#1087;&#1080;&#1082;&#1089;&#1077;&#1083;&#1077;&#1081;. &#1042;&#1099;&#1089;&#1086;&#1090;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1076;&#1083;&#1103; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1089;&#1086;&#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1103; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;. &#1045;&#1089;&#1083;&#1080; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1077; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1073;&#1099;&#1083;&#1086; 1600x1200, &#1072; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; DesiredWidth &#1088;&#1072;&#1074;&#1085;&#1086; 800, &#1090;&#1086; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1080;&#1088;&#1091;&#1102;&#1097;&#1077;&#1077; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; 800x600.
</p><p><code>ScaleFactor</code> &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1091;&#1077;&#1090; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1076;&#1086; &#1085;&#1091;&#1078;&#1085;&#1086;&#1075;&#1086; &#1089;&#1086;&#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1103;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, 0,5. &#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; 1.0, &#1074; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1085;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103;. &#1069;&#1090;&#1086;&#1090; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1087;&#1077;&#1088;&#1077;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; DesiredWidth, &#1077;&#1089;&#1083;&#1080; ScaleFactor &#1085;&#1077; &#1088;&#1072;&#1074;&#1077;&#1085; 1.0.
</p><p>&#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1086;&#1073;&#1086;&#1081;&#1090;&#1080; &#1083;&#1102;&#1073;&#1086;&#1077; &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;, &#1091;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1103; &#1085;&#1072;&#1078;&#1072;&#1090;&#1086;&#1081; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1091; Ctrl &#1080; &#1085;&#1072;&#1078;&#1080;&#1084;&#1072;&#1103; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; Ok, &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1089;&#1085;&#1080;&#1084;&#1086;&#1082; &#1101;&#1082;&#1088;&#1072;&#1085;&#1072;.
</p><p><span id="Script"></span>
</p>
<h2><span id=".D0.A1.D0.BA.D1.80.D0.B8.D0.BF.D1.82"></span><span class="mw-headline" id="&#1057;&#1082;&#1088;&#1080;&#1087;&#1090;">&#1057;&#1082;&#1088;&#1080;&#1087;&#1090;</span></h2>
<p>&#1047;&#1085;&#1072;&#1095;&#1086;&#1082; &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; <span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Snip.png&amp;filetimestamp=20190803232007&amp;.html" class="mw-file-description"><img src="../File/Snip.png" decoding="async" width="44" height="42" class="mw-file-element" data-file-width="44" data-file-height="42"></a></span>
</p><p><b>Macro_Snip.FCMacro</b>
</p>
<pre># -*- coding: utf-8 -*-
"""
***************************************************************************
*   Copyright (c) 2019 &lt;TheMarkster&gt;                                      *
*                                                                         *
*   This file is a supplement to the FreeCAD CAx development system.      *
*                                                                         *
*   This program is free software; you can redistribute it and/or modify  *
*   it under the terms of the GNU Lesser General Public License (LGPL)    *
*   as published by the Free Software Foundation; either version 2 of     *
*   the License, or (at your option) any later version.                   *
*                                                                         *
*   This software is distributed in the hope that it will be useful,      *
*   but WITHOUT ANY WARRANTY; without even the implied warranty of        *
*   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the          *
*   GNU Library General Public License at http://www.gnu.org/licenses     *
*   for more details.                                                     *
*                                                                         *
*   For more information about the GNU Library General Public License     *
*   write to the Free Software Foundation, Inc., 59 Temple Place,         *
*   Suite 330, Boston, MA  02111-1307 USA                                 *
*                                                                         *
***************************************************************************
"""



"""
Snip Macro

This is a macro to make it easier to post screenshots to the FreeCAD forum.

The forum supports a drag and drop interface -- just drag and drop an image to the
textarea where you type in your post. But it still requires many
tedious steps. This macro is to reduce some of those steps.

You should add the macro to your custom macro toolbar to save as many clicks as possible.

The first thing the macro does is to check if there is an image already saved to the
system clipboard, and if so, it uses that one. To bypass the clipboard, press Shift
while invoking the macro.

"""

__title__ = "Snip"
__author__ = "TheMarkster"
__url__ = ""
__Wiki__ = ""
__date__ = "2024.07.23"
__version__ = 1.3
import FreeCAD
from PySide import QtGui,QtCore
import uuid
import time
import tempfile, os, shutil

# class SnipBox(QtGui.QDialog):
#     def __init__(self, scale, desired_width):
#         QtGui.QDialog.__init__(self)
#         self.scale = scale
#         self.desired_width = desired_width
#
#         self.detailsTextEdit = QtGui.QTextEdit("Details")
#         self.Details = QtGui.QPushButton("Details")
#         self.Scaling = QtGui.QPushButton("Scaling")
#         self.Details.clicked.connect(self.onDetailsClicked)
#         self.Scaling.clicked.connect(self.onScalingClicked)
#         layout = QtGui.QVBoxLayout()
#         layout.addWidget(self.detailsTextEdit)
#         layout.addStretch()
#         buttons = QtGui.QDialogButtonBox(
#             QtGui.QDialogButtonBox.Ok,
#             QtCore.Qt.Horizontal, self)
#         buttons.accepted.connect(self.accept)
#         buttons.rejected.connect(self.reject)
#         buttons.addButton(self.Details, QtGui.QDialogButtonBox.ActionRole)
#         buttons.addButton(self.Scaling, QtGui.QDialogButtonBox.ActionRole)
#         buttons.setCenterButtons(True)
#         layout.addWidget(buttons)
#         self.setLayout(layout)
#         self.detailsTextEdit.setVisible(False)
#
#     def setDetailedText(self, txt):
#         self.detailsTextEdit.setText(txt)
#
#     def setTitle(self, rectwidth, rectheight):
#         if self.scale&nbsp;!= 1.0:
#            out_width = rect.width()*scale_factor
#         elif self.desired_width&nbsp;!= 0:
#             out_width = desired_width
#         self.setWindowTitle(f"Snip macro v{__version__} {rectwidth} x {rectheight} output width {out_width}")
#
#
#     def onDetailsClicked(self):
#         self.detailsTextEdit.setVisible(not self.detailsTextEdit.isVisible())
#
#     def onScalingClicked(self):
#         pass
#
#     def event(self, e): #credit serge_gubenko of stackoverflow for this
#         result = QtGui.QDialog.event(self, e)
#         self.setMinimumHeight(0)
#         self.setMaximumHeight(16777215)
#         self.setMinimumWidth(0)
#         self.setMaximumWidth(16777215)
#         self.setSizePolicy(QtGui.QSizePolicy.Expanding, QtGui.QSizePolicy.Expanding)
#         textEdit = self.findChild(QtGui.QTextEdit)
#         if textEdit&nbsp;!= None&nbsp;:
#             textEdit.setMinimumHeight(0)
#             textEdit.setMaximumHeight(16777215)
#             textEdit.setMinimumWidth(0)
#             textEdit.setMaximumWidth(16777215)
#             textEdit.setSizePolicy(QtGui.QSizePolicy.Expanding, QtGui.QSizePolicy.Expanding)
# #thanks to mario52 for this
#         if result == True:
#             try:
#                 rect = mb.frameGeometry()
#                 rectwidth  = rect.width()
#                 rectheight = rect.height()
#                 mb.setTitle(rectwidth,rectheight)
#
#             except Exception:
#                 None
# ##############
#         return result
class SnipBox(QtGui.QDialog):
    def __init__(self, scale, desired_width):
        QtGui.QDialog.__init__(self)
        self.pg = FreeCAD.ParamGet("User parameter:Plugins/Snip_Macro")
        self.scale = scale
        self.desired_width = desired_width

        self.detailsTextEdit = QtGui.QTextEdit("Details")
        self.Details = QtGui.QPushButton("Details")
        self.Scaling = QtGui.QPushButton("Scaling")
        self.Details.clicked.connect(self.onDetailsClicked)
        self.Scaling.clicked.connect(self.onScalingClicked)

        layout = QtGui.QVBoxLayout()
        layout.addWidget(self.detailsTextEdit)
        layout.addStretch()

        # Scaling widgets
        self.scaleLabel = QtGui.QLabel("Scale:")
        self.scaleSpinBox = QtGui.QDoubleSpinBox()
        self.scaleSpinBox.setDecimals(2)
        self.scaleSpinBox.setSingleStep(0.1)
        self.scaleSpinBox.setValue(self.scale)
        self.scaleSpinBox.valueChanged.connect(self.updateScale)

        self.fixedWidthLabel = QtGui.QLabel("Fixed Width:")
        self.fixedWidthSpinBox = QtGui.QSpinBox()
        self.fixedWidthSpinBox.setRange(0, 10000)
        self.fixedWidthSpinBox.setValue(self.desired_width)
        self.fixedWidthSpinBox.valueChanged.connect(self.updateDesiredWidth)

        self.scaleLayout = QtGui.QVBoxLayout()
        self.scaleText = QtGui.QLabel("Scale values other than 1.0 will override fixed width setting")
        self.scaleLayout.addWidget(self.scaleText)
        scaleHBox1 = QtGui.QHBoxLayout()
        scaleHBox1.addWidget(self.scaleLabel)
        scaleHBox1.addWidget(self.scaleSpinBox)

        scaleHBox2 = QtGui.QHBoxLayout()
        scaleHBox2.addWidget(self.fixedWidthLabel)
        scaleHBox2.addWidget(self.fixedWidthSpinBox)

        self.scaleLayout.addLayout(scaleHBox1)
        self.scaleLayout.addLayout(scaleHBox2)

        self.scaleWidget = QtGui.QWidget()
        self.scaleWidget.setLayout(self.scaleLayout)
        self.scaleWidget.setVisible(False)

        layout.addWidget(self.scaleWidget)

        buttons = QtGui.QDialogButtonBox(
            QtGui.QDialogButtonBox.Ok,
            QtCore.Qt.Horizontal, self)
        buttons.accepted.connect(self.accept)
        buttons.rejected.connect(self.reject)
        buttons.addButton(self.Details, QtGui.QDialogButtonBox.ActionRole)
        buttons.addButton(self.Scaling, QtGui.QDialogButtonBox.ActionRole)
        buttons.setCenterButtons(True)
        layout.addWidget(buttons)
        self.setLayout(layout)
        self.detailsTextEdit.setVisible(False)

    def setDetailedText(self, txt):
        self.detailsTextEdit.setText(txt)

    def setTitle(self, rectwidth, rectheight):
        if self.scale&nbsp;!= 1.0:
            out_width = rectwidth * self.scale
        elif self.desired_width&nbsp;!= 0:
            out_width = self.desired_width
        self.setWindowTitle(f"Snip macro v{__version__} {rectwidth} x {rectheight} output width {out_width}")

    def onDetailsClicked(self):
        if self.scaleWidget.isVisible():
            self.scaleWidget.setVisible(False)
        self.detailsTextEdit.setVisible(not self.detailsTextEdit.isVisible())

    def onScalingClicked(self):
        if self.detailsTextEdit.isVisible():
            self.detailsTextEdit.setVisible(False)
        self.scaleWidget.setVisible(not self.scaleWidget.isVisible())

    def updateScale(self, value):
        self.scale = value
        self.pg.SetFloat("ScaleFactor", self.scale)

    def updateDesiredWidth(self, value):
        self.desired_width = value
        self.pg.SetInt("DesiredWidth", self.desired_width)

    def event(self, e): #credit serge_gubenko of stackoverflow for this
        result = QtGui.QDialog.event(self, e)
        self.setMinimumHeight(0)
        self.setMaximumHeight(16777215)
        self.setMinimumWidth(0)
        self.setMaximumWidth(16777215)
        self.setSizePolicy(QtGui.QSizePolicy.Expanding, QtGui.QSizePolicy.Expanding)
        textEdit = self.findChild(QtGui.QTextEdit)
        if textEdit&nbsp;!= None&nbsp;:
            textEdit.setMinimumHeight(0)
            textEdit.setMaximumHeight(16777215)
            textEdit.setMinimumWidth(0)
            textEdit.setMaximumWidth(16777215)
            textEdit.setSizePolicy(QtGui.QSizePolicy.Expanding, QtGui.QSizePolicy.Expanding)
#thanks to mario52 for this
        if result == True:
            try:
                rect = mb.frameGeometry()
                rectwidth  = rect.width()
                rectheight = rect.height()
                mb.setTitle(rectwidth,rectheight)
            except Exception:
                None
##############
        return result

def get_screen_for_widget(widget):
    screen_geometry = widget.geometry()
    for screen in QtGui.QApplication.screens():
        if screen.geometry().contains(screen_geometry.center()):
            return screen
def get_widget_screen_coordinates(widget):
    screen = get_screen_for_widget(widget)
    widget_geometry = widget.geometry()
    screen_geometry = screen.geometry()
    return QtCore.QRect(widget_geometry.x() - screen_geometry.x(),
                        widget_geometry.y() - screen_geometry.y(),
                        widget_geometry.width(),
                        widget_geometry.height())


pg = FreeCAD.ParamGet("User parameter:Plugins/Snip_Macro")
#parameters were originally in BaseApp, but should be in Plugins, so relocate if necessary
if FreeCAD.ParamGet("User parameter:BaseApp/Preferences").HasGroup("Snip_Macro"):
    deprecated = FreeCAD.ParamGet("User parameter:BaseApp/Preferences/Snip_Macro")
    pg.SetInt("LastX",deprecated.GetInt("LastX",0))
    pg.SetInt("LastY",deprecated.GetInt("LastY",0))
    pg.SetInt("LastWidth",deprecated.GetInt("LastWidth",0))
    pg.SetInt("LastHeight",deprecated.GetInt("LastHeight",0))
    pg.SetFloat("WindowOpacity",deprecated.GetFloat("WindowOpacity",0.85))
    pg.SetFloat("SnipDelay",deprecated.GetFloat("SnipDelay",0.5))
    FreeCAD.ParamGet("User parameter:BaseApp/Preferences").RemGroup("Snip_Macro")

desired_width = pg.GetInt("DesiredWidth",0) #used for scaling to desired width, maintaining aspect ratio
pg.SetInt("DesiredWidth", desired_width)
scale_factor = pg.GetFloat("ScaleFactor", 1.0) #scale by scale factor instead of desired width
pg.SetFloat("ScaleFactor", scale_factor)

skipClipboard = False
modifiers = QtGui.QApplication.keyboardModifiers()
if modifiers == QtCore.Qt.ShiftModifier:
    skipClipboard = True

userCanceled = False
fname = "Snip macro screenshot-"+str(uuid.uuid4())[:6]+".png"
image = None
if not skipClipboard:
    clip = QtGui.QClipboard()
    image = clip.image(QtGui.QClipboard.Clipboard)
if not image:

    #use our own screen grabber
    mb = SnipBox(scale_factor, desired_width)
    details = """
Move and resize this box to cover the part of the screen you wish to grab.
If it succeeds an open file dialog will appear. Drag and drop the file
from the open file dialog to the forum. The file will be deleted after
you close the dialog.

If this fails you can still use this macro to handle screenshots you
copied to the clipboard using other tools:

Windows snip tool: Window Key + Shift + S
Mac snip tool: Command + Shift + 4
Linux: gnome-screenshot utility

If the macro finds there is already an image copied to the clipboard
it uses that image instead of bringing up this dialog. Press Shift
while invoking this macro to bypass the clipboard. Alternatively,
you can clear the image from the clipboard by copying some text to it.

The Open button will open the file in the system
default application for handling png files, e.g. Paint in windows. This
can be useful if you wish to annotate the screenshot. But most of the
time you will simply want to drag and drop the file to the forum, then
Cancel to close the open file dialog afterwards.

If you wish to open the screenshot file with another application, right-click
the file and select open with... option or drag/drop to that other application.

User Parameters: These can be accessed via Tools menu -&gt; Edit Parameters in
Plugins -&gt; Snip_Macro:

LastX, LastY, LastWidth, LastHeight -- location and size of snip box last use
WindowOpacity (0.85) -- value between 0.0 (less opaque) and 1.0 (more opaque)
SnipDelay (0.5) -- time (in seconds) delay between snip box close and snip
DesiredWidth -- image will be scaled to this width (unless it is 0) maintaining
current aspect ratio.
ScaleFactor -- float value, e.g. 0.5 -- image will be scaled to that scale factor.
Note: ScaleFactor (if not 1.0) will take precedence over DesiredWidth
Hold down Ctrl key to ignore scaling.

The SnipDelay parameter can be adjusted to speed things up a bit, but if it
is too small the screenshot taken might include the snip box itself because
we need to wait for it to close before taking the screenshot.

"""
   # mb.setWindowTitle("Snip macro v"+str(__version__))
    mb.setDetailedText(details)
    if pg.GetFloat("WindowOpacity",0.85) == 0.85:
        pg.SetFloat("WindowOpacity",0.85)
    mb.setWindowOpacity(pg.GetFloat("WindowOpacity",0.85))
    lastX = pg.GetInt("LastX",0)
    lastY = pg.GetInt("LastY",0)
    lastWidth = pg.GetInt("LastWidth",100)
    lastHeight = pg.GetInt("LastHeight",100)
    mb.setGeometry(lastX, lastY, lastWidth, lastHeight)
    mb.resize(lastWidth, lastHeight)
    mb.setWindowFlags(QtCore.Qt.Tool)
    result = mb.exec_()
    if not result:
        userCanceled = True
    if not userCanceled:
        clientRect = mb.geometry()
        scale_factor = mb.scale
        desired_width = mb.desired_width
        rect = get_widget_screen_coordinates(mb)
        diff = rect.height()-clientRect.height()
        pg.SetInt("LastX", rect.x())
        pg.SetInt("LastY", rect.y())
        pg.SetInt("LastWidth", rect.width())
        pg.SetInt("LastHeight", rect.height()-diff)
        QtGui.QApplication.processEvents()
        snipDelay = pg.GetFloat("SnipDelay", 0.5)
        if snipDelay == 0.5:
            pg.SetFloat("SnipDelay", 0.5)
        time.sleep(snipDelay) #give time for dialog to close before taking screenshot
        QtGui.QApplication.processEvents()
        if hasattr(QtGui.QApplication,"primaryScreen"):
            #screen = QtGui.QApplication.primaryScreen()
            screen = get_screen_for_widget(mb)
            image = screen.grabWindow(0,rect.x(),rect.y(),rect.width(),rect.height()).toImage()
        else:
            long_qdesktop_id = QtGui.QApplication.desktop().winId()
            image = QtGui.QPixmap.grabWindow(long_qdesktop_id, rect.x(), rect.y(), rect.width(), rect.height()).toImage()
        if not image:
            raise Exception("Snip Macro Error: Unable to grab screen image\n")
        modifiers = QtGui.QApplication.keyboardModifiers()
        skipScaling = False
        if modifiers == QtCore.Qt.ControlModifier:
            skipScaling = True
        if not skipScaling:
            if scale_factor&nbsp;!= 1.0:
                image = image.smoothScaled(rect.width()*scale_factor, rect.height()*scale_factor)
            elif desired_width&nbsp;!= 0:
                image = image.smoothScaled(desired_width, rect.height()*float(desired_width)/float(rect.width()))

if not userCanceled:
    dirPath = tempfile.mkdtemp()
    filePath = dirPath + os.path.sep + fname
    image.save(filePath)
    fileName = QtGui.QFileDialog.getOpenFileName(QtGui.QApplication.activeWindow(),
    "Drag the image to the forum, then Cancel will delete the temporary file", dirPath, "PNG (*.png)")
    if fileName[0]:  #user selected Open or double-clicked file
        import subprocess, os, platform
        if platform.system() == 'Darwin':       # macOS
            subprocess.call(('open', fileName[0]))
        elif platform.system() == 'Windows':    # Windows
            os.startfile(fileName[0])
        else:                                   # linux variants
            subprocess.call(('xdg-open', fileName[0]))
        QtGui.QApplication.processEvents() #allow some time for file to open before deleting temp folder and contents
        time.sleep(1)
        QtGui.QApplication.processEvents()
    shutil.rmtree(dirPath)</pre>
<p><span id="Link"></span>
</p>
<h2><span id=".D0.A1.D1.81.D1.8B.D0.BB.D0.BA.D0.B8"></span><span class="mw-headline" id="&#1057;&#1089;&#1099;&#1083;&#1082;&#1080;">&#1057;&#1089;&#1099;&#1083;&#1082;&#1080;</span></h2>
<p>&#1054;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072; &#1092;&#1086;&#1088;&#1091;&#1084;&#1077; <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?f=9&amp;t=38328&amp;sid=385bf3174dcae7fb8bdf529f4e76dfed">Snip macro</a>
</p>
<!-- 
NewPP limit report
Cached time: 20251009170811
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.074 seconds
Real time usage: 0.163 seconds
Preprocessor visited node count: 282/1000000
Post&#8208;expand include size: 11298/2097152 bytes
Template argument size: 21100/2097152 bytes
Highest expansion depth: 6/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 18787/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   36.992      1 -total
 17.28%    6.392     13 Template:Incode
 16.12%    5.962      2 Template:Caption
 15.19%    5.618      1 Template:MacroCode
 10.83%    4.006      1 Template:Macro/ru
  9.61%    3.553      3 Template:Button
  9.26%    3.427      1 Template:FileName
  8.66%    3.202      1 Template:MenuCommand
  7.14%    2.641      7 Template:KEY
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:381236-0!canonical and timestamp 20251009170811 and revision id 1659904. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>