<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Online Help Startpage/ru</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="ru" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Online+Help+Startpage&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../id/Online_Help_Startpage.html" class="mw-pt-progress mw-pt-progress--med" title="Online Help Startpage/id (45% translated)" lang="id" dir="ltr">Bahasa Indonesia</a></li>
<li><a href="../de/Online_Help_Startpage.html" class="mw-pt-progress mw-pt-progress--complete" title="Startseite Online-Hilfe (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Online_Help_Startpage.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Online Help Startpage (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../tr/Online_Help_Startpage.html" class="mw-pt-progress mw-pt-progress--med" title="&Ccedil;evrimi&ccedil;i Yard&#305;m Ana Sayfas&#305; (64% translated)" lang="tr" dir="ltr">T&uuml;rk&ccedil;e</a></li>
<li><a href="../es/Online_Help_Startpage.html" class="mw-pt-progress mw-pt-progress--high" title="Pagina inicio de ayuda en linea (82% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/Online_Help_Startpage.html" class="mw-pt-progress mw-pt-progress--complete" title="Aide en ligne (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../hr/Online_Help_Startpage.html" class="mw-pt-progress mw-pt-progress--complete" title="Po&#269;etna stranica Online pomo&#263;i (100% translated)" lang="hr" dir="ltr">hrvatski</a></li>
<li><a href="../it/Online_Help_Startpage.html" class="mw-pt-progress mw-pt-progress--complete" title="Pagina iniziale della Guida in linea (100% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Online_Help_Startpage.html" class="mw-pt-progress mw-pt-progress--complete" title="Strona pomocy online (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt/Online_Help_Startpage.html" class="mw-pt-progress mw-pt-progress--complete" title="P&aacute;gina inicial da Ajuda Online (100% translated)" lang="pt" dir="ltr">portugu&ecirc;s</a></li>
<li><a href="../pt-br/Online_Help_Startpage.html" class="mw-pt-progress mw-pt-progress--high" title="P&aacute;gina inicial da Ajuda Online (91% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../ro/Online_Help_Startpage.html" class="mw-pt-progress mw-pt-progress--med" title="Online Help Startpage/ro (55% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><a href="../sk/Online_Help_Startpage.html" class="mw-pt-progress mw-pt-progress--high" title="&Scaron;tartovacia str&aacute;nka online pomoci (82% translated)" lang="sk" dir="ltr">sloven&#269;ina</a></li>
<li><a href="../sv/Online_Help_Startpage.html" class="mw-pt-progress mw-pt-progress--med" title="Online Help Startpage (64% translated)" lang="sv" dir="ltr">svenska</a></li>
<li><a href="../cs/Online_Help_Startpage.html" class="mw-pt-progress mw-pt-progress--complete" title="&Uacute;vodn&iacute; str&aacute;nka online n&aacute;pov&#283;dy (100% translated)" lang="cs" dir="ltr">&#269;e&scaron;tina</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</span></li>
<li><a href="../uk/Online_Help_Startpage.html" class="mw-pt-progress mw-pt-progress--low" title="Online Help Startpage (9% translated)" lang="uk" dir="ltr">&#1091;&#1082;&#1088;&#1072;&#1111;&#1085;&#1089;&#1100;&#1082;&#1072;</a></li>
<li><a href="../zh/Online_Help_Startpage.html" class="mw-pt-progress mw-pt-progress--high" title="&#22312;&#32447;&#24110;&#21161;&#39318;&#39029; (82% translated)" lang="zh" dir="ltr">&#20013;&#25991;</a></li>
<li><a href="../zh-cn/Online_Help_Startpage.html" class="mw-pt-progress mw-pt-progress--complete" title="&#22312;&#32447;&#24110;&#21161;&#36215;&#22987;&#39029; (100% translated)" lang="zh-Hans-CN" dir="ltr">&#20013;&#25991;&#65288;&#20013;&#22269;&#22823;&#38470;&#65289;</a></li>
<li><a href="../zh-tw/Online_Help_Startpage.html" class="mw-pt-progress mw-pt-progress--low" title="Online Help Startpage (9% translated)" lang="zh-Hant-TW" dir="ltr">&#20013;&#25991;&#65288;&#33274;&#28771;&#65289;</a></li>
<li><a href="../ja/Online_Help_Startpage.html" class="mw-pt-progress mw-pt-progress--high" title="&#12399;&#12376;&#12417;&#12395; (73% translated)" lang="ja" dir="ltr">&#26085;&#26412;&#35486;</a></li>
<li><a href="../ko/Online_Help_Startpage.html" class="mw-pt-progress mw-pt-progress--complete" title="&#50728;&#46972;&#51064; &#46020;&#50880;&#47568; &#49884;&#51089; &#54168;&#51060;&#51648; (100% translated)" lang="ko" dir="ltr">&#54620;&#44397;&#50612;</a></li></ul></div>
<div class="docnav">
    <div><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Freecad.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span></div>
    <div><a href="../ru/About_FreeCAD.html" title="About FreeCAD/ru">&#1054; FreeCAD</a>
 <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-right.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span></div>
    <div><a href="../ru/Online_Help_Toc.html" title="Online Help Toc/ru">&#1054;&#1075;&#1083;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;</a> <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Online_Help_Toc.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span></div>
</div>
<figure class="mw-default-size mw-halign-right" typeof="mw:File"><a href="../index.php?title=Crystal_Clear_app_tutorials.png&amp;filetimestamp=20090202153438&amp;.html" class="mw-file-description" title="150"><img alt="150" src="../File/Crystal_Clear_app_tutorials.png" decoding="async" width="128" height="128" class="mw-file-element" data-file-width="128" data-file-height="128"></a><figcaption>150</figcaption></figure>
<p><span id="Welcome_to_the_FreeCAD_on-line_help"></span>
</p>
<h2><span id=".D0.94.D0.BE.D0.B1.D1.80.D0.BE_.D0.BF.D0.BE.D0.B6.D0.B0.D0.BB.D0.BE.D0.B2.D0.B0.D1.82.D1.8C_.D0.BD.D0.B0_.D1.81.D1.82.D1.80.D0.B0.D0.BD.D0.B8.D1.86.D1.83_.D0.BF.D0.BE.D0.BC.D0.BE.D1.89.D0.B8_FreeCAD"></span><span class="mw-headline" id="&#1044;&#1086;&#1073;&#1088;&#1086;_&#1087;&#1086;&#1078;&#1072;&#1083;&#1086;&#1074;&#1072;&#1090;&#1100;_&#1085;&#1072;_&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091;_&#1087;&#1086;&#1084;&#1086;&#1097;&#1080;_FreeCAD">&#1044;&#1086;&#1073;&#1088;&#1086; &#1087;&#1086;&#1078;&#1072;&#1083;&#1086;&#1074;&#1072;&#1090;&#1100; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; &#1087;&#1086;&#1084;&#1086;&#1097;&#1080; FreeCAD</span></h2>
<p>&#1057;&#1087;&#1088;&#1072;&#1074;&#1086;&#1095;&#1085;&#1072;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; FreeCAD &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1072; &#1085;&#1072; <a rel="nofollow" class="external text" href="http://wiki.freecad.org">wiki</a>, &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1086;&#1081;, &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1086;&#1081; &#1080; &#1088;&#1072;&#1079;&#1074;&#1080;&#1074;&#1072;&#1077;&#1084;&#1086;&#1081; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1084; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; &#1080; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074; FreeCAD. &#1054;&#1085;&#1072; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1086;&#1073;&#1097;&#1091;&#1102; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1086; FreeCAD, &#1091;&#1095;&#1077;&#1073;&#1085;&#1099;&#1077; &#1087;&#1086;&#1089;&#1086;&#1073;&#1080;&#1103;, &#1090;&#1086;&#1095;&#1085;&#1091;&#1102; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1102; &#1087;&#1086; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1077; FreeCAD, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1102; &#1087;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1102; &#1085;&#1072; Python &#1080; C++. &#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1086;&#1085;&#1072; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1099; &#1101;&#1090;&#1086;&#1081; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080; &#1085;&#1072; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1103;&#1079;&#1099;&#1082;&#1086;&#1074;. &#1052;&#1099; &#1085;&#1072;&#1076;&#1077;&#1077;&#1084;&#1089;&#1103;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1085;&#1072;&#1081;&#1076;&#1077;&#1090;&#1077; &#1079;&#1076;&#1077;&#1089;&#1100; &#1074;&#1089;&#1102; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1091;&#1102; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102;. &#1045;&#1089;&#1083;&#1080; &#1091; &#1074;&#1072;&#1089; &#1077;&#1089;&#1090;&#1100; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1099; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1081;&#1090;&#1080; &#1086;&#1090;&#1074;&#1077;&#1090;&#1099; &#1074; &#1101;&#1090;&#1086;&#1081; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080;, &#1079;&#1072;&#1075;&#1083;&#1103;&#1085;&#1080;&#1090;&#1077; &#1085;&#1072; &#1092;&#1086;&#1088;&#1091;&#1084; <a rel="nofollow" class="external text" href="http://forum.freecad.org/index.php">FreeCAD</a>, &#1075;&#1076;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1081;&#1090;&#1080; &#1086;&#1090;&#1074;&#1077;&#1090; &#1085;&#1072; &#1089;&#1074;&#1086;&#1081; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089; &#1080;&#1083;&#1080; &#1085;&#1072;&#1081;&#1090;&#1080; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1072;, &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1085;&#1086;&#1075;&#1086; &#1074;&#1072;&#1084; &#1087;&#1086;&#1084;&#1086;&#1095;&#1100;.
</p><p><span id="How_to_use"></span>
</p>
<h3><span id=".D0.9A.D0.B0.D0.BA_.D0.BF.D0.BE.D0.BB.D1.8C.D0.B7.D0.BE.D0.B2.D0.B0.D1.82.D1.8C.D1.81.D1.8F"></span><span class="mw-headline" id="&#1050;&#1072;&#1082;_&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103;">&#1050;&#1072;&#1082; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103;</span></h3>
<p>&#1069;&#1090;&#1086;&#1090; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; &#1088;&#1072;&#1079;&#1073;&#1080;&#1090; &#1085;&#1072; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1086;&#1074;:
</p>
<ol><li><a href="../ru/User_hub.html" title="User hub/ru">&#1062;&#1077;&#1085;&#1090;&#1088; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;</a>, &#1076;&#1083;&#1103; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1099;&#1093; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1093;&#1086;&#1090;&#1103;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1091;.</li>
<li><a href="../ru/Power_users_hub.html" title="Power users hub/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1089;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1077;&#1074; &#1085;&#1072; Python</a>, &#1076;&#1083;&#1103; &#1086;&#1087;&#1099;&#1090;&#1085;&#1099;&#1093; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1079;&#1072;&#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1086;&#1074;&#1072;&#1083;&#1080;&#1089;&#1100; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1074;&#1099;&#1084;&#1080; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1103;&#1084;&#1080; FreeCAD &#1080; &#1093;&#1086;&#1090;&#1077;&#1083;&#1080; &#1073;&#1099; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1077;&#1075;&#1086; &#1072;&#1089;&#1087;&#1077;&#1082;&#1090;&#1099;.</li>
<li><a href="../ru/Developer_hub.html" title="Developer hub/ru">&#1056;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1077;</a>, &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1102;&#1090; FreeCAD &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1073;&#1072;&#1079;&#1099; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1093; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;.</li></ol>
<p>&#1052;&#1085;&#1086;&#1075;&#1080;&#1077; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1101;&#1090;&#1086;&#1081; &#1074;&#1080;&#1082;&#1080; &#1090;&#1072;&#1082;&#1078;&#1077; &#1089;&#1075;&#1088;&#1091;&#1087;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1099; &#1074; &#1073;&#1086;&#1083;&#1077;&#1077; &#1091;&#1076;&#1086;&#1073;&#1085;&#1086;&#1077; &#1076;&#1083;&#1103; &#1095;&#1090;&#1077;&#1085;&#1080;&#1103; <a href="../ru/Manual.html" class="mw-redirect" title="Manual/ru">&#1056;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086;</a>. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1085;&#1086;&#1074;&#1080;&#1095;&#1086;&#1082; &#1074; FreeCAD, &#1084;&#1099; &#1089;&#1086;&#1074;&#1077;&#1090;&#1091;&#1077;&#1084; &#1074;&#1072;&#1084; &#1085;&#1072;&#1095;&#1072;&#1090;&#1100; &#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1089; &#1101;&#1090;&#1086;&#1075;&#1086; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1072;.
</p><p><span id="Contribute"></span>
</p>
<h3><span id=".D0.A1.D0.BE.D0.B4.D0.B5.D0.B9.D1.81.D1.82.D0.B2.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1057;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077;">&#1057;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077;</span></h3>
<p>&#1050;&#1072;&#1082; &#1074;&#1099; &#1084;&#1086;&#1075;&#1083;&#1080; &#1091;&#1073;&#1077;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103;, &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1099; &#1080;&#1085;&#1086;&#1075;&#1076;&#1072; &#1087;&#1083;&#1086;&#1093;&#1086; &#1087;&#1080;&#1096;&#1091;&#1090; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1102;! &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1086;&#1095;&#1077;&#1085;&#1100; &#1074;&#1072;&#1078;&#1085;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1087;&#1099;&#1090;&#1085;&#1099;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1080; &#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1083;&#1080; &#1087;&#1080;&#1089;&#1072;&#1090;&#1100;, &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1103;&#1090;&#1100;, &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1080; &#1087;&#1077;&#1088;&#1077;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1090;&#1100; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1102;. &#1044;&#1072;, &#1084;&#1099; &#1080;&#1084;&#1077;&#1077;&#1084; &#1074; &#1074;&#1080;&#1076;&#1091; &#1074;&#1072;&#1089;! &#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1074;&#1080;&#1082;&#1080; - &#1101;&#1090;&#1086; <a class="external text" href="https://www.mediawiki.org/wiki/Help:Formatting">&#1083;&#1077;&#1075;&#1082;&#1086;</a>. &#1055;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1101;&#1090;&#1072; &#1074;&#1080;&#1082;&#1080; &#1079;&#1072;&#1097;&#1080;&#1097;&#1077;&#1085;&#1072; &#1086;&#1090; &#1089;&#1087;&#1072;&#1084;&#1072;, &#1076;&#1083;&#1103; &#1074;&#1093;&#1086;&#1076;&#1072; &#1074; &#1085;&#1077;&#1105; &#1074;&#1072;&#1084; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074;&#1080;&#1082;&#1080;-&#1072;&#1082;&#1082;&#1072;&#1091;&#1085;&#1090; FreeCAD. &#1057;&#1087;&#1088;&#1086;&#1089;&#1080;&#1090;&#1077; <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=6830">&#1085;&#1072; &#1092;&#1086;&#1088;&#1091;&#1084;&#1077;</a>, &#1080; &#1084;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1076;&#1080;&#1084; &#1076;&#1083;&#1103; &#1074;&#1072;&#1089; &#1072;&#1082;&#1082;&#1072;&#1091;&#1085;&#1090;. &#1042; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1077;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1074;&#1080;&#1082;&#1080;-&#1072;&#1082;&#1082;&#1072;&#1091;&#1085;&#1090; &#1086;&#1090;&#1076;&#1077;&#1083;&#1077;&#1085; &#1086;&#1090; &#1092;&#1086;&#1088;&#1091;&#1084;&#1085;&#1086;&#1075;&#1086; &#1072;&#1082;&#1082;&#1072;&#1091;&#1085;&#1090;&#1072;, &#1085;&#1086; &#1084;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1076;&#1080;&#1084; &#1074;&#1072;&#1084; &#1074;&#1080;&#1082;&#1080;-&#1072;&#1082;&#1082;&#1072;&#1091;&#1085;&#1090; &#1089; &#1090;&#1077;&#1084; &#1078;&#1077; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084;, &#1095;&#1090;&#1086; &#1080; &#1074;&#1072;&#1096; &#1092;&#1086;&#1088;&#1091;&#1084;&#1085;&#1099;&#1081; &#1072;&#1082;&#1082;&#1072;&#1091;&#1085;&#1090;. &#1058;&#1086;&#1075;&#1076;&#1072; &#1074;&#1099; &#1089;&#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1095;&#1072;&#1090;&#1100; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;!  &#1058;&#1072;&#1082;&#1078;&#1077; &#1087;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; <a rel="nofollow" class="external text" href="http://www.freecad.org/wiki/index.php?title=Help_FreeCAD">&#1101;&#1090;&#1091; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091;</a>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1079;&#1085;&#1072;&#1090;&#1100;, &#1082;&#1072;&#1082; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1086;&#1084;&#1086;&#1095;&#1100; FreeCAD.
</p>
<div class="docnav">
    <div><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Freecad.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span></div>
    <div><a href="../ru/About_FreeCAD.html" title="About FreeCAD/ru">&#1054; FreeCAD</a>
 <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-right.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span></div>
    <div><a href="../ru/Online_Help_Toc.html" title="Online Help Toc/ru">&#1054;&#1075;&#1083;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;</a> <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Online_Help_Toc.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span></div>
</div>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><span typeof="mw:File"><a href="../index.php?title=User_hub.png&amp;filetimestamp=20190221145008&amp;.html" class="mw-file-description"><img src="../File/User_hub.png" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/User_hub.html" title="User hub/ru">&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b><a href="../ru/Getting_started.html" title="Getting started/ru">&#1053;&#1072;&#1095;&#1080;&#1085;&#1072;&#1102;&#1097;&#1080;&#1084;</a></b></li>
<li><b>&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072;:</b> <a href="../ru/Download.html" title="Download/ru">&#1047;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072;</a>, <a href="../ru/Installing_on_Windows.html" title="Installing on Windows/ru">Windows</a>, <a href="../ru/Installing_on_Linux.html" title="Installing on Linux/ru">Linux</a>, <a href="../ru/Installing_on_Mac.html" title="Installing on Mac/ru">Mac</a>, <a href="../ru/Installing_additional_components.html" title="Installing additional components/ru">
&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074;</a>, <a href="../ru/Compile_on_Docker.html" title="Compile on Docker/ru">Docker</a>, <a href="../ru/AppImage.html" title="AppImage/ru">AppImage</a>, <a href="../ru/Ubuntu_Snap.html" title="Ubuntu Snap/ru">Ubuntu Snap</a></li>
<li><b>&#1041;&#1072;&#1079;&#1086;&#1074;&#1072;&#1103;:</b> <a href="../ru/About_FreeCAD.html" title="About FreeCAD/ru">&#1054; FreeCAD</a>, <a href="../ru/Interface.html" title="Interface/ru">&#1048;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;</a>, <a href="../ru/Mouse_navigation.html" title="Mouse navigation/ru">&#1053;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1103; &#1084;&#1099;&#1096;&#1080;</a>, <a href="../ru/Selection_methods.html" title="Selection methods/ru">&#1052;&#1077;&#1090;&#1086;&#1076;&#1099; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103;</a>, <a href="../ru/Object_name.html" title="Object name/ru">&#1048;&#1084;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;</a>, <a href="../ru/Preferences_Editor.html" title="Preferences Editor/ru">&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;</a>, <a href="../ru/Workbenches.html" title="Workbenches/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>, <a href="../ru/Document_structure.html" title="Document structure/ru">&#1057;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;</a>, <a href="../ru/Property.html" title="Property/ru">&#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;</a>, <a href="../ru/Help_FreeCAD.html" title="Help FreeCAD/ru">&#1055;&#1086;&#1084;&#1086;&#1075;&#1080; FreeCAD</a>, <a href="../ru/Donate.html" title="Donate/ru">&#1055;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</a></li></ul>
<hr>
<ul><li><b>&#1055;&#1086;&#1084;&#1086;&#1097;&#1100;:</b> <a href="../ru/Tutorials.html" title="Tutorials/ru">&#1059;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082;&#1080;</a>, <a href="../ru/Video_tutorials.html" title="Video tutorials/ru">&#1042;&#1080;&#1076;&#1077;&#1086; &#1091;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082;&#1080;</a></li>
<li><b><a href="../ru/Workbenches.html" title="Workbenches/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>:</b> <a href="../ru/Std_Base.html" title="Std Base/ru">Std Base</a>, <a href="../ru/Arch_Workbench.html" title="Arch Workbench/ru">Arch</a>, <a href="../ru/Assembly_Workbench.html" title="Assembly Workbench/ru">Assembly</a>, <a href="../ru/CAM_Workbench.html" title="CAM Workbench/ru">CAM</a>, <a href="../ru/Draft_Workbench.html" title="Draft Workbench/ru">Draft</a>, <a href="../ru/FEM_Workbench.html" title="FEM Workbench/ru">FEM</a>, <a href="../ru/Inspection_Workbench.html" title="Inspection Workbench/ru">Inspection</a>, <a href="../ru/Mesh_Workbench.html" title="Mesh Workbench/ru">Mesh</a>, <a href="../ru/OpenSCAD_Workbench.html" title="OpenSCAD Workbench/ru">OpenSCAD</a>, <a href="../ru/Part_Workbench.html" title="Part Workbench/ru">Part</a>, <a href="../ru/PartDesign_Workbench.html" title="PartDesign Workbench/ru">PartDesign</a>, <a href="../ru/Points_Workbench.html" title="Points Workbench/ru">Points</a>, <a href="../ru/Reverse_Engineering_Workbench.html" title="Reverse Engineering Workbench/ru">Reverse Engineering</a>, <a href="../ru/Robot_Workbench.html" title="Robot Workbench/ru">Robot</a>, <a href="../ru/Sketcher_Workbench.html" title="Sketcher Workbench/ru">Sketcher</a>, <a href="../ru/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/ru">Spreadsheet</a>, <a href="../ru/Surface_Workbench.html" title="Surface Workbench/ru">Surface</a>, <a href="../ru/TechDraw_Workbench.html" title="TechDraw Workbench/ru">TechDraw</a>, <a href="../ru/Testing.html" title="Testing/ru">Test Framework</a></li></ul>
<hr>
<ul><li><b><a href="../ru/Addon.html" title="Addon/ru">Addons</a>:</b> <a href="../ru/Std_AddonMgr.html" title="Std AddonMgr/ru">&#1052;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1081;</a>, <a href="../ru/External_workbenches.html" title="External workbenches/ru">&#1042;&#1085;&#1077;&#1096;&#1085;&#1080;&#1077; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>, <a href="../ru/Scripting_and_macros.html" title="Scripting and macros/ru">C&#1082;&#1088;&#1080;&#1087;&#1090;&#1099; &#1080; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1099;</a></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="../ru/User_hub.html" title="User hub/ru">&#1059;&#1075;&#1086;&#1083;&#1086;&#1082; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;</a>, <a href="../ru/Power_users_hub.html" title="Power users hub/ru">&#1059;&#1075;&#1086;&#1083;&#1086;&#1082; &#1086;&#1087;&#1099;&#1090;&#1085;&#1099;&#1093; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;</a>, <a href="../ru/Developer_hub.html" title="Developer hub/ru">&#1059;&#1075;&#1086;&#1083;&#1086;&#1082; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20260216160510
Cache expiry: 86400
Reduced expiry: false
Complications: []
CPU time usage: 0.064 seconds
Real time usage: 0.079 seconds
Preprocessor visited node count: 75/1000000
Post&#8208;expand include size: 7197/2097152 bytes
Template argument size: 2368/2097152 bytes
Highest expansion depth: 5/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 4303/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    6.795      1 -total
 60.04%    4.080      1 Template:Userdocnavi/ru
 36.98%    2.513      2 Template:Docnav/ru
 27.20%    1.848      1 Template:Navigation_menu_2
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:988-0!canonical and timestamp 20260216160510 and revision id 1659471. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>