<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">OpenCASCADE/ru</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="ru" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-OpenCASCADE&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/OpenCASCADE.html" class="mw-pt-progress mw-pt-progress--complete" title="OpenCASCADE (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../OpenCASCADE.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="OpenCASCADE (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/OpenCASCADE.html" class="mw-pt-progress mw-pt-progress--high" title="OpenCASCADE (97% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/OpenCASCADE.html" class="mw-pt-progress mw-pt-progress--complete" title="OpenCASCADE (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/OpenCASCADE.html" class="mw-pt-progress mw-pt-progress--low" title="OpenCASCADE (6% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/OpenCASCADE.html" class="mw-pt-progress mw-pt-progress--complete" title="OpenCASCADE (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt-br/OpenCASCADE.html" class="mw-pt-progress mw-pt-progress--high" title="OpenCASCADE (94% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../fi/OpenCASCADE.html" class="mw-pt-progress mw-pt-progress--low" title="OpenCASCADE (3% translated)" lang="fi" dir="ltr">suomi</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</span></li></ul></div>
<div style="clear:right; margin-bottom: .5em; float: right; padding: .5em 0 .8em 1.4em; background: none;"><meta property="mw:PageProp/toc"></div>
<p><span id="Description"></span>
</p>
<h2><span id=".D0.9E.D0.BF.D0.B8.D1.81.D0.B0.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;">&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;</span></h2>
<p><a class="mw-selflink selflink">OpenCASCADE Technology</a>, &#1089;&#1086;&#1082;&#1088;&#1072;&#1097;&#1077;&#1085;&#1085;&#1086; <b>OCC</b> &#1080;&#1083;&#1080; <b>OCCT</b>, &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1085;&#1072;&#1073;&#1086;&#1088; C++ &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1084;&#1077;&#1089;&#1090;&#1077; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1103;&#1076;&#1088;&#1086; &#1087;&#1088;&#1086;&#1092;&#1077;&#1089;&#1089;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; (&#1057;&#1040;&#1055;&#1056;) &#1076;&#1083;&#1103; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; 2D &#1080; 3D &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1080; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1103; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1072;, &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080;&#1083;&#1080; &#1074;&#1080;&#1079;&#1091;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080;. OpenCascade - &#1101;&#1090;&#1086; "&#1089;&#1077;&#1088;&#1076;&#1094;&#1077;" &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081; FreeCAD.
</p><p>&#1043;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; OCCT &#1074; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1084; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085;&#1099; &#1080; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099; &#1074; FreeCAD &#1095;&#1077;&#1088;&#1077;&#1079; &#1084;&#1086;&#1076;&#1091;&#1083;&#1100; <a href="../ru/Part_Workbench.html" title="Part Workbench/ru">Part</a> , &#1086;&#1090; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1090; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; <a href="../ru/Workbenches.html" title="Workbenches/ru">&#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1086;&#1074;</a>. &#1054;&#1085;&#1080; &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1076;&#1083;&#1103; &#1095;&#1090;&#1077;&#1085;&#1080;&#1103; &#1080; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1086;&#1074; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;, &#1090;&#1072;&#1082;&#1080;&#1093; &#1082;&#1072;&#1082; STEP &#1080; IGES, &#1080; &#1076;&#1083;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; 2D-&#1087;&#1088;&#1086;&#1077;&#1082;&#1094;&#1080;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1095;&#1077;&#1088;&#1090;&#1077;&#1078;&#1077;&#1081; &#1074; <a href="../ru/TechDraw_Workbench.html" title="TechDraw Workbench/ru">TechDraw</a>.
</p><p><span typeof="mw:File"><a href="../index.php?title=Part_Workbench_relationships.svg&amp;filetimestamp=20241015172549&amp;.html" class="mw-file-description"><img src="../File/Part_Workbench_relationships.svg" decoding="async" width="600" height="276" class="mw-file-element" data-file-width="663" data-file-height="305"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">OpenCASCADE &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1077; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; &#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1103; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080; &#1076;&#1083;&#1103; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; <a href="../ru/Part_Workbench.html" title="Part Workbench/ru">Part</a>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1079;&#1072;&#1090;&#1077;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1074;&#1089;&#1077;&#1084;&#1080; &#1088;&#1072;&#1073;&#1086;&#1095;&#1080;&#1084;&#1080; &#1084;&#1077;&#1089;&#1090;&#1072;&#1084;&#1080; &#1074; FreeCAD.</p>
<p>OpenCascade &#1085;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1087;&#1091;&#1090;&#1072;&#1090;&#1100; &#1089; <a rel="nofollow" class="external text" href="https://www.openscad.org/">OpenSCAD</a>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1089; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084; &#1082;&#1086;&#1076;&#1086;&#1084; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; 3D-&#1084;&#1086;&#1076;&#1077;&#1083;&#1077;&#1081;, &#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1095;&#1077;&#1088;&#1077;&#1079; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; <a href="../OpenSCAD_Workbench.html" title="OpenSCAD Workbench">OpenSCAD</a>.
</p><p>OpenCascade &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1084; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1099;&#1084; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1103; GNU Lesser General Public License (LGPL) &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 2.1 &#1089; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;.
</p><p><span id="Installation"></span>
</p>
<h2><span id=".D0.A3.D1.81.D1.82.D0.B0.D0.BD.D0.BE.D0.B2.D0.BA.D0.B0"></span><span class="mw-headline" id="&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072;">&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072;</span></h2>
<p>OpenCascade &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1084; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1084; FreeCAD, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1089;&#1082;&#1072;&#1095;&#1072;&#1077;&#1090;&#1077; FreeCAD &#1087;&#1086; &#1086;&#1076;&#1085;&#1086;&#1081; &#1080;&#1079; &#1089;&#1089;&#1099;&#1083;&#1086;&#1082; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; <a href="../ru/Download.html" title="Download/ru">&#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080;</a>, &#1086;&#1085; &#1073;&#1091;&#1076;&#1077;&#1090; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1074;&#1084;&#1077;&#1089;&#1090;&#1077; &#1089; FreeCAD.
</p><p>&#1054;&#1076;&#1085;&#1072;&#1082;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1090;&#1100; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1097;&#1080;&#1077; OCCT, &#1080;&#1083;&#1080; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1089;&#1074;&#1086;&#1081; C++ &#1082;&#1086;&#1076; &#1074; FreeCAD, &#1074;&#1072;&#1084; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1092;&#1072;&#1081;&#1083;&#1099; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; OCCT. &#1042; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1072; &#1086;&#1073;&#1098;&#1103;&#1089;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; <a href="../ru/Compiling.html" title="Compiling/ru">&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080;</a> &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1080;&#1079; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;: Linux, Windows &#1080; macOS.
</p><p><span id="Community_edition"></span>
</p>
<h2><span id=".D0.92.D0.B5.D1.80.D1.81.D0.B8.D1.8F_Community_edition"></span><span class="mw-headline" id="&#1042;&#1077;&#1088;&#1089;&#1080;&#1103;_Community_edition">&#1042;&#1077;&#1088;&#1089;&#1080;&#1103; Community edition</span></h2>
<p>&#1042; 2011 &#1075;&#1086;&#1076;&#1091; &#1073;&#1099;&#1083;&#1072; &#1074;&#1099;&#1087;&#1091;&#1097;&#1077;&#1085;&#1072; OpenCascade "community edition" (&#1074;&#1077;&#1088;&#1089;&#1080;&#1103; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1072;), &#1089;&#1086;&#1082;&#1088;&#1072;&#1097;&#1077;&#1085;&#1085;&#1086; OCE, &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1072;&#1103; &#1085;&#1072; &#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1080;&#1082;&#1072;&#1093; OpenCascade (OCCT) &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 6.5. &#1058;&#1077;&#1086;&#1088;&#1077;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1072; OCE &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100; &#1089;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1080;&#1084;&#1072; &#1089; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1077;&#1081; OCCT &#1087;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1091; &#1072;&#1089;&#1087;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1085;&#1086; &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1086;&#1085;&#1072; &#1080;&#1084;&#1077;&#1077;&#1090; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076;, &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1084;.
</p><p>&#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1085;&#1086; &#1074; 2017 &#1075;&#1086;&#1076;&#1091; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1101;&#1090;&#1086;&#1075;&#1086; &#1072;&#1083;&#1100;&#1090;&#1077;&#1088;&#1085;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086;&#1075;&#1086; &#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074;&#1072; &#1073;&#1099;&#1083;&#1072; &#1087;&#1088;&#1077;&#1082;&#1088;&#1072;&#1097;&#1077;&#1085;&#1072; &#1080;&#1079;-&#1079;&#1072; &#1080; &#1086;&#1090;&#1089;&#1090;&#1072;&#1074;&#1072;&#1085;&#1080;&#1103; &#1086;&#1090; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; &#1089; &#1090;&#1086;&#1095;&#1082;&#1080; &#1079;&#1088;&#1077;&#1085;&#1080;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1080; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1081; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082;. &#1055;&#1086; &#1101;&#1090;&#1086;&#1081; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1077;, &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1103; &#1089; FreeCAD &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 0.17, FreeCAD &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; OCCT, &#1072; OCE &#1073;&#1086;&#1083;&#1077;&#1077; &#1085;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103;.
</p><p>&#1042; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1089;&#1090;&#1072;&#1088;&#1099;&#1093; Linux &#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074;&#1072;&#1093; FreeCAD &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1089;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085; &#1087;&#1086;&#1076; OCE 0.18, &#1095;&#1090;&#1086; &#1101;&#1082;&#1074;&#1080;&#1074;&#1072;&#1083;&#1077;&#1085;&#1090;&#1085;&#1086; OCCT 6.9.x, &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1103; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1091;&#1078;&#1077; &#1073;&#1099;&#1083;&#1080; &#1088;&#1077;&#1096;&#1077;&#1085;&#1099; &#1074; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1093; &#1074;&#1099;&#1087;&#1091;&#1089;&#1082;&#1072;&#1093; OCCT 7.x. &#1045;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086; &#1090;&#1072;&#1082;, &#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1091;&#1081;&#1090;&#1077; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; OCE &#1080; &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1085;&#1077;&#1075;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; OCCT. &#1045;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1090;&#1086; &#1083;&#1091;&#1095;&#1096;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; <a href="../ru/AppImage.html" title="AppImage/ru">AppImage</a> &#1074;&#1077;&#1088;&#1089;&#1080;&#1102; FreeCAD, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1089;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1081; FreeCAD &#1089; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1077;&#1081; OCCT.
</p><p><span id="History"></span>
</p>
<h2><span id=".D0.98.D1.81.D1.82.D0.BE.D1.80.D0.B8.D1.8F_.D0.BF.D0.BE.D1.8F.D0.B2.D0.BB.D0.B5.D0.BD.D0.B8.D1.8F_OpenCascade"></span><span class="mw-headline" id="&#1048;&#1089;&#1090;&#1086;&#1088;&#1080;&#1103;_&#1087;&#1086;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;_OpenCascade">&#1048;&#1089;&#1090;&#1086;&#1088;&#1080;&#1103; &#1087;&#1086;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; OpenCascade</span></h2>
<p>&#1055;&#1077;&#1088;&#1074;&#1086;&#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1103;&#1076;&#1088;&#1072; Cas.CADE &#1073;&#1099;&#1083; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084;, &#1085;&#1086; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1085;&#1086; &#1074; 2000 &#1075;&#1086;&#1076;&#1091;, &#1086;&#1085; &#1089;&#1090;&#1072;&#1083; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084; &#1082;&#1086;&#1076;&#1086;&#1084; &#1087;&#1086;&#1076; &#1089;&#1074;&#1086;&#1080;&#1084; &#1085;&#1099;&#1085;&#1077;&#1096;&#1085;&#1080;&#1084; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084;. &#1042;&#1089;&#1082;&#1086;&#1088;&#1077; &#1087;&#1086;&#1089;&#1083;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1073;&#1099;&#1083; &#1079;&#1072;&#1087;&#1091;&#1097;&#1077;&#1085; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; FreeCAD, &#1087;&#1088;&#1080;&#1095;&#1077;&#1084; &#1089;&#1072;&#1084;&#1099;&#1077; &#1089;&#1090;&#1072;&#1088;&#1099;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; &#1076;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1099; &#1103;&#1085;&#1074;&#1072;&#1088;&#1077;&#1084; 2001 &#1075;&#1086;&#1076;&#1072;. &#1055;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1077;&#1077; &#1095;&#1080;&#1090;&#1072;&#1081;&#1090;&#1077; &#1074; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077; <a href="../ru/History.html" title="History/ru">&#1048;&#1089;&#1090;&#1086;&#1088;&#1080;&#1103;</a>.
</p><p>OpenCascade &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 6.6 &#1080; &#1073;&#1086;&#1083;&#1077;&#1077; &#1088;&#1072;&#1085;&#1085;&#1080;&#1093; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081; &#1088;&#1077;&#1075;&#1091;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1083;&#1089;&#1103; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1081; "OCCT public license", &#1095;&#1090;&#1086; &#1076;&#1077;&#1083;&#1072;&#1083;&#1086; &#1077;&#1075;&#1086; &#1085;&#1077; &#1089;&#1086;&#1074;&#1089;&#1077;&#1084; "&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1084; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1099;&#1084; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084;". &#1069;&#1090;&#1072; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1073;&#1099;&#1083;&#1072; &#1088;&#1077;&#1096;&#1077;&#1085;&#1072; &#1089; &#1074;&#1099;&#1087;&#1091;&#1089;&#1082;&#1086;&#1084; OCCT 6.7 (2013), &#1082;&#1086;&#1075;&#1076;&#1072; &#1073;&#1099;&#1083;&#1072; &#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1072; LGPL2 &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1103;.
</p><p><span id="OCCT_geometric_concepts"></span>
</p>
<h2><span id=".D0.91.D0.B0.D0.B7.D0.BE.D0.B2.D1.8B.D0.B5_.D0.B3.D0.B5.D0.BE.D0.BC.D0.B5.D1.82.D1.80.D0.B8.D1.87.D0.B5.D1.81.D0.BA.D0.B8.D0.B5_.D0.BF.D0.BE.D0.BD.D1.8F.D1.82.D0.B8.D1.8F_OCCT"></span><span class="mw-headline" id="&#1041;&#1072;&#1079;&#1086;&#1074;&#1099;&#1077;_&#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077;_&#1087;&#1086;&#1085;&#1103;&#1090;&#1080;&#1103;_OCCT">&#1041;&#1072;&#1079;&#1086;&#1074;&#1099;&#1077; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1087;&#1086;&#1085;&#1103;&#1090;&#1080;&#1103; OCCT</span></h2>
<p>&#1042; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1086;&#1083;&#1086;&#1075;&#1080;&#1080; OpenCascade &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1080;&#1084;&#1099; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1087;&#1088;&#1080;&#1084;&#1080;&#1090;&#1080;&#1074;&#1099; &#1080; &#1090;&#1086;&#1087;&#1086;&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1092;&#1086;&#1088;&#1084;&#1099;. &#1043;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084; &#1087;&#1088;&#1080;&#1084;&#1080;&#1090;&#1080;&#1074;&#1086;&#1084; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1090;&#1086;&#1095;&#1082;&#1072;, &#1083;&#1080;&#1085;&#1080;&#1103;, &#1086;&#1082;&#1088;&#1091;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;, &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1100; &#1080; &#1090;. &#1076;. &#1048;&#1083;&#1080; &#1076;&#1072;&#1078;&#1077; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1086;&#1083;&#1077;&#1077; &#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1077; &#1090;&#1080;&#1087;&#1099;, &#1090;&#1072;&#1082;&#1080;&#1077; &#1082;&#1072;&#1082; &#1082;&#1088;&#1080;&#1074;&#1072;&#1103; B-&#1089;&#1087;&#1083;&#1072;&#1081;&#1085;&#1072; &#1080;&#1083;&#1080; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1100;. &#1060;&#1080;&#1075;&#1091;&#1088;&#1086;&#1081; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074;&#1077;&#1088;&#1096;&#1080;&#1085;&#1072;, &#1088;&#1077;&#1073;&#1088;&#1086;, wire &#1082;&#1072;&#1088;&#1082;&#1072;&#1089;, &#1075;&#1088;&#1072;&#1085;&#1100;, &#1089;&#1087;&#1083;&#1086;&#1096;&#1085;&#1086;&#1077; &#1090;&#1077;&#1083;&#1086; &#1080;&#1083;&#1080; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1092;&#1080;&#1075;&#1091;&#1088;. &#1043;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1087;&#1088;&#1080;&#1084;&#1080;&#1090;&#1080;&#1074;&#1099; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1099; &#1085;&#1077; &#1076;&#1083;&#1103; &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1074; 3D-&#1089;&#1094;&#1077;&#1085;&#1077;, &#1072; &#1076;&#1083;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1103; &#1092;&#1080;&#1075;&#1091;&#1088;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1088;&#1077;&#1073;&#1088;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1086; &#1080;&#1079; &#1086;&#1090;&#1088;&#1077;&#1079;&#1082;&#1072; &#1080;&#1083;&#1080; &#1080;&#1079; &#1095;&#1072;&#1089;&#1090;&#1080; &#1086;&#1082;&#1088;&#1091;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080;.
</p><p>&#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1087;&#1088;&#1080;&#1084;&#1080;&#1090;&#1080;&#1074;&#1099; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; "&#1073;&#1077;&#1089;&#1092;&#1086;&#1088;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077;" &#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1073;&#1083;&#1086;&#1082;&#1080;, &#1074; &#1090;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1082;&#1072;&#1082; <a href="../ru/Part_TopoShape.html" title="Part TopoShape/ru">&#1090;&#1086;&#1087;&#1086;&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1092;&#1086;&#1088;&#1084;&#1099;</a> - &#1101;&#1090;&#1086; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;, &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1099;&#1077; &#1085;&#1072; &#1085;&#1080;&#1093;.
</p><p>&#1055;&#1086;&#1083;&#1085;&#1099;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1074;&#1089;&#1077;&#1093; &#1087;&#1088;&#1080;&#1084;&#1080;&#1090;&#1080;&#1074;&#1086;&#1074; &#1080; &#1092;&#1086;&#1088;&#1084; &#1089;&#1084;. &#1087;&#1086; &#1089;&#1089;&#1099;&#1083;&#1082;&#1077; <a rel="nofollow" class="external text" href="https://dev.opencascade.org/resources/documentation">&#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080; OCC</a> (&#1072;&#1083;&#1100;&#1090;&#1077;&#1088;&#1085;&#1072;&#1090;&#1080;&#1074;&#1085;&#1072;&#1103; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072;: sourcearchive.com ) &#1090;&#1072;&#1084; &#1078;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1087;&#1086;&#1080;&#1089;&#1082;  <b>Geom_*</b>  (&#1076;&#1083;&#1103; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1087;&#1088;&#1080;&#1084;&#1080;&#1090;&#1080;&#1074;&#1086;&#1074;) &#1080; <b>TopoDS_*</b> (&#1076;&#1083;&#1103; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1092;&#1086;&#1088;&#1084;). &#1058;&#1072;&#1084; &#1074;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1086; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1080;&#1103;&#1093; &#1084;&#1077;&#1078;&#1076;&#1091; &#1085;&#1080;&#1084;&#1080;. &#1055;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; OCC &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072; &#1074; &#1048;&#1085;&#1090;&#1077;&#1088;&#1085;&#1077;&#1090;&#1077; (&#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1100; &#1072;&#1088;&#1093;&#1080;&#1074;) &#1080; &#1074; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1084; &#1086;&#1085;&#1072; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1072; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1086;&#1074;, &#1072; &#1085;&#1077; &#1076;&#1083;&#1103; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1099;&#1093; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;. &#1053;&#1086;, &#1085;&#1072;&#1076;&#1077;&#1102;&#1089;&#1100;, &#1074;&#1099; &#1085;&#1072;&#1081;&#1076;&#1077;&#1090;&#1077; &#1079;&#1076;&#1077;&#1089;&#1100; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1085;&#1072;&#1095;&#1072;&#1090;&#1100; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091;. &#1058;&#1072;&#1082;&#1078;&#1077; &#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; <a rel="nofollow" class="external text" href="https://www.opencascade.com/doc/occt-7.0.0/overview/html/occt_user_guides__modeling_data.html">&#1056;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1087;&#1086; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1102; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;</a>.
</p>
<blockquote style="color: slategray"><p><i>    &#1053;&#1072; &#1086;&#1095;&#1077;&#1085;&#1100; &#1074;&#1099;&#1089;&#1086;&#1082;&#1086;&#1084; &#1091;&#1088;&#1086;&#1074;&#1085;&#1077; &#1090;&#1086;&#1087;&#1086;&#1083;&#1086;&#1075;&#1080;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;, &#1080;&#1079; &#1082;&#1072;&#1082;&#1080;&#1093; &#1095;&#1072;&#1089;&#1090;&#1077;&#1081; &#1089;&#1086;&#1089;&#1090;&#1086;&#1080;&#1090; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;, &#1080; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1089;&#1074;&#1103;&#1079;&#1080; &#1084;&#1077;&#1078;&#1076;&#1091; &#1085;&#1080;&#1084;&#1080;. &#1060;&#1080;&#1075;&#1091;&#1088;&#1072; &#1089;&#1086;&#1089;&#1090;&#1086;&#1080;&#1090; &#1080;&#1079; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1085;&#1072;&#1073;&#1086;&#1088;&#1072; &#1075;&#1088;&#1072;&#1085;&#1077;&#1081;. &#1043;&#1088;&#1072;&#1085;&#1100; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1072; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084; &#1085;&#1072;&#1073;&#1086;&#1088;&#1086;&#1084; &#1088;&#1077;&#1073;&#1077;&#1088;. &#1044;&#1074;&#1077; &#1075;&#1088;&#1072;&#1085;&#1080; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1089;&#1084;&#1077;&#1078;&#1085;&#1099;&#1084;&#1080;, &#1077;&#1089;&#1083;&#1080; &#1086;&#1085;&#1080; &#1080;&#1084;&#1077;&#1102;&#1090; &#1086;&#1073;&#1097;&#1077;&#1077; &#1088;&#1077;&#1073;&#1088;&#1086;.</i></p></blockquote>
<blockquote style="color: slategray"><p><i>&#1057;&#1072;&#1084;&#1072; &#1087;&#1086; &#1089;&#1077;&#1073;&#1077; &#1090;&#1086;&#1087;&#1086;&#1083;&#1086;&#1075;&#1080;&#1103; &#1085;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1072;&#1077;&#1090; &#1074;&#1072;&#1084; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;, &#1082;&#1088;&#1080;&#1074;&#1080;&#1079;&#1085;&#1091; &#1080;&#1083;&#1080; &#1090;&#1088;&#1077;&#1093;&#1084;&#1077;&#1088;&#1085;&#1086;&#1077; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1083;&#1102;&#1073;&#1086;&#1081; &#1080;&#1079; &#1101;&#1090;&#1080;&#1093; &#1095;&#1072;&#1089;&#1090;&#1077;&#1081;. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1082;&#1072;&#1078;&#1076;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; &#1090;&#1086;&#1087;&#1086;&#1083;&#1086;&#1075;&#1080;&#1080; &#1079;&#1085;&#1072;&#1077;&#1090; &#1086; &#1089;&#1074;&#1086;&#1077;&#1081; &#1073;&#1072;&#1079;&#1086;&#1074;&#1086;&#1081; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080;. &#1043;&#1088;&#1072;&#1085;&#1100; "&#1079;&#1085;&#1072;&#1077;&#1090;", &#1085;&#1072; &#1082;&#1072;&#1082;&#1086;&#1081; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1080; &#1086;&#1085;&#1086; &#1083;&#1077;&#1078;&#1080;&#1090;. &#1056;&#1077;&#1073;&#1088;&#1086; "&#1079;&#1085;&#1072;&#1077;&#1090;", &#1085;&#1072; &#1082;&#1072;&#1082;&#1086;&#1081; &#1082;&#1088;&#1080;&#1074;&#1086;&#1081; &#1086;&#1085;&#1086; &#1083;&#1077;&#1078;&#1080;&#1090;. &#1043;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1103; &#1079;&#1085;&#1072;&#1077;&#1090; &#1086; &#1082;&#1088;&#1080;&#1074;&#1080;&#1079;&#1085;&#1077; &#1080; &#1084;&#1077;&#1089;&#1090;&#1086;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1080; &#1074; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1077;.</i> - <a rel="nofollow" class="external text" href="https://www.opencascade.com/content/geometry-and-topology">&#1048;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076;</a></p></blockquote>
<hr>
<blockquote style="color: slategray"><p><i>&#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1090;&#1086;&#1087;&#1086;&#1083;&#1086;&#1075;&#1080;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1089;&#1074;&#1103;&#1079;&#1100; &#1084;&#1077;&#1078;&#1076;&#1091; &#1087;&#1088;&#1086;&#1089;&#1090;&#1099;&#1084;&#1080; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1099; &#1076;&#1088;&#1091;&#1075; &#1089; &#1076;&#1088;&#1091;&#1075;&#1086;&#1084; &#1076;&#1083;&#1103; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1093; &#1092;&#1086;&#1088;&#1084;.</i> - <a rel="nofollow" class="external text" href="https://www.opencascade.com/doc/occt-7.0.0/overview/html/occt_user_guides__modeling_data.html">&#1056;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1087;&#1086; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1102; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;</a></p></blockquote>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=ClassTopoDS_Shape_inherit_graph.png&amp;filetimestamp=20200503185906&amp;.html" class="mw-file-description"><img src="../File/ClassTopoDS_Shape_inherit_graph.png" decoding="async" width="324" height="329" class="mw-file-element" data-file-width="324" data-file-height="329"></a></span>
</p><p><b>Note:</b> &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; 3 &#1090;&#1080;&#1087;&#1072; &#1090;&#1086;&#1087;&#1086;&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1080;&#1084;&#1077;&#1102;&#1090; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &ndash; &#1074;&#1077;&#1088;&#1096;&#1080;&#1085;&#1072;, &#1088;&#1077;&#1073;&#1088;&#1086; &#1080; &#1075;&#1088;&#1072;&#1085;&#1100; (<a rel="nofollow" class="external text" href="https://opencascade.blogspot.com/2009/02/topology-and-geometry-in-open-cascade.html">&#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;</a>).
</p><p>&#1043;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1090;&#1080;&#1087;&#1099; &#1085;&#1072; &#1089;&#1072;&#1084;&#1086;&#1084; &#1076;&#1077;&#1083;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1085;&#1072; &#1076;&#1074;&#1077; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099;: &#1082;&#1088;&#1080;&#1074;&#1099;&#1077; &#1080; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1080;. &#1048;&#1079; &#1082;&#1088;&#1080;&#1074;&#1099;&#1093; (&#1086;&#1090;&#1088;&#1077;&#1079;&#1086;&#1082;, &#1086;&#1082;&#1088;&#1091;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;, ...) &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1087;&#1088;&#1103;&#1084;&#1091;&#1102; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1088;&#1077;&#1073;&#1088;&#1086;, &#1080;&#1079; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081; (&#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1100;, &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;, ...) &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1075;&#1088;&#1072;&#1085;&#1100;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1086;&#1090;&#1088;&#1077;&#1079;&#1086;&#1082;, &#1082;&#1072;&#1082; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1087;&#1088;&#1080;&#1084;&#1080;&#1090;&#1080;&#1074; &#1085;&#1077; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;, &#1090;.&#1082;. &#1086;&#1085; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074;&#1077;&#1082;&#1090;&#1086;&#1088;&#1086;&#1084; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; (&#1086;&#1089;&#1085;&#1086;&#1074;&#1099;) &#1080; &#1074;&#1077;&#1082;&#1090;&#1086;&#1088;&#1086;&#1084; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1074; &#1090;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1082;&#1072;&#1082; &#1077;&#1075;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1092;&#1086;&#1088;&#1084;&#1099; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1086; &#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1080; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;&#1081; &#1090;&#1086;&#1095;&#1082;&#1072;&#1084;&#1080;. &#1048; &#1082;&#1086;&#1088;&#1086;&#1073;&#1082;&#1072; - &#1090;&#1074;&#1077;&#1088;&#1076;&#1086;&#1077; &#1090;&#1077;&#1083;&#1086; - &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1072; &#1096;&#1077;&#1089;&#1090;&#1100;&#1102; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1103;&#1084;&#1080;.
</p><p>&#1054;&#1090; &#1088;&#1077;&#1073;&#1088;&#1072; &#1080;&#1083;&#1080; &#1075;&#1088;&#1072;&#1085;&#1080;, &#1074;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1089;&#1103; &#1082; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084; &#1087;&#1088;&#1080;&#1084;&#1080;&#1090;&#1080;&#1074;&#1072;&#1084; &#1080;&#1079; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1086;&#1085;&#1080; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;.
</p><p>&#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1080;&#1079; &#1092;&#1086;&#1088;&#1084; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1086;&#1095;&#1077;&#1085;&#1100; &#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1077; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080; &#1080;&#1083;&#1080; , &#1080;&#1083;&#1080; &#1085;&#1072;&#1086;&#1073;&#1086;&#1088;&#1086;&#1090;, &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1100; &#1074;&#1089;&#1077; &#1089;&#1091;&#1073;&#1092;&#1086;&#1088;&#1084;&#1099; &#1080;&#1079; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1086;&#1081; &#1089;&#1083;&#1086;&#1078;&#1085;&#1086;&#1081; &#1092;&#1086;&#1088;&#1084;&#1099;.
</p><p><span typeof="mw:File"><a href="../index.php?title=Part_TopoShape_relationships.svg&amp;filetimestamp=20191020053628&amp;.html" class="mw-file-description"><img src="../File/Part_TopoShape_relationships.svg" decoding="async" width="600" height="375" class="mw-file-element" data-file-width="664" data-file-height="415"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">&#1050;&#1083;&#1072;&#1089;&#1089; <code>Part::TopoShape</code> &#1101;&#1090;&#1086; &#1074;&#1080;&#1076;&#1080;&#1084;&#1099;&#1081; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085;&#1077; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;. &#1048;&#1079;&#1085;&#1091;&#1090;&#1088;&#1080; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1074;&#1089;&#1077; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090; <a href="../ru/Part_TopoShape.html" title="Part TopoShape/ru">&#1090;&#1086;&#1087;&#1086;&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1092;&#1086;&#1088;&#1084;&#1099; TopoShapes</a> &#1076;&#1083;&#1103; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1103; &#1080; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1088;&#1077;&#1073;&#1105;&#1088;, &#1075;&#1088;&#1072;&#1085;&#1077;&#1081; &#1080; &#1090;&#1074;&#1105;&#1088;&#1076;&#1099;&#1093; &#1090;&#1077;&#1083;.</p>
<p><span id="Related"></span>
</p>
<h2><span id=".D0.A1.D0.BE.D0.BF.D1.83.D1.82.D1.81.D1.82.D0.B2.D1.83.D1.8E.D1.89.D0.B0.D1.8F_.D0.B8.D0.BD.D1.84.D0.BE.D1.80.D0.BC.D0.B0.D1.86.D0.B8.D1.8F"></span><span class="mw-headline" id="&#1057;&#1086;&#1087;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1072;&#1103;_&#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;">&#1057;&#1086;&#1087;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;</span></h2>
<ul><li>OpenCASCADE Technology (OCCT) <a rel="nofollow" class="external text" href="http://www.opencascade.com">&#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1074;&#1077;&#1073; &#1089;&#1072;&#1081;&#1090;</a></li>
<li>OCCT <a rel="nofollow" class="external text" href="https://dev.opencascade.org/">&#1087;&#1086;&#1088;&#1090;&#1072;&#1083; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;</a></li>
<li>OCCT <a rel="nofollow" class="external text" href="https://www.opencascade.com/content/latest-release">&#1089;&#1074;&#1077;&#1078;&#1080;&#1081; &#1088;&#1077;&#1083;&#1080;&#1079;</a></li>
<li>OCCT <a rel="nofollow" class="external text" href="https://git.dev.opencascade.org/gitweb/?p=occt.git">git &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1081;</a></li>
<li>OpenCASCADE Community Edition (OCE) <a rel="nofollow" class="external text" href="https://github.com/tpaviot/oce">git &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1081;</a></li>
<li><a rel="nofollow" class="external text" href="http://en.wikipedia.org/wiki/Open_Cascade_Technology">Open Cascade Technology OCCT</a> &#1074; &#1042;&#1080;&#1082;&#1080;&#1087;&#1077;&#1076;&#1080;&#1080;</li>
<li>&#1043;&#1083;&#1086;&#1089;&#1089;&#1072;&#1088;&#1080;&#1081;, <a href="../Glossary.html#Open_CASCADE" title="Glossary">Open CASCADE</a></li>
<li>&#1041;&#1072;&#1075;&#1080; OCCT &#1074; FreeCAD &#1073;&#1072;&#1075;&#1090;&#1088;&#1077;&#1082;&#1077;&#1088;&#1077; <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?f=10&amp;t=20264">(thread)</a></li></ul>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><span typeof="mw:File"><a href="../index.php?title=Power_user_hub.png&amp;filetimestamp=20200511213015&amp;.html" class="mw-file-description"><img src="../File/Power_user_hub.png" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="128" data-file-height="128"></a></span> <a href="../ru/Power_users_hub.html" title="Power users hub/ru">Power user documentation</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b>FreeCAD scripting:</b> <a href="../ru/Python.html" title="Python/ru">Python</a>, <a href="../ru/Introduction_to_Python.html" title="Introduction to Python/ru">Introduction to Python</a>, <a href="../ru/Python_scripting_tutorial.html" title="Python scripting tutorial/ru">Python scripting tutorial</a>, <a href="../ru/FreeCAD_Scripting_Basics.html" title="FreeCAD Scripting Basics/ru">FreeCAD Scripting Basics</a></li></ul>
<hr>
<ul><li><b>Modules:</b> <a href="../ru/Builtin_modules.html" title="Builtin modules/ru">Builtin modules</a>, <a href="../ru/Units.html" title="Units/ru">Units</a>, <a href="../ru/Quantity.html" title="Quantity/ru">Quantity</a></li>
<li><b>Workbenches:</b> <a href="../ru/Workbench_creation.html" title="Workbench creation/ru">Workbench creation</a>, <a href="../ru/Gui_Command.html" title="Gui Command/ru">Gui Commands</a>, <a href="../ru/Command.html" title="Command/ru">Commands</a>, <a href="../ru/Installing_more_workbenches.html" title="Installing more workbenches/ru">Installing more workbenches</a></li>
<li><b>Meshes and Parts:</b> <a href="../ru/Mesh_Scripting.html" title="Mesh Scripting/ru">Mesh Scripting</a>, <a href="../ru/Topological_data_scripting.html" title="Topological data scripting/ru">Topological data scripting</a>, <a href="../ru/Mesh_to_Part.html" title="Mesh to Part/ru">Mesh to Part</a>, <a href="../ru/PythonOCC.html" title="PythonOCC/ru">PythonOCC</a></li></ul>
<hr>
<ul><li><b>Parametric objects:</b> <a href="../ru/Scripted_objects.html" title="Scripted objects/ru">Scripted objects</a>, <a href="../ru/Viewprovider.html" title="Viewprovider/ru">Viewproviders</a> <small>(<a href="../ru/Custom_icon_in_tree_view.html" title="Custom icon in tree view/ru">Custom icon in tree view</a>)</small></li>
<li><b>Scenegraph:</b> <a href="../ru/Scenegraph.html" title="Scenegraph/ru">Coin (Inventor) scenegraph</a>, <a href="../ru/Pivy.html" title="Pivy/ru">Pivy</a></li>
<li><b>Graphical interface:</b> <a href="../ru/Interface_creation.html" title="Interface creation/ru">Interface creation</a>, <a href="../ru/Dialog_creation.html" title="Dialog creation/ru">Interface creation completely in Python</a> <small>(<a href="../index.php?title=Dialog_creation_with_various_widgets/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation with various widgets/ru (page does not exist)">1</a>, <a href="../index.php?title=Dialog_creation_reading_and_writing_files/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation reading and writing files/ru (page does not exist)">2</a>, <a href="../index.php?title=Dialog_creation_setting_colors/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation setting colors/ru (page does not exist)">3</a>, <a href="../index.php?title=Dialog_creation_image_and_animated_GIF/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation image and animated GIF/ru (page does not exist)">4</a>, <a href="../index.php?title=PySide_usage_snippets/ru&amp;action=edit&amp;redlink=1.html" class="new" title="PySide usage snippets/ru (page does not exist)">5</a>)</small>, <a href="../ru/PySide.html" title="PySide/ru">PySide</a>, PySide examples <a href="../ru/PySide_Beginner_Examples.html" title="PySide Beginner Examples/ru">beginner</a>, <a href="../ru/PySide_Intermediate_Examples.html" title="PySide Intermediate Examples/ru">intermediate</a>, <a href="../ru/PySide_Advanced_Examples.html" title="PySide Advanced Examples/ru">advanced</a></li>
<li><b>Macros:</b> <a href="../ru/Macros.html" title="Macros/ru">Macros</a>, <a href="../ru/How_to_install_macros.html" title="How to install macros/ru">How to install macros</a></li>
<li><b>Embedding:</b> <a href="../ru/Embedding_FreeCAD.html" title="Embedding FreeCAD/ru">Embedding FreeCAD</a>, <a href="../ru/Embedding_FreeCADGui.html" title="Embedding FreeCADGui/ru">Embedding FreeCADGui</a></li></ul>
<hr>
<ul><li><b>Other:</b> <a href="../ru/Expressions.html" title="Expressions/ru">Expressions</a>, <a href="../ru/Code_snippets.html" title="Code snippets/ru">Code snippets</a>, <a href="../ru/Line_drawing_function.html" title="Line drawing function/ru">Line drawing function</a>, <a href="../ru/FreeCAD_vector_math_library.html" title="FreeCAD vector math library/ru">FreeCAD vector math library</a> <small>(deprecated)</small></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="../ru/User_hub.html" title="User hub/ru">User hub</a>, <a href="../ru/Power_users_hub.html" title="Power users hub/ru">Power users hub</a>, <a href="../ru/Developer_hub.html" title="Developer hub/ru">Developer hub</a></li></ul></div>
    </div></div>
<div style="clear:both"></div>
<!-- 
NewPP limit report
Cached time: 20251208084318
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.063 seconds
Real time usage: 0.090 seconds
Preprocessor visited node count: 136/1000000
Post&#8208;expand include size: 8927/2097152 bytes
Template argument size: 2860/2097152 bytes
Highest expansion depth: 6/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1737/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   23.176      1 -total
 45.81%   10.616      1 Template:Powerdocnavi/ru
 27.17%    6.297      2 Template:Caption
 15.02%    3.481      1 Template:Incode
 13.52%    3.133      1 Template:TOCright
 12.89%    2.987      1 Template:Navigation_menu_2
 10.57%    2.450      1 Template:Clear
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:235978-0!canonical and timestamp 20251208084318 and revision id 1658895. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>