<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Part Slice/ru</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="ru" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Part+Slice&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/Part_Slice.html" class="mw-pt-progress mw-pt-progress--high" title="Part Zerschneiden (97% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Part_Slice.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Part Slice (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../fr/Part_Slice.html" class="mw-pt-progress mw-pt-progress--high" title="Part S&eacute;parer en compos&eacute;s (97% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/Part_Slice.html" class="mw-pt-progress mw-pt-progress--high" title="Part: Affetta in composto (72% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Part_Slice.html" class="mw-pt-progress mw-pt-progress--high" title="Cz&#281;&#347;&#263;: Krojenie (97% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt-br/Part_Slice.html" class="mw-pt-progress mw-pt-progress--low" title="Fatiar (3% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../ro/Part_Slice.html" class="mw-pt-progress mw-pt-progress--med" title="Part: Slice (25% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--high" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</span></li></ul></div>
<div class="docnav">
    <div><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-left.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span> <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Part_SliceApart.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span> <a href="../ru/Part_SliceApart.html" title="Part SliceApart/ru">&#1056;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100; &#1085;&#1072; &#1095;&#1072;&#1089;&#1090;&#1080;</a></div>
    <div><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Part_XOR.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span> <a href="../ru/Part_XOR.html" title="Part XOR/ru">&#1041;&#1091;&#1083;&#1077;&#1074;&#1072; XOR</a>
 <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-right.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span></div>
    <div><a href="../ru/Part_Workbench.html" title="Part Workbench/ru">&#1044;&#1077;&#1090;&#1072;&#1083;&#1100;</a>
 <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Workbench_Part.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span></div>
</div>
<div class="mw-translate-fuzzy">
<table class="fcinfobox wikitable ct" width="100%" style="float: right; width: 230px; margin-left: 1em">
<tbody><tr>
<td class="ctTitle" style="font-weight: bold; font-size: 125%;">
<p><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Part_Slice.svg" decoding="async" width="32" height="32" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span><span> </span>&#1056;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100; &#1080; &#1089;&#1075;&#1088;&#1091;&#1087;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;
</p>
</td></tr>
<tr>
<th class="ctOdd">&#1056;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074; &#1084;&#1077;&#1085;&#1102;
</th></tr>
<tr>
<td class="ctEven">&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &rarr; &#1056;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &rarr; &#1053;&#1072;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1080;&#1090;&#1100;
</td></tr>
<tr>
<th class="ctOdd">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;
</th></tr>
<tr>
<td class="ctEven"><a href="../ru/Part_Workbench.html" title="Part Workbench/ru">Part</a>
</td></tr>
<tr>
<th class="ctOdd">&#1041;&#1099;&#1089;&#1090;&#1088;&#1099;&#1077; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080;
</th></tr>
<tr>
<td class="ctEven"><i>&#1053;&#1077;&#1090;</i>
</td></tr>
<tr>
<th class="ctOdd">&#1055;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1086; &#1074; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080;
</th></tr>
<tr>
<td class="ctEven">0.17
</td></tr>
<tr>
<th class="ctOdd">&#1057;&#1084;. &#1090;&#1072;&#1082;&#1078;&#1077;
</th></tr>
<tr>
<td class="ctEven"><a href="../ru/Part_BooleanFragments.html" title="Part BooleanFragments/ru">&#1041;&#1091;&#1083;&#1077;&#1074;&#1086; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077;</a>, <a href="../ru/Part_XOR.html" title="Part XOR/ru">&#1041;&#1091;&#1083;&#1077;&#1074;&#1072; XOR</a>, <a href="../ru/Part_Cut.html" title="Part Cut/ru">&#1054;&#1073;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100;</a>, <a href="../ru/Part_Boolean.html" title="Part Boolean/ru">&#1041;&#1091;&#1083;&#1077;&#1074;&#1099; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080;</a>
</td></tr>
<tr>
<td class="ctToc"><br><meta property="mw:PageProp/toc">
</td></tr></tbody></table>
</div>
<p><span id="Description"></span>
</p>
<h2><span id=".D0.9E.D0.BF.D0.B8.D1.81.D0.B0.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;">&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;</span></h2>
<div class="mw-translate-fuzzy">
<p>&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; <span typeof="mw:File"><a href="../index.php?title=Part_Slice.svg&amp;filetimestamp=20240712183709&amp;.html" class="mw-file-description"><img src="../File/Part_Slice.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a class="mw-selflink selflink">&#1053;&#1072;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100;</a>, &#1090;&#1072;&#1082;&#1078;&#1077; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1099;&#1081; &#1082;&#1072;&#1082; <b>&#1053;&#1072;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100; &#1080; &#1089;&#1075;&#1088;&#1091;&#1087;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;</b>, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1092;&#1080;&#1075;&#1091;&#1088; &#1087;&#1091;&#1090;&#1105;&#1084; &#1087;&#1077;&#1088;&#1077;&#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1089; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1084;&#1080;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1076;&#1083;&#1103; &#1082;&#1091;&#1073;&#1072; &#1080; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1105;&#1090;&#1089;&#1103; &#1075;&#1088;&#1091;&#1087;&#1087;&#1072; (&#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077;)&#1080;&#1079; &#1076;&#1074;&#1091;&#1093; &#1090;&#1074;&#1105;&#1088;&#1076;&#1099;&#1093; &#1090;&#1077;&#1083;.
</p>
</div>
<p><span typeof="mw:File"><a href="../index.php?title=Part_Slice_Demo.png&amp;filetimestamp=20160731095151&amp;.html" class="mw-file-description"><img src="../File/Part_Slice_Demo.png" decoding="async" width="600" height="252" class="mw-file-element" data-file-width="1169" data-file-height="491"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">&#1042;&#1074;&#1077;&#1088;&#1093;&#1091;: &#1095;&#1072;&#1089;&#1090;&#1080; &#1073;&#1099;&#1083;&#1080; &#1074;&#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1089;&#1090;&#1074;&#1080;&#1080; &#1088;&#1072;&#1079;&#1076;&#1074;&#1080;&#1085;&#1091;&#1090;&#1099; &#1074;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1088;&#1072;&#1079;&#1088;&#1077;&#1079;</p>
<div class="mw-translate-fuzzy">
<p>&#1057;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1076;&#1074;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1076;&#1083;&#1103; &#1085;&#1072;&#1088;&#1077;&#1079;&#1082;&#1080; &#1092;&#1080;&#1075;&#1091;&#1088;&#1099;: <span typeof="mw:File"><a href="../index.php?title=Part_SliceApart.svg&amp;filetimestamp=20240712183721&amp;.html" class="mw-file-description"><img src="../File/Part_SliceApart.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Part_SliceApart.html" title="Part SliceApart/ru">&#1056;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100; &#1085;&#1072; &#1095;&#1072;&#1089;&#1090;&#1080;</a> &#1080; <span typeof="mw:File"><a href="../index.php?title=Part_Slice.svg&amp;filetimestamp=20240712183709&amp;.html" class="mw-file-description"><img src="../File/Part_Slice.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a class="mw-selflink selflink">&#1056;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100; &#1080; &#1089;&#1075;&#1088;&#1091;&#1087;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;</a>. &#1054;&#1085;&#1080; &#1086;&#1073;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1102;&#1090; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1091;&#1102; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102; 'Slice (&#1056;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100;)', &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090; &#1085;&#1072;&#1088;&#1077;&#1079;&#1072;&#1085;&#1085;&#1099;&#1077; &#1095;&#1072;&#1089;&#1090;&#1080; &#1074; &#1075;&#1088;&#1091;&#1087;&#1087;&#1091; (&#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077;). &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; <span typeof="mw:File"><a href="../index.php?title=Part_SliceApart.svg&amp;filetimestamp=20240712183721&amp;.html" class="mw-file-description"><img src="../File/Part_SliceApart.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Part_SliceApart.html" title="Part SliceApart/ru">&#1056;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100; &#1085;&#1072; &#1095;&#1072;&#1089;&#1090;&#1080;</a> &#1088;&#1072;&#1079;&#1088;&#1091;&#1096;&#1072;&#1077;&#1090; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1086;&#1077; &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;. &laquo;&#1056;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100; &#1080; &#1089;&#1075;&#1088;&#1091;&#1087;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;&raquo; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1080; &#1085;&#1077; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; &#1087;&#1088;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1080; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1072; &#1095;&#1072;&#1089;&#1090;&#1077;&#1081;. &laquo;&#1056;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1085;&#1072; &#1095;&#1072;&#1089;&#1090;&#1080;&raquo; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1103;&#1090;&#1100; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1087;&#1088;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1080; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1072; &#1095;&#1072;&#1089;&#1090;&#1077;&#1081;.
</p>
</div>
<div class="mw-translate-fuzzy">
<p>&#1048;&#1090;&#1086;&#1075;&#1086;&#1074;&#1072;&#1103; &#1092;&#1080;&#1075;&#1091;&#1088;&#1072; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1090;&#1086;&#1090; &#1078;&#1077; &#1086;&#1073;&#1098;&#1105;&#1084;, &#1095;&#1090;&#1086; &#1080; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1072;&#1103;. &#1053;&#1086; &#1086;&#1085;&#1072; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1072; &#1074; &#1084;&#1077;&#1089;&#1090;&#1072;&#1093; &#1087;&#1077;&#1088;&#1077;&#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1089; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1084;&#1080;. &#1056;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1095;&#1072;&#1089;&#1090;&#1080; &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1075;&#1088;&#1091;&#1087;&#1087;&#1091; (&#1080;&#1083;&#1080; compsolid-&#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077;), &#1090;&#1072;&#1082; &#1095;&#1090;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1082;&#1072;&#1078;&#1077;&#1090;&#1089;&#1103; &#1077;&#1076;&#1080;&#1085;&#1099;&#1084; &#1094;&#1077;&#1083;&#1099;&#1084;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1095;&#1072;&#1089;&#1090;&#1080;, &#1085;&#1091;&#1078;&#1085;&#1086; &#1088;&#1072;&#1079;&#1088;&#1091;&#1096;&#1080;&#1090;&#1100; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084; &#1095;&#1072;&#1089;&#1090;&#1103;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1086;&#1084;, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; <span typeof="mw:File"><a href="../index.php?title=Part_CompoundFilter.svg&amp;filetimestamp=20240712183337&amp;.html" class="mw-file-description"><img src="../File/Part_CompoundFilter.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Part_CompoundFilter.html" title="Part CompoundFilter/ru">&#1060;&#1080;&#1083;&#1100;&#1090;&#1088; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074;</a> &#1076;&#1083;&#1103; &#1101;&#1090;&#1086;&#1081; &#1094;&#1077;&#1083;&#1080;. &#1044;&#1083;&#1103; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;&#1075;&#1086; &#1085;&#1077;&#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; <span typeof="mw:File"><a href="../index.php?title=Draft_Downgrade.svg&amp;filetimestamp=20210319101401&amp;.html" class="mw-file-description"><img src="../File/Draft_Downgrade.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../Draft_Downgrade.html" title="Draft Downgrade">Draft &#1044;&#1072;&#1091;&#1085;&#1075;&#1088;&#1077;&#1081;&#1076;</a>.
</p>
</div>
<p>&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1080;&#1084;&#1077;&#1077;&#1090; &#1090;&#1088;&#1080; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072;: "Standard-&#1057;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1081;", "Split-&#1056;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100;" &#1080; "CompSolid-&#1043;&#1088;&#1091;&#1087;&#1087;&#1072;". &#1060;&#1086;&#1088;&#1084;&#1072; &#1074;&#1099;&#1073;&#1086;&#1088;&#1072; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090;, &#1086;&#1085;&#1080; &#1087;&#1088;&#1077;&#1076;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1099;, &#1085;&#1086; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099; &#1087;&#1086;&#1089;&#1083;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1085;&#1072; &#1091;&#1088;&#1086;&#1074;&#1085;&#1077; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1080;&#1088;&#1091;&#1102;&#1097;&#1080;&#1093; &#1089;&#1088;&#1077;&#1079;&#1086;&#1074;.
</p><p>&laquo;Standard&raquo; &#1080; &laquo;Split&raquo; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077;&#1084; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &#1085;&#1072; &#1088;&#1105;&#1073;&#1088;&#1072;, &#1086;&#1073;&#1086;&#1083;&#1086;&#1095;&#1082;&#1080; &#1080; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1085;&#1099;&#1077; &#1090;&#1077;&#1083;&#1072;: &#1077;&#1089;&#1083;&#1080; &laquo;Split&raquo;, &#1086;&#1085;&#1080; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103;; &#1077;&#1089;&#1083;&#1080; &laquo;Standard&raquo;, &#1086;&#1085;&#1080; &#1086;&#1089;&#1090;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074;&#1084;&#1077;&#1089;&#1090;&#1077; (&#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1102;&#1090; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1099;).
</p><p>&#1057;&#1086;&#1089;&#1090;&#1072;&#1074;&#1085;&#1072;&#1103; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072;&#1093; &laquo;Standard&raquo; &#1080; &laquo;Split&raquo; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1079;&#1072; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1086;&#1081; &#1088;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1077;&#1084;&#1086;&#1081; &#1092;&#1086;&#1088;&#1084;&#1099;. 
</p><p>&#1042; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; &laquo;CompSolid&raquo; &#1085;&#1072; &#1074;&#1099;&#1093;&#1086;&#1076;&#1077; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1105;&#1085;&#1085;&#1086;&#1077; &#1090;&#1074;&#1105;&#1088;&#1076;&#1086;&#1077; &#1090;&#1077;&#1083;&#1086; (&#1080;&#1083;&#1080; &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099; &#1090;&#1077;&#1083;, &#1077;&#1089;&#1083;&#1080; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1099;&#1077; &#1090;&#1074;&#1105;&#1088;&#1076;&#1099;&#1077; &#1090;&#1077;&#1083;&#1072; &#1086;&#1073;&#1088;&#1072;&#1079;&#1091;&#1102;&#1090; &#1073;&#1086;&#1083;&#1077;&#1077; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1091;&#1095;&#1072;&#1089;&#1090;&#1082;&#1072; &#1089;&#1084;&#1077;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080;). Compsolid - &#1101;&#1090;&#1086; &#1085;&#1072;&#1073;&#1086;&#1088; &#1090;&#1077;&#1083;, &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1085;&#1099;&#1093; &#1075;&#1088;&#1072;&#1085;&#1103;&#1084;&#1080;; &#1086;&#1085;&#1080; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1099; &#1089; &#1090;&#1074;&#1105;&#1088;&#1076;&#1099;&#1084;&#1080; &#1090;&#1077;&#1083;&#1072;&#1084;&#1080;, &#1082;&#1072;&#1082; &#1082;&#1088;&#1080;&#1074;&#1099;&#1077; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1099; &#1089; &#1088;&#1105;&#1073;&#1088;&#1072;&#1084;&#1080;, &#1072; &#1086;&#1073;&#1086;&#1083;&#1086;&#1095;&#1082;&#1080; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1099; &#1089; &#1075;&#1088;&#1072;&#1085;&#1103;&#1084;&#1080;; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;, &#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;, &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1086;&#1082;&#1088;&#1072;&#1097;&#1105;&#1085;&#1085;&#1099;&#1084; &#1089;&#1083;&#1086;&#1074;&#1086;&#1089;&#1086;&#1095;&#1077;&#1090;&#1072;&#1085;&#1080;&#1077;&#1084; &laquo;&#1082;&#1086;&#1084;&#1087;&#1086;&#1079;&#1080;&#1090;&#1085;&#1086;&#1077; &#1090;&#1074;&#1105;&#1088;&#1076;&#1086;&#1077; &#1090;&#1077;&#1083;&#1086;&raquo;.
</p><p>&#1054;&#1073;&#1097;&#1077;&#1077; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &#1086;&#1095;&#1077;&#1085;&#1100; &#1087;&#1086;&#1093;&#1086;&#1078;&#1077; &#1085;&#1072; <span typeof="mw:File"><a href="../index.php?title=Part_BooleanFragments.svg&amp;filetimestamp=20240712183152&amp;.html" class="mw-file-description"><img src="../File/Part_BooleanFragments.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Part_BooleanFragments.html" title="Part BooleanFragments/ru">&#1041;&#1091;&#1083;&#1077;&#1074;&#1086; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077;</a>, &#1079;&#1072; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1074; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1087;&#1086;&#1087;&#1072;&#1076;&#1072;&#1102;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1095;&#1072;&#1089;&#1090;&#1080; &#1086;&#1090; &#1087;&#1077;&#1088;&#1074;&#1086;&#1081; &#1092;&#1080;&#1075;&#1091;&#1088;&#1099;.
</p><p><span id="Usage"></span>
</p>
<h2><span id=".D0.9F.D1.80.D0.B8.D0.BC.D0.B5.D0.BD.D0.B5.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1055;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;">&#1055;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;</span></h2>
<div class="mw-translate-fuzzy">
<ol><li>&#1057;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1085;&#1080;&#1103;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1088;&#1077;&#1079;&#1072;&#1090;&#1100;. <br> &#1055;&#1086;&#1088;&#1103;&#1076;&#1086;&#1082; &#1074;&#1099;&#1073;&#1086;&#1088;&#1072; &#1074;&#1072;&#1078;&#1077;&#1085;. &#1043;&#1088;&#1091;&#1087;&#1087;&#1099; &#1089; &#1089;&#1072;&#1084;&#1086;&#1087;&#1077;&#1088;&#1077;&#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080; &#1085;&#1077; &#1076;&#1086;&#1087;&#1091;&#1089;&#1082;&#1072;&#1102;&#1090;&#1089;&#1103; (&#1089;&#1072;&#1084;&#1086;&#1087;&#1077;&#1088;&#1077;&#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1080;&#1085;&#1086;&#1075;&#1076;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1095;&#1077;&#1089;&#1090;&#1100;, &#1087;&#1088;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1074; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; &#1095;&#1077;&#1088;&#1077;&#1079; <span typeof="mw:File"><a href="../index.php?title=Part_BooleanFragments.svg&amp;filetimestamp=20240712183152&amp;.html" class="mw-file-description"><img src="../File/Part_BooleanFragments.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Part_BooleanFragments.html" title="Part BooleanFragments/ru">&#1041;&#1091;&#1083;&#1077;&#1074;&#1086; &#1056;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077;</a>)</li>
<li>&#1042;&#1099;&#1079;&#1086;&#1074;&#1080;&#1090;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1091; &#1056;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100; &#1080; &#1089;&#1075;&#1088;&#1091;&#1087;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1086;&#1076;&#1085;&#1080;&#1084; &#1080;&#1079; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1086;&#1074;:
<ul><li>&#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091;  <span typeof="mw:File"><a href="../index.php?title=Part_Slice.svg&amp;filetimestamp=20240712183709&amp;.html" class="mw-file-description"><img src="../File/Part_Slice.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a class="mw-selflink selflink">&#1053;&#1072;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100;</a> &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; Part</li>
<li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1087;&#1091;&#1085;&#1082;&#1090; &#1074; &#1084;&#1077;&#1085;&#1102; <b>&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &rarr; &#1056;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &rarr; &#1053;&#1072;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100; &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1080;&#1090;&#1100;</b></li></ul></li></ol>
</div>
<h3><span class="mw-headline" id="Tree_structure_of_Slice">Tree structure of Slice</span></h3>
<div class="mw-translate-fuzzy">
<h3><span id=".D0.94.D0.B5.D1.80.D0.B5.D0.B2.D0.BE_.D1.81.D1.82.D1.80.D1.83.D0.BA.D1.82.D1.83.D1.80.D0.B0_Slice"></span><span class="mw-headline" id="&#1044;&#1077;&#1088;&#1077;&#1074;&#1086;_&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072;_Slice">&#1044;&#1077;&#1088;&#1077;&#1074;&#1086; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; Slice</span></h3>
<p>&#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1056;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100; &#1080; &#1089;&#1075;&#1088;&#1091;&#1087;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1086;&#1079;&#1076;&#1072;&#1105;&#1090; &#1088;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1085;&#1085;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;. &#1042; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; &#1082;&#1091;&#1073; &#1088;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1077;&#1090;&#1089;&#1103; &#1075;&#1088;&#1072;&#1085;&#1100;&#1102;.
</p>
</div>
<p>&#1057;&#1086;&#1079;&#1076;&#1072;&#1105;&#1090;&#1089;&#1103; &#1085;&#1085;&#1072;&#1088;&#1077;&#1079;&#1082;&#1072;, &#1080; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1077;&#1105; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090; &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074; &#1075;&#1088;&#1091;&#1087;&#1087;&#1091;.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Part_SliceTree.png&amp;filetimestamp=20190308094826&amp;.html" class="mw-file-description"><img src="../File/Part_SliceTree.png" decoding="async" width="735" height="291" class="mw-file-element" data-file-width="735" data-file-height="291"></a></span>
</p><p><span id="Properties"></span>
</p>
<h2><span id=".D0.A1.D0.B2.D0.BE.D0.B9.D1.81.D1.82.D0.B2.D0.B0"></span><span class="mw-headline" id="&#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;">&#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;</span></h2>
<p><span style="color: #fdfdfd; background-color: #909090; font-size: 112%; font-weight: bold; margin-bottom: .3em; padding: 0px 10px 1px 10px; page-break-after: avoid;">Slice</span>
</p>
<div class="mw-translate-fuzzy">
<p><span style="color: #fdfdfd; background-color: #909090; font-size: 112%; font-weight: bold; margin-bottom: .3em; padding: 0px 10px 1px 10px; page-break-after: avoid;">&#1056;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100;</span>
</p>
<ul><li><span style="font-size:60%; padding-right:0.8em;">&#1044;&#1072;&#1085;&#1085;&#1099;&#1077;</span><b>&#1041;&#1072;&#1079;&#1072;</b>: &#1056;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1077;&#1084;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;.</li>
<li><span style="font-size:60%; padding-right:0.8em;">&#1044;&#1072;&#1085;&#1085;&#1099;&#1077;</span><b>Tools-&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;</b>: &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1088;&#1077;&#1078;&#1091;&#1097;&#1080;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;. (&#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1103; &#1089; FreeCAD v0.17.8053, &#1101;&#1090;&#1086; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; &#1085;&#1077; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; &#1080; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1095;&#1077;&#1088;&#1077;&#1079; Python).</li>
<li><span style="font-size:60%; padding-right:0.8em;">&#1044;&#1072;&#1085;&#1085;&#1099;&#1077;</span><b>Mode-&#1056;&#1077;&#1078;&#1080;&#1084;</b>: &laquo;Standard (&#1057;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;)&raquo;, &laquo;Split (&#1056;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100;)&raquo; &#1080;&#1083;&#1080; &laquo;CompSolid (&#1043;&#1088;&#1091;&#1087;&#1087;&#1072;)&raquo;. &#1056;&#1077;&#1078;&#1080;&#1084; "&#1056;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100;" &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;. &#1057;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1081; &#1080; &#1056;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100;&#1086;&#1090;&#1083;&#1080;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077;&#1084; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &#1085;&#1072; &#1074;&#1086;&#1079;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1091;&#1077;&#1084;&#1099;&#1077; &#1092;&#1080;&#1075;&#1091;&#1088;&#1099;: &#1077;&#1089;&#1083;&#1080; &#1088;&#1077;&#1078;&#1080;&#1084; &#1056;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100;, &#1090;&#1086; &#1086;&#1085;&#1080; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103;; &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1086;&#1085;&#1080; &#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1089;&#1103; &#1074;&#1084;&#1077;&#1089;&#1090;&#1077; (&#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1099;).</li>
<li><span style="font-size:60%; padding-right:0.8em;">&#1044;&#1072;&#1085;&#1085;&#1099;&#1077;</span><b>Tolerance (&#1058;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;)</b>: &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; "&#1085;&#1077;&#1095;&#1105;&#1090;&#1082;&#1086;&#1089;&#1090;&#1080;". &#1069;&#1090;&#1086; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1076;&#1086;&#1087;&#1091;&#1089;&#1082;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1087;&#1086;&#1080;&#1089;&#1082;&#1077; &#1087;&#1077;&#1088;&#1077;&#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1081; &#1074; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1080; &#1082; &#1076;&#1086;&#1087;&#1091;&#1089;&#1082;&#1072;&#1084;, &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1105;&#1085;&#1085;&#1099;&#1084; &#1074;&#1086; &#1074;&#1093;&#1086;&#1076;&#1085;&#1099;&#1093; &#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1093;.</li></ul>
</div>
<p><span id="Example"></span>
</p>
<h2><span id=".D0.9F.D1.80.D0.B8.D0.BC.D0.B5.D1.80"></span><span class="mw-headline" id="&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;">&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;</span></h2>
<p><span id="Creating_a_Puzzle"></span>
</p>
<h3><span id=".D0.A1.D0.BE.D0.B7.D0.B4.D0.B0.D0.BD.D0.B8.D0.B5_.D0.BC.D0.BE.D0.B7.D0.B0.D0.B9.D0.BA.D0.B8-.D0.BF.D0.B0.D0.B7.D0.BB.D0.B0"></span><span class="mw-headline" id="&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077;_&#1084;&#1086;&#1079;&#1072;&#1081;&#1082;&#1080;-&#1087;&#1072;&#1079;&#1083;&#1072;">&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1084;&#1086;&#1079;&#1072;&#1081;&#1082;&#1080;-&#1087;&#1072;&#1079;&#1083;&#1072;</span></h3>
<ol><li>&#1055;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1089;&#1100; &#1085;&#1072; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; <span typeof="mw:File"><a href="../index.php?title=Workbench_Sketcher.svg&amp;filetimestamp=20231231194727&amp;.html" class="mw-file-description"><img src="../File/Workbench_Sketcher.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Sketcher_Workbench.html" title="Sketcher Workbench/ru">Sketcher (&#1069;&#1089;&#1082;&#1080;&#1079;&#1099;)</a>
<ul><li>&#1057;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1085;&#1086;&#1074;&#1099;&#1081; &#1101;&#1089;&#1082;&#1080;&#1079;.</li>
<li>&#1053;&#1072;&#1088;&#1080;&#1089;&#1091;&#1081;&#1090;&#1077; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1080;&#1090; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1077; &#1075;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1084;&#1086;&#1079;&#1072;&#1081;&#1082;&#1080;.</li>
<li>&#1047;&#1072;&#1082;&#1088;&#1086;&#1081;&#1090;&#1077; &#1101;&#1089;&#1082;&#1080;&#1079;.<br><span typeof="mw:File"><a href="../index.php?title=Slice_example_step1.png&amp;filetimestamp=20160731095225&amp;.html" class="mw-file-description"><img src="../File/Slice_example_step1.png" decoding="async" width="320" height="239" class="mw-file-element" data-file-width="784" data-file-height="586"></a></span></li></ul></li>
<li>&#1055;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1089;&#1100; &#1085;&#1072; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; <span typeof="mw:File"><a href="../index.php?title=Workbench_Part.svg&amp;filetimestamp=20240712190040&amp;.html" class="mw-file-description"><img src="../File/Workbench_Part.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Part_Workbench.html" title="Part Workbench/ru">Part (&#1044;&#1077;&#1090;&#1072;&#1083;&#1100;)</a>.
<ul><li>&#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1101;&#1089;&#1082;&#1080;&#1079; &#1080; &#1074; &#1084;&#1077;&#1085;&#1102; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077;<b>&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &rarr; &#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1075;&#1088;&#1072;&#1085;&#1100; &#1080;&#1079; &#1083;&#1086;&#1084;&#1072;&#1085;&#1085;&#1099;&#1093;</b>.<br><span typeof="mw:File"><a href="../index.php?title=Slice_example_step2.png&amp;filetimestamp=20160731095238&amp;.html" class="mw-file-description"><img src="../File/Slice_example_step2.png" decoding="async" width="320" height="239" class="mw-file-element" data-file-width="784" data-file-height="586"></a></span></li></ul></li>
<li>&#1055;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1089;&#1100; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086; &#1085;&#1072; &#1074;&#1077;&#1088;&#1089;&#1082;&#1072;&#1082; <span typeof="mw:File"><a href="../index.php?title=Workbench_Sketcher.svg&amp;filetimestamp=20231231194727&amp;.html" class="mw-file-description"><img src="../File/Workbench_Sketcher.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Sketcher_Workbench.html" title="Sketcher Workbench/ru">&#1069;&#1089;&#1082;&#1080;&#1079;&#1099;</a>
<ul><li>&#1057;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1077;&#1097;&#1105; &#1086;&#1076;&#1080;&#1085; &#1101;&#1089;&#1082;&#1080;&#1079; &#1074; &#1090;&#1086;&#1081; &#1078;&#1077; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080;.</li>
<li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1087;&#1086;&#1083;&#1080;&#1083;&#1080;&#1085;&#1080;&#1080;, &#1085;&#1072;&#1088;&#1080;&#1089;&#1091;&#1081;&#1090;&#1077; &#1083;&#1080;&#1085;&#1080;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1103;&#1090; &#1084;&#1086;&#1079;&#1072;&#1081;&#1082;&#1091; &#1085;&#1072; &#1095;&#1072;&#1089;&#1090;&#1080;.<br><span typeof="mw:File"><a href="../index.php?title=Slice_example_step3.png&amp;filetimestamp=20160731095251&amp;.html" class="mw-file-description"><img src="../File/Slice_example_step3.png" decoding="async" width="320" height="239" class="mw-file-element" data-file-width="784" data-file-height="586"></a></span></li></ul></li>
<li>&#1042;&#1077;&#1088;&#1085;&#1080;&#1090;&#1077;&#1089;&#1100; &#1085;&#1072; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; <span typeof="mw:File"><a href="../index.php?title=Workbench_Part.svg&amp;filetimestamp=20240712190040&amp;.html" class="mw-file-description"><img src="../File/Workbench_Part.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Part_Workbench.html" title="Part Workbench/ru">&#1044;&#1077;&#1090;&#1072;&#1083;&#1100;</a>.
<ul><li>&#1042;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077; &#1101;&#1089;&#1082;&#1080;&#1079; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077;&#1083;&#1103; &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; <span typeof="mw:File"><a href="../index.php?title=Part_BooleanFragments.svg&amp;filetimestamp=20240712183152&amp;.html" class="mw-file-description"><img src="../File/Part_BooleanFragments.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Part_BooleanFragments.html" title="Part BooleanFragments/ru">&#1041;&#1091;&#1083;&#1077;&#1074;&#1086; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077;</a>. &#1069;&#1090;&#1086; &#1074;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090; &#1074;&#1077;&#1088;&#1096;&#1080;&#1085;&#1099; &#1074; &#1084;&#1077;&#1089;&#1090;&#1072; &#1087;&#1077;&#1088;&#1077;&#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1083;&#1080;&#1085;&#1080;&#1081; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077;&#1083;&#1103;. &#1048;&#1093; &#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1077; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1076;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1085;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1101;&#1090;&#1072;&#1087;&#1077;.<br><span typeof="mw:File"><a href="../index.php?title=Slice_example_step4.png&amp;filetimestamp=20160731095310&amp;.html" class="mw-file-description"><img src="../File/Slice_example_step4.png" decoding="async" width="320" height="239" class="mw-file-element" data-file-width="784" data-file-height="586"></a></span></li></ul></li>
<li>&#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1088;&#1072;&#1085;&#1077;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1091;&#1102; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1091;&#1102; &#1075;&#1088;&#1072;&#1085;&#1100; &#1080; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1086;&#1077; BooleanFragments (&#1041;&#1091;&#1083;&#1077;&#1074;&#1086; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077;) &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077;&#1083;&#1103; &#1080; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102; <span typeof="mw:File"><a href="../index.php?title=Part_Slice.svg&amp;filetimestamp=20240712183709&amp;.html" class="mw-file-description"><img src="../File/Part_Slice.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> &#1056;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100; &#1080; &#1089;&#1075;&#1088;&#1091;&#1087;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;.<br><span typeof="mw:File"><a href="../index.php?title=Slice_example_step5.png&amp;filetimestamp=20160731095328&amp;.html" class="mw-file-description"><img src="../File/Slice_example_step5.png" decoding="async" width="320" height="239" class="mw-file-element" data-file-width="784" data-file-height="586"></a></span></li>
<li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1091; <span typeof="mw:File"><a href="../index.php?title=Part_ExplodeCompound.svg&amp;filetimestamp=20190304152129&amp;.html" class="mw-file-description"><img src="../File/Part_ExplodeCompound.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Part_ExplodeCompound.html" title="Part ExplodeCompound/ru">&#1056;&#1072;&#1079;&#1075;&#1088;&#1091;&#1087;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077;</a> &#1082; &#1088;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1085;&#1085;&#1086;&#1081; &#1075;&#1088;&#1072;&#1085;&#1080;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1088;&#1072;&#1079;&#1073;&#1080;&#1090;&#1100; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1086;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1077;&#1081; &#1056;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100;, &#1085;&#1072; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1095;&#1072;&#1089;&#1090;&#1080;.</li></ol>
<p><b>&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;:</b> &#1064;&#1072;&#1075;&#1080; 5 &#1080; 6 &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1086;&#1076;&#1085;&#1080;&#1084; &#1097;&#1077;&#1083;&#1095;&#1082;&#1086;&#1084; &#1084;&#1099;&#1096;&#1080;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; <span typeof="mw:File"><a href="../index.php?title=Part_SliceApart.svg&amp;filetimestamp=20240712183721&amp;.html" class="mw-file-description"><img src="../File/Part_SliceApart.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Part_SliceApart.html" title="Part SliceApart/ru">&#1056;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100; &#1085;&#1072; &#1095;&#1072;&#1089;&#1090;&#1080;</a>
</p><p><span id="Notes"></span>
</p>
<h2><span id=".D0.9F.D1.80.D0.B8.D0.BC.D0.B5.D1.87.D0.B0.D0.BD.D0.B8.D1.8F"></span><span class="mw-headline" id="&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1103;">&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1103;</span></h2>
<div class="mw-translate-fuzzy">
<ul><li>&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1073;&#1099;&#1083; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085; &#1074; FreeCAD v0.17.8053. FreeCAD &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1089;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089; OCC 6.9.0 &#1080;&#1083;&#1080; &#1085;&#1086;&#1074;&#1077;&#1077;; &#1080;&#1085;&#1072;&#1095;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1073;&#1091;&#1076;&#1077;&#1090; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085;.</li>
<li>&#776;&#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099; &#1085;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1077;&#1084; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1077; &#1089;&#1088;&#1077;&#1079;&#1086;&#1074;, &#1072; &#1085;&#1077; &#1085;&#1072; &#1091;&#1088;&#1086;&#1074;&#1085;&#1077; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1072;.</li>
<li>&#1053;&#1072;&#1088;&#1077;&#1079;&#1072;&#1102;&#1097;&#1080;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1103;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1085;&#1091;&#1078;&#1085;&#1086; &#1085;&#1072;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100;. &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1082;&#1091;&#1073; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1088;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1085; &#1082;&#1088;&#1080;&#1074;&#1086;&#1081;, &#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1088;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1085;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1075;&#1088;&#1072;&#1085;&#1100;&#1102;, &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1086;&#1081; &#1080;&#1079; &#1074;&#1099;&#1076;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1082;&#1088;&#1080;&#1074;&#1086;&#1081;.</li>
<li>&#1053;&#1072;&#1088;&#1077;&#1079;&#1072;&#1085;&#1085;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1087;&#1088;&#1086;&#1081;&#1090;&#1080; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1091; BOP. &#1057;&#1084;. <span typeof="mw:File"><a href="../index.php?title=Part_CheckGeometry.svg&amp;filetimestamp=20240712183246&amp;.html" class="mw-file-description"><img src="../File/Part_CheckGeometry.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Part_CheckGeometry.html" title="Part CheckGeometry/ru">&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1072; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080;</a>.</li></ul>
</div>
<p><span id="Scripting"></span>
</p>
<h2><span id=".D0.9D.D0.B0.D0.BF.D0.B8.D1.81.D0.B0.D0.BD.D0.B8.D0.B5_.D1.81.D0.BA.D1.80.D0.B8.D0.BF.D1.82.D0.BE.D0.B2"></span><span class="mw-headline" id="&#1053;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;_&#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1074;">&#1053;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1074;</span></h2>
<div class="mw-translate-fuzzy">
<p>&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; <a href="../ru/Macros.html" title="Macros/ru">&#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1072;&#1093;</a> &#1080; &#1080;&#1079; &#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1080; <a href="../ru/Python.html" title="Python/ru">Python</a> &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1081; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;:
</p>
</div>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">BOPTools</span><span class="o">.</span><span class="n">SplitFeatures</span><span class="o">.</span><span class="n">makeSlice</span><span class="p">(</span><span class="n">name</span><span class="p">)</span>
</pre></div>
<ul><li>&#1057;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1087;&#1091;&#1089;&#1090;&#1091;&#1102; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102; Slice. &#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; 'Base' &#1080; 'Tools' &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1099; &#1074;&#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1089;&#1090;&#1074;&#1080;&#1080; &#1103;&#1074;&#1085;&#1086;.</li>
<li>&#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1074;&#1085;&#1086;&#1074;&#1100; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;.</li></ul>
<p>Slice &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; &#1082; &#1087;&#1088;&#1086;&#1089;&#1090;&#1099;&#1084; &#1092;&#1086;&#1088;&#1084;&#1072;&#1084;, &#1073;&#1077;&#1079; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;, &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102;:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">BOPTools</span><span class="o">.</span><span class="n">SplitAPI</span><span class="o">.</span><span class="n">slice</span><span class="p">(</span><span class="n">base_shape</span><span class="p">,</span> <span class="n">tool_shapes</span><span class="p">,</span> <span class="n">mode</span><span class="p">,</span> <span class="n">tolerance</span> <span class="o">=</span> <span class="mf">0.0</span><span class="p">)</span>
</pre></div>
<p>&#1069;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1093; &#1089;&#1094;&#1077;&#1085;&#1072;&#1088;&#1085;&#1099;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1085;&#1072; Python.
</p><p>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="kn">import</span> <span class="nn">BOPTools.SplitFeatures</span>
<span class="n">j</span> <span class="o">=</span> <span class="n">BOPTools</span><span class="o">.</span><span class="n">SplitFeatures</span><span class="o">.</span><span class="n">makeSlice</span><span class="p">(</span><span class="n">name</span><span class="o">=</span> <span class="s1">'Slice'</span><span class="p">)</span>
<span class="n">j</span><span class="o">.</span><span class="n">Base</span> <span class="o">=</span> <span class="n">FreeCADGui</span><span class="o">.</span><span class="n">Selection</span><span class="o">.</span><span class="n">getSelection</span><span class="p">()[</span><span class="mi">0</span><span class="p">]</span>
<span class="n">j</span><span class="o">.</span><span class="n">Tools</span> <span class="o">=</span> <span class="n">FreeCADGui</span><span class="o">.</span><span class="n">Selection</span><span class="o">.</span><span class="n">getSelection</span><span class="p">()[</span><span class="mi">1</span><span class="p">:]</span>
</pre></div>
<p>&#1057;&#1072;&#1084; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085; &#1085;&#1072; Python, &#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">/Mod/Part/BOPTools/SplitFeatures.py</span> (<a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/blob/master/src/Mod/Part/BOPTools/SplitFeatures.py">GitHub link</a>) &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1072; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; FreeCAD.
</p><p><span id="Tutorials"></span>
</p>
<h2><span id=".D0.A3.D1.87.D0.B5.D0.B1.D0.BD.D0.B8.D0.BA.D0.B8"></span><span class="mw-headline" id="&#1059;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082;&#1080;">&#1059;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082;&#1080;</span></h2>
<ul><li><a rel="nofollow" class="external text" href="https://www.youtube.com/watch?v=tzHkQaHgrfQ">FreeCad 0.18 &#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; &#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; Slice &#1080; Slice Apart</a> (&#1085;&#1072; &#1072;&#1085;&#1075;&#1083;&#1080;&#1081;&#1089;&#1082;&#1086;&#1084; &#1103;&#1079;&#1099;&#1082;&#1077;), &#1072;&#1074;&#1090;&#1086;&#1088;: &#1061;&#1072; &#1043;&#1101;&#1081;</li></ul>
<ul><li><a rel="nofollow" class="external text" href="https://www.youtube.com/watch?v=JJAL5JmqqKQ">FreeCAD Slice und Slice Apart und andere Tricks</a> (&#1053;&#1077;&#1084;&#1077;&#1094;&#1082;&#1080;&#1081; &#1103;&#1079;&#1099;&#1082;), &#1072;&#1074;&#1090;&#1086;&#1088;: &#1061;&#1072; &#1043;&#1101;&#1081;</li></ul>
<p><br>
</p>
<div class="docnav">
    <div><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-left.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span> <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Part_SliceApart.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span> <a href="../ru/Part_SliceApart.html" title="Part SliceApart/ru">&#1056;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100; &#1085;&#1072; &#1095;&#1072;&#1089;&#1090;&#1080;</a></div>
    <div><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Part_XOR.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span> <a href="../ru/Part_XOR.html" title="Part XOR/ru">&#1041;&#1091;&#1083;&#1077;&#1074;&#1072; XOR</a>
 <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-right.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span></div>
    <div><a href="../ru/Part_Workbench.html" title="Part Workbench/ru">&#1044;&#1077;&#1090;&#1072;&#1083;&#1100;</a>
 <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Workbench_Part.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span></div>
</div>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><a href="../ru/Part_Workbench.html" title="Part Workbench/ru">Part</a> <span typeof="mw:File"><a href="../index.php?title=Workbench_Part.svg&amp;filetimestamp=20240712190040&amp;.html" class="mw-file-description"><img src="../File/Workbench_Part.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b>&#1055;&#1088;&#1080;&#1084;&#1080;&#1090;&#1080;&#1074;&#1099;:</b> <a href="../ru/Part_Box.html" title="Part Box/ru">&#1050;&#1091;&#1073;(&#1055;&#1072;&#1088;&#1072;&#1083;&#1083;&#1077;&#1083;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;)</a>, <a href="../ru/Part_Cone.html" title="Part Cone/ru">&#1050;&#1086;&#1085;&#1091;&#1089;</a>, <a href="../ru/Part_Cylinder.html" title="Part Cylinder/ru">&#1062;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;</a>, <a href="../ru/Part_Sphere.html" title="Part Sphere/ru">&#1057;&#1092;&#1077;&#1088;&#1072;</a>, <a href="../ru/Part_Torus.html" title="Part Torus/ru">&#1058;&#1086;&#1088;</a>, <a href="../ru/Part_Tube.html" title="Part Tube/ru">&#1055;&#1086;&#1083;&#1099;&#1081; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;</a>,<a href="../ru/Part_CreatePrimitives.html" class="mw-redirect" title="Part CreatePrimitives/ru">&#1055;&#1088;&#1080;&#1084;&#1080;&#1090;&#1080;&#1074;&#1099;</a>, <a href="../ru/Part_Shapebuilder.html" class="mw-redirect" title="Part Shapebuilder/ru">&#1057;&#1074;&#1103;&#1079;&#1091;&#1102;&#1097;&#1080;&#1077; &#1092;&#1086;&#1088;&#1084;&#1099;</a></li></ul>
<hr>
<ul><li><b>&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1080; &#1087;&#1088;&#1072;&#1074;&#1082;&#1072;:</b> <a href="../ru/Part_Extrude.html" title="Part Extrude/ru">&#1042;&#1099;&#1076;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077;</a>, <a href="../ru/Part_Revolve.html" title="Part Revolve/ru">&#1055;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1077; &#1092;&#1080;&#1075;&#1091;&#1088;&#1099; &#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103;</a>, <a href="../ru/Part_Mirror.html" title="Part Mirror/ru">&#1054;&#1090;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;</a>, <a href="../ru/Part_Fillet.html" title="Part Fillet/ru">&#1057;&#1082;&#1088;&#1091;&#1075;&#1083;&#1077;&#1085;&#1080;&#1077;</a>, <a href="../ru/Part_Chamfer.html" title="Part Chamfer/ru">&#1060;&#1072;&#1089;&#1082;&#1072;</a>, <a href="../ru/Part_MakeFace.html" title="Part MakeFace/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1100; &#1080;&#1079; &#1075;&#1088;&#1072;&#1085;&#1077;&#1081;</a>, <a href="../ru/Part_RuledSurface.html" title="Part RuledSurface/ru">Ruled Surface</a>, <a href="../ru/Part_Loft.html" title="Part Loft/ru">&#1055;&#1088;&#1086;&#1092;&#1080;&#1083;&#1100;</a>, <a href="../ru/Part_Sweep.html" title="Part Sweep/ru">Sweep</a>, <a href="../ru/Part_Section.html" title="Part Section/ru">Section</a>, <a href="../ru/Part_CrossSections.html" title="Part CrossSections/ru">Cross sections</a>, <a href="../ru/Part_Offset.html" title="Part Offset/ru">3D Offset</a>, <a href="../ru/Part_Offset2D.html" title="Part Offset2D/ru">2D Offset</a>, <a href="../ru/Part_Thickness.html" title="Part Thickness/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1087;&#1086;&#1083;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;</a>, <a href="../ru/Part_ProjectionOnSurface.html" title="Part ProjectionOnSurface/ru">Projection on surface</a>, <a href="../ru/Part_EditAttachment.html" title="Part EditAttachment/ru">&#1055;&#1088;&#1080;&#1082;&#1088;&#1077;&#1087;&#1083;&#1077;&#1085;&#1080;&#1077;</a></li></ul>
<hr>
<ul><li><b>&#1041;&#1091;&#1083;&#1077;&#1074;&#1099; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080;:</b> <a href="../ru/Part_Compound.html" title="Part Compound/ru">&#1057;&#1086;&#1077;&#1076;&#1080;&#1085;&#1080;&#1090;&#1100;</a>, <a href="../ru/Part_ExplodeCompound.html" title="Part ExplodeCompound/ru">&#1056;&#1072;&#1079;&#1086;&#1088;&#1074;&#1072;&#1090;&#1100; &#1089;&#1074;&#1103;&#1079;&#1100;</a>, <a href="../ru/Part_CompoundFilter.html" title="Part CompoundFilter/ru">Compound Filter</a>, <a href="../ru/Part_Boolean.html" title="Part Boolean/ru">&#1041;&#1091;&#1083;&#1077;&#1074;&#1099; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080;</a>, <a href="../ru/Part_Cut.html" title="Part Cut/ru">Cut</a>, <a href="../ru/Part_Fuse.html" title="Part Fuse/ru">Fuse</a>, <a href="../ru/Part_Common.html" title="Part Common/ru">Common</a>, <a href="../ru/Part_JoinConnect.html" title="Part JoinConnect/ru">Connect</a>, <a href="../ru/Part_JoinEmbed.html" title="Part JoinEmbed/ru">Embed</a>, <a href="../ru/Part_JoinCutout.html" title="Part JoinCutout/ru">Cutout</a>, <a href="../ru/Part_BooleanFragments.html" title="Part BooleanFragments/ru">Boolean fragments</a>, <a href="../ru/Part_SliceApart.html" title="Part SliceApart/ru">Slice apart</a>, <a class="mw-selflink selflink">Slice</a>, <a href="../ru/Part_XOR.html" title="Part XOR/ru">XOR</a></li></ul>
<hr>
<ul><li><b>&#1048;&#1079;&#1084;&#1077;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077;:</b> <a href="../ru/Part_Measure_Linear.html" title="Part Measure Linear/ru">Measure Linear</a>, <a href="../ru/Part_Measure_Angular.html" title="Part Measure Angular/ru">Measure Angular</a>, <a href="../ru/Part_Measure_Refresh.html" title="Part Measure Refresh/ru">Measure Refresh</a>, <a href="../ru/Part_Measure_Clear_All.html" title="Part Measure Clear All/ru">Clear All</a>, <a href="../ru/Part_Measure_Toggle_All.html" title="Part Measure Toggle All/ru">Toggle All</a>, <a href="../ru/Part_Measure_Toggle_3D.html" title="Part Measure Toggle 3D/ru">Toggle 3D</a>, <a href="../ru/Part_Measure_Toggle_Delta.html" title="Part Measure Toggle Delta/ru">Toggle Delta</a></li></ul>
<hr>
<ul><li><b>&#1044;&#1088;&#1091;&#1075;&#1080;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;:</b> <a href="../ru/Part_Import.html" title="Part Import/ru">&#1048;&#1084;&#1087;&#1086;&#1088;&#1090;</a>, <a href="../ru/Part_Export.html" title="Part Export/ru">&#1069;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;</a>, <a href="../ru/Part_BoxSelection.html" title="Part BoxSelection/ru">Box selection</a>, <a href="../ru/Part_ShapeFromMesh.html" title="Part ShapeFromMesh/ru">Shape from Mesh</a>, <a href="../ru/Part_PointsFromMesh.html" title="Part PointsFromMesh/ru">Points from mesh</a>, <a href="../ru/Part_MakeSolid.html" title="Part MakeSolid/ru">&#1055;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; &#1090;&#1074;&#1077;&#1088;&#1076;&#1086;&#1077; &#1090;&#1077;&#1083;&#1086;</a>, <a href="../ru/Part_ReverseShape.html" title="Part ReverseShape/ru">Reverse shapes</a>, <a href="../ru/Part_SimpleCopy.html" title="Part SimpleCopy/ru">Create simple copy</a>, <a href="../ru/Part_TransformedCopy.html" title="Part TransformedCopy/ru">Create transformed copy</a>, <a href="../ru/Part_ElementCopy.html" title="Part ElementCopy/ru">Create shape element copy</a>, <a href="../ru/Part_RefineShape.html" title="Part RefineShape/ru">Refine shape</a>, <a href="../ru/Part_CheckGeometry.html" title="Part CheckGeometry/ru">Check geometry</a>, <a href="../ru/Part_Defeaturing.html" title="Part Defeaturing/ru">Defeaturing</a>, <a href="../ru/Std_SetAppearance.html" title="Std SetAppearance/ru">Appearance</a>, <a href="../ru/Part_FaceColors.html" class="mw-redirect" title="Part FaceColors/ru">Set colors</a></li></ul></div>
    </div></div>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><span typeof="mw:File"><a href="../index.php?title=User_hub.png&amp;filetimestamp=20190221145008&amp;.html" class="mw-file-description"><img src="../File/User_hub.png" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/User_hub.html" title="User hub/ru">&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b><a href="../ru/Getting_started.html" title="Getting started/ru">&#1053;&#1072;&#1095;&#1080;&#1085;&#1072;&#1102;&#1097;&#1080;&#1084;</a></b></li>
<li><b>&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072;:</b> <a href="../ru/Download.html" title="Download/ru">&#1047;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072;</a>, <a href="../ru/Installing_on_Windows.html" title="Installing on Windows/ru">Windows</a>, <a href="../ru/Installing_on_Linux.html" title="Installing on Linux/ru">Linux</a>, <a href="../ru/Installing_on_Mac.html" title="Installing on Mac/ru">Mac</a>, <a href="../ru/Installing_additional_components.html" title="Installing additional components/ru">
&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074;</a>, <a href="../ru/Compile_on_Docker.html" title="Compile on Docker/ru">Docker</a>, <a href="../ru/AppImage.html" title="AppImage/ru">AppImage</a>, <a href="../ru/Ubuntu_Snap.html" title="Ubuntu Snap/ru">Ubuntu Snap</a></li>
<li><b>&#1041;&#1072;&#1079;&#1086;&#1074;&#1072;&#1103;:</b> <a href="../ru/About_FreeCAD.html" title="About FreeCAD/ru">&#1054; FreeCAD</a>, <a href="../ru/Interface.html" title="Interface/ru">&#1048;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;</a>, <a href="../ru/Mouse_navigation.html" title="Mouse navigation/ru">&#1053;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1103; &#1084;&#1099;&#1096;&#1080;</a>, <a href="../ru/Selection_methods.html" title="Selection methods/ru">&#1052;&#1077;&#1090;&#1086;&#1076;&#1099; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103;</a>, <a href="../ru/Object_name.html" title="Object name/ru">&#1048;&#1084;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;</a>, <a href="../ru/Preferences_Editor.html" title="Preferences Editor/ru">&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;</a>, <a href="../ru/Workbenches.html" title="Workbenches/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>, <a href="../ru/Document_structure.html" title="Document structure/ru">&#1057;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;</a>, <a href="../ru/Property.html" title="Property/ru">&#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;</a>, <a href="../ru/Help_FreeCAD.html" title="Help FreeCAD/ru">&#1055;&#1086;&#1084;&#1086;&#1075;&#1080; FreeCAD</a>, <a href="../ru/Donate.html" title="Donate/ru">&#1055;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</a></li></ul>
<hr>
<ul><li><b>&#1055;&#1086;&#1084;&#1086;&#1097;&#1100;:</b> <a href="../ru/Tutorials.html" title="Tutorials/ru">&#1059;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082;&#1080;</a>, <a href="../ru/Video_tutorials.html" title="Video tutorials/ru">&#1042;&#1080;&#1076;&#1077;&#1086; &#1091;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082;&#1080;</a></li>
<li><b><a href="../ru/Workbenches.html" title="Workbenches/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>:</b> <a href="../ru/Std_Base.html" title="Std Base/ru">Std Base</a>, <a href="../ru/Arch_Workbench.html" title="Arch Workbench/ru">Arch</a>, <a href="../ru/Assembly_Workbench.html" title="Assembly Workbench/ru">Assembly</a>, <a href="../ru/CAM_Workbench.html" title="CAM Workbench/ru">CAM</a>, <a href="../ru/Draft_Workbench.html" title="Draft Workbench/ru">Draft</a>, <a href="../ru/FEM_Workbench.html" title="FEM Workbench/ru">FEM</a>, <a href="../ru/Inspection_Workbench.html" title="Inspection Workbench/ru">Inspection</a>, <a href="../ru/Mesh_Workbench.html" title="Mesh Workbench/ru">Mesh</a>, <a href="../ru/OpenSCAD_Workbench.html" title="OpenSCAD Workbench/ru">OpenSCAD</a>, <a href="../ru/Part_Workbench.html" title="Part Workbench/ru">Part</a>, <a href="../ru/PartDesign_Workbench.html" title="PartDesign Workbench/ru">PartDesign</a>, <a href="../ru/Points_Workbench.html" title="Points Workbench/ru">Points</a>, <a href="../ru/Reverse_Engineering_Workbench.html" title="Reverse Engineering Workbench/ru">Reverse Engineering</a>, <a href="../ru/Robot_Workbench.html" title="Robot Workbench/ru">Robot</a>, <a href="../ru/Sketcher_Workbench.html" title="Sketcher Workbench/ru">Sketcher</a>, <a href="../ru/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/ru">Spreadsheet</a>, <a href="../ru/Surface_Workbench.html" title="Surface Workbench/ru">Surface</a>, <a href="../ru/TechDraw_Workbench.html" title="TechDraw Workbench/ru">TechDraw</a>, <a href="../ru/Testing.html" title="Testing/ru">Test Framework</a></li></ul>
<hr>
<ul><li><b><a href="../ru/Addon.html" title="Addon/ru">Addons</a>:</b> <a href="../ru/Std_AddonMgr.html" title="Std AddonMgr/ru">&#1052;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1081;</a>, <a href="../ru/External_workbenches.html" title="External workbenches/ru">&#1042;&#1085;&#1077;&#1096;&#1085;&#1080;&#1077; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>, <a href="../ru/Scripting_and_macros.html" title="Scripting and macros/ru">C&#1082;&#1088;&#1080;&#1087;&#1090;&#1099; &#1080; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1099;</a></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="../ru/User_hub.html" title="User hub/ru">&#1059;&#1075;&#1086;&#1083;&#1086;&#1082; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;</a>, <a href="../ru/Power_users_hub.html" title="Power users hub/ru">&#1059;&#1075;&#1086;&#1083;&#1086;&#1082; &#1086;&#1087;&#1099;&#1090;&#1085;&#1099;&#1093; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;</a>, <a href="../ru/Developer_hub.html" title="Developer hub/ru">&#1059;&#1075;&#1086;&#1083;&#1086;&#1082; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20260104164102
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.114 seconds
Real time usage: 0.150 seconds
Preprocessor visited node count: 518/1000000
Post&#8208;expand include size: 19829/2097152 bytes
Template argument size: 7261/2097152 bytes
Highest expansion depth: 7/100
Expensive parser function count: 4/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 3794/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   31.883      1 -total
 14.42%    4.597      2 Template:Docnav/ru
 13.06%    4.163      1 Template:Part_Tools_navi/ru
 12.95%    4.130      1 Template:GuiCommand/ru
 12.50%    3.984      4 Template:PropertyData
 12.46%    3.974      1 Template:Userdocnavi/ru
  9.69%    3.089      2 Template:TitleProperty
  7.36%    2.348      4 Template:Variable
  7.03%    2.240      3 Template:Code
  5.52%    1.759      1 Template:Caption
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:73216-0!canonical and timestamp 20260104164102 and revision id 1727428. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>