<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Part CompoundFilter/ru</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="ru" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Part+CompoundFilter&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/Part_CompoundFilter.html" class="mw-pt-progress mw-pt-progress--complete" title="Part VerbundFiltern (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Part_CompoundFilter.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Part CompoundFilter (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/Part_CompoundFilter.html" class="mw-pt-progress mw-pt-progress--med" title="Piezas FiltroCompuesto (50% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/Part_CompoundFilter.html" class="mw-pt-progress mw-pt-progress--complete" title="Part Filtre de compos&eacute; (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/Part_CompoundFilter.html" class="mw-pt-progress mw-pt-progress--high" title="Part: Filtra composto (83% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Part_CompoundFilter.html" class="mw-pt-progress mw-pt-progress--complete" title="Cz&#281;&#347;&#263;: Filtr z&#322;o&#380;e&#324; (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt-br/Part_CompoundFilter.html" class="mw-pt-progress mw-pt-progress--low" title="Filtro de composi&ccedil;&atilde;o (8% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../ro/Part_CompoundFilter.html" class="mw-pt-progress mw-pt-progress--med" title="Part: CompoundFilter (42% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--high" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</span></li></ul></div>
<div class="docnav">
    <div><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-left.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span> <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Part_ExplodeCompound.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span> <a href="../ru/Part_ExplodeCompound.html" title="Part ExplodeCompound/ru">&#1056;&#1072;&#1079;&#1075;&#1088;&#1091;&#1087;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077;</a></div>
    <div><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Part_Boolean.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span> <a href="../ru/Part_Boolean.html" title="Part Boolean/ru">&#1041;&#1091;&#1083;&#1077;&#1074;&#1099; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080;</a>
 <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-right.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span></div>
    <div><a href="../ru/Part_Workbench.html" title="Part Workbench/ru">&#1044;&#1077;&#1090;&#1072;&#1083;&#1100;</a>
 <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Workbench_Part.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span></div>
</div>
<table class="fcinfobox wikitable ct" width="100%" style="float: right; width: 230px; margin-left: 1em">
<tbody><tr>
<td class="ctTitle" style="font-weight: bold; font-size: 125%;">
<p><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Part_CompoundFilter.svg" decoding="async" width="32" height="32" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span><span> </span>&#1060;&#1080;&#1083;&#1100;&#1090;&#1088; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099;
</p>
</td></tr>
<tr>
<th class="ctOdd">&#1056;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074; &#1084;&#1077;&#1085;&#1102;
</th></tr>
<tr>
<td class="ctEven">&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &rarr; &#1057;&#1086;&#1077;&#1076;&#1080;&#1085;&#1080;&#1090;&#1100; &#1043;&#1088;&#1091;&#1087;&#1087;&#1080;&#1088;&#1086;&#1074;&#1082;&#1072; &rarr; &#1060;&#1080;&#1083;&#1100;&#1090;&#1088; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1081;
</td></tr>
<tr>
<th class="ctOdd">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;
</th></tr>
<tr>
<td class="ctEven"><a href="../ru/Part_Workbench.html" title="Part Workbench/ru">&#1044;&#1077;&#1090;&#1072;&#1083;&#1100;</a>
</td></tr>
<tr>
<th class="ctOdd">&#1041;&#1099;&#1089;&#1090;&#1088;&#1099;&#1077; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080;
</th></tr>
<tr>
<td class="ctEven"><i>&#1053;&#1077;&#1090;</i>
</td></tr>
<tr>
<th class="ctOdd">&#1055;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1086; &#1074; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080;
</th></tr>
<tr>
<td class="ctEven">0.17
</td></tr>
<tr>
<th class="ctOdd">&#1057;&#1084;. &#1090;&#1072;&#1082;&#1078;&#1077;
</th></tr>
<tr>
<td class="ctEven"><i>&#1053;&#1077;&#1090;</i>
</td></tr>
<tr>
<td class="ctToc"><br><meta property="mw:PageProp/toc">
</td></tr></tbody></table>
<p><span id="Description"></span>
</p>
<h2><span id=".D0.9E.D0.BF.D0.B8.D1.81.D0.B0.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;">&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;</span></h2>
<div class="mw-translate-fuzzy">
<p>&#1060;&#1080;&#1083;&#1100;&#1090;&#1088; &#1050;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074; &#1043;&#1088;&#1091;&#1087;&#1087;&#1099; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1083;&#1103; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1095;&#1072;&#1089;&#1090;&#1077;&#1081; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1072;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; <a href="../ru/Part_Slice.html" title="Part Slice/ru">&#1056;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100; &#1080; &#1089;&#1075;&#1088;&#1091;&#1087;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;</a>, &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1074;&#1099; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1083;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;.
</p>
</div>
<p>&#1054;&#1085; &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1079;&#1074;&#1083;&#1077;&#1082;&#1072;&#1090;&#1100; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1087;&#1086; &#1080;&#1093; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1072;&#1084;, &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1103;&#1090;&#1100; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1085;&#1072; &#1089;&#1090;&#1086;&#1083;&#1082;&#1085;&#1086;&#1074;&#1077;&#1085;&#1080;&#1077; &#1089; &#1092;&#1086;&#1088;&#1084;&#1086;&#1081; &#1090;&#1088;&#1072;&#1092;&#1072;&#1088;&#1077;&#1090;&#1072; &#1080; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1087;&#1086; &#1080;&#1093; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;&#1084;, &#1090;&#1072;&#1082;&#1080;&#1084; &#1082;&#1072;&#1082; &#1076;&#1083;&#1080;&#1085;&#1072;, &#1087;&#1083;&#1086;&#1097;&#1072;&#1076;&#1100;, &#1086;&#1073;&#1098;&#1077;&#1084;.
</p><p>&#1045;&#1089;&#1083;&#1080; &#1074; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1077;&#1089;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1076;&#1080;&#1085; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;, &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1086;&#1084; &#1073;&#1091;&#1076;&#1077;&#1090; &#1101;&#1090;&#1086;&#1090; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;. &#1045;&#1089;&#1083;&#1080; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1093; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086;, &#1090;&#1086; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1086;&#1084; &#1073;&#1091;&#1076;&#1077;&#1090; &#1085;&#1086;&#1074;&#1099;&#1081; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1085;&#1086;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; (&#1075;&#1088;&#1091;&#1087;&#1087;&#1072;).
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=CompoundFilter.png&amp;filetimestamp=20180715203148&amp;.html" class="mw-file-description"><img src="../File/CompoundFilter.png" decoding="async" width="600" height="133" class="mw-file-element" data-file-width="600" data-file-height="133"></a></span>
</p><p><span id="Usage"></span>
</p>
<h2><span id=".D0.9F.D1.80.D0.B8.D0.BC.D0.B5.D0.BD.D0.B5.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1055;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;">&#1055;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;</span></h2>
<div class="mw-translate-fuzzy">
<ol><li>&#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1085;&#1072;&#1088;&#1077;&#1079;&#1072;&#1085;&#1085;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;</li>
<li>&#1055;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; <b>&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &rarr; &#1057;&#1086;&#1077;&#1076;&#1080;&#1085;&#1080;&#1090;&#1100; &#1043;&#1088;&#1091;&#1087;&#1087;&#1080;&#1088;&#1086;&#1074;&#1082;&#1072; &rarr; &#1060;&#1080;&#1083;&#1100;&#1090;&#1088; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1081; (&#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099;)</b></li>
<li>&#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; CompoundFilter &#1074; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077;.</li>
<li>&#1053;&#1072; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1076;&#1083;&#1103; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &laquo;Filter Type - &#1058;&#1080;&#1087; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1072;&raquo; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &laquo;specific items -</li></ol>
<p>&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099;&raquo;.
</p>
<ol><li>&#1047;&#1072;&#1076;&#1072;&#1081;&#1090;&#1077; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1090;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1100;.
<ol><li>&#1044;&#1083;&#1103; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1101;&#1090;&#1086; &#1095;&#1080;&#1089;&#1083;&#1086;, &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1102;&#1097;&#1077;&#1077;&#1089;&#1103; &#1089; 0, &#1090;.&#1077;. &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1100; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;, &#1074;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; 0 &#1074; &#1101;&#1090;&#1086; &#1087;&#1086;&#1083;&#1077;, 1 &#1076;&#1083;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1080; &#1090;&#1072;&#1082; &#1076;&#1072;&#1083;&#1077;&#1077;...</li>
<li>&#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1100; &#1073;&#1086;&#1083;&#1077;&#1077; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1079;&#1072; &#1088;&#1072;&#1079;, &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077; &#1095;&#1080;&#1089;&#1083;&#1072; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1084; &laquo;;&raquo;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &laquo;0;2&raquo; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1077;&#1090; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1080; &#1090;&#1088;&#1077;&#1090;&#1080;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;.</li>
<li>&#1054;&#1073;&#1097;&#1080;&#1081; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081; - &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1090;&#1072;&#1082;&#1078;&#1077; &#1086;&#1093;&#1074;&#1072;&#1090;&#1099;&#1074;&#1072;&#1077;&#1090; &#1074;&#1099;&#1096;&#1077;&#1091;&#1087;&#1086;&#1084;&#1103;&#1085;&#1091;&#1090;&#1099;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; - &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1076;&#1080;&#1072;&#1087;&#1072;&#1079;&#1086;&#1085;&#1086;&#1074; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1086;&#1074;, &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; &#1085;&#1086;&#1090;&#1072;&#1094;&#1080;&#1080; Python, &#1085;&#1086; &#1073;&#1077;&#1079; &#1089;&#1082;&#1086;&#1073;&#1086;&#1082;. &#1044;&#1080;&#1072;&#1087;&#1072;&#1079;&#1086;&#1085;&#1099; &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1103;&#1090;&#1100; &#1090;&#1086;&#1095;&#1082;&#1086;&#1081; &#1089; &#1079;&#1072;&#1087;&#1103;&#1090;&#1086;&#1081;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;:
<ul><li><tt>7:10</tt> &#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1086;&#1074; 7, 8 &#1080; 9 (&#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1099; &#1086;&#1090;&#1089;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1086;&#1090; &#1085;&#1091;&#1083;&#1103;; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; &#1076;&#1080;&#1072;&#1087;&#1072;&#1079;&#1086;&#1085;&#1072; &#1076;&#1086; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103;).</li>
<li><tt>1;2 </tt> &#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; 1 &#1080; 2 (&#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1076;&#1080;&#1072;&#1087;&#1072;&#1079;&#1086;&#1085; - &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1081; 1, &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; &#1076;&#1080;&#1072;&#1087;&#1072;&#1079;&#1086;&#1085; - &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1081; 2, &#1076;&#1080;&#1072;&#1087;&#1072;&#1079;&#1086;&#1085;&#1099; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1090;&#1086;&#1095;&#1082;&#1086;&#1081; &#1089; &#1079;&#1072;&#1087;&#1103;&#1090;&#1086;&#1081;)</li>
<li><tt>0;-1 </tt> &#1074;&#1079;&#1103;&#1090;&#1100; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; (&#1080;&#1085;&#1076;&#1077;&#1082;&#1089; 0) &#1080; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1081; (&#1080;&#1085;&#1076;&#1077;&#1082;&#1089; -1 &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1081; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;, -2 - &#1086;&#1076;&#1080;&#1085; &#1087;&#1077;&#1088;&#1077;&#1076; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1084; &#1080; &#1090;&#1072;&#1082; &#1076;&#1072;&#1083;&#1077;&#1077;)</li>
<li><tt>1: </tt> &#1074;&#1079;&#1103;&#1090;&#1100; &#1074;&#1089;&#1077;, &#1082;&#1088;&#1086;&#1084;&#1077; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1077;&#1075;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; (&#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1080;&#1077; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1072; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090; &laquo;&#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1076;&#1086; &#1082;&#1086;&#1085;&#1094;&#1072;&raquo;).</li>
<li><tt>::-1 </tt> &#1074;&#1079;&#1103;&#1090;&#1100; &#1074;&#1089;&#1077; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1099; &#1074; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086;&#1084; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077;</li>
<li><tt>::2 </tt> &#1074;&#1079;&#1103;&#1090;&#1100; &#1074;&#1089;&#1077; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1089; &#1085;&#1077;&#1095;&#1105;&#1090;&#1085;&#1099;&#1084; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1086;&#1084;, &#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1099;, 1,3,5, ..., &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080; 2,4,6, ...</li>
<li><tt>:;: </tt> &#1076;&#1074;&#1072;&#1078;&#1076;&#1099; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1080;&#1090;&#1100; &#1074;&#1074;&#1077;&#1076;&#1105;&#1085;&#1085;&#1086;&#1077; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077;</li></ul></li></ol></li>
<li>&#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1100; &#1077;&#1097;&#1077; &#1086;&#1076;&#1080;&#1085; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;, &#1089;&#1085;&#1086;&#1074;&#1072; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1085;&#1072;&#1088;&#1077;&#1079;&#1072;&#1085;&#1085;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;. &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1086;&#1085; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1087;&#1086;&#1076; CompoundFilter &#1074; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077;.</li>
<li>&#1055;&#1086;&#1074;&#1090;&#1086;&#1088;&#1080;&#1090;&#1077; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1091; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1091;&#1102; &#1074;&#1099;&#1096;&#1077;. &#1057;&#1088;&#1077;&#1079; &#1080; &#1077;&#1075;&#1086; &#1087;&#1086;&#1076;&#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1073;&#1091;&#1076;&#1091;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1099; &#1087;&#1086;&#1076; &#1086;&#1073;&#1086;&#1080;&#1084;&#1080; CompoundFilter; &#1086;&#1085;&#1080;, &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1085;&#1077; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1103;&#1102;&#1090;&#1089;&#1103; &#1074; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;. &#1054;&#1095;&#1077;&#1085;&#1100; &#1073;&#1099;&#1089;&#1090;&#1088;&#1099;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1100; &#1077;&#1097;&#1077; &#1086;&#1076;&#1080;&#1085; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090; - &#1089;&#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; CompoundFilter. &#1053;&#1086; <b>&#1073;&#1091;&#1076;&#1100;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;</b>: &#1074;&#1072;&#1089; &#1089;&#1087;&#1088;&#1086;&#1089;&#1103;&#1090;, &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1083;&#1080; &#1074;&#1099; &#1089;&#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1087;&#1086;&#1076; CompoundFilter, &#1085;&#1072; &#1095;&#1090;&#1086; &#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1086;&#1090;&#1074;&#1077;&#1090;&#1080;&#1090;&#1100; <b>&#1085;&#1077;&#1090;</b>, &#1074;&#1099; &#1078;&#1077; &#1085;&#1077; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1080;&#1093; &#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;, &#1074;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089;&#1089;&#1099;&#1083;&#1072;&#1077;&#1090;&#1077;&#1089;&#1100; &#1085;&#1072; &#1085;&#1080;&#1093;.</li></ol>
</div>
<p><span id="Properties"></span>
</p>
<h2><span id=".D0.A1.D0.B2.D0.BE.D0.B9.D1.81.D1.82.D0.B2.D0.B0"></span><span class="mw-headline" id="&#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;">&#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;</span></h2>
<ul><li><span style="font-size:60%; padding-right:0.8em;">&#1044;&#1072;&#1085;&#1085;&#1099;&#1077;</span><b>&#1041;&#1072;&#1079;&#1072;</b>: &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1091;&#1077;&#1084;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;.</li>
<li>&#1042;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1099; &#1074;&#1099;&#1073;&#1086;&#1088;&#1072; <span style="font-size:60%; padding-right:0.8em;">&#1044;&#1072;&#1085;&#1085;&#1099;&#1077;</span><b>Filter Type - &#1090;&#1080;&#1087;&#1072; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1072;</b>:
<ul><li>bypass (&#1080;&#1075;&#1085;&#1086;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;): &#1085;&#1077;&#1090; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1072;. &#1048;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1077; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1073;&#1077;&#1079; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081;.</li>
<li>specific items (&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1099;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099;): &#1080;&#1079;&#1074;&#1083;&#1077;&#1082;&#1072;&#1102;&#1090;&#1089;&#1103; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099;, &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1074; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1077; "items"</li>
<li>collision-pass (&#1089;&#1090;&#1086;&#1083;&#1082;&#1085;&#1086;&#1074;&#1077;&#1085;&#1080;&#1077;): &#1080;&#1079;&#1074;&#1083;&#1077;&#1082;&#1072;&#1102;&#1090;&#1089;&#1103; &#1095;&#1072;&#1089;&#1090;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1082;&#1072;&#1089;&#1072;&#1102;&#1090;&#1089;&#1103; &#1080;&#1083;&#1080; &#1087;&#1077;&#1088;&#1077;&#1089;&#1077;&#1082;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089; &#1092;&#1086;&#1088;&#1084;&#1086;&#1081; 'Stencil (&#1090;&#1088;&#1072;&#1092;&#1072;&#1088;&#1077;&#1090;)'.</li>
<li>window-volume (&#1086;&#1073;&#1098;&#1105;&#1084; - &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;): &#1080;&#1079;&#1074;&#1083;&#1077;&#1082;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074;&#1089;&#1077; &#1095;&#1072;&#1089;&#1090;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1084;&#1077;&#1102;&#1090; &#1086;&#1073;&#1098;&#1077;&#1084; &#1084;&#1077;&#1078;&#1076;&#1091; &laquo;Window From (&#1054;&#1073;&#1098;&#1105;&#1084; &#1054;&#1090;)&raquo; &#1080; &laquo;Window To (&#1054;&#1073;&#1098;&#1105;&#1084; &#1044;&#1086;)&raquo;, &#1075;&#1076;&#1077; 100% - &#1089;&#1072;&#1084;&#1099;&#1081; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;, &#1072; &#1085;&#1077; &#1085;&#1077;&#1088;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1085;&#1085;&#1099;&#1081; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;. &#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; 100% &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1101;&#1090;&#1072;&#1083;&#1086;&#1085;&#1085;&#1099;&#1084; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &laquo;Override Max Val&raquo; - &laquo;&#1055;&#1077;&#1088;&#1077;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&raquo;.</li>
<li>window-area (&#1087;&#1083;&#1086;&#1097;&#1072;&#1076;&#1100;): &#1090;&#1086; &#1078;&#1077;, &#1095;&#1090;&#1086; &#1080; window-volume, &#1085;&#1086; &#1075;&#1076;&#1077; &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1086;&#1073;&#1098;&#1105;&#1084;&#1072; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072;&#1088;&#1077;&#1079;&#1072;&#1085;&#1085;&#1072;&#1103; &#1087;&#1083;&#1086;&#1097;&#1072;&#1076;&#1100; &#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1081;, &#1072; &#1085;&#1077; &#1086;&#1073;&#1098;&#1077;&#1084;.</li>
<li>window-length (&#1076;&#1083;&#1080;&#1085;&#1072;): &#1090;&#1086; &#1078;&#1077;, &#1095;&#1090;&#1086; &#1080; window-volume, &#1085;&#1086; &#1075;&#1076;&#1077; &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1086;&#1073;&#1098;&#1105;&#1084;&#1072; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1080;&#1085;&#1072; &#1082;&#1088;&#1072;&#1105;&#1074;.</li>
<li>window-distance (&#1088;&#1072;&#1089;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077;); &#1080;&#1079;&#1074;&#1083;&#1077;&#1082;&#1072;&#1102;&#1090;&#1089;&#1103; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099;, &#1088;&#1072;&#1089;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1076;&#1086; &#1092;&#1086;&#1088;&#1084;&#1086;&#1081; 'Stencil (&#1090;&#1088;&#1072;&#1092;&#1072;&#1088;&#1077;&#1090;)' &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1072;&#1093; &#1076;&#1080;&#1072;&#1087;&#1072;&#1079;&#1086;&#1085;&#1072; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081;, &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1084;&#1086;&#1075;&#1086; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;&#1084;&#1080; &laquo;Window From (&#1054;&#1090;)&raquo;, &laquo;Window To (&#1044;&#1086;)&raquo;, &laquo;Override Max Val (&#1055;&#1077;&#1088;&#1077;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;)&raquo;.</li></ul></li>
<li><span style="font-size:60%; padding-right:0.8em;">&#1044;&#1072;&#1085;&#1085;&#1099;&#1077;</span><b>Invert (&#1080;&#1085;&#1074;&#1077;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;)</b>: &#1077;&#1089;&#1083;&#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; true, &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1082;&#1072;&#1082; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1086; &#1074;&#1099;&#1096;&#1077;, &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1072; &#1085;&#1077; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103;.</li>
<li><span style="font-size:60%; padding-right:0.8em;">&#1044;&#1072;&#1085;&#1085;&#1099;&#1077;</span><b>Override Max Val (&#1055;&#1077;&#1088;&#1077;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;)</b>: &#1076;&#1080;&#1072;&#1087;&#1072;&#1079;&#1086;&#1085; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074; &#1087;&#1088;&#1086;&#1094;&#1077;&#1085;&#1090;&#1072;&#1093; &#1086;&#1090; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;. &#1052;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1080; &#1089;&#1086; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1084; &#1085;&#1072;&#1073;&#1086;&#1088;&#1086;&#1084; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;:
<ul><li>&#1077;&#1089;&#1083;&#1080; OverrideMaxVal &#1086;&#1090;&#1083;&#1080;&#1095;&#1077;&#1085; &#1086;&#1090; &#1085;&#1091;&#1083;&#1103; - &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1086;&#1085;&#1086;.</li>
<li>&#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1072; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; 'Stencil (&#1090;&#1088;&#1072;&#1092;&#1072;&#1088;&#1077;&#1090;)' - &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1092;&#1086;&#1088;&#1084;&#1099; &#1090;&#1088;&#1072;&#1092;&#1072;&#1088;&#1077;&#1090;&#1072; (&#1085;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1084;&#1086; &#1082; &#1088;&#1072;&#1089;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1102; &#1084;&#1077;&#1078;&#1076;&#1091; &#1086;&#1082;&#1085;&#1072;&#1084;&#1080; 'FilterType')</li>
<li>&#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1073;&#1077;&#1088;&#1105;&#1090;&#1089;&#1103; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1086;&#1090; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1093; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074; &#1075;&#1088;&#1091;&#1087;&#1087;&#1077; &#1076;&#1083;&#1103; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1072;&#1094;&#1080;&#1080;.</li></ul></li>
<li><span style="font-size:60%; padding-right:0.8em;">&#1044;&#1072;&#1085;&#1085;&#1099;&#1077;</span><b>Stencil (&#1090;&#1088;&#1072;&#1092;&#1072;&#1088;&#1077;&#1090;)</b>: &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1092;&#1080;&#1075;&#1091;&#1088;&#1091; &#1090;&#1088;&#1072;&#1092;&#1072;&#1088;&#1077;&#1090;&#1072;. &#1044;&#1083;&#1103; Collision-Pass &#1080; Window-Distance FilterType stencil - &#1101;&#1090;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;, &#1089; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100; &#1089;&#1090;&#1086;&#1083;&#1082;&#1085;&#1086;&#1074;&#1077;&#1085;&#1080;&#1077;/&#1088;&#1072;&#1089;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077;. &#1044;&#1083;&#1103; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1090;&#1080;&#1087;&#1086;&#1074; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1086;&#1074; &laquo;window-***&raquo; &#1090;&#1088;&#1072;&#1092;&#1072;&#1088;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1087;&#1088;&#1072;&#1074;&#1086;&#1095;&#1085;&#1086;&#1075;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1094;&#1077;&#1085;&#1090;&#1085;&#1099;&#1093; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081; &#1086;&#1082;&#1085;&#1072; (&#1087;&#1077;&#1088;&#1077;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;). &#1042;&#1086; &#1074;&#1089;&#1077;&#1093; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072;&#1093; &laquo;Stencil&raquo; &#1080;&#1075;&#1085;&#1086;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103;.</li>
<li><span style="font-size:60%; padding-right:0.8em;">&#1044;&#1072;&#1085;&#1085;&#1099;&#1077;</span><b>Window From (&#1054;&#1090;)</b>: &#1087;&#1088;&#1086;&#1094;&#1077;&#1085;&#1090; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1075;&#1086; &#1087;&#1086;&#1088;&#1086;&#1075;&#1072; &#1076;&#1083;&#1103; &#1074;&#1099;&#1073;&#1086;&#1088;&#1072; &#1095;&#1072;&#1089;&#1090;&#1077;&#1081;, 100% &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1089;&#1072;&#1084;&#1086;&#1081; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;.</li>
<li><span style="font-size:60%; padding-right:0.8em;">&#1044;&#1072;&#1085;&#1085;&#1099;&#1077;</span><b>Window To (&#1044;&#1086;)</b>: &#1087;&#1088;&#1086;&#1094;&#1077;&#1085;&#1090; &#1085;&#1080;&#1078;&#1085;&#1077;&#1075;&#1086; &#1087;&#1086;&#1088;&#1086;&#1075;&#1072; &#1076;&#1083;&#1103; &#1074;&#1099;&#1073;&#1086;&#1088;&#1072; &#1095;&#1072;&#1089;&#1090;&#1077;&#1081;, 100% &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1089;&#1072;&#1084;&#1086;&#1081; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;.</li>
<li><span style="font-size:60%; padding-right:0.8em;">&#1044;&#1072;&#1085;&#1085;&#1099;&#1077;</span><b>items (&#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099;)</b>: &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1080;&#1083;&#1080; &#1076;&#1080;&#1072;&#1087;&#1072;&#1079;&#1086;&#1085; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100;, &#1077;&#1089;&#1083;&#1080; &#1090;&#1080;&#1087; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1072; - &laquo;specific items (&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1099;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099;)&raquo;.</li></ul>
<p><br>
</p>
<div class="docnav">
    <div><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-left.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span> <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Part_ExplodeCompound.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span> <a href="../ru/Part_ExplodeCompound.html" title="Part ExplodeCompound/ru">&#1056;&#1072;&#1079;&#1075;&#1088;&#1091;&#1087;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077;</a></div>
    <div><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Part_Boolean.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span> <a href="../ru/Part_Boolean.html" title="Part Boolean/ru">&#1041;&#1091;&#1083;&#1077;&#1074;&#1099; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080;</a>
 <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-right.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span></div>
    <div><a href="../ru/Part_Workbench.html" title="Part Workbench/ru">&#1044;&#1077;&#1090;&#1072;&#1083;&#1100;</a>
 <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Workbench_Part.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span></div>
</div>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><a href="../ru/Part_Workbench.html" title="Part Workbench/ru">Part</a> <span typeof="mw:File"><a href="../index.php?title=Workbench_Part.svg&amp;filetimestamp=20240712190040&amp;.html" class="mw-file-description"><img src="../File/Workbench_Part.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b>&#1055;&#1088;&#1080;&#1084;&#1080;&#1090;&#1080;&#1074;&#1099;:</b> <a href="../ru/Part_Box.html" title="Part Box/ru">&#1050;&#1091;&#1073;(&#1055;&#1072;&#1088;&#1072;&#1083;&#1083;&#1077;&#1083;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;)</a>, <a href="../ru/Part_Cone.html" title="Part Cone/ru">&#1050;&#1086;&#1085;&#1091;&#1089;</a>, <a href="../ru/Part_Cylinder.html" title="Part Cylinder/ru">&#1062;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;</a>, <a href="../ru/Part_Sphere.html" title="Part Sphere/ru">&#1057;&#1092;&#1077;&#1088;&#1072;</a>, <a href="../ru/Part_Torus.html" title="Part Torus/ru">&#1058;&#1086;&#1088;</a>, <a href="../ru/Part_Tube.html" title="Part Tube/ru">&#1055;&#1086;&#1083;&#1099;&#1081; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;</a>,<a href="../ru/Part_CreatePrimitives.html" class="mw-redirect" title="Part CreatePrimitives/ru">&#1055;&#1088;&#1080;&#1084;&#1080;&#1090;&#1080;&#1074;&#1099;</a>, <a href="../ru/Part_Shapebuilder.html" class="mw-redirect" title="Part Shapebuilder/ru">&#1057;&#1074;&#1103;&#1079;&#1091;&#1102;&#1097;&#1080;&#1077; &#1092;&#1086;&#1088;&#1084;&#1099;</a></li></ul>
<hr>
<ul><li><b>&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1080; &#1087;&#1088;&#1072;&#1074;&#1082;&#1072;:</b> <a href="../ru/Part_Extrude.html" title="Part Extrude/ru">&#1042;&#1099;&#1076;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077;</a>, <a href="../ru/Part_Revolve.html" title="Part Revolve/ru">&#1055;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1077; &#1092;&#1080;&#1075;&#1091;&#1088;&#1099; &#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103;</a>, <a href="../ru/Part_Mirror.html" title="Part Mirror/ru">&#1054;&#1090;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;</a>, <a href="../ru/Part_Fillet.html" title="Part Fillet/ru">&#1057;&#1082;&#1088;&#1091;&#1075;&#1083;&#1077;&#1085;&#1080;&#1077;</a>, <a href="../ru/Part_Chamfer.html" title="Part Chamfer/ru">&#1060;&#1072;&#1089;&#1082;&#1072;</a>, <a href="../ru/Part_MakeFace.html" title="Part MakeFace/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1100; &#1080;&#1079; &#1075;&#1088;&#1072;&#1085;&#1077;&#1081;</a>, <a href="../ru/Part_RuledSurface.html" title="Part RuledSurface/ru">Ruled Surface</a>, <a href="../ru/Part_Loft.html" title="Part Loft/ru">&#1055;&#1088;&#1086;&#1092;&#1080;&#1083;&#1100;</a>, <a href="../ru/Part_Sweep.html" title="Part Sweep/ru">Sweep</a>, <a href="../ru/Part_Section.html" title="Part Section/ru">Section</a>, <a href="../ru/Part_CrossSections.html" title="Part CrossSections/ru">Cross sections</a>, <a href="../ru/Part_Offset.html" title="Part Offset/ru">3D Offset</a>, <a href="../ru/Part_Offset2D.html" title="Part Offset2D/ru">2D Offset</a>, <a href="../ru/Part_Thickness.html" title="Part Thickness/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1087;&#1086;&#1083;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;</a>, <a href="../ru/Part_ProjectionOnSurface.html" title="Part ProjectionOnSurface/ru">Projection on surface</a>, <a href="../ru/Part_EditAttachment.html" title="Part EditAttachment/ru">&#1055;&#1088;&#1080;&#1082;&#1088;&#1077;&#1087;&#1083;&#1077;&#1085;&#1080;&#1077;</a></li></ul>
<hr>
<ul><li><b>&#1041;&#1091;&#1083;&#1077;&#1074;&#1099; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080;:</b> <a href="../ru/Part_Compound.html" title="Part Compound/ru">&#1057;&#1086;&#1077;&#1076;&#1080;&#1085;&#1080;&#1090;&#1100;</a>, <a href="../ru/Part_ExplodeCompound.html" title="Part ExplodeCompound/ru">&#1056;&#1072;&#1079;&#1086;&#1088;&#1074;&#1072;&#1090;&#1100; &#1089;&#1074;&#1103;&#1079;&#1100;</a>, <a class="mw-selflink selflink">Compound Filter</a>, <a href="../ru/Part_Boolean.html" title="Part Boolean/ru">&#1041;&#1091;&#1083;&#1077;&#1074;&#1099; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080;</a>, <a href="../ru/Part_Cut.html" title="Part Cut/ru">Cut</a>, <a href="../ru/Part_Fuse.html" title="Part Fuse/ru">Fuse</a>, <a href="../ru/Part_Common.html" title="Part Common/ru">Common</a>, <a href="../ru/Part_JoinConnect.html" title="Part JoinConnect/ru">Connect</a>, <a href="../ru/Part_JoinEmbed.html" title="Part JoinEmbed/ru">Embed</a>, <a href="../ru/Part_JoinCutout.html" title="Part JoinCutout/ru">Cutout</a>, <a href="../ru/Part_BooleanFragments.html" title="Part BooleanFragments/ru">Boolean fragments</a>, <a href="../ru/Part_SliceApart.html" title="Part SliceApart/ru">Slice apart</a>, <a href="../ru/Part_Slice.html" title="Part Slice/ru">Slice</a>, <a href="../ru/Part_XOR.html" title="Part XOR/ru">XOR</a></li></ul>
<hr>
<ul><li><b>&#1048;&#1079;&#1084;&#1077;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077;:</b> <a href="../ru/Part_Measure_Linear.html" title="Part Measure Linear/ru">Measure Linear</a>, <a href="../ru/Part_Measure_Angular.html" title="Part Measure Angular/ru">Measure Angular</a>, <a href="../ru/Part_Measure_Refresh.html" title="Part Measure Refresh/ru">Measure Refresh</a>, <a href="../ru/Part_Measure_Clear_All.html" title="Part Measure Clear All/ru">Clear All</a>, <a href="../ru/Part_Measure_Toggle_All.html" title="Part Measure Toggle All/ru">Toggle All</a>, <a href="../ru/Part_Measure_Toggle_3D.html" title="Part Measure Toggle 3D/ru">Toggle 3D</a>, <a href="../ru/Part_Measure_Toggle_Delta.html" title="Part Measure Toggle Delta/ru">Toggle Delta</a></li></ul>
<hr>
<ul><li><b>&#1044;&#1088;&#1091;&#1075;&#1080;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;:</b> <a href="../ru/Part_Import.html" title="Part Import/ru">&#1048;&#1084;&#1087;&#1086;&#1088;&#1090;</a>, <a href="../ru/Part_Export.html" title="Part Export/ru">&#1069;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;</a>, <a href="../ru/Part_BoxSelection.html" title="Part BoxSelection/ru">Box selection</a>, <a href="../ru/Part_ShapeFromMesh.html" title="Part ShapeFromMesh/ru">Shape from Mesh</a>, <a href="../ru/Part_PointsFromMesh.html" title="Part PointsFromMesh/ru">Points from mesh</a>, <a href="../ru/Part_MakeSolid.html" title="Part MakeSolid/ru">&#1055;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; &#1090;&#1074;&#1077;&#1088;&#1076;&#1086;&#1077; &#1090;&#1077;&#1083;&#1086;</a>, <a href="../ru/Part_ReverseShape.html" title="Part ReverseShape/ru">Reverse shapes</a>, <a href="../ru/Part_SimpleCopy.html" title="Part SimpleCopy/ru">Create simple copy</a>, <a href="../ru/Part_TransformedCopy.html" title="Part TransformedCopy/ru">Create transformed copy</a>, <a href="../ru/Part_ElementCopy.html" title="Part ElementCopy/ru">Create shape element copy</a>, <a href="../ru/Part_RefineShape.html" title="Part RefineShape/ru">Refine shape</a>, <a href="../ru/Part_CheckGeometry.html" title="Part CheckGeometry/ru">Check geometry</a>, <a href="../ru/Part_Defeaturing.html" title="Part Defeaturing/ru">Defeaturing</a>, <a href="../ru/Std_SetAppearance.html" title="Std SetAppearance/ru">Appearance</a>, <a href="../ru/Part_FaceColors.html" class="mw-redirect" title="Part FaceColors/ru">Set colors</a></li></ul></div>
    </div></div>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><span typeof="mw:File"><a href="../index.php?title=User_hub.png&amp;filetimestamp=20190221145008&amp;.html" class="mw-file-description"><img src="../File/User_hub.png" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/User_hub.html" title="User hub/ru">&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b><a href="../ru/Getting_started.html" title="Getting started/ru">&#1053;&#1072;&#1095;&#1080;&#1085;&#1072;&#1102;&#1097;&#1080;&#1084;</a></b></li>
<li><b>&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072;:</b> <a href="../ru/Download.html" title="Download/ru">&#1047;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072;</a>, <a href="../ru/Installing_on_Windows.html" title="Installing on Windows/ru">Windows</a>, <a href="../ru/Installing_on_Linux.html" title="Installing on Linux/ru">Linux</a>, <a href="../ru/Installing_on_Mac.html" title="Installing on Mac/ru">Mac</a>, <a href="../ru/Installing_additional_components.html" title="Installing additional components/ru">
&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074;</a>, <a href="../ru/Compile_on_Docker.html" title="Compile on Docker/ru">Docker</a>, <a href="../ru/AppImage.html" title="AppImage/ru">AppImage</a>, <a href="../ru/Ubuntu_Snap.html" title="Ubuntu Snap/ru">Ubuntu Snap</a></li>
<li><b>&#1041;&#1072;&#1079;&#1086;&#1074;&#1072;&#1103;:</b> <a href="../ru/About_FreeCAD.html" title="About FreeCAD/ru">&#1054; FreeCAD</a>, <a href="../ru/Interface.html" title="Interface/ru">&#1048;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;</a>, <a href="../ru/Mouse_navigation.html" title="Mouse navigation/ru">&#1053;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1103; &#1084;&#1099;&#1096;&#1080;</a>, <a href="../ru/Selection_methods.html" title="Selection methods/ru">&#1052;&#1077;&#1090;&#1086;&#1076;&#1099; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103;</a>, <a href="../ru/Object_name.html" title="Object name/ru">&#1048;&#1084;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;</a>, <a href="../ru/Preferences_Editor.html" title="Preferences Editor/ru">&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;</a>, <a href="../ru/Workbenches.html" title="Workbenches/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>, <a href="../ru/Document_structure.html" title="Document structure/ru">&#1057;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;</a>, <a href="../ru/Property.html" title="Property/ru">&#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;</a>, <a href="../ru/Help_FreeCAD.html" title="Help FreeCAD/ru">&#1055;&#1086;&#1084;&#1086;&#1075;&#1080; FreeCAD</a>, <a href="../ru/Donate.html" title="Donate/ru">&#1055;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</a></li></ul>
<hr>
<ul><li><b>&#1055;&#1086;&#1084;&#1086;&#1097;&#1100;:</b> <a href="../ru/Tutorials.html" title="Tutorials/ru">&#1059;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082;&#1080;</a>, <a href="../ru/Video_tutorials.html" title="Video tutorials/ru">&#1042;&#1080;&#1076;&#1077;&#1086; &#1091;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082;&#1080;</a></li>
<li><b><a href="../ru/Workbenches.html" title="Workbenches/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>:</b> <a href="../ru/Std_Base.html" title="Std Base/ru">Std Base</a>, <a href="../ru/Arch_Workbench.html" title="Arch Workbench/ru">Arch</a>, <a href="../ru/Assembly_Workbench.html" title="Assembly Workbench/ru">Assembly</a>, <a href="../ru/CAM_Workbench.html" title="CAM Workbench/ru">CAM</a>, <a href="../ru/Draft_Workbench.html" title="Draft Workbench/ru">Draft</a>, <a href="../ru/FEM_Workbench.html" title="FEM Workbench/ru">FEM</a>, <a href="../ru/Inspection_Workbench.html" title="Inspection Workbench/ru">Inspection</a>, <a href="../ru/Mesh_Workbench.html" title="Mesh Workbench/ru">Mesh</a>, <a href="../ru/OpenSCAD_Workbench.html" title="OpenSCAD Workbench/ru">OpenSCAD</a>, <a href="../ru/Part_Workbench.html" title="Part Workbench/ru">Part</a>, <a href="../ru/PartDesign_Workbench.html" title="PartDesign Workbench/ru">PartDesign</a>, <a href="../ru/Points_Workbench.html" title="Points Workbench/ru">Points</a>, <a href="../ru/Reverse_Engineering_Workbench.html" title="Reverse Engineering Workbench/ru">Reverse Engineering</a>, <a href="../ru/Robot_Workbench.html" title="Robot Workbench/ru">Robot</a>, <a href="../ru/Sketcher_Workbench.html" title="Sketcher Workbench/ru">Sketcher</a>, <a href="../ru/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/ru">Spreadsheet</a>, <a href="../ru/Surface_Workbench.html" title="Surface Workbench/ru">Surface</a>, <a href="../ru/TechDraw_Workbench.html" title="TechDraw Workbench/ru">TechDraw</a>, <a href="../ru/Testing.html" title="Testing/ru">Test Framework</a></li></ul>
<hr>
<ul><li><b><a href="../ru/Addon.html" title="Addon/ru">Addons</a>:</b> <a href="../ru/Std_AddonMgr.html" title="Std AddonMgr/ru">&#1052;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1081;</a>, <a href="../ru/External_workbenches.html" title="External workbenches/ru">&#1042;&#1085;&#1077;&#1096;&#1085;&#1080;&#1077; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>, <a href="../ru/Scripting_and_macros.html" title="Scripting and macros/ru">C&#1082;&#1088;&#1080;&#1087;&#1090;&#1099; &#1080; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1099;</a></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="../ru/User_hub.html" title="User hub/ru">&#1059;&#1075;&#1086;&#1083;&#1086;&#1082; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;</a>, <a href="../ru/Power_users_hub.html" title="Power users hub/ru">&#1059;&#1075;&#1086;&#1083;&#1086;&#1082; &#1086;&#1087;&#1099;&#1090;&#1085;&#1099;&#1093; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;</a>, <a href="../ru/Developer_hub.html" title="Developer hub/ru">&#1059;&#1075;&#1086;&#1083;&#1086;&#1082; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;</a></li></ul></div>
    </div></div>
<div style="clear:both"></div>
<!-- 
NewPP limit report
Cached time: 20251230165610
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.074 seconds
Real time usage: 0.219 seconds
Preprocessor visited node count: 529/1000000
Post&#8208;expand include size: 19519/2097152 bytes
Template argument size: 7101/2097152 bytes
Highest expansion depth: 7/100
Expensive parser function count: 1/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1891/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   51.904      1 -total
 34.62%   17.971      8 Template:PropertyData
 21.49%   11.153      1 Template:Part_Tools_navi/ru
 20.69%   10.741      8 Template:Variable
 15.63%    8.115      1 Template:GuiCommand/ru
 10.87%    5.641      2 Template:Navigation_menu_2
 10.84%    5.628      2 Template:Docnav/ru
  7.28%    3.779      1 Template:Userdocnavi/ru
  5.57%    2.891      1 Template:MenuCommand
  2.77%    1.437      1 Template:Clear
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:195302-0!canonical and timestamp 20251230165610 and revision id 1600590. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>