<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Power users hub/ru</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="ru" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Power+users+hub&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../id/Power_users_hub.html" class="mw-pt-progress mw-pt-progress--low" title="Power users hub (3% translated)" lang="id" dir="ltr">Bahasa Indonesia</a></li>
<li><a href="../de/Power_users_hub.html" class="mw-pt-progress mw-pt-progress--complete" title="Hauptanwenderzentrum (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Power_users_hub.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Power users hub (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../tr/Power_users_hub.html" class="mw-pt-progress mw-pt-progress--low" title="Uzman kullan&#305;c&#305; merkezi (8% translated)" lang="tr" dir="ltr">T&uuml;rk&ccedil;e</a></li>
<li><a href="../es/Power_users_hub.html" class="mw-pt-progress mw-pt-progress--high" title="Centro usuarios avanzados (92% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/Power_users_hub.html" class="mw-pt-progress mw-pt-progress--complete" title="Documentation pour utilisateurs exp&eacute;riment&eacute;s (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../hr/Power_users_hub.html" class="mw-pt-progress mw-pt-progress--low" title="Napredno korisni&#269;ko okru&#382;enje (3% translated)" lang="hr" dir="ltr">hrvatski</a></li>
<li><a href="../it/Power_users_hub.html" class="mw-pt-progress mw-pt-progress--complete" title="Hub degli utenti esperti (100% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Power_users_hub.html" class="mw-pt-progress mw-pt-progress--complete" title="Centrum Power u&#380;ytkownik&oacute;w (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt/Power_users_hub.html" class="mw-pt-progress mw-pt-progress--med" title="Power users hub (65% translated)" lang="pt" dir="ltr">portugu&ecirc;s</a></li>
<li><a href="../pt-br/Power_users_hub.html" class="mw-pt-progress mw-pt-progress--med" title="Documenta&ccedil;&atilde;o para usu&aacute;rios avan&ccedil;ados (27% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../ro/Power_users_hub.html" class="mw-pt-progress mw-pt-progress--med" title="=Hub ul pentru utilizatorii avansa&#539;i= (35% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><a href="../fi/Power_users_hub.html" class="mw-pt-progress mw-pt-progress--low" title="Power users hub (3% translated)" lang="fi" dir="ltr">suomi</a></li>
<li><a href="../sv/Power_users_hub.html" class="mw-pt-progress mw-pt-progress--med" title="Power users hub (22% translated)" lang="sv" dir="ltr">svenska</a></li>
<li><a href="../cs/Power_users_hub.html" class="mw-pt-progress mw-pt-progress--med" title="Centrum pokro&#269;il&eacute;ho u&#382;ivatele (22% translated)" lang="cs" dir="ltr">&#269;e&scaron;tina</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--high" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</span></li>
<li><a href="../zh-cn/Power_users_hub.html" class="mw-pt-progress mw-pt-progress--med" title="&#21457;&#28903;&#21451;&#20013;&#24515; (35% translated)" lang="zh-Hans-CN" dir="ltr">&#20013;&#25991;&#65288;&#20013;&#22269;&#22823;&#38470;&#65289;</a></li>
<li><a href="../zh-tw/Power_users_hub.html" class="mw-pt-progress mw-pt-progress--med" title="&#36914;&#38542;&#29992;&#25142;&#21312; (16% translated)" lang="zh-Hant-TW" dir="ltr">&#20013;&#25991;&#65288;&#33274;&#28771;&#65289;</a></li>
<li><a href="../ja/Power_users_hub.html" class="mw-pt-progress mw-pt-progress--low" title="&#12497;&#12527;&#12540;&#12518;&#12540;&#12470;&#12540;&#21521;&#12369;&#12495;&#12502; (3% translated)" lang="ja" dir="ltr">&#26085;&#26412;&#35486;</a></li>
<li><a href="../ko/Power_users_hub.html" class="mw-pt-progress mw-pt-progress--med" title="Power users hub/ko (22% translated)" lang="ko" dir="ltr">&#54620;&#44397;&#50612;</a></li></ul></div>
<div style="clear:right; margin-bottom: .5em; float: right; padding: .5em 0 .8em 1.4em; background: none;"><meta property="mw:PageProp/toc"></div>
<p><span typeof="mw:File"><a href="../index.php?title=Power_user_hub.png&amp;filetimestamp=20200511213015&amp;.html" class="mw-file-description"><img src="../File/Power_user_hub.png" decoding="async" width="64" height="64" class="mw-file-element" data-file-width="128" data-file-height="128"></a></span>
</p>
<hr>
<p>&#1069;&#1090;&#1086; &#1084;&#1077;&#1089;&#1090;&#1086;, &#1082;&#1091;&#1076;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1088;&#1080;&#1081;&#1090;&#1080;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1086;&#1087;&#1099;&#1090;&#1085;&#1099;&#1081; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; &#1080; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1091;&#1079;&#1085;&#1072;&#1090;&#1100; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1086; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1077; &#1080; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1080; FreeCAD.
</p><p>FreeCAD &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1103;&#1077;&#1084; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1086;&#1076;&#1072; <a href="../ru/Python.html" title="Python/ru">Python</a>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1074; <a href="../ru/Python_console.html" class="mw-redirect" title="Python console/ru">&#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1080; Python</a> &#1080;&#1083;&#1080; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1079; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1081; &#1087;&#1088;&#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1077;. &#1069;&#1090;&#1086; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; FreeCAD &#1073;&#1077;&#1079; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1087;&#1077;&#1088;&#1077;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077;:
</p>
<ul><li><b>&#1057;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1102;</b>: &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1081; &#1074;&#1080;&#1076; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;, &#1083;&#1080;&#1073;&#1086; &#1089; &#1085;&#1091;&#1083;&#1103;, &#1083;&#1080;&#1073;&#1086; &#1072;&#1076;&#1072;&#1087;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1074; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1081; &#1090;&#1080;&#1087;.</li>
<li><b>&#1057;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1080; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;</b>: &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1074;&#1072;&#1096;&#1080; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077; &#1085;&#1072;&#1073;&#1086;&#1088;&#1099; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1102;&#1097;&#1080;&#1093; &#1042;&#1072;&#1096; &#1082;&#1086;&#1076; .</li>
<li><b>&#1048;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;</b>: &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1080; &#1087;&#1086;&#1084;&#1077;&#1090;&#1080;&#1090;&#1100; &#1090;&#1091;&#1076;&#1072; &#1074;&#1072;&#1096;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1086;&#1082;&#1085;&#1072;, &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1083;&#1080; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1099; &#1076;&#1083;&#1103; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; &#1089; &#1074;&#1072;&#1096;&#1080;&#1084;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080;.</li>
<li><b>&#1048;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074; &#1075;&#1088;&#1072;&#1092;&#1077; &#1089;&#1094;&#1077;&#1085;&#1099;</b>: &#1042; FreeCAD &#1077;&#1089;&#1090;&#1100; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1074; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1103; &#1080; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080; &#1080; &#1086;&#1090;&#1088;&#1080;&#1089;&#1086;&#1074;&#1082;&#1080; &#1101;&#1090;&#1086;&#1081; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080; &#1085;&#1072; &#1074;&#1072;&#1096;&#1077;&#1084; &#1101;&#1082;&#1088;&#1072;&#1085;&#1077;. &#1059; &#1042;&#1072;&#1089; &#1077;&#1089;&#1090;&#1100; &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1091; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1075;&#1086; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085;&#1077;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;, &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089; &#1085;&#1080;&#1084;, &#1080;&#1083;&#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1082; &#1085;&#1080;&#1084; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1077; &#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;.</li></ul>
<p>&#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1090;&#1072;&#1082; &#1078;&#1077; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1077; &#1101;&#1082;&#1088;&#1072;&#1085;&#1085;&#1099;&#1077; &#1074;&#1080;&#1076;&#1078;&#1077;&#1090;&#1099;, &#1082;&#1072;&#1082; &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1077;, &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1090;&#1077;&#1083;&#1080; (draggers), &#1103;&#1082;&#1086;&#1088;&#1103; (&#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1080;) &#1080;&#1083;&#1080; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; (&#1076;&#1083;&#1103; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;&#1075;&#1086; &#1087;&#1088;&#1077;&#1076;&#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1072; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080;).
</p><p>&#1045;&#1089;&#1083;&#1080; &#1042;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1082;&#1086;&#1085;&#1090;&#1077;&#1085;&#1090; &#1085;&#1072; &#1101;&#1090;&#1080; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;, &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1080;&#1090;&#1077; &#1072;&#1082;&#1082;&#1072;&#1091;&#1085;&#1090; &#1085;&#1072; wiki &#1089; &#1087;&#1088;&#1072;&#1074;&#1086;&#1084; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?f=21&amp;t=6830">&#1085;&#1072; &#1092;&#1086;&#1088;&#1091;&#1084;&#1077;</a>, &#1080;&#1079;&#1091;&#1095;&#1080;&#1090;&#1077; <a href="../ru/WikiPages.html" title="WikiPages/ru">WikiPages</a> &#1085;&#1072;&#1089;&#1095;&#1105;&#1090; &#1086;&#1073;&#1097;&#1080;&#1093; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1072;&#1094;&#1080;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1042;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1100;. &#1054;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1087;&#1088;&#1086;&#1095;&#1080;&#1093; &#1087;&#1091;&#1090;&#1077;&#1081; &#1074;&#1085;&#1077;&#1089;&#1090;&#1080; &#1074;&#1082;&#1083;&#1072;&#1076; &#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; <a href="../ru/Help_FreeCAD.html" title="Help FreeCAD/ru">&#1086; &#1090;&#1086;&#1084; &#1082;&#1072;&#1082; &#1087;&#1086;&#1084;&#1086;&#1095;&#1100; FreeCAD</a>.
</p><p><span id="Customizing_FreeCAD"></span>
</p>
<h2><span id=".D0.9D.D0.B0.D1.81.D1.82.D1.80.D0.BE.D0.B9.D0.BA.D0.B0_FreeCAD"></span><span class="mw-headline" id="&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072;_FreeCAD">&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072; FreeCAD</span></h2>
<ul><li><a href="../ru/Interface_Customization.html" title="Interface Customization/ru">&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072; &#1048;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072;</a>: &#1053;&#1072;&#1095;&#1080;&#1085;&#1072;&#1103; &#1089; &#1085;&#1072;&#1095;&#1072;&#1083;&#1072;: &#1055;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1080; &#1103;&#1088;&#1083;&#1099;&#1082;&#1080;</li>
<li><a href="../ru/Macros.html" title="Macros/ru">&#1056;&#1072;&#1073;&#1086;&#1090;&#1072; &#1089; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1072;&#1084;&#1080;</a>: &#1051;&#1077;&#1075;&#1082;&#1072;&#1103; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1095;&#1072;&#1089;&#1090;&#1086; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1103;&#1102;&#1097;&#1080;&#1093;&#1089;&#1103; &#1079;&#1072;&#1076;&#1072;&#1095; &#1080;&#1083;&#1080; python &#1082;&#1086;&#1076;&#1072;</li>
<li><a href="../ru/Macros_recipes.html" title="Macros recipes/ru">&#1056;&#1077;&#1094;&#1077;&#1087;&#1090;&#1099; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1086;&#1074;</a></li>
<li><a href="../ru/Customize_Toolbars.html" title="Customize Toolbars/ru">&#1050;&#1072;&#1089;&#1090;&#1086;&#1084;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; &#1087;&#1072;&#1085;&#1077;&#1083;&#1077;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;</a></li>
<li><a href="../ru/Installing_more_workbenches.html" title="Installing more workbenches/ru">&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1086;&#1074;</a></li></ul>
<p><span id="Scripting_in_FreeCAD"></span>
</p>
<h2><span id=".D0.9D.D0.B0.D0.BF.D0.B8.D1.81.D0.B0.D0.BD.D0.B8.D0.B5_.D1.81.D1.86.D0.B5.D0.BD.D0.B0.D1.80.D0.B8.D0.B5.D0.B2_FreeCAD"></span><span class="mw-headline" id="&#1053;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;_&#1089;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1077;&#1074;_FreeCAD">&#1053;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1089;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1077;&#1074; FreeCAD</span></h2>
<p><span id="General"></span>
</p>
<h3><span id=".D0.9E.D1.81.D0.BD.D0.BE.D0.B2.D1.8B"></span><span class="mw-headline" id="&#1054;&#1089;&#1085;&#1086;&#1074;&#1099;">&#1054;&#1089;&#1085;&#1086;&#1074;&#1099;</span></h3>
<div class="mw-translate-fuzzy">
<ul><li><a href="../ru/Introduction_to_Python.html" title="Introduction to Python/ru">&#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; &#1074; Python</a>- &#1057;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; &#1090;&#1072;&#1082;&#1078;&#1077; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1072; &#1087;&#1086; Python &#1074; &#1085;&#1080;&#1078;&#1085;&#1077;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080; &#1101;&#1090;&#1086;&#1081; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;</li>
<li><a href="../Python_scripting_tutorial.html" title="Python scripting tutorial">&#1059;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1074; FreeCAD</a> - &#1054;&#1073;&#1097;&#1080;&#1081; &#1074;&#1079;&#1075;&#1083;&#1103;&#1076; &#1085;&#1072; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1074; &#1085;&#1072; python &#1074;  FreeCAD</li>
<li><a href="../ru/FreeCAD_Scripting_Basics.html" title="FreeCAD Scripting Basics/ru">&#1054;&#1089;&#1085;&#1086;&#1074;&#1099; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1089;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1077;&#1074; &#1076;&#1083;&#1103; FreeCAD</a>: &#1063;&#1090;&#1086; &#1089;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;, &#1086;&#1089;&#1085;&#1086;&#1074;&#1099; ...</li>
<li><a href="../ru/Gui_Command.html" title="Gui Command/ru">&#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072;</a>&nbsp;: &#1044;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1093; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1074; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;</li>
<li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089;&#1084;&#1077;&#1096;&#1072;&#1085;&#1085;&#1099;&#1093; <a href="../ru/Units.html" title="Units/ru">&#1045;&#1076;&#1080;&#1085;&#1080;&#1094; &#1080;&#1079;&#1084;&#1077;&#1088;&#1077;&#1085;&#1080;&#1103;</a> &#1074; FreeCAD</li>
<li><a href="../ru/Profiling.html" title="Profiling/ru">&#1055;&#1088;&#1086;&#1092;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;</a> &#1082;&#1086;&#1076;&#1072; Python</li></ul>
</div>
<p><span id="Modules"></span>
</p>
<h3><span id=".D0.9C.D0.BE.D0.B4.D1.83.D0.BB.D0.B8"></span><span class="mw-headline" id="&#1052;&#1086;&#1076;&#1091;&#1083;&#1080;">&#1052;&#1086;&#1076;&#1091;&#1083;&#1080;</span></h3>
<p>&#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; FreeCAD &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1072; &#1084;&#1077;&#1078;&#1076;&#1091; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103;&#1084;&#1080;, &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1097;&#1080;&#1084;&#1080; &#1089;&#1086; &#1089;&#1074;&#1086;&#1080;&#1084;&#1080; &#1090;&#1080;&#1087;&#1072;&#1084;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;. &#1059; FreeCAD&#1072; &#1077;&#1089;&#1090;&#1100; &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1099;&#1077; &#1084;&#1086;&#1076;&#1091;&#1083;&#1080; &#1080; &#1084;&#1086;&#1076;&#1091;&#1083;&#1080; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1103; (plug-ins). &#1050;&#1086;&#1075;&#1076;&#1072; &#1084;&#1086;&#1076;&#1091;&#1083;&#1080; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1081; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1099;, &#1086;&#1085;&#1080; &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1103;&#1090;&#1089;&#1103; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099; &#1074;&#1072;&#1084; &#1082;&#1072;&#1082; &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1099;&#1077; &#1084;&#1086;&#1076;&#1091;&#1083;&#1080;. &#1054;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1077; &#1085;&#1080;&#1078;&#1077; &#1084;&#1086;&#1076;&#1091;&#1083;&#1080; &#1084;&#1086;&#1076;&#1091;&#1083;&#1080; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;, &#1074;&#1082;&#1083;&#1102;&#1095;&#1105;&#1085;&#1085;&#1099;&#1077; &#1074; &#1083;&#1102;&#1073;&#1091;&#1102; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1091; FreeCAD.
</p>
<ul><li><a href="../ru/Builtin_modules.html" title="Builtin modules/ru">&#1042;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1099;&#1077; &#1084;&#1086;&#1076;&#1091;&#1083;&#1080;</a> &#1101;&#1090;&#1086; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1084;&#1086;&#1076;&#1091;&#1083;&#1080; FreeCAD. &#1054;&#1085;&#1080; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1076;&#1083;&#1103; &#1084;&#1072;&#1085;&#1080;&#1087;&#1091;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1086;&#1073;&#1097;&#1080;&#1084;&#1080; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1103;&#1084;&#1080; FreeCAD, &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080; &#1080; &#1080;&#1093; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1099;&#1084;.</li>
<li><a href="../ru/Workbench_creation.html" title="Workbench creation/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1086;&#1074;</a> &#1087;&#1086;&#1082;&#1072;&#1078;&#1077;&#1090; &#1042;&#1072;&#1084; &#1082;&#1072;&#1082; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1093; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;.</li></ul>
<p><span id="Working_with_Meshes"></span>
</p>
<h4><span id=".D0.A0.D0.B0.D0.B1.D0.BE.D1.82.D0.B0_.D1.81_.D0.BF.D0.BE.D0.BB.D0.B8.D0.B3.D0.BE.D0.BD.D0.B0.D0.BB.D1.8C.D0.BD.D1.8B.D0.BC.D0.B8_.D1.81.D0.B5.D1.82.D0.BA.D0.B0.D0.BC.D0.B8"></span><span class="mw-headline" id="&#1056;&#1072;&#1073;&#1086;&#1090;&#1072;_&#1089;_&#1087;&#1086;&#1083;&#1080;&#1075;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080;_&#1089;&#1077;&#1090;&#1082;&#1072;&#1084;&#1080;">&#1056;&#1072;&#1073;&#1086;&#1090;&#1072; &#1089; &#1087;&#1086;&#1083;&#1080;&#1075;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080; &#1089;&#1077;&#1090;&#1082;&#1072;&#1084;&#1080;</span></h4>
<ul><li><a href="../ru/Mesh_Scripting.html" title="Mesh Scripting/ru">&#1053;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1089;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1077;&#1074; &#1076;&#1083;&#1103; Mesh</a>: &#1050;&#1072;&#1082; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089; <a href="../ru/Mesh_Workbench.html" title="Mesh Workbench/ru">&#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1084; Mesh</a></li></ul>
<p><span id="Working_with_Parts"></span>
</p>
<h4><span id=".D0.A0.D0.B0.D0.B1.D0.BE.D1.82.D0.B0_.D1.81_Parts"></span><span class="mw-headline" id="&#1056;&#1072;&#1073;&#1086;&#1090;&#1072;_&#1089;_Parts">&#1056;&#1072;&#1073;&#1086;&#1090;&#1072; &#1089; Parts</span></h4>
<div class="mw-translate-fuzzy">
<ul><li><a href="../ru/Part_Workbench.html" title="Part Workbench/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; &#1044;&#1077;&#1090;&#1072;&#1083;&#1100;</a>: &#1050;&#1072;&#1082; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1080; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1099; <a rel="nofollow" class="external text" href="http://en.wikipedia.org/wiki/Open_CASCADE">OpenCasCade</a> &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1074; FreeCAD</li>
<li><a href="../ru/Topological_data_scripting.html" title="Topological data scripting/ru">&#1057;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1080; &#1076;&#1083;&#1103; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1090;&#1086;&#1087;&#1086;&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;</a>: &#1050;&#1072;&#1082; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1084; Part</li>
<li><a href="../ru/PythonOCC.html" title="PythonOCC/ru">PythonOCC</a>: &#1050;&#1072;&#1082; &#1088;&#1072;&#1089;&#1082;&#1088;&#1099;&#1090;&#1100; &#1074;&#1089;&#1102; &#1084;&#1086;&#1097;&#1100; OpenCasCade</li>
<li><a href="../ru/Mesh_to_Part.html" title="Mesh to Part/ru">Mesh to Part</a>: &#1055;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1084;&#1077;&#1078;&#1076;&#1091; &#1090;&#1080;&#1087;&#1072;&#1084;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;</li></ul>
</div>
<p><span id="Accessing_the_Coin_scenegraph"></span>
</p>
<h4><span id=".D0.9F.D0.BE.D0.BB.D1.83.D1.87.D0.B5.D0.BD.D0.B8.D0.B5_.D0.B4.D0.BE.D1.81.D1.82.D1.83.D0.BF.D0.B0_.D0.BA_.D0.B2.D0.B8.D0.B7.D1.83.D0.B0.D0.BB.D0.B8.D0.B7.D0.B0.D1.82.D0.BE.D1.80.D1.83_.D1.81.D1.86.D0.B5.D0.BD_-_Coin"></span><span class="mw-headline" id="&#1055;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077;_&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072;_&#1082;_&#1074;&#1080;&#1079;&#1091;&#1072;&#1083;&#1080;&#1079;&#1072;&#1090;&#1086;&#1088;&#1091;_&#1089;&#1094;&#1077;&#1085;_-_Coin">&#1055;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1082; &#1074;&#1080;&#1079;&#1091;&#1072;&#1083;&#1080;&#1079;&#1072;&#1090;&#1086;&#1088;&#1091; &#1089;&#1094;&#1077;&#1085; - Coin</span></h4>
<ul><li><a href="../ru/Scenegraph.html" title="Scenegraph/ru">The Coin/Inventor scenegraph</a>: &#1050;&#1072;&#1082; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1089;&#1094;&#1077;&#1085; &#1074; FreeCAD</li>
<li><a href="../ru/Pivy.html" title="Pivy/ru">Pivy</a>: &#1050;&#1072;&#1082; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1089;&#1094;&#1077;&#1085;&#1099;</li></ul>
<p><span id="Controlling_the_Qt_interface"></span>
</p>
<h3><span id=".D0.A3.D0.BF.D1.80.D0.B0.D0.B2.D0.BB.D0.B5.D0.BD.D0.B8.D0.B5_Qt_.D0.B8.D0.BD.D1.82.D0.B5.D1.80.D1.84.D0.B5.D0.B9.D1.81.D0.BE.D0.BC"></span><span class="mw-headline" id="&#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;_Qt_&#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1086;&#1084;">&#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; Qt &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1086;&#1084;</span></h3>
<ul><li><a href="../ru/PySide.html" title="PySide/ru">PySide</a>: &#1050;&#1072;&#1082; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1091; &#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</li>
<li><a href="../ru/Embedding_FreeCADGui.html" title="Embedding FreeCADGui/ru">&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; FreeCAD GUI</a> &#1074; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; Qt &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1093; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; PyQt</li></ul>
<p><span id="Working_with_parametric_objects"></span>
</p>
<h3><span id=".D0.A0.D0.B0.D0.B1.D0.BE.D1.82.D0.B0_.D1.81_.D0.BF.D0.B0.D1.80.D0.B0.D0.BC.D0.B5.D1.82.D1.80.D0.B8.D1.87.D0.B5.D1.81.D0.BA.D0.B8.D0.BC.D0.B8_.D0.BE.D0.B1.D1.8A.D0.B5.D0.BA.D1.82.D0.B0.D0.BC.D0.B8"></span><span class="mw-headline" id="&#1056;&#1072;&#1073;&#1086;&#1090;&#1072;_&#1089;_&#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;&#1080;_&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084;&#1080;">&#1056;&#1072;&#1073;&#1086;&#1090;&#1072; &#1089; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084;&#1080;</span></h3>
<div class="mw-translate-fuzzy">
<ul><li><a href="../ru/Scripted_objects.html" title="Scripted objects/ru">&#1057;&#1094;&#1077;&#1085;&#1072;&#1088;&#1085;&#1099;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;</a>: &#1050;&#1072;&#1082; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1085;&#1072; 100% &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084;&#1099;&#1077; &#1089;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1103;&#1084;&#1080; &#1085;&#1072; python &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1074; FreeCAD
<ul><li><a href="../ru/Scripted_objects_with_attachment.html" title="Scripted objects with attachment/ru">Scripted objects with attachment</a>:&#1050;&#1072;&#1082; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1074;&#1099;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1087;&#1088;&#1080;&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1103;&#1077;&#1084;&#1099;&#1084;&#1080; &#1082; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084; &#1074; FreeCAD</li>
<li><a href="../ru/Scripted_objects_saving_attributes.html" title="Scripted objects saving attributes/ru">Scripted objects saving attributes</a>: &#1082;&#1072;&#1082; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1080; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1087;&#1088;&#1086;&#1084;&#1077;&#1078;&#1091;&#1090;&#1086;&#1095;&#1085;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1089; <code>__getstate__</code> &#1080; <code>__setstate__</code>.</li>
<li><a href="../ru/Scripted_objects_migration.html" title="Scripted objects migration/ru">Scripted objects migration</a>: &#1082;&#1072;&#1082; &#1084;&#1080;&#1075;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1090;&#1072;&#1088;&#1099;&#1077; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1074;&#1099;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1085;&#1072; &#1085;&#1086;&#1074;&#1099;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099;.</li></ul></li></ul>
</div>
<p><span id="Examples"></span>
</p>
<h3><span id=".D0.9F.D1.80.D0.B8.D0.BC.D0.B5.D1.80.D1.8B"></span><span class="mw-headline" id="&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099;">&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099;</span></h3>
<ul><li><a href="../ru/Code_snippets.html" title="Code snippets/ru">&#1060;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1099; &#1082;&#1086;&#1076;&#1072;</a>: &#1050;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1103; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; FreeCAD python &#1082;&#1086;&#1076;&#1072;, &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1080;&#1085;&#1075;&#1088;&#1077;&#1076;&#1080;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074;&#1072;&#1096;&#1080;&#1093; &#1089;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1077;&#1074;...</li>
<li><a href="../ru/Line_drawing_function.html" title="Line drawing function/ru">&#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1086;&#1090;&#1088;&#1080;&#1089;&#1086;&#1074;&#1082;&#1080; &#1083;&#1080;&#1085;&#1080;&#1080;</a>: &#1050;&#1072;&#1082; &#1089;&#1086;&#1073;&#1088;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1076;&#1083;&#1103; &#1086;&#1090;&#1088;&#1080;&#1089;&#1086;&#1074;&#1082;&#1080; &#1083;&#1080;&#1085;&#1080;&#1081;</li>
<li><a href="../ru/Dialog_creation.html" title="Dialog creation/ru">&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1072;</a>: &#1050;&#1072;&#1082; &#1089;&#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075; &#1074; Qt designer, &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1074; FreeCAD</li>
<li><a href="../ru/Embedding_FreeCAD.html" title="Embedding FreeCAD/ru">&#1042;&#1089;&#1090;&#1088;&#1072;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; FreeCAD</a>: &#1050;&#1072;&#1082; &#1080;&#1084;&#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; FreeCAD &#1074; &#1074;&#1080;&#1076;&#1077; python &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; &#1074; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;</li>
<li><a href="../ru/Draft_Workbench.html" title="Draft Workbench/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; &#1095;&#1077;&#1088;&#1095;&#1077;&#1085;&#1080;&#1103;</a>&#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; 2d &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074; freecad. &#1054;&#1085; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085; &#1085;&#1072; python, &#1090;&#1072;&#1082; &#1095;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1093;&#1086;&#1088;&#1086;&#1096;&#1080;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1086;&#1084; &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1074;&#1072;&#1096;&#1080; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077; &#1084;&#1086;&#1076;&#1091;&#1083;&#1080;.</li>
<li><a href="../ru/FreeCAD_vector_math_library.html" title="FreeCAD vector math library/ru">&#1042;&#1077;&#1082;&#1090;&#1086;&#1088;&#1085;&#1072;&#1103; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; FreeCAD</a>: &#1055;&#1072;&#1088;&#1072; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1099;&#1093; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1081; &#1076;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; &#1074;&#1077;&#1082;&#1090;&#1086;&#1088;&#1072;&#1084;&#1080; &#1074; FreeCAD. &#1069;&#1090;&#1072; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1072; &#1074; &#1063;&#1077;&#1088;&#1090;&#1077;&#1078;&#1085;&#1099;&#1081; &#1052;&#1086;&#1076;&#1091;&#1083;&#1100;.</li></ul>
<p><span id="API_Functions"></span>
</p>
<h2><span id=".D0.A4.D1.83.D0.BD.D0.BA.D1.86.D0.B8.D0.B8_API"></span><span class="mw-headline" id="&#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;_API">&#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; API</span></h2>
<p>&#1055;&#1086;&#1083;&#1085;&#1086;&#1077; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; API &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1081;&#1090;&#1080; &#1074; <a rel="nofollow" class="external free" href="http://www.freecad.org/api/">http://www.freecad.org/api/</a> . &#1054;&#1085; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1099;&#1081; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089; &#1082;&#1072;&#1082; &#1085;&#1072; C++, &#1090;&#1072;&#1082; &#1080; &#1085;&#1072; Python, &#1080; &#1087;&#1086;&#1082;&#1072; &#1085;&#1077; &#1089;&#1086;&#1074;&#1089;&#1077;&#1084; &#1093;&#1086;&#1088;&#1086;&#1096;&#1086; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;, &#1095;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1084;&#1077;&#1096;&#1072;&#1090;&#1100; &#1087;&#1088;&#1080; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077; &#1082;&#1086;&#1076;&#1072; Python. &#1041;&#1086;&#1083;&#1077;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1072;&#1103; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1072; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072; <a href="../ru/Category;API.html" title="Category:API/ru">&#1079;&#1076;&#1077;&#1089;&#1100;</a>.  &#1047;&#1072;&#1084;&#1077;&#1090;&#1080;&#1084; &#1095;&#1090;&#1086; &#1086;&#1085; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1085;&#1077;&#1087;&#1086;&#1083;&#1085;&#1099;&#1084;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102;. &#1044;&#1083;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1073;&#1086;&#1083;&#1077;&#1077; &#1090;&#1086;&#1095;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;, &#1087;&#1088;&#1086;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1081;&#1090;&#1077; &#1084;&#1086;&#1076;&#1091;&#1083;&#1080; &#1085;&#1072;&#1087;&#1088;&#1103;&#1084;&#1091;&#1102; &#1080;&#1079; &#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1080; Python FreeCAD&#1072;.
</p><p>&#1057;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1086;&#1077;: <a href="../ru/Exposing_C%2B%2B_to_Python.html" class="mw-redirect" title="Exposing C++ to Python/ru">&#1055;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; C++ &#1074; Python</a>
</p><p><span id="Advanced_modification"></span>
</p>
<h2><span id=".D0.9F.D1.80.D0.BE.D0.B4.D0.B2.D0.B8.D0.BD.D1.83.D1.82.D1.8B.D0.B5_.D0.BC.D0.BE.D0.B4.D0.B8.D1.84.D0.B8.D0.BA.D0.B0.D1.86.D0.B8.D0.B8"></span><span class="mw-headline" id="&#1055;&#1088;&#1086;&#1076;&#1074;&#1080;&#1085;&#1091;&#1090;&#1099;&#1077;_&#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080;">&#1055;&#1088;&#1086;&#1076;&#1074;&#1080;&#1085;&#1091;&#1090;&#1099;&#1077; &#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080;</span></h2>
<ul><li><a href="../ru/Start_up_and_Configuration.html" title="Start up and Configuration/ru">&#1047;&#1072;&#1087;&#1091;&#1089;&#1082; &#1080; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072;</a>: &#1047;&#1072;&#1087;&#1091;&#1089;&#1082; &#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;</li>
<li><a href="../ru/Installing_on_Windows.html" title="Installing on Windows/ru">&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1074; Windows</a>: &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1097;&#1080;&#1082;&#1072; windows</li>
<li><a href="../ru/Compile_on_Windows.html" title="Compile on Windows/ru">&#1050;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1103; FreeCAD &#1074; Windows</a> &#1080; <a href="../ru/Compile_on_Linux.html" title="Compile on Linux/ru">&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1103; FreeCAD &#1074; Linux</a></li>
<li><a href="../ru/Branding.html" title="Branding/ru">&#1052;&#1072;&#1088;&#1082;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;</a>: &#1055;&#1088;&#1086;&#1089;&#1090;&#1099;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1089; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084;&#1080; &#1082;&#1086;&#1076;&#1072;&#1084;&#1080; &#1076;&#1083;&#1103; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1072;&#1089;&#1087;&#1077;&#1082;&#1090;&#1086;&#1074; FreeCAD</li>
<li><a href="../ru/Extra_python_modules.html" title="Extra python modules/ru">&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1084;&#1086;&#1076;&#1091;&#1083;&#1080; Python</a>&nbsp;: &#1056;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077; &#1080;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1077;&#1090;&#1072;&#1090;&#1086;&#1088;&#1072; python &#1074; FreeCAD &#1101;&#1090;&#1080;&#1084;&#1080; &#1084;&#1086;&#1097;&#1085;&#1099;&#1084;&#1080; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103;&#1084;&#1080;!</li></ul>
<p><span id="Python_tutorials"></span>
</p>
<h2><span id=".D0.A3.D1.87.D0.B5.D0.B1.D0.BD.D0.B8.D0.BA.D0.B8_.D0.BF.D0.BE_Python"></span><span class="mw-headline" id="&#1059;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082;&#1080;_&#1087;&#1086;_Python">&#1059;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082;&#1080; &#1087;&#1086; Python</span></h2>
<p>&#1047;&#1076;&#1077;&#1089;&#1100; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1099; &#1093;&#1086;&#1088;&#1086;&#1096;&#1080;&#1077; &#1086;&#1073;&#1097;&#1080;&#1077; &#1091;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082;&#1080;, &#1073;&#1077;&#1079; &#1089;&#1087;&#1077;&#1094;&#1080;&#1092;&#1080;&#1082;&#1080; FreeCAD, &#1086;&#1085;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1074;&#1072;&#1089; &#1079;&#1072;&#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1086;&#1074;&#1072;&#1090;&#1100;, &#1077;&#1089;&#1083;&#1080; &#1076;&#1083;&#1103; &#1074;&#1072;&#1089; python, &#1101;&#1090;&#1086; &#1095;&#1090;&#1086;-&#1090;&#1086; &#1089;&#1074;&#1086;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1085;&#1086; &#1085;&#1086;&#1074;&#1086;&#1077;.
</p><p><b>Python</b>
</p>
<ul><li><a rel="nofollow" class="external text" href="https://docs.python.org/3/tutorial/index.html">&#1054;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1091;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082; python</a> - &#1074;&#1077;&#1089;&#1100;&#1084;&#1072; &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1091;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082; &#1076;&#1083;&#1103; &#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1089;&#1090;&#1074;&#1072; &#1089; Python</li>
<li><a rel="nofollow" class="external text" href="https://en.wikibooks.org/wiki/Non-Programmer%27s_Tutorial_for_Python_3">&#1059;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082; &#1087;&#1086; python &#1076;&#1083;&#1103; &#1085;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1086;&#1074;</a> - &#1086;&#1090;&#1083;&#1080;&#1095;&#1085;&#1072;&#1103; wiki&#1082;&#1085;&#1080;&#1075;&#1072;</li>
<li><a rel="nofollow" class="external text" href="http://npt.cc.rsu.ru/user/wanderer/ODP/Python_for_Newbies.htm">Python &#1076;&#1083;&#1103; &#1085;&#1086;&#1074;&#1080;&#1095;&#1082;&#1086;&#1074;</a> - &#1086;&#1076;&#1080;&#1085; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081; &#1091;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082;, &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1086;&#1093;&#1074;&#1072;&#1090;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081; &#1086;&#1089;&#1085;&#1086;&#1074;&#1099;</li></ul>
<div class="mw-translate-fuzzy">
<p><b>PySide</b> - &#1050;&#1072;&#1082; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1080; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; FreeCAD Qt UI &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1086;&#1084; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; python
</p>
<ul><li><a rel="nofollow" class="external text" href="http://zetcode.com/gui/pysidetutorial/">PySide tutorial</a>&nbsp;: &#1055;&#1083;&#1072;&#1090;&#1092;&#1086;&#1088;&#1084;&#1086;&#1085;&#1077;&#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1099;&#1081; &#1091;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082;, &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; PySide &#1089; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072;&#1084;&#1080;</li>
<li><a rel="nofollow" class="external text" href="http://www.pythoncentral.io/series/python-pyside-pyqt-tutorial/">PySide/PyQt tutorial</a>&nbsp;: &#1051;&#1077;&#1075;&#1082;&#1080;&#1081; &#1074; &#1095;&#1090;&#1077;&#1085;&#1080;&#1080; &#1091;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082; &#1087;&#1086; PySide &#1080; PyQt, &#1089; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072;&#1084;&#1080;</li>
<li><a rel="nofollow" class="external text" href="http://qt-project.org/wiki/PySideDocumentation">&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; PySide</a>&nbsp;: &#1086;&#1090; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; Qt (&#1086;&#1090; &#1090;&#1077;&#1093;, &#1082;&#1090;&#1086; &#1077;&#1075;&#1086; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1083;)</li>
<li><a rel="nofollow" class="external text" href="http://qt-project.org/wiki/QtCreator_and_PySide">&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; QtCreator &#1074; PySide</a>&nbsp;: &#1090;&#1072;&#1082; &#1078;&#1077; &#1086;&#1090; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; Qt</li>
<li><a rel="nofollow" class="external text" href="http://srinikom.github.io/pyside-docs/index.html">&#1057;&#1087;&#1088;&#1072;&#1074;&#1082;&#1072; &#1087;&#1086; PySide</a>&nbsp;: &#1073;&#1077;&#1089;&#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1099;&#1077; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080; &#1086; minutiae PySide &#1080; Qt, &#1085;&#1072;&#1076;&#1077;&#1078;&#1085;&#1099;&#1081; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082; &#1076;&#1083;&#1103; &#1089;&#1087;&#1088;&#1072;&#1074;&#1082;&#1080;</li>
<li><a rel="nofollow" class="external text" href="http://nullege.com/codes/search?cq=PySide">&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099; &#1082;&#1086;&#1076;&#1072; PySide</a>&nbsp;: &#1073;&#1072;&#1079;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1082;&#1086;&#1076;&#1072; PySide &#1089; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1087;&#1086;&#1080;&#1089;&#1082;&#1072;</li></ul>
</div>
<p>&#1044;&#1072;&#1083;&#1100;&#1085;&#1077;&#1081;&#1096;&#1080;&#1077; &#1076;&#1074;&#1072; &#1089;&#1089;&#1099;&#1083;&#1072;&#1102;&#1090;&#1089;&#1103; &#1085;&#1072; &#1089;&#1087;&#1077;&#1094;&#1080;&#1092;&#1092;&#1080;&#1095;&#1085;&#1099;&#1077; &#1076;&#1083;&#1103; PyQt (&#1085;&#1077; PySide), &#1085;&#1086; &#1084;&#1086;&#1075;&#1091;&#1090; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1080;&#1090;&#1100; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1091;&#1102; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102;:
</p>
<ul><li><a rel="nofollow" class="external text" href="http://www.cs.usfca.edu/~afedosov/qttut/">Basic PyQt tutorial</a>&nbsp;: &#1055;&#1088;&#1086;&#1089;&#1090;&#1086;&#1077; &#1080; &#1082;&#1086;&#1088;&#1086;&#1090;&#1082;&#1086;&#1077;, &#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1077; &#1085;&#1072; linux &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086;, &#1086;&#1073;&#1098;&#1103;&#1089;&#1085;&#1103;&#1102;&#1097;&#1077;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091; &#1089; PyQt &#1080; Qt Designer</li>
<li><a rel="nofollow" class="external text" href="http://vizzzion.org/?id=pyqt">Programming Qt applications in python</a>&nbsp;: &#1041;&#1086;&#1083;&#1077;&#1077; &#1075;&#1083;&#1091;&#1073;&#1086;&#1082;&#1086;&#1077; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086;, &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1102;&#1097;&#1077;&#1077; &#1074;&#1089;&#1077; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1099; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; qt &#1080; python.</li></ul>
<p><b>Pivy</b> - &#1050;&#1072;&#1082; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;  &#1074; 3D &#1089;&#1094;&#1077;&#1085;&#1086;&#1081; FreeCAD&#1072;
</p>
<ul><li><a rel="nofollow" class="external text" href="http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.108.947&amp;rep=rep1&amp;type=pdf">Pivy - Embedding a Dynamic Scripting Language into a Scene Graph Library</a>&nbsp;: &#1058;&#1077;&#1079;&#1080;&#1089;, &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086; &#1086;&#1073;&#1098;&#1103;&#1089;&#1085;&#1103;&#1102;&#1097;&#1080;&#1081; Pivy</li>
<li><a rel="nofollow" class="external text" href="http://ftp.ntua.gr/mirror/python/pycon/dc2004/papers/47/">High Level 3D Graphics Programming in Python</a>&nbsp;: &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099; Pivy &#1080;&#1079; Pycon 2004</li>
<li><a rel="nofollow" class="external text" href="https://www.semanticscholar.org/paper/Integrating-Pivy-into-Studierstube-4.2-Gruber/08c9a89c8326c87f81c2d83428029fbfb6c2ae64">Introducing Pivy into studierstube</a> <a rel="nofollow" class="external text" href="https://www.researchgate.net/publication/228737136_Integrating_Pivy_into_Studierstube_42">(Mirror)</a>&nbsp;:  &#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1085;&#1072; &#1089;&#1072;&#1084;&#1086;&#1084; &#1076;&#1077;&#1083;&#1077; &#1085;&#1077; &#1091;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082;, &#1085;&#1086; &#1087;&#1088;&#1077;&#1082;&#1088;&#1072;&#1089;&#1085;&#1086; &#1080;&#1083;&#1083;&#1102;&#1089;&#1090;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090; &#1082;&#1072;&#1082; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; Pivy (&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090; &#1072;&#1082;&#1072;&#1076;&#1077;&#1084;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1072;&#1082;&#1082;&#1072;&#1091;&#1085;&#1090;)</li></ul>
<p><span id="Community_projects"></span>
</p>
<h2><span id=".D0.9F.D1.80.D0.BE.D0.B5.D0.BA.D1.82.D1.8B_.D1.81.D0.BE.D0.BE.D0.B1.D1.89.D0.B5.D1.81.D1.82.D0.B2.D0.B0"></span><span class="mw-headline" id="&#1055;&#1088;&#1086;&#1077;&#1082;&#1090;&#1099;_&#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1072;">&#1055;&#1088;&#1086;&#1077;&#1082;&#1090;&#1099; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1072;</span></h2>
<p>&#1053;&#1072; <a href="../FreeCAD_Community_Portal.html" title="FreeCAD Community Portal">&#1087;&#1086;&#1088;&#1090;&#1072;&#1083;&#1077; &#1057;&#1086;&#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1072;</a>, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1081;&#1090;&#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1085;&#1072; FreeCAD &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1099; &#1079;&#1072;&#1087;&#1091;&#1097;&#1077;&#1085;&#1085;&#1099;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1084; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; FreeCAD. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1090;&#1077; &#1085;&#1086;&#1074;&#1099;&#1081; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; FreeCAD, &#1091;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1089;&#1100; &#1095;&#1090;&#1086; &#1077;&#1075;&#1086; &#1085;&#1077;&#1090; &#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077;! &#1059; &#1085;&#1072;&#1089; &#1090;&#1072;&#1082;&#1078;&#1077; &#1077;&#1089;&#1090;&#1100; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;, &#1089; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;&#1084; &#1074;&#1077;&#1097;&#1077;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1099; &#1084;&#1086;&#1075;&#1083;&#1080; &#1073;&#1099; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100;, &#1077;&#1089;&#1083;&#1080; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; <a href="../ru/Help_FreeCAD.html" title="Help FreeCAD/ru">&#1055;&#1086;&#1084;&#1086;&#1095;&#1100; FreeCAD</a>.
</p><p><br>
</p>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><span typeof="mw:File"><a href="../index.php?title=Power_user_hub.png&amp;filetimestamp=20200511213015&amp;.html" class="mw-file-description"><img src="../File/Power_user_hub.png" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="128" data-file-height="128"></a></span> <a class="mw-selflink selflink">Power user documentation</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b>FreeCAD scripting:</b> <a href="../ru/Python.html" title="Python/ru">Python</a>, <a href="../ru/Introduction_to_Python.html" title="Introduction to Python/ru">Introduction to Python</a>, <a href="../ru/Python_scripting_tutorial.html" title="Python scripting tutorial/ru">Python scripting tutorial</a>, <a href="../ru/FreeCAD_Scripting_Basics.html" title="FreeCAD Scripting Basics/ru">FreeCAD Scripting Basics</a></li></ul>
<hr>
<ul><li><b>Modules:</b> <a href="../ru/Builtin_modules.html" title="Builtin modules/ru">Builtin modules</a>, <a href="../ru/Units.html" title="Units/ru">Units</a>, <a href="../ru/Quantity.html" title="Quantity/ru">Quantity</a></li>
<li><b>Workbenches:</b> <a href="../ru/Workbench_creation.html" title="Workbench creation/ru">Workbench creation</a>, <a href="../ru/Gui_Command.html" title="Gui Command/ru">Gui Commands</a>, <a href="../ru/Command.html" title="Command/ru">Commands</a>, <a href="../ru/Installing_more_workbenches.html" title="Installing more workbenches/ru">Installing more workbenches</a></li>
<li><b>Meshes and Parts:</b> <a href="../ru/Mesh_Scripting.html" title="Mesh Scripting/ru">Mesh Scripting</a>, <a href="../ru/Topological_data_scripting.html" title="Topological data scripting/ru">Topological data scripting</a>, <a href="../ru/Mesh_to_Part.html" title="Mesh to Part/ru">Mesh to Part</a>, <a href="../ru/PythonOCC.html" title="PythonOCC/ru">PythonOCC</a></li></ul>
<hr>
<ul><li><b>Parametric objects:</b> <a href="../ru/Scripted_objects.html" title="Scripted objects/ru">Scripted objects</a>, <a href="../ru/Viewprovider.html" title="Viewprovider/ru">Viewproviders</a> <small>(<a href="../ru/Custom_icon_in_tree_view.html" title="Custom icon in tree view/ru">Custom icon in tree view</a>)</small></li>
<li><b>Scenegraph:</b> <a href="../ru/Scenegraph.html" title="Scenegraph/ru">Coin (Inventor) scenegraph</a>, <a href="../ru/Pivy.html" title="Pivy/ru">Pivy</a></li>
<li><b>Graphical interface:</b> <a href="../ru/Interface_creation.html" title="Interface creation/ru">Interface creation</a>, <a href="../ru/Dialog_creation.html" title="Dialog creation/ru">Interface creation completely in Python</a> <small>(<a href="../index.php?title=Dialog_creation_with_various_widgets/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation with various widgets/ru (page does not exist)">1</a>, <a href="../index.php?title=Dialog_creation_reading_and_writing_files/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation reading and writing files/ru (page does not exist)">2</a>, <a href="../index.php?title=Dialog_creation_setting_colors/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation setting colors/ru (page does not exist)">3</a>, <a href="../index.php?title=Dialog_creation_image_and_animated_GIF/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation image and animated GIF/ru (page does not exist)">4</a>, <a href="../index.php?title=PySide_usage_snippets/ru&amp;action=edit&amp;redlink=1.html" class="new" title="PySide usage snippets/ru (page does not exist)">5</a>)</small>, <a href="../ru/PySide.html" title="PySide/ru">PySide</a>, PySide examples <a href="../ru/PySide_Beginner_Examples.html" title="PySide Beginner Examples/ru">beginner</a>, <a href="../ru/PySide_Intermediate_Examples.html" title="PySide Intermediate Examples/ru">intermediate</a>, <a href="../ru/PySide_Advanced_Examples.html" title="PySide Advanced Examples/ru">advanced</a></li>
<li><b>Macros:</b> <a href="../ru/Macros.html" title="Macros/ru">Macros</a>, <a href="../ru/How_to_install_macros.html" title="How to install macros/ru">How to install macros</a></li>
<li><b>Embedding:</b> <a href="../ru/Embedding_FreeCAD.html" title="Embedding FreeCAD/ru">Embedding FreeCAD</a>, <a href="../ru/Embedding_FreeCADGui.html" title="Embedding FreeCADGui/ru">Embedding FreeCADGui</a></li></ul>
<hr>
<ul><li><b>Other:</b> <a href="../ru/Expressions.html" title="Expressions/ru">Expressions</a>, <a href="../ru/Code_snippets.html" title="Code snippets/ru">Code snippets</a>, <a href="../ru/Line_drawing_function.html" title="Line drawing function/ru">Line drawing function</a>, <a href="../ru/FreeCAD_vector_math_library.html" title="FreeCAD vector math library/ru">FreeCAD vector math library</a> <small>(deprecated)</small></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="../ru/User_hub.html" title="User hub/ru">User hub</a>, <a class="mw-selflink selflink">Power users hub</a>, <a href="../ru/Developer_hub.html" title="Developer hub/ru">Developer hub</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20251009171158
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.079 seconds
Real time usage: 0.147 seconds
Preprocessor visited node count: 186/1000000
Post&#8208;expand include size: 6307/2097152 bytes
Template argument size: 2179/2097152 bytes
Highest expansion depth: 5/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 3759/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   11.402      1 -total
 49.06%    5.594      1 Template:Powerdocnavi/ru
 28.51%    3.250      2 Template:Incode
 19.25%    2.195      1 Template:TOCright
 14.75%    1.682      1 Template:Navigation_menu_2
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:1206-0!canonical and timestamp 20251009171158 and revision id 1659538. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>