<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Preferences Editor/ru</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="ru" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Preferences+Editor&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../id/Preferences_Editor.html" class="mw-pt-progress mw-pt-progress--low" title="Preferences Editor (8% translated)" lang="id" dir="ltr">Bahasa Indonesia</a></li>
<li><a href="../de/Preferences_Editor.html" class="mw-pt-progress mw-pt-progress--high" title="Voreinstellungseditor (77% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Preferences_Editor.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Preferences Editor (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../tr/Preferences_Editor.html" class="mw-pt-progress mw-pt-progress--low" title="Se&ccedil;enekler Penceresi (5% translated)" lang="tr" dir="ltr">T&uuml;rk&ccedil;e</a></li>
<li><a href="../es/Preferences_Editor.html" class="mw-pt-progress mw-pt-progress--low" title="Editor de preferencias (12% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/Preferences_Editor.html" class="mw-pt-progress mw-pt-progress--complete" title="R&eacute;glage des pr&eacute;f&eacute;rences (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../hr/Preferences_Editor.html" class="mw-pt-progress mw-pt-progress--low" title="Ure&#273;iva&#269; postavki (3% translated)" lang="hr" dir="ltr">hrvatski</a></li>
<li><a href="../it/Preferences_Editor.html" class="mw-pt-progress mw-pt-progress--med" title="Impostare le preferenze (57% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Preferences_Editor.html" class="mw-pt-progress mw-pt-progress--complete" title="Edytor ustawie&#324; (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt/Preferences_Editor.html" class="mw-pt-progress mw-pt-progress--low" title="Editor de prefer&ecirc;ncias (9% translated)" lang="pt" dir="ltr">portugu&ecirc;s</a></li>
<li><a href="../pt-br/Preferences_Editor.html" class="mw-pt-progress mw-pt-progress--med" title="Editor de Prefer&ecirc;ncias (28% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../ro/Preferences_Editor.html" class="mw-pt-progress mw-pt-progress--low" title="Preferences Editor (5% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><a href="../sv/Preferences_Editor.html" class="mw-pt-progress mw-pt-progress--low" title="Preferences Editor (8% translated)" lang="sv" dir="ltr">svenska</a></li>
<li><a href="../cs/Preferences_Editor.html" class="mw-pt-progress mw-pt-progress--low" title="Editor p&#345;edvoleb (8% translated)" lang="cs" dir="ltr">&#269;e&scaron;tina</a></li>
<li><a href="../bg/Preferences_Editor.html" class="mw-pt-progress mw-pt-progress--low" title="&#1052;&#1077;&#1085;&#1102; &#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; (5% translated)" lang="bg" dir="ltr">&#1073;&#1098;&#1083;&#1075;&#1072;&#1088;&#1089;&#1082;&#1080;</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--med" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</span></li>
<li><a href="../uk/Preferences_Editor.html" class="mw-pt-progress mw-pt-progress--low" title="Preferences Editor (1% translated)" lang="uk" dir="ltr">&#1091;&#1082;&#1088;&#1072;&#1111;&#1085;&#1089;&#1100;&#1082;&#1072;</a></li>
<li><a href="../zh/Preferences_Editor.html" class="mw-pt-progress mw-pt-progress--low" title="&#35774;&#32622;&#29992;&#25143;&#39318;&#36873;&#39033; (5% translated)" lang="zh" dir="ltr">&#20013;&#25991;</a></li>
<li><a href="../zh-cn/Preferences_Editor.html" class="mw-pt-progress mw-pt-progress--low" title="&#39318;&#36873;&#39033;&#32534;&#36753;&#22120; (8% translated)" lang="zh-Hans-CN" dir="ltr">&#20013;&#25991;&#65288;&#20013;&#22269;&#22823;&#38470;&#65289;</a></li>
<li><a href="../zh-tw/Preferences_Editor.html" class="mw-pt-progress mw-pt-progress--low" title="Preferences Editor/zh-tw (7% translated)" lang="zh-Hant-TW" dir="ltr">&#20013;&#25991;&#65288;&#33274;&#28771;&#65289;</a></li>
<li><a href="../ja/Preferences_Editor.html" class="mw-pt-progress mw-pt-progress--low" title="Preferences Editor (8% translated)" lang="ja" dir="ltr">&#26085;&#26412;&#35486;</a></li>
<li><a href="../ko/Preferences_Editor.html" class="mw-pt-progress mw-pt-progress--low" title="&#54872;&#44221; &#49444;&#51221; &#54200;&#51665;&#44592;(Preferences Editor) (11% translated)" lang="ko" dir="ltr">&#54620;&#44397;&#50612;</a></li></ul></div>
<div class="docnav">
    <div><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-left.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span> <a href="../ru/Interface_Customization.html" title="Interface Customization/ru">&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072;</a></div>
    <div><a href="../ru/Import_Export_Preferences.html" title="Import Export Preferences/ru">&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1048;&#1084;&#1087;&#1086;&#1088;&#1090;&#1072; &#1069;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1072;</a>
 <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-right.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span></div>
    <div><a href="../ru/Online_Help_Toc.html" title="Online Help Toc/ru">&#1054;&#1075;&#1083;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;</a> <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Online_Help_Toc.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span></div>
</div>
<div style="clear:right; margin-bottom: .5em; float: right; padding: .5em 0 .8em 1.4em; background: none;"><meta property="mw:PageProp/toc"></div>
<p><span id="Introduction"></span>
</p>
<h2><span id=".D0.92.D0.B2.D0.B5.D0.B4.D0.B5.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;">&#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;</span></h2>
<p>&#1044;&#1083;&#1103; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;&#1072; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1086;&#1087;&#1094;&#1080;&#1102; <b>&#1055;&#1088;&#1072;&#1074;&#1082;&#1072; &rarr; &#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;...</b> &#1074; &#1084;&#1077;&#1085;&#1102; &#1080;&#1083;&#1080; (<span style="font-size:small;"><a href="../ru/Release_notes_1.1.html" title="Release notes 1.1/ru">&#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1086; &#1074; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 1.1</a></span>) &#1074;&#1086;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077;&#1089;&#1100; &#1089;&#1086;&#1095;&#1077;&#1090;&#1072;&#1085;&#1080;&#1077;&#1084; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096; <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">Ctrl</span>+<span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">,</span>. &#1053;&#1072; macOS &#1086;&#1087;&#1094;&#1080;&#1103; <b>&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;...</b> &#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074; &#1084;&#1077;&#1085;&#1102; <b>FreeCAD</b> (&#1101;&#1090;&#1086; &#1084;&#1077;&#1089;&#1090;&#1086; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1076;&#1083;&#1103; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082; &#1085;&#1072; Mac).
</p><p>FreeCAD &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1082;&#1086;&#1085;&#1094;&#1077;&#1087;&#1094;&#1080;&#1102; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072;, &#1075;&#1076;&#1077; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; &#1086;&#1090;&#1074;&#1077;&#1095;&#1072;&#1077;&#1090; &#1079;&#1072; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1099;&#1077; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080; &#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;. &#1059; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1089;&#1074;&#1086;&#1080; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;. &#1054;&#1085;&#1080; &#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1074; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;&#1077; &#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082;, &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1074; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1075;&#1088;&#1091;&#1087;&#1087;&#1077;, &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1077;&#1089;&#1083;&#1080; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; &#1073;&#1099;&#1083; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085; &#1074; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1084; &#1089;&#1077;&#1072;&#1085;&#1089;&#1077; FreeCAD. &#1053;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1091; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1099;&#1093; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1086;&#1074; &#1080;&#1084;&#1087;&#1086;&#1088;&#1090;&#1072; &#1080; &#1101;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1072;. &#1045;&#1089;&#1083;&#1080; &#1077;&#1089;&#1090;&#1100; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;, &#1086;&#1085;&#1080; &#1087;&#1086;&#1103;&#1074;&#1103;&#1090;&#1089;&#1103; &#1085;&#1072; &#1086;&#1076;&#1085;&#1086;&#1081; &#1080;&#1083;&#1080; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;&#1093; &#1074; &#1075;&#1088;&#1091;&#1087;&#1087;&#1077; <a href="#Import-Export">&#1048;&#1084;&#1087;&#1086;&#1088;&#1090;-&#1069;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;</a> &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;&#1072; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082;.
</p><p>&#1063;&#1090;&#1086;&#1073;&#1099; &#1089;&#1101;&#1082;&#1086;&#1085;&#1086;&#1084;&#1080;&#1090;&#1100; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1099;, FreeCAD &#1085;&#1077; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1077;&#1090; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1074;&#1089;&#1077; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1077; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;. &#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1091;&#1102; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; &#1074; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077; <a href="#Workbenches"> &#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>. &#1057;&#1087;&#1080;&#1089;&#1086;&#1082; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082;, &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1093; &#1089; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1086;&#1084;, &#1089;&#1084;&#1086;&#1090;&#1088;&#1080; &#1074; <a href="#Workbench_related_preferences"> &#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;, &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089; &#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1086;&#1084;</a>.
</p><p>&#1045;&#1089;&#1083;&#1080; &#1085;&#1080; &#1086;&#1076;&#1080;&#1085; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; &#1085;&#1077; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085;, &#1074; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082; &#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1089;&#1077;&#1084;&#1100; &#1075;&#1088;&#1091;&#1087;&#1087;: <a href="#General">&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077;</a>, <a href="#Display">&#1054;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;</a>, <a href="#Workbenches">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>, <a href="#Python">Python</a>, <a href="#Addon_Manager">&#1052;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1081;</a>, <a href="#Import-Export">&#1048;&#1084;&#1087;&#1086;&#1088;&#1090;-&#1069;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;</a> &#1080; <a href="#Measure">Measure - &#1048;&#1079;&#1084;&#1077;&#1088;&#1077;&#1085;&#1080;&#1103;</a>. &#1055;&#1086;&#1076; &#1085;&#1080;&#1084;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074;&#1089;&#1077; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085;&#1085;&#1099;&#1077; &#1088;&#1072;&#1073;&#1086;&#1095;&#1080;&#1077; &#1089;&#1090;&#1086;&#1083;&#1099; &#1089; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072;&#1084;&#1080;.
</p><p>&#1053;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.4em; padding: 0px 10px 1px 10px; font-weight:normal;color: #202122;">&#1057;&#1073;&#1088;&#1086;&#1089;</span> &#1074; &#1083;&#1077;&#1074;&#1086;&#1084; &#1085;&#1080;&#1078;&#1085;&#1077;&#1084; &#1091;&#1075;&#1083;&#1091; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1072; &#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1086;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1077;&#1090; &#1084;&#1077;&#1085;&#1102; (<span style="font-size:small;"><a href="../ru/Release_notes_1.0.html" title="Release notes 1.0/ru">&#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1086; &#1074; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 1.0</a></span>) &#1089; &#1086;&#1087;&#1094;&#1080;&#1103;&#1084;&#1080; &#1076;&#1083;&#1103; &#1089;&#1073;&#1088;&#1086;&#1089;&#1072; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082; &#1082; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1089;&#1073;&#1088;&#1086;&#1089;&#1080;&#1090;&#1100; &#1090;&#1077;&#1082;&#1091;&#1097;&#1091;&#1102; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091;, &#1090;&#1077;&#1082;&#1091;&#1097;&#1091;&#1102; &#1075;&#1088;&#1091;&#1087;&#1087;&#1091; &#1080;&#1083;&#1080; &#1074;&#1089;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;. &#1042; <span style="font-size:small;color:blue;">0.21 &#1080; &#1085;&#1080;&#1078;&#1077;</span> &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; &#1089;&#1073;&#1088;&#1072;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090; <b>&#1074;&#1089;&#1077;</b> &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;.
</p><p>&#1053;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; <a href="../ru/Std_DlgParameter.html" title="Std DlgParameter/ru">&#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074;</a>. &#1053;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; <a href="../ru/Fine-tuning.html" title="Fine-tuning/ru">&#1058;&#1086;&#1095;&#1085;&#1099;&#1093; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082;</a> &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1099; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1079; &#1085;&#1080;&#1093;.
</p><p>&#1069;&#1090;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1072; &#1076;&#1083;&#1103; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 1.0.
</p><p><span id="General"></span>
</p>
<h2><span id=".D0.9E.D1.81.D0.BD.D0.BE.D0.B2.D0.BD.D1.8B.D0.B5"></span><span class="mw-headline" id="&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077;">&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077;</span></h2>
<p>&#1069;&#1090;&#1072; &#1075;&#1088;&#1091;&#1087;&#1087;&#1072; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082; &#1089;&#1086;&#1089;&#1090;&#1086;&#1080;&#1090; &#1080;&#1079; &#1089;&#1077;&#1084;&#1080; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;: &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077;, &#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;, &#1042;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077;, &#1050;&#1101;&#1096;, &#1054;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1091;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1081;, &#1055;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088; &#1086;&#1090;&#1095;&#1105;&#1090;&#1072; &#1080; &#1057;&#1087;&#1088;&#1072;&#1074;&#1082;&#1072;.
</p><p>&#1042; <span style="font-size:small;color:blue;">0.21 &#1080; &#1085;&#1080;&#1078;&#1077;</span> &#1089;&#1077;&#1076;&#1100;&#1084;&#1072;&#1103; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;, &#1057;&#1087;&#1088;&#1072;&#1074;&#1082;&#1072;, &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1073;&#1099;&#1083;&#1086; <a href="../ru/Std_AddonMgr.html" title="Std AddonMgr/ru">&#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1086;</a> &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD-Help">&#1057;&#1087;&#1088;&#1072;&#1074;&#1082;&#1072;</a>.
</p><p><span id="General"></span>
</p>
<h3><span id=".D0.9E.D1.81.D0.BD.D0.BE.D0.B2.D0.BD.D1.8B.D0.B5_2"></span><span class="mw-headline" id="&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077;_2">&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077;</span></h3>
<p><span typeof="mw:File"><a href="../index.php?title=Preferences_General_Page_General.png&amp;filetimestamp=20240720115445&amp;.html" class="mw-file-description"><img src="../File/Preferences_General_Page_General.png" decoding="async" width="400" height="397" class="mw-file-element" data-file-width="600" data-file-height="595"></a></span>
</p><p>&#1053;&#1072; &#1101;&#1090;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;:
</p>
<table class="wikitable float-right mw-collapsible mw-uncollapsed">
<tbody><tr>
<th style="width: 33%;">&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;
</th>
<th style="width: 66%;">&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;
</th></tr>
<tr>
<td><b>&#1071;&#1079;&#1099;&#1082; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072;</b>
</td>
<td>&#1071;&#1079;&#1099;&#1082; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1075;&#1086; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;.
</td></tr>
<tr>
<td><b>&#1057;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094; &#1080;&#1079;&#1084;&#1077;&#1088;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;</b>
</td>
<td>&#1057;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094; &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;. <span style="font-size:small;"><a href="../ru/Release_notes_1.0.html" title="Release notes 1.0/ru">&#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1086; &#1074; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 1.0</a></span>: &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1076;&#1083;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094; <a href="../ru/Std_ProjectInfo.html" title="Std ProjectInfo/ru"> &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;</a> &#1074; &#1085;&#1086;&#1074;&#1099;&#1093; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1093;. &#1057;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1075;&#1086; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &#1087;&#1077;&#1088;&#1077;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;, &#1077;&#1089;&#1083;&#1080; &#1085;&#1077; &#1086;&#1090;&#1084;&#1077;&#1095;&#1077;&#1085; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;.
</td></tr>
<tr>
<td><b>&#1048;&#1075;&#1085;&#1086;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;</b> <span style="font-size:small;"><a href="../ru/Release_notes_1.0.html" title="Release notes 1.0/ru">&#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1086; &#1074; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 1.0</a></span>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094; &#1080;&#1079;&#1084;&#1077;&#1088;&#1077;&#1085;&#1080;&#1103; &#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077; &#1080;&#1075;&#1085;&#1086;&#1088;&#1080;&#1088;&#1091;&#1102;&#1090;&#1089;&#1103; &#1080; &#1085;&#1077; &#1086;&#1090;&#1084;&#1077;&#1085;&#1103;&#1102;&#1090; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094; &#1080;&#1079;&#1084;&#1077;&#1088;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;.
</td></tr>
<tr>
<td><b>&#1050;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1076;&#1077;&#1089;&#1103;&#1090;&#1080;&#1095;&#1085;&#1099;&#1093; &#1079;&#1085;&#1072;&#1082;&#1086;&#1074;</b>
</td>
<td>&#1050;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1076;&#1077;&#1089;&#1103;&#1090;&#1080;&#1095;&#1085;&#1099;&#1093; &#1079;&#1085;&#1072;&#1082;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1099; &#1076;&#1083;&#1103; &#1095;&#1080;&#1089;&#1077;&#1083; &#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074;.
</td></tr>
<tr>
<td><b>&#1052;&#1080;&#1085;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1076;&#1086;&#1083;&#1103; &#1076;&#1102;&#1081;&#1084;&#1072;</b>
</td>
<td>&#1052;&#1080;&#1085;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1076;&#1088;&#1086;&#1073;&#1100; &#1074; &#1076;&#1102;&#1081;&#1084;&#1072;&#1093;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1072; &#1076;&#1083;&#1103; &#1095;&#1080;&#1089;&#1077;&#1083; &#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074;. &#1044;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094; &#1089; &#1076;&#1088;&#1086;&#1073;&#1085;&#1099;&#1084;&#1080; &#1076;&#1102;&#1081;&#1084;&#1072;&#1084;&#1080;.
</td></tr>
<tr>
<td><b>&#1060;&#1086;&#1088;&#1084;&#1072;&#1090; &#1095;&#1080;&#1089;&#1077;&#1083;</b>
</td>
<td>&#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1095;&#1080;&#1089;&#1083;&#1072;. &#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1099;:
<ul><li><b>&#1054;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1072;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;</b>: &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1077;&#1089;&#1103;&#1090;&#1080;&#1095;&#1085;&#1099;&#1081; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100;, &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1084;&#1099;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1086;&#1081;.</li>
<li><b>&#1042;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1081; &#1103;&#1079;&#1099;&#1082;</b>: &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1077;&#1089;&#1103;&#1090;&#1080;&#1095;&#1085;&#1099;&#1081; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1103;&#1079;&#1099;&#1082;&#1072; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072; FreeCAD.</li>
<li><b>C/POSIX</b>: &#1058;&#1086;&#1095;&#1082;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1076;&#1077;&#1089;&#1103;&#1090;&#1080;&#1095;&#1085;&#1086;&#1075;&#1086; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077;&#1083;&#1103;.</li></ul>
</td></tr>
<tr>
<td><b>&#1047;&#1072;&#1084;&#1077;&#1085;&#1072; &#1076;&#1077;&#1089;&#1103;&#1090;&#1080;&#1095;&#1085;&#1086;&#1075;&#1086; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077;&#1083;&#1103;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1076;&#1077;&#1089;&#1103;&#1090;&#1080;&#1095;&#1085;&#1099;&#1081; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100; &#1094;&#1080;&#1092;&#1088;&#1086;&#1074;&#1086;&#1081; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1099; &#1073;&#1091;&#1076;&#1077;&#1090; &#1079;&#1072;&#1084;&#1077;&#1085;&#1077;&#1085; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077;&#1083;&#1077;&#1084;, &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1086;&#1081; <b> &#1060;&#1086;&#1088;&#1084;&#1072;&#1090; &#1095;&#1080;&#1089;&#1077;&#1083;</b>. <span style="font-size:small;"><a href="../ru/Release_notes_0.21.html" title="Release notes 0.21/ru">&#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1086; &#1074; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 0.21</a></span>: &#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1077;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086;&#1090; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;, &#1090;&#1086; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1076;&#1077;&#1089;&#1103;&#1090;&#1080;&#1095;&#1085;&#1086;&#1075;&#1086; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077;&#1083;&#1103; &#1094;&#1080;&#1092;&#1088;&#1086;&#1074;&#1086;&#1081; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1099; &#1074; <a href="../ru/Python_console.html" class="mw-redirect" title="Python console/ru">&#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1080; Python</a> &#1080; <a href="../Std_DlgMacroExecute.html#Edit/ru" title="Std DlgMacroExecute">&#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;&#1077; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1086;&#1074;</a> &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1077;&#1095;&#1072;&#1090;&#1072;&#1090;&#1100;&#1089;&#1103; &#1090;&#1086;&#1095;&#1082;&#1072;/&#1087;&#1077;&#1088;&#1080;&#1086;&#1076;.
</td></tr>
<tr>
<td><b>&#1058;&#1077;&#1084;&#1072;</b>
</td>
<td>&#1059;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; <a href="../Interface_Customization.html#Themes/ru" title="Interface Customization">&#1090;&#1077;&#1084;&#1091;</a> &#1076;&#1083;&#1103; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1075;&#1086; &#1074;&#1080;&#1076;&#1072; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1075;&#1086; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072;.
</td></tr>
<tr>
<td><b>&#1056;&#1072;&#1079;&#1084;&#1077;&#1088; &#1079;&#1085;&#1072;&#1095;&#1082;&#1086;&#1074; &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1103;&#1093; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;</b>
</td>
<td>&#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1079;&#1085;&#1072;&#1095;&#1082;&#1086;&#1074; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1099;:
<ul><li><b>&#1052;&#1072;&#1083;&#1099;&#1081; (16px)</b></li>
<li><b>&#1057;&#1088;&#1077;&#1076;&#1085;&#1080;&#1081; (24px)</b></li>
<li><b>&#1050;&#1088;&#1091;&#1087;&#1085;&#1099;&#1081; (32px)</b></li>
<li><b>&#1054;&#1095;&#1077;&#1085;&#1100; &#1082;&#1088;&#1091;&#1087;&#1085;&#1099;&#1081; (48px)</b></li></ul>
</td></tr>
<tr>
<td><b>&#1056;&#1077;&#1078;&#1080;&#1084; &#1074;&#1080;&#1076;&#1072; &#1076;&#1077;&#1088;&#1077;&#1074;&#1072; &#1080; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;</b>
</td>
<td>&#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;, &#1082;&#1072;&#1082; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1076;&#1077;&#1088;&#1077;&#1074;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1074; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1084; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1077; (&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1077;&#1088;&#1077;&#1079;&#1072;&#1087;&#1091;&#1089;&#1082;). &#1042;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1099;:
<ul><li><b>&#1050;&#1086;&#1084;&#1073;&#1080;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081;</b>: &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1103;&#1077;&#1090; <a href="../ru/Tree_view.html" class="mw-redirect" title="Tree view/ru">&#1044;&#1077;&#1088;&#1077;&#1074;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;</a> &#1080; <a href="../ru/Property_editor.html" class="mw-redirect" title="Property editor/ru">&#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074;</a> &#1074; &#1086;&#1076;&#1085;&#1091; <a href="../ru/Combo_view.html" class="mw-redirect" title="Combo view/ru">&#1087;&#1072;&#1085;&#1077;&#1083;&#1100;</a>.</li>
<li><b>&#1053;&#1077;&#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1099;&#1081;</b>: &#1056;&#1072;&#1079;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1044;&#1077;&#1088;&#1077;&#1074;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1080; &#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; &#1085;&#1072; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080;.</li></ul>
</td></tr>
<tr>
<td><b>&#1056;&#1072;&#1079;&#1084;&#1077;&#1088; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;</b>
</td>
<td>&#1059;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;, &#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1086; &#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;.
<p>&#1055;&#1086; &#1078;&#1077;&#1083;&#1072;&#1085;&#1080;&#1102; &#1080;&#1079; &#1101;&#1090;&#1086;&#1075;&#1086; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1080;&#1084;&#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; &#1080; &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1101;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077;. &#1057;&#1084;. &#1088;&#1072;&#1079;&#1076;&#1077;&#1083; <a href="../ru/Fine-tuning.html" title="Fine-tuning/ru">&#1058;&#1086;&#1085;&#1082;&#1072;&#1103; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072;</a>.
</p>
</td></tr>
<tr>
<td><b>&#1042;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1092;&#1086;&#1085; &#1080;&#1079; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1103;&#1102;&#1097;&#1077;&#1075;&#1086;&#1089;&#1103; &#1091;&#1079;&#1086;&#1088;&#1072;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1090;&#1086; &#1092;&#1086;&#1085; &#1075;&#1083;&#1072;&#1074;&#1085;&#1086;&#1075;&#1086; &#1086;&#1082;&#1085;&#1072; FreeCAD &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1100; &#1080;&#1079; &#1087;&#1083;&#1080;&#1090;&#1086;&#1082; &#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;: <span typeof="mw:File"><a href="../index.php?title=Background.png&amp;filetimestamp=20131110000302&amp;.html" class="mw-file-description"><img src="../File/Background.png" decoding="async" width="64" height="64" class="mw-file-element" data-file-width="256" data-file-height="256"></a></span>
<p>&#1069;&#1090;&#1086;&#1090; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1077;&#1089;&#1083;&#1080; <b>&#1058;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072; &#1089;&#1090;&#1080;&#1083;&#1077;&#1081;</b> &#1085;&#1077; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1072;.
</p><p>&#1048;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100;, &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1074; &#1087;&#1072;&#1087;&#1082;&#1080; <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">Gui/Images</span> &#1074; &#1087;&#1072;&#1087;&#1082;&#1091;:
</p><p><span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;"><a rel="nofollow" class="external text" href="https://www.howtogeek.com/318177/what-is-the-appdata-folder-in-windows/">%APPDATA%</a>/FreeCAD</span> (&#1074; Windows),
</p><p><span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">$HOME/.FreeCAD</span> (&#1074; Linux) &#1080;&#1083;&#1080;
</p><p><span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">$HOME/Library/Preferences/FreeCAD</span> (&#1074; macOS).
</p><p>&#1055;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1077; &#1092;&#1072;&#1081;&#1083; &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">background.png</span> &#1074; &#1087;&#1072;&#1087;&#1082;&#1091; <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">Images</span> &#1080; &#1089;&#1085;&#1080;&#1084;&#1080;&#1090;&#1077;/&#1086;&#1090;&#1084;&#1077;&#1090;&#1100;&#1090;&#1077; &#1101;&#1090;&#1086;&#1090; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1080;&#1079;&#1084;&#1077;&#1085;&#1105;&#1085;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083;.
</p>
</td></tr>
<tr>
<td><b>&#1042;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; &#1101;&#1082;&#1088;&#1072;&#1085;&#1072; &#1079;&#1072;&#1089;&#1090;&#1072;&#1074;&#1082;&#1080; &#1087;&#1088;&#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1077;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1087;&#1088;&#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1077; FreeCAD &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1072; &#1079;&#1072;&#1089;&#1090;&#1072;&#1074;&#1082;&#1072;.
<p>&#1048;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1079;&#1072;&#1089;&#1090;&#1072;&#1074;&#1082;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100;, &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1074; &#1092;&#1072;&#1081;&#1083; &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">splash_image.png</span> &#1074; &#1087;&#1072;&#1087;&#1082;&#1091; <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">Images</span>, &#1091;&#1078;&#1077; &#1091;&#1087;&#1086;&#1084;&#1103;&#1085;&#1091;&#1090;&#1091;&#1102; &#1074; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077; <b>&#1042;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1092;&#1086;&#1085; &#1080;&#1079; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1103;&#1102;&#1097;&#1077;&#1075;&#1086;&#1089;&#1103; &#1091;&#1079;&#1086;&#1088;&#1072;</b>.
</p>
</td></tr>
<tr>
<td><b>&#1042;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1084;&#1080;&#1075;&#1072;&#1085;&#1080;&#1077; &#1082;&#1091;&#1088;&#1089;&#1086;&#1088;&#1072;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1099;&#1081; &#1082;&#1091;&#1088;&#1089;&#1086;&#1088; &#1074; <a href="../ru/Python_console.html" class="mw-redirect" title="Python console/ru">&#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1080; Python</a> &#1080; <a href="../Std_DlgMacroExecute.html#Edit/ru" title="Std DlgMacroExecute">&#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;&#1077; &#1052;&#1072;&#1082;&#1088;&#1086;&#1089;&#1086;&#1074;</a> &#1073;&#1091;&#1076;&#1077;&#1090; &#1084;&#1080;&#1075;&#1072;&#1090;&#1100;.
</td></tr>
<tr>
<td><b>&#1040;&#1082;&#1090;&#1080;&#1074;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1091; &#1085;&#1072;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;</b> <span style="font-size:small;"><a href="../ru/Release_notes_1.0.html" title="Release notes 1.0/ru">&#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1086; &#1074; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 1.0</a></span>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1087;&#1088;&#1080;&#1089;&#1090;&#1099;&#1082;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1086;&#1082;&#1085;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1090;&#1100; &#1082;&#1072;&#1082; &#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1099;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099;.
</td></tr>
<tr>
<td><b>&#1053;&#1072;&#1073;&#1086;&#1088;&#1099; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082;</b>
</td>
<td>&#1055;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1090; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1077; <a href="../ru/Preference_Packs.html" title="Preference Packs/ru">&#1087;&#1072;&#1082;&#1077;&#1090;&#1099; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082;</a>, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1080;&#1084;&#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;, &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1100;, &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1080;&#1093;.
</td></tr></tbody></table>
<p><span id="Document"></span>
</p>
<h3><span id=".D0.94.D0.BE.D0.BA.D1.83.D0.BC.D0.B5.D0.BD.D1.82"></span><span class="mw-headline" id="&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;">&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;</span></h3>
<p><span typeof="mw:File"><a href="../index.php?title=Preferences_General_Page_Document.png&amp;filetimestamp=20240422195639&amp;.html" class="mw-file-description"><img src="../File/Preferences_General_Page_Document.png" decoding="async" width="400" height="449" class="mw-file-element" data-file-width="600" data-file-height="674"></a></span>
</p><p>&#1053;&#1072; &#1101;&#1090;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;:
</p>
<table class="wikitable float-right mw-collapsible mw-uncollapsed">
<tbody><tr>
<th style="width: 33%;">&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;
</th>
<th style="width: 66%;">&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;
</th></tr>
<tr>
<td><b>&#1057;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1081; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; &#1087;&#1088;&#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1077;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1086;&#1090;&#1084;&#1077;&#1095;&#1077;&#1085;&#1086;, FreeCAD &#1089;&#1086;&#1079;&#1076;&#1072;&#1089;&#1090; &#1085;&#1086;&#1074;&#1099;&#1081; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; &#1087;&#1088;&#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1077;.
</td></tr>
<tr>
<td><b>&#1059;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1089;&#1078;&#1072;&#1090;&#1080;&#1103; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1077;&#1084;&#1086;&#1075;&#1086; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;</b>
</td>
<td>&#1059;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1091;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1089;&#1078;&#1072;&#1090;&#1080;&#1103; &#1076;&#1083;&#1103; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">FCStd</span>. &#1060;&#1072;&#1081;&#1083;&#1099; <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">FCStd</span> &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072;&#1084;&#1080; &#1089; ZIP-&#1089;&#1078;&#1072;&#1090;&#1080;&#1077;&#1084;. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1077;&#1088;&#1077;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1093; &#1089;&#1091;&#1092;&#1092;&#1080;&#1082;&#1089; <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">.FCStd</span> &#1074; <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">.zip</span> &#1080; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1100; &#1080;&#1093; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1072;&#1088;&#1093;&#1080;&#1074;&#1072;&#1094;&#1080;&#1080; ZIP.
</td></tr>
<tr>
<td><b>&#1054;&#1090;&#1084;&#1077;&#1085;&#1099;/&#1055;&#1086;&#1074;&#1090;&#1086;&#1088;&#1099;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1087;&#1091;&#1085;&#1082;&#1090; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;, &#1074;&#1089;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1074; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1093; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1093; &#1084;&#1086;&#1078;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086; &#1086;&#1090;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100;/&#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1080;&#1090;&#1100;.
</td></tr>
<tr>
<td><b>&#1052;&#1072;&#1082;&#1089;&#1080;&#1084;&#1091;&#1084; &#1096;&#1072;&#1075;&#1086;&#1074; &#1086;&#1090;&#1084;&#1077;&#1085;/&#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1086;&#1074;</b>
</td>
<td>&#1059;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;, &#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1096;&#1072;&#1075;&#1086;&#1074; &#1086;&#1090;&#1084;&#1077;&#1085;&#1099;/&#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100; &#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1086;.
</td></tr>
<tr>
<td><b>&#1056;&#1072;&#1079;&#1088;&#1077;&#1096;&#1080;&#1090;&#1100; &#1086;&#1090;&#1084;&#1077;&#1085;&#1091; &#1087;&#1077;&#1088;&#1077;&#1088;&#1072;&#1089;&#1095;&#1105;&#1090;&#1072;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1085;&#1099;&#1077; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1088;&#1077;&#1088;&#1074;&#1072;&#1090;&#1100;, &#1085;&#1072;&#1078;&#1072;&#1074; <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">Esc</span>. &#1069;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1085;&#1077;&#1084;&#1085;&#1086;&#1075;&#1086; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1090;&#1100; &#1074;&#1088;&#1077;&#1084;&#1103; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1085;&#1099;&#1093; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1081;.
</td></tr>
<tr>
<td><b>&#1047;&#1072;&#1087;&#1091;&#1089;&#1082; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1077;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1072;&#1081;&#1083; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085;, FreeCAD &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1092;&#1072;&#1081;&#1083;&#1072; &#1087;&#1088;&#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1077;. &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1092;&#1072;&#1081;&#1083;&#1099; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1099;, &#1077;&#1089;&#1083;&#1080; &#1087;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1105;&#1083; &#1089;&#1073;&#1086;&#1081;.
</td></tr>
<tr>
<td><b>&#1040;&#1074;&#1090;&#1086;&#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077; &#1082;&#1072;&#1078;&#1076;&#1099;&#1077;</b>
</td>
<td>&#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1095;&#1072;&#1089;&#1090;&#1086;&#1090;&#1091; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1092;&#1072;&#1081;&#1083;&#1072; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;.
</td></tr>
<tr>
<td><b>&#1057;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1084;&#1080;&#1085;&#1080;&#1072;&#1090;&#1102;&#1088;&#1091; &#1074; &#1092;&#1072;&#1081;&#1083; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1087;&#1088;&#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1080; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1090;&#1086; &#1087;&#1088;&#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1080; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1072; &#1084;&#1080;&#1085;&#1080;&#1072;&#1090;&#1102;&#1088;&#1072;. &#1052;&#1080;&#1085;&#1080;&#1072;&#1090;&#1102;&#1088;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1085;&#1072; &#1089;&#1090;&#1072;&#1088;&#1090;&#1086;&#1074;&#1086;&#1081; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077;. &#1044;&#1083;&#1103; &#1084;&#1080;&#1085;&#1080;&#1072;&#1090;&#1102;&#1088;&#1099; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; <b>&#1056;&#1072;&#1079;&#1084;&#1077;&#1088;</b> &#1074; &#1076;&#1080;&#1072;&#1087;&#1072;&#1079;&#1086;&#1085;&#1077; &#1086;&#1090; 128&times;128 &#1076;&#1086; 512&times;512 &#1087;&#1080;&#1082;&#1089;&#1077;&#1083;&#1077;&#1081;. &#1054;&#1073;&#1099;&#1095;&#1085;&#1099;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1082;&#1088;&#1072;&#1090;&#1085;&#1099;&#1077; &#1076;&#1074;&#1091;&#1084;: 128, 256, 512.
</td></tr>
<tr>
<td><b>&#1044;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1083;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1074; &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1084;&#1091;&#1102; &#1084;&#1080;&#1085;&#1080;&#1072;&#1090;&#1102;&#1088;&#1091;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1082; &#1084;&#1080;&#1085;&#1080;&#1072;&#1090;&#1102;&#1088;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085; &#1083;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; FreeCAD <span typeof="mw:File"><a href="../index.php?title=Freecad.svg&amp;filetimestamp=20240704193018&amp;.html" class="mw-file-description"><img src="../File/Freecad.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="48" data-file-height="48"></a></span>.
</td></tr>
<tr>
<td><b>&#1052;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1088;&#1077;&#1079;&#1077;&#1088;&#1074;&#1085;&#1099;&#1093; &#1082;&#1086;&#1087;&#1080;&#1081;, &#1087;&#1088;&#1080; &#1087;&#1077;&#1088;&#1077;&#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1080; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1087;&#1088;&#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1080; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &#1073;&#1091;&#1076;&#1091;&#1090; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; &#1088;&#1077;&#1079;&#1077;&#1088;&#1074;&#1085;&#1099;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099;. &#1052;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1077;&#1084;&#1099;&#1093; &#1088;&#1077;&#1079;&#1077;&#1088;&#1074;&#1085;&#1099;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;. &#1056;&#1077;&#1079;&#1077;&#1088;&#1074;&#1085;&#1099;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; - &#1101;&#1090;&#1086; &#1088;&#1072;&#1085;&#1077;&#1077; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1105;&#1085;&#1085;&#1099;&#1077; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;.
</td></tr>
<tr>
<td><b>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1072;&#1090;&#1091; &#1080; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077; FCBak</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1092;&#1072;&#1081;&#1083;&#1099; &#1088;&#1077;&#1079;&#1077;&#1088;&#1074;&#1085;&#1099;&#1093; &#1082;&#1086;&#1087;&#1080;&#1081; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1090; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077; <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">.FCbak</span>, &#1072; &#1080;&#1093; &#1080;&#1084;&#1077;&#1085;&#1072; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1090; &#1089;&#1091;&#1092;&#1092;&#1080;&#1082;&#1089; &#1076;&#1072;&#1090;&#1099; &#1074; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1080; &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084; <b>&#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1086;&#1084; &#1076;&#1072;&#1090;&#1099;</b>. &#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072; &#1076;&#1072;&#1090;&#1099; &#1089;&#1084;&#1086;&#1090;&#1088;&#1080; &#1074; <a rel="nofollow" class="external text" href="https://devhints.io/datetime">&#1064;&#1087;&#1072;&#1088;&#1075;&#1072;&#1083;&#1082;&#1072; &#1087;&#1086; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072;&#1084; &#1076;&#1072;&#1090;&#1099; &#1080; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;</a>.
<p>&#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1092;&#1072;&#1081;&#1083; &#1088;&#1077;&#1079;&#1077;&#1088;&#1074;&#1085;&#1086;&#1081; &#1082;&#1086;&#1087;&#1080;&#1080; &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1090;&#1072;&#1082;&#1086;&#1077; &#1080;&#1084;&#1103; <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">TD-Cube.20200315-215654.FCBak</span>. (&#1086;&#1088;&#1080;&#1075;&#1080;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1080;&#1084;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072; - <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">TD-Cube.FCStd</span>).
</p>
</td></tr>
<tr>
<td><b>&#1056;&#1072;&#1079;&#1088;&#1077;&#1096;&#1080;&#1090;&#1100; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1095;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1082;&#1080; (Label) &#1074; &#1086;&#1076;&#1085;&#1086;&#1084; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1077;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1084;&#1086;&#1075;&#1091;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; &#1086;&#1076;&#1080;&#1085;&#1072;&#1082;&#1086;&#1074;&#1099;&#1077; &#1084;&#1077;&#1090;&#1082;&#1080;.
</td></tr>
<tr>
<td><b>&#1054;&#1090;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077; &#1095;&#1072;&#1089;&#1090;&#1080;&#1095;&#1085;&#1091;&#1102; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1091; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1093; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1072; &#1095;&#1072;&#1089;&#1090;&#1080;&#1095;&#1085;&#1072;&#1103; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1093; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1090;&#1086; &#1087;&#1088;&#1080; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1080;&#1080; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &#1074;&#1084;&#1077;&#1089;&#1090;&#1077; &#1089; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1084; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084; &#1073;&#1091;&#1076;&#1091;&#1090; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1080; &#1080;&#1093; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080;. &#1058;&#1072;&#1082;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;&#1095;&#1085;&#1086; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085;&#1085;&#1099;&#1081; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; &#1085;&#1077;&#1083;&#1100;&#1079;&#1103; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;, &#1076;&#1074;&#1072;&#1078;&#1076;&#1099; &#1097;&#1105;&#1083;&#1082;&#1085;&#1080;&#1090;&#1077; &#1079;&#1085;&#1072;&#1095;&#1086;&#1082; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &#1074; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;. &#1041;&#1086;&#1083;&#1077;&#1077; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086;&#1077; &#1086;&#1073;&#1098;&#1103;&#1089;&#1085;&#1077;&#1085;&#1080;&#1077; &#1101;&#1090;&#1086;&#1081; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1081;&#1090;&#1080; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080; <a rel="nofollow" class="external text" href="https://github.com/realthunder/FreeCAD_assembly3/wiki/Core-Changes#partial-document-loading">Assembly3 (&#1057;&#1073;&#1086;&#1088;&#1082;&#1072;3)</a>.
</td></tr>
<tr>
<td><b>&#1048;&#1084;&#1103; &#1072;&#1074;&#1090;&#1086;&#1088;&#1072;</b>
</td>
<td>&#1042;&#1089;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1077; &#1080;&#1084;&#1103; &#1072;&#1074;&#1090;&#1086;&#1088;&#1072;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1085;&#1077; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1100; &#1101;&#1090;&#1091; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102;, &#1086;&#1089;&#1090;&#1072;&#1074;&#1100;&#1090;&#1077; &#1087;&#1086;&#1083;&#1077; &#1072;&#1074;&#1090;&#1086;&#1088;&#1072; &#1087;&#1091;&#1089;&#1090;&#1099;&#1084;. &#1045;&#1089;&#1083;&#1080; &#1086;&#1090;&#1084;&#1077;&#1095;&#1077;&#1085;&#1072; &#1086;&#1087;&#1094;&#1080;&#1103; <b>&#1059;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1090;&#1100; &#1087;&#1088;&#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1080;</b>, &#1090;&#1086; &#1087;&#1088;&#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1080; &#1092;&#1072;&#1081;&#1083;&#1072; &#1074; &#1087;&#1086;&#1083;&#1077; <b>&#1040;&#1074;&#1090;&#1086;&#1088; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1093; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081;</b> &#1073;&#1091;&#1076;&#1077;&#1090; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1081; &#1072;&#1074;&#1090;&#1086;&#1088;. &#1069;&#1090;&#1086; &#1087;&#1086;&#1083;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1087;&#1091;&#1085;&#1082;&#1090;&#1072; &#1084;&#1077;&#1085;&#1102; <b>&#1060;&#1072;&#1081;&#1083; &rarr; &#1048;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1086; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1077;</b>.
</td></tr>
<tr>
<td><b>&#1050;&#1086;&#1084;&#1087;&#1072;&#1085;&#1080;&#1103;</b>
</td>
<td>&#1042;&#1089;&#1077; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1099;, &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1077; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1072;&#1085;&#1080;&#1080;.
</td></tr>
<tr>
<td><b>&#1051;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1103; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;</b>
</td>
<td>&#1059;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1102; &#1076;&#1083;&#1103; &#1085;&#1086;&#1074;&#1099;&#1093; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1044;&#1083;&#1103; &#1087;&#1088;&#1077;&#1076;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1081; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; <b>URL -&#1072;&#1076;&#1088;&#1077;&#1089; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1080;</b>. &#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; <b>&#1044;&#1088;&#1091;&#1075;&#1086;&#1077;</b> &#1076;&#1083;&#1103; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1081; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1080;.
</td></tr>
<tr>
<td><b>URL &#1072;&#1076;&#1088;&#1077;&#1089; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1080;</b>
</td>
<td>&#1059;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; URL-&#1072;&#1076;&#1088;&#1077;&#1089;, &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1102;, &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1091;&#1102; &#1074; <b>&#1051;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1080; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;</b>.
</td></tr></tbody></table>
<p><span id="Selection"></span>
</p>
<h3><span id=".D0.92.D1.8B.D0.B4.D0.B5.D0.BB.D0.B5.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1042;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077;">&#1042;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077;</span></h3>
<p><span typeof="mw:File"><a href="../index.php?title=Preferences_General_Page_Selection.png&amp;filetimestamp=20250610104409&amp;.html" class="mw-file-description"><img src="../File/Preferences_General_Page_Selection.png" decoding="async" width="400" height="213" class="mw-file-element" data-file-width="686" data-file-height="365"></a></span>
</p><p>&#1053;&#1072; &#1101;&#1090;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;:
</p>
<table class="wikitable float-right mw-collapsible mw-uncollapsed">
<tbody><tr>
<th style="width: 33%;">&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;
</th>
<th style="width: 66%;">&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;
</th></tr>
<tr>
<td><b>&#1042;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1087;&#1088;&#1077;&#1076;&#1074;&#1099;&#1073;&#1086;&#1088;&#1082;&#1091;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085; ,&#1090;&#1086; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1077;&#1076;&#1074;&#1072;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1077; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074; <a href="../ru/3D_view.html" class="mw-redirect" title="3D view/ru">3D &#1074;&#1080;&#1076;&#1077;</a> &#1080; &#1076;&#1083;&#1103; &#1085;&#1077;&#1075;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1081; &#1094;&#1074;&#1077;&#1090;. &#1055;&#1088;&#1077;&#1076;&#1074;&#1072;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1074;&#1099;&#1073;&#1086;&#1088; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1082;&#1088;&#1072;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1073;&#1091;&#1076;&#1091;&#1090; &#1087;&#1086;&#1076;&#1089;&#1074;&#1077;&#1095;&#1080;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1087;&#1088;&#1080; &#1085;&#1072;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1080; &#1085;&#1072; &#1085;&#1080;&#1093; &#1084;&#1099;&#1096;&#1080;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1086;&#1085;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1099;.
</td></tr>
<tr>
<td><b>&#1042;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1074;&#1099;&#1073;&#1086;&#1088;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074; 3D-&#1074;&#1080;&#1076;&#1077; &#1080; &#1076;&#1083;&#1103; &#1085;&#1077;&#1075;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1081; &#1094;&#1074;&#1077;&#1090;. &#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1085;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; <a href="../ru/Tree_view.html" class="mw-redirect" title="Tree view/ru">&#1044;&#1077;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;</a>.
<p>&#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1091; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1087;&#1088;&#1080; &#1085;&#1077; &#1086;&#1090;&#1084;&#1077;&#1095;&#1077;&#1085;&#1085;&#1086;&#1081; &#1086;&#1087;&#1094;&#1080;&#1080;, &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; <span style="font-size:60%; padding-right:0.8em;">&#1042;&#1080;&#1076;</span><b>Selectable - &#1042;&#1099;&#1073;&#1080;&#1088;&#1072;&#1077;&#1084;&#1099;&#1081;</b> &#1073;&#1091;&#1076;&#1077;&#1090; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1086; &#1074; <code>false</code>. &#1055;&#1088;&#1080; &#1090;&#1072;&#1082;&#1086;&#1084; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1080; &#1086;&#1085;&#1080; &#1085;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1099; &#1074; 3D-&#1074;&#1080;&#1076;&#1077;, &#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1101;&#1090;&#1072; &#1086;&#1087;&#1094;&#1080;&#1103; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1084;&#1077;&#1095;&#1077;&#1085;&#1072; &#1089;&#1085;&#1086;&#1074;&#1072;.
</p>
</td></tr>
<tr>
<td><b>&#1059;&#1082;&#1072;&#1078;&#1080;&#1090;&#1077; &#1088;&#1072;&#1076;&#1080;&#1091;&#1089; (&#1087;&#1080;&#1082;&#1089;.)</b>
</td>
<td>&#1059;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1076;&#1083;&#1103; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074; <a href="../ru/3D_view.html" class="mw-redirect" title="3D view/ru">3D &#1074;&#1080;&#1076;&#1077;</a>. &#1041;&#1086;&#1083;&#1100;&#1096;&#1077;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; (&#1074; &#1087;&#1080;&#1082;&#1089;&#1077;&#1083;&#1103;&#1093;) &#1086;&#1073;&#1083;&#1077;&#1075;&#1095;&#1072;&#1077;&#1090; &#1074;&#1099;&#1073;&#1086;&#1088; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1085;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1084; &#1074;&#1099;&#1073;&#1086;&#1088; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1084;&#1077;&#1083;&#1082;&#1080;&#1093; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;.
</td></tr>
<tr>
<td><b>&#1040;&#1074;&#1090;&#1086;&#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; &#1074; 3D-&#1074;&#1080;&#1076;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1080;&#1081; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;</b>
</td>
<td>&#1042;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090; &#1088;&#1077;&#1078;&#1080;&#1084; <a href="../ru/Std_TreeSyncView.html" title="Std TreeSyncView/ru">&#1044;&#1077;&#1088;&#1077;&#1074;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1057;&#1080;&#1085;&#1093;&#1088;&#1086;&#1085;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1080;&#1076;</a>.
</td></tr>
<tr>
<td><b>&#1040;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1088;&#1072;&#1079;&#1074;&#1086;&#1088;&#1072;&#1095;&#1080;&#1074;&#1072;&#1090;&#1100; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1076;&#1077;&#1088;&#1077;&#1074;&#1072; &#1087;&#1088;&#1080; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1080; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1074; 3D-&#1074;&#1080;&#1076;&#1077;</b>
</td>
<td>&#1042;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090; &#1088;&#1077;&#1078;&#1080;&#1084; <a href="../ru/Std_TreeSyncSelection.html" title="Std TreeSyncSelection/ru">&#1044;&#1077;&#1088;&#1077;&#1074;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1057;&#1080;&#1085;&#1093;&#1088;&#1086;&#1085;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077;</a>.
</td></tr>
<tr>
<td><b>&#1042;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1074; 3D &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077; &#1087;&#1088;&#1080; &#1085;&#1072;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1080; &#1082;&#1091;&#1088;&#1089;&#1086;&#1088;&#1072; &#1085;&#1072; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1076;&#1077;&#1088;&#1077;&#1074;&#1072;</b>
</td>
<td>&#1042;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090; <a href="../ru/Std_TreePreSelection.html" title="Std TreePreSelection/ru">&#1056;&#1077;&#1078;&#1080;&#1084; &#1087;&#1088;&#1077;&#1076;&#1074;&#1072;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1074;&#1099;&#1073;&#1086;&#1088;&#1072; &#1074; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;</a>.
</td></tr>
<tr>
<td><b>&#1047;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1090;&#1100; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1076;&#1083;&#1103; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1072; &#1085;&#1072;&#1079;&#1072;&#1076;/&#1074;&#1087;&#1077;&#1088;&#1077;&#1076; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1085;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1080;</b>
</td>
<td>&#1042;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090; &#1088;&#1077;&#1078;&#1080;&#1084; <a href="../ru/Std_TreeRecordSelection.html" title="Std TreeRecordSelection/ru">&#1044;&#1077;&#1088;&#1077;&#1074;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1047;&#1072;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077;</a>.
</td></tr>
<tr>
<td><b>&#1044;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1092;&#1083;&#1072;&#1078;&#1082;&#1080; &#1076;&#1083;&#1103; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1074; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;</b>
</td>
<td>&#1050;&#1072;&#1078;&#1076;&#1099;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; <a href="../ru/Tree_view.html" class="mw-redirect" title="Tree view/ru">&#1044;&#1077;&#1088;&#1077;&#1074;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;</a> &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082;. &#1069;&#1090;&#1086; &#1091;&#1076;&#1086;&#1073;&#1085;&#1086;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1076;&#1083;&#1103; &#1074;&#1099;&#1073;&#1086;&#1088;&#1072; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1085;&#1072; &#1089;&#1077;&#1085;&#1089;&#1086;&#1088;&#1085;&#1086;&#1084; &#1101;&#1082;&#1088;&#1072;&#1085;&#1077;.
</td></tr></tbody></table>
<p><span id="Cache"></span>
</p>
<h3><span id=".D0.9A.D1.8D.D1.88"></span><span class="mw-headline" id="&#1050;&#1101;&#1096;">&#1050;&#1101;&#1096;</span></h3>
<p><span typeof="mw:File"><a href="../index.php?title=Preferences_General_Page_Cache.png&amp;filetimestamp=20240624131811&amp;.html" class="mw-file-description"><img src="../File/Preferences_General_Page_Cache.png" decoding="async" width="400" height="143" class="mw-file-element" data-file-width="600" data-file-height="215"></a></span>
</p><p>&#1069;&#1090;&#1080; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1099; &#1089; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1086;&#1084; &#1082;&#1101;&#1096;&#1072;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; FreeCAD &#1093;&#1088;&#1072;&#1085;&#1080;&#1090; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099;.
</p><p>&#1053;&#1072; &#1101;&#1090;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;:
</p>
<table class="wikitable float-right mw-collapsible mw-uncollapsed">
<tbody><tr>
<th style="width: 33%;">&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;
</th>
<th style="width: 66%;">&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;
</th></tr>
<tr>
<td><b>&#1052;&#1077;&#1089;&#1090;&#1086;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; (&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1095;&#1090;&#1077;&#1085;&#1080;&#1103;)</b>
</td>
<td>&#1055;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1087;&#1091;&#1090;&#1100; &#1082; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1080; &#1082;&#1101;&#1096;&#1072;. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.4em; padding: 0px 10px 1px 10px; font-weight:normal;color: #202122;"><span typeof="mw:File"><a href="../index.php?title=Document-open.svg&amp;filetimestamp=20240704191852&amp;.html" class="mw-file-description"><img src="../File/Document-open.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span></span> &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1072; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1072;.
</td></tr>
<tr>
<td><b>&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1103;&#1090;&#1100; &#1087;&#1077;&#1088;&#1080;&#1086;&#1076;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1087;&#1088;&#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;</b>
</td>
<td>&#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1095;&#1072;&#1089;&#1090;&#1086;&#1090;&#1086;&#1081; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1072;. &#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1099;:
<ul><li><b>&#1042;&#1089;&#1077;&#1075;&#1076;&#1072;</b></li>
<li><b>&#1045;&#1078;&#1077;&#1076;&#1085;&#1077;&#1074;&#1085;&#1086;</b></li>
<li><b>&#1045;&#1078;&#1077;&#1085;&#1077;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086;</b></li>
<li><b>&#1045;&#1078;&#1077;&#1084;&#1077;&#1089;&#1103;&#1095;&#1085;&#1086;</b></li>
<li><b>&#1045;&#1078;&#1077;&#1075;&#1086;&#1076;&#1085;&#1086;</b></li>
<li><b>&#1053;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072;</b></li></ul>
</td></tr>
<tr>
<td><b>&#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072; &#1082;&#1101;&#1096;&#1072;</b>
</td>
<td>&#1059;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1072;. &#1058;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1096;&#1100; &#1091;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1072; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1072; &#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1087;&#1088;&#1077;&#1074;&#1099;&#1089;&#1080;&#1090; &#1101;&#1090;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;. &#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1099;:
<ul><li><b>100 MB</b></li>
<li><b>300 MB</b></li>
<li><b>500 MB</b></li>
<li><b>1 GB</b></li>
<li><b>2 GB</b></li>
<li><b>3 GB</b></li></ul>
</td></tr>
<tr>
<td><b>&#1058;&#1077;&#1082;&#1091;&#1097;&#1080;&#1081; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1082;&#1101;&#1096;&#1072;</b>
</td>
<td>&#1055;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1081; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1072;, &#1077;&#1089;&#1083;&#1080; &#1086;&#1085; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085;. &#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.4em; padding: 0px 10px 1px 10px; font-weight:normal;color: #202122;">&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100; &#1089;&#1077;&#1081;&#1095;&#1072;&#1089;...</span>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1073;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;.
</td></tr></tbody></table>
<p><span id="Notification_Area"></span>
</p>
<h3><span id=".D0.9E.D0.B1.D0.BB.D0.B0.D1.81.D1.82.D1.8C_.D1.83.D0.B2.D0.B5.D0.B4.D0.BE.D0.BC.D0.BB.D0.B5.D0.BD.D0.B8.D0.B9"></span><span class="mw-headline" id="&#1054;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;_&#1091;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1081;">&#1054;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1091;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1081;</span></h3>
<p><span typeof="mw:File"><a href="../index.php?title=Preferences_General_Page_Notification_Area.png&amp;filetimestamp=20250610104744&amp;.html" class="mw-file-description"><img src="../File/Preferences_General_Page_Notification_Area.png" decoding="async" width="400" height="335" class="mw-file-element" data-file-width="626" data-file-height="524"></a></span>
</p><p>&#1069;&#1090;&#1080; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1054;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;&#1102; &#1059;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1081; &#1080; &#1077;&#1105; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;.
</p><p>&#1053;&#1072; &#1101;&#1090;&#1086;&#1081; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; (<span style="font-size:small;"><a href="../ru/Release_notes_0.21.html" title="Release notes 0.21/ru">&#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1086; &#1074; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 0.21</a></span>) &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;:
</p>
<table class="wikitable float-right mw-collapsible mw-uncollapsed">
<tbody><tr>
<th style="width: 33%;">&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;
</th>
<th style="width: 66%;">&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;
</th></tr>
<tr>
<td><b>&#1042;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1091;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1081;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1091;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1081; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103;.
</td></tr>
<tr>
<td><b>&#1042;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1085;&#1077;&#1085;&#1072;&#1074;&#1103;&#1079;&#1095;&#1080;&#1074;&#1099;&#1077; &#1091;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1103;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1090;&#1086; &#1085;&#1077;&#1085;&#1072;&#1074;&#1103;&#1079;&#1095;&#1080;&#1074;&#1099;&#1077; &#1074;&#1089;&#1087;&#1083;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1077; &#1091;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1103; &#1073;&#1091;&#1076;&#1091;&#1090; &#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072;&#1076; &#1089;&#1090;&#1088;&#1086;&#1082;&#1086;&#1081; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103;.
</td></tr>
<tr>
<td><b>&#1054;&#1096;&#1080;&#1073;&#1082;&#1080; &#1086;&#1090;&#1083;&#1072;&#1076;&#1082;&#1080;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1086;&#1096;&#1080;&#1073;&#1082;&#1080;, &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1085;&#1099;&#1077; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;, &#1073;&#1091;&#1076;&#1091;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1054;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1059;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1081;.
</td></tr>
<tr>
<td><b>&#1054;&#1090;&#1083;&#1072;&#1076;&#1086;&#1095;&#1085;&#1099;&#1077; &#1087;&#1088;&#1077;&#1076;&#1091;&#1087;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1087;&#1088;&#1077;&#1076;&#1091;&#1087;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103;, &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1085;&#1099;&#1077; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;, &#1073;&#1091;&#1076;&#1091;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1054;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1059;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1081;.
</td></tr>
<tr>
<td><b>&#1052;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1076;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100;</b>
</td>
<td>&#1052;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1091;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1081; (&#1077;&#1089;&#1083;&#1080; &#1085;&#1077; &#1085;&#1072;&#1078;&#1080;&#1084;&#1072;&#1090;&#1100; &#1085;&#1072; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1084;&#1099;&#1096;&#1080;).
</td></tr>
<tr>
<td><b>&#1052;&#1080;&#1085;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1076;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100;</b>
</td>
<td>&#1052;&#1080;&#1085;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; (&#1090;&#1086;&#1078;&#1077;).
</td></tr>
<tr>
<td><b>&#1052;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093; &#1091;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1081;</b>
</td>
<td>&#1052;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1091;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086; &#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;&#1077; &#1074;&#1089;&#1087;&#1083;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1093; &#1091;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1081;.
</td></tr>
<tr>
<td><b>&#1064;&#1080;&#1088;&#1080;&#1085;&#1072; &#1091;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1081;</b>
</td>
<td>&#1064;&#1080;&#1088;&#1080;&#1085;&#1072; &#1074;&#1089;&#1087;&#1083;&#1099;&#1074;&#1072;&#1102;&#1097;&#1077;&#1075;&#1086; &#1086;&#1082;&#1085;&#1072; &#1091;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1103; &#1074; &#1087;&#1080;&#1082;&#1089;&#1077;&#1083;&#1103;&#1093;.
</td></tr>
<tr>
<td><b>&#1057;&#1082;&#1088;&#1099;&#1074;&#1072;&#1090;&#1100;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1076;&#1088;&#1091;&#1075;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; &#1072;&#1082;&#1090;&#1080;&#1074;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1086;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1077; &#1091;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1103; &#1073;&#1091;&#1076;&#1091;&#1090; &#1080;&#1089;&#1095;&#1077;&#1079;&#1072;&#1090;&#1100; &#1087;&#1088;&#1080; &#1072;&#1082;&#1090;&#1080;&#1074;&#1072;&#1094;&#1080;&#1080; &#1076;&#1088;&#1091;&#1075;&#1086;&#1075;&#1086; &#1086;&#1082;&#1085;&#1072;.
</td></tr>
<tr>
<td><b>&#1053;&#1077; &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077;&#1072;&#1082;&#1090;&#1080;&#1074;&#1077;&#1085;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1091;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1090;&#1100;&#1089;&#1103;, &#1077;&#1089;&#1083;&#1080; &#1086;&#1082;&#1085;&#1086; FreeCAD &#1085;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1084; &#1086;&#1082;&#1085;&#1086;&#1084;.
</td></tr>
<tr>
<td><b>&#1052;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1091;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1081;</b>
</td>
<td>&#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1091;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100;&#1089;&#1103; &#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077;. &#1045;&#1089;&#1083;&#1080; 0, &#1090;&#1086; &#1083;&#1080;&#1084;&#1080;&#1090; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090;..
</td></tr>
<tr>
<td><b>&#1040;&#1074;&#1090;&#1086;&#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1077; &#1091;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1081; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1091;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1103; &#1073;&#1091;&#1076;&#1091;&#1090; &#1091;&#1076;&#1072;&#1083;&#1103;&#1090;&#1100;&#1089;&#1103; &#1080;&#1079; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081; &#1087;&#1086; &#1080;&#1089;&#1090;&#1077;&#1095;&#1077;&#1085;&#1080;&#1080; <b>&#1052;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1076;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080;</b>.
</td></tr></tbody></table>
<p><span id="Report_view"></span>
</p>
<h3><span id=".D0.9F.D1.80.D0.BE.D1.81.D0.BC.D0.BE.D1.82.D1.80_.D0.BE.D1.82.D1.87.D1.91.D1.82.D0.B0"></span><span class="mw-headline" id="&#1055;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;_&#1086;&#1090;&#1095;&#1105;&#1090;&#1072;">&#1055;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088; &#1086;&#1090;&#1095;&#1105;&#1090;&#1072;</span></h3>
<p><span typeof="mw:File"><a href="../index.php?title=Preferences_General_Page_Report_view.png&amp;filetimestamp=20240422195728&amp;.html" class="mw-file-description"><img src="../File/Preferences_General_Page_Report_view.png" decoding="async" width="400" height="365" class="mw-file-element" data-file-width="600" data-file-height="547"></a></span>
</p><p>&#1069;&#1090;&#1080; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;&#1084; <a href="../ru/Report_view.html" class="mw-redirect" title="Report view/ru">&#1055;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088; &#1086;&#1090;&#1095;&#1105;&#1090;&#1072;</a>. &#1069;&#1090;&#1091; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1087;&#1091;&#1085;&#1082;&#1090;&#1072; &#1084;&#1077;&#1085;&#1102; <b> &#1042;&#1080;&#1076; &rarr; &#1055;&#1072;&#1085;&#1077;&#1083;&#1080; &rarr; &#1055;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088; &#1086;&#1090;&#1095;&#1105;&#1090;&#1072;</b>.
</p><p>&#1042; &#1055;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077; &#1086;&#1090;&#1095;&#1105;&#1090;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1090;&#1077; &#1078;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1096;&#1088;&#1080;&#1092;&#1090;&#1072;, &#1095;&#1090;&#1086; &#1080; &#1074; <a href="#Editor">&#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;&#1077; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1086;&#1074;</a>.
</p><p>&#1053;&#1072; &#1101;&#1090;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;:
</p>
<table class="wikitable float-right mw-collapsible mw-uncollapsed">
<tbody><tr>
<th style="width: 33%;">&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;
</th>
<th style="width: 66%;">&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;
</th></tr>
<tr>
<td><b>&#1047;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1090;&#1100; &#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; (normal)</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1073;&#1091;&#1076;&#1091;&#1090; &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103;. &#1054;&#1085;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; <a href="../ru/Report_view.html" class="mw-redirect" title="Report view/ru">&#1054;&#1090;&#1095;&#1105;&#1090;&#1077;</a> &#1089; &#1094;&#1074;&#1077;&#1090;&#1086;&#1084;, &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084; &#1076;&#1083;&#1103; <b>&#1054;&#1073;&#1099;&#1095;&#1085;&#1099;&#1093; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081;</b>.
</td></tr>
<tr>
<td><b>&#1047;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1090;&#1100; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1078;&#1091;&#1088;&#1085;&#1072;&#1083;&#1072; (log)</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1078;&#1091;&#1088;&#1085;&#1072;&#1083;&#1072; &#1073;&#1091;&#1076;&#1091;&#1090; &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103;. &#1054;&#1085;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; <a href="../ru/Report_view.html" class="mw-redirect" title="Report view/ru">&#1054;&#1090;&#1095;&#1105;&#1090;&#1077;</a> &#1089; &#1094;&#1074;&#1077;&#1090;&#1086;&#1084;, &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084; &#1076;&#1083;&#1103; <b>&#1057;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081; &#1078;&#1091;&#1088;&#1085;&#1072;&#1083;&#1072;</b>.
</td></tr>
<tr>
<td><b>&#1047;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1090;&#1100; &#1087;&#1088;&#1077;&#1076;&#1091;&#1087;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103; (warnings)</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1087;&#1088;&#1077;&#1076;&#1091;&#1087;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103; &#1073;&#1091;&#1076;&#1091;&#1090; &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103;. &#1054;&#1085;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; <a href="../ru/Report_view.html" class="mw-redirect" title="Report view/ru">&#1054;&#1090;&#1095;&#1105;&#1090;&#1077;</a> &#1089; &#1094;&#1074;&#1077;&#1090;&#1086;&#1084;, &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084; &#1076;&#1083;&#1103; <b>&#1055;&#1088;&#1077;&#1076;&#1091;&#1087;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1081;</b>.
</td></tr>
<tr>
<td><b>&#1047;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1090;&#1100; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093; (error)</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093; &#1073;&#1091;&#1076;&#1091;&#1090; &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103;. &#1054;&#1085;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; <a href="../ru/Report_view.html" class="mw-redirect" title="Report view/ru">&#1054;&#1090;&#1095;&#1105;&#1090;&#1077;</a> &#1089; &#1094;&#1074;&#1077;&#1090;&#1086;&#1084;, &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084; &#1076;&#1083;&#1103; <b>&#1054;&#1096;&#1080;&#1073;&#1086;&#1082;</b>.
</td></tr>
<tr>
<td><b>&#1055;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1086;&#1090;&#1095;&#1105;&#1090; &#1087;&#1088;&#1080; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1085;&#1086;&#1074;&#1077;&#1085;&#1080;&#1080; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1090;&#1086; &#1087;&#1088;&#1080; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1085;&#1086;&#1074;&#1077;&#1085;&#1080;&#1080; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080; &#1073;&#1091;&#1076;&#1077;&#1090; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; <a href="../ru/Report_view.html" class="mw-redirect" title="Report view/ru">&#1054;&#1090;&#1095;&#1105;&#1090;</a>.
</td></tr>
<tr>
<td><b>&#1055;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1086;&#1090;&#1095;&#1105;&#1090; &#1087;&#1088;&#1080; &#1087;&#1086;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080; &#1087;&#1088;&#1077;&#1076;&#1091;&#1087;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1090;&#1086; &#1087;&#1088;&#1080; &#1087;&#1086;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080; &#1087;&#1088;&#1077;&#1076;&#1091;&#1087;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103; &#1073;&#1091;&#1076;&#1077;&#1090; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; <a href="../ru/Report_view.html" class="mw-redirect" title="Report view/ru">&#1054;&#1090;&#1095;&#1105;&#1090;</a>.
</td></tr>
<tr>
<td><b>&#1055;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1086;&#1090;&#1095;&#1105;&#1090; &#1087;&#1088;&#1080; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1080; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086;&#1075;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1090;&#1086; <a href="../ru/Report_view.html" class="mw-redirect" title="Report view/ru">&#1054;&#1090;&#1095;&#1105;&#1090;</a> &#1073;&#1091;&#1076;&#1077;&#1090; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1087;&#1088;&#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1080; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086;&#1075;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;.
</td></tr>
<tr>
<td><b>&#1055;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1086;&#1090;&#1095;&#1105;&#1090; &#1087;&#1088;&#1080; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1080; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081; &#1078;&#1091;&#1088;&#1085;&#1072;&#1083;&#1072;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1090;&#1086; <a href="../ru/Report_view.html" class="mw-redirect" title="Report view/ru">&#1054;&#1090;&#1095;&#1105;&#1090;</a> &#1073;&#1091;&#1076;&#1077;&#1090; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1087;&#1088;&#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1080; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081; &#1078;&#1091;&#1088;&#1085;&#1072;&#1083;&#1072;.
</td></tr>
<tr>
<td><b>&#1042;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1082;&#1086;&#1076; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1082;&#1072;&#1078;&#1076;&#1086;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1080; &#1087;&#1088;&#1077;&#1076;&#1091;&#1087;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090; &#1084;&#1077;&#1090;&#1082;&#1091; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;.
</td></tr>
<tr>
<td><b>&#1054;&#1073;&#1099;&#1095;&#1085;&#1099;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; (normal)</b>
</td>
<td>&#1059;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1094;&#1074;&#1077;&#1090; &#1096;&#1088;&#1080;&#1092;&#1090;&#1072; &#1076;&#1083;&#1103; &#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1093; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081;.
</td></tr>
<tr>
<td><b>&#1057;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1078;&#1091;&#1088;&#1085;&#1072;&#1083;&#1072; (log)</b>
</td>
<td>&#1059;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1094;&#1074;&#1077;&#1090; &#1096;&#1088;&#1080;&#1092;&#1090;&#1072; &#1076;&#1083;&#1103; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081; &#1078;&#1091;&#1088;&#1085;&#1072;&#1083;&#1072;.
</td></tr>
<tr>
<td><b>&#1055;&#1088;&#1077;&#1076;&#1091;&#1087;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103; (warnings)</b>
</td>
<td>&#1059;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1094;&#1074;&#1077;&#1090; &#1096;&#1088;&#1080;&#1092;&#1090;&#1072; &#1076;&#1083;&#1103; &#1087;&#1088;&#1077;&#1076;&#1091;&#1087;&#1088;&#1077;&#1078;&#1076;&#1072;&#1102;&#1097;&#1080;&#1093; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081;.
</td></tr>
<tr>
<td><b>&#1057;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073; &#1054;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093; (errors)</b>
</td>
<td>&#1059;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1094;&#1074;&#1077;&#1090; &#1096;&#1088;&#1080;&#1092;&#1090;&#1072; &#1076;&#1083;&#1103; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093;.
</td></tr>
<tr>
<td><b>&#1055;&#1077;&#1088;&#1077;&#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1081; &#1074;&#1099;&#1074;&#1086;&#1076; Python &#1074; &#1086;&#1090;&#1095;&#1105;&#1090;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1090;&#1086; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1081; &#1074;&#1099;&#1074;&#1086;&#1076; Python &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100;&#1089;&#1103; &#1080;&#1079; <a href="../ru/Python_console.html" class="mw-redirect" title="Python console/ru">&#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1080; Python</a> &#1074; <a href="../ru/Report_view.html" class="mw-redirect" title="Report view/ru">&#1086;&#1090;&#1095;&#1105;&#1090;</a>.
</td></tr>
<tr>
<td><b>&#1055;&#1077;&#1088;&#1077;&#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093; Python &#1074; &#1086;&#1090;&#1095;&#1105;&#1090;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1090;&#1086; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093; Python &#1073;&#1091;&#1076;&#1091;&#1090; &#1087;&#1077;&#1088;&#1077;&#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100;&#1089;&#1103; &#1080;&#1079; <a href="../ru/Python_console.html" class="mw-redirect" title="Python console/ru">&#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1080; Python</a> &#1074; <a href="../ru/Report_view.html" class="mw-redirect" title="Report view/ru">&#1086;&#1090;&#1095;&#1105;&#1090;</a>.
</td></tr></tbody></table>
<p><span id="Help"></span>
</p>
<h3><span id=".D0.A1.D0.BF.D1.80.D0.B0.D0.B2.D0.BA.D0.B0"></span><span class="mw-headline" id="&#1057;&#1087;&#1088;&#1072;&#1074;&#1082;&#1072;">&#1057;&#1087;&#1088;&#1072;&#1074;&#1082;&#1072;</span></h3>
<p><span typeof="mw:File"><a href="../index.php?title=Preferences_General_Page_Help.png&amp;filetimestamp=20240517105829&amp;.html" class="mw-file-description"><img src="../File/Preferences_General_Page_Help.png" decoding="async" width="400" height="259" class="mw-file-element" data-file-width="600" data-file-height="388"></a></span>
</p><p>&#1053;&#1072; &#1101;&#1090;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;:
</p>
<table class="wikitable float-right mw-collapsible mw-uncollapsed">
<tbody><tr>
<th style="width: 33%;">&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;
</th>
<th style="width: 66%;">&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;
</th></tr>
<tr>
<td><b>&#1054;&#1090;&#1082;&#1091;&#1076;&#1072;</b>
</td>
<td>&#1059;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1089;&#1087;&#1088;&#1072;&#1074;&#1082;&#1080;. &#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1099;:
<ul><li><b>FreeCAD &#1042;&#1080;&#1082;&#1080; (&#1086;&#1085;&#1083;&#1072;&#1081;&#1085;)</b>:</li>
<li><b>Markdown &#1074;&#1077;&#1088;&#1089;&#1080;&#1103;(&#1086;&#1085;&#1083;&#1072;&#1081;&#1085;)</b>:</li>
<li><b>GitHub (&#1086;&#1085;&#1083;&#1072;&#1081;&#1085;)</b>: &#1053;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1072;.</li>
<li><b>&#1055;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1077; &#1084;&#1077;&#1089;&#1090;&#1086;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;</b>: &#1059;&#1082;&#1072;&#1078;&#1080;&#1090;&#1077; &#1087;&#1091;&#1090;&#1100;, &#1087;&#1086; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084;&#1091; &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1081;&#1090;&#1080; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085;&#1085;&#1091;&#1102; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1102; FreeCAD. &#1044;&#1083;&#1103; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; "offline-documentation" &#1080;&#1079; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1086;&#1074; &#1074; <a href="../ru/Std_AddonMgr.html" title="Std AddonMgr/ru"> &#1052;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088;&#1077; &#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1081;</a>.</li></ul>
<p><b>&#1057;&#1091;&#1092;&#1092;&#1080;&#1082;&#1089; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1072;</b>: &#1044;&#1083;&#1103; &#1086;&#1087;&#1094;&#1080;&#1080; &#1042;&#1080;&#1082;&#1080; &#1080; &#1086;&#1087;&#1094;&#1080;&#1080; Markdown &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/List_of_ISO_639-1_codes">&#1103;&#1079;&#1099;&#1082;&#1086;&#1074;&#1086;&#1081; &#1089;&#1091;&#1092;&#1092;&#1080;&#1082;&#1089;</a>. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; <code>ru</code> &#1076;&#1083;&#1103; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1072; &#1085;&#1072; &#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081; &#1103;&#1079;&#1099;&#1082;.
</p>
</td></tr>
<tr>
<td><b>&#1054;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;</b>
</td>
<td>&#1059;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;, &#1075;&#1076;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103;. &#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1099;:
<ul><li><b>&#1042; &#1074;&#1072;&#1096;&#1077;&#1084; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;</b>: &#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1074;&#1077;&#1073;-&#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;.</li>
<li><b>&#1042;&#1086; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; FreeCAD</b>: &#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1085;&#1086;&#1074;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; &#1074; <a href="../ru/Main_view_area.html" class="mw-redirect" title="Main view area/ru">&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;</a>. <span style="font-size:small;"><a href="../ru/Release_notes_1.0.html" title="Release notes 1.0/ru">&#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1086; &#1074; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 1.0</a></span>: &#1041;&#1086;&#1083;&#1100;&#1096;&#1077; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1072;.</li>
<li><b>&#1042; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086;&#1084;, &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1086;&#1084;, &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1084; &#1086;&#1082;&#1085;&#1077;</b>: &#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086;&#1084; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1084; &#1086;&#1082;&#1085;&#1077;. &#1069;&#1090;&#1086;&#1090; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1088;&#1080;&#1082;&#1088;&#1077;&#1087;&#1105;&#1085; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; <a href="../ru/Combo_view.html" class="mw-redirect" title="Combo view/ru">&#1050;&#1086;&#1084;&#1073;&#1086; &#1074;&#1080;&#1076;&#1072;</a>. <span style="font-size:small;"><a href="../ru/Release_notes_1.0.html" title="Release notes 1.0/ru">&#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1086; &#1074; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 1.0</a></span>: &#1041;&#1086;&#1083;&#1100;&#1096;&#1077; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1072;.</li></ul>
</td></tr>
<tr>
<td><b>&#1055;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1072;&#1103; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072; &#1089;&#1090;&#1080;&#1083;&#1077;&#1081;</b>
</td>
<td>&#1059;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1085;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1091;&#1102; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1091;&#1102; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091; &#1089;&#1090;&#1080;&#1083;&#1077;&#1081;. &#1053;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1042;&#1080;&#1082;&#1080;.
</td></tr></tbody></table>
<p><span id="Display"></span>
</p>
<h2><span id=".D0.9E.D1.82.D0.BE.D0.B1.D1.80.D0.B0.D0.B6.D0.B5.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1054;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;">&#1054;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;</span></h2>
<p>&#1042; &#1101;&#1090;&#1086;&#1081; &#1075;&#1088;&#1091;&#1087;&#1087;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082; &#1077;&#1089;&#1090;&#1100; &#1096;&#1077;&#1089;&#1090;&#1100; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1093; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1086;&#1074;: 3D-&#1074;&#1080;&#1076;, &#1048;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1080; &#1089;&#1074;&#1077;&#1090;&#1072;, &#1055;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1081; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;, &#1053;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1103;, &#1042;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1094;&#1074;&#1077;&#1090;&#1086;&#1084; &#1080; &#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;. &#1057;&#1077;&#1076;&#1100;&#1084;&#1072;&#1103; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;, &#1055;&#1086;&#1083;&#1080;&#1075;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1089;&#1077;&#1090;&#1082;&#1080;, &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;, &#1077;&#1089;&#1083;&#1080; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085; <a href="../ru/Mesh_Workbench.html" title="Mesh Workbench/ru"> &#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; &#1057;&#1077;&#1090;&#1082;&#1080; (Mesh)</a>.
</p><p><span id="3D_View"></span>
</p>
<h3><span id="3D_.D0.92.D0.B8.D0.B4"></span><span class="mw-headline" id="3D_&#1042;&#1080;&#1076;">3D &#1042;&#1080;&#1076;</span></h3>
<p><span typeof="mw:File"><a href="../index.php?title=Preferences_Display_Page_3D_View.png&amp;filetimestamp=20250610110413&amp;.html" class="mw-file-description"><img src="../File/Preferences_Display_Page_3D_View.png" decoding="async" width="400" height="372" class="mw-file-element" data-file-width="623" data-file-height="579"></a></span>
</p><p>&#1053;&#1072; &#1101;&#1090;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;:
</p>
<table class="wikitable float-right mw-collapsible mw-uncollapsed">
<tbody><tr>
<th style="width: 33%;">&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;
</th>
<th style="width: 66%;">&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;
</th></tr>
<tr>
<td><b>&#1055;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090; &#1074; &#1091;&#1075;&#1083;&#1091;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086;&#1090; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1087;&#1088;&#1072;&#1074;&#1086;&#1084; &#1085;&#1080;&#1078;&#1085;&#1077;&#1084; &#1091;&#1075;&#1083;&#1091; <a href="../ru/3D_view.html" class="mw-redirect" title="3D view/ru">3D-&#1074;&#1080;&#1076;&#1072;</a>.
<p><b>&#1054;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;</b> &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1074; &#1087;&#1088;&#1086;&#1094;&#1077;&#1085;&#1090;&#1072;&#1093; &#1086;&#1090; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072; &#1086;&#1082;&#1085;&#1072; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1072; (&#1084;&#1080;&#1085;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1080;&#1079; &#1074;&#1099;&#1089;&#1086;&#1090;&#1099; &#1080; &#1096;&#1080;&#1088;&#1080;&#1085;&#1099;). <b>&#1062;&#1074;&#1077;&#1090; &#1073;&#1091;&#1082;&#1074;</b> &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1094;&#1074;&#1077;&#1090; &#1073;&#1091;&#1082;&#1074; &#1085;&#1072; &#1086;&#1089;&#1103;&#1093;. <span style="font-size:small;"><a href="../ru/Release_notes_1.1.html" title="Release notes 1.1/ru">&#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1086; &#1074; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 1.1</a></span>: <b>&#1062;&#1074;&#1077;&#1090; &#1086;&#1089;&#1080; X</b>, <b>&#1062;&#1074;&#1077;&#1090; &#1086;&#1089;&#1080; Y</b> &#1080; <b>&#1062;&#1074;&#1077;&#1090; &#1086;&#1089;&#1080; Z</b> &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1102;&#1090; &#1094;&#1074;&#1077;&#1090;&#1072; &#1086;&#1089;&#1077;&#1081;.
</p>
</td></tr>
<tr>
<td><b>&#1055;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1082;&#1088;&#1077;&#1089;&#1090;&#1080;&#1077; &#1086;&#1089;&#1077;&#1081; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086;&#1090; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1087;&#1077;&#1088;&#1077;&#1082;&#1088;&#1077;&#1089;&#1090;&#1080;&#1077; &#1086;&#1089;&#1077;&#1081; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; <a href="../ru/3D_view.html" class="mw-redirect" title="3D view/ru">3D-&#1074;&#1080;&#1076;&#1077;</a> &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;.
</td></tr>
<tr>
<td><b>&#1055;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1089;&#1095;&#1105;&#1090;&#1095;&#1080;&#1082; &#1082;&#1072;&#1076;&#1088;&#1086;&#1074; &#1074; &#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1091;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086;&#1090; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1074;&#1088;&#1077;&#1084;&#1103;, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1077; &#1076;&#1083;&#1103; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080;, &#1080; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1080;&#1088;&#1091;&#1102;&#1097;&#1072;&#1103; [&#1095;&#1072;&#1089;&#1090;&#1086;&#1090;&#1072; &#1082;&#1072;&#1076;&#1088;&#1086;&#1074; <a rel="nofollow" class="external free" href="https://en.wikipedia.org/wiki/Frame_rate">https://en.wikipedia.org/wiki/Frame_rate</a>] &#1073;&#1091;&#1076;&#1091;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1083;&#1077;&#1074;&#1086;&#1084; &#1085;&#1080;&#1078;&#1085;&#1077;&#1084; &#1091;&#1075;&#1083;&#1091; <a href="../ru/3D_view.html" class="mw-redirect" title="3D view/ru">3D-&#1074;&#1080;&#1076;&#1072;</a>.
</td></tr>
<tr>
<td><b>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; OpenGL</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086;&#1090; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/OpenGL">OpenGL</a> &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1062;&#1055; &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072;. &#1069;&#1090;&#1072; &#1086;&#1087;&#1094;&#1080;&#1103; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1072; &#1076;&#1083;&#1103; &#1091;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077;&#1087;&#1086;&#1083;&#1072;&#1076;&#1086;&#1082; &#1089; &#1074;&#1080;&#1076;&#1077;&#1086;&#1082;&#1072;&#1088;&#1090;&#1086;&#1081; &#1080; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;&#1072;&#1084;&#1080;. &#1048;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1101;&#1090;&#1086;&#1081; &#1086;&#1087;&#1094;&#1080;&#1080; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;.
</td></tr>
<tr>
<td><b>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; OpenGL VBO (&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1073;&#1091;&#1092;&#1077;&#1088;&#1072; &#1074;&#1077;&#1088;&#1096;&#1080;&#1085;)</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1090;&#1086; &#1073;&#1091;&#1076;&#1091;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Vertex_Buffer_Object">&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1073;&#1091;&#1092;&#1077;&#1088;&#1072; &#1074;&#1077;&#1088;&#1096;&#1080;&#1085;</a> (VBO). VBO - &#1101;&#1090;&#1086; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/OpenGL">OpenGL</a>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1076;&#1083;&#1103; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074;&#1077;&#1088;&#1096;&#1080;&#1085; (&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;, &#1074;&#1077;&#1082;&#1090;&#1086;&#1088; &#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1080;, &#1094;&#1074;&#1077;&#1090; &#1080; &#1090;.&#1076;.) &#1085;&#1072; &#1074;&#1080;&#1076;&#1077;&#1086;&#1082;&#1072;&#1088;&#1090;&#1091;. VBO &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1074;&#1099;&#1080;&#1075;&#1088;&#1099;&#1096; &#1074; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1074; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;, &#1072; &#1085;&#1077; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1086;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;, &#1080; &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1086;&#1085;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1086;&#1084;. &#1044;&#1083;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1089;&#1084;. <a rel="nofollow" class="external text" href="https://www.haroldserrano.com/blog/understanding-opengl-objects">&#1101;&#1090;&#1091; &#1074;&#1077;&#1073;-&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091;</a>.
</td></tr>
<tr>
<td><b>&#1050;&#1101;&#1096; &#1088;&#1077;&#1085;&#1076;&#1077;&#1088;&#1072;</b>
</td>
<td>"&#1050;&#1101;&#1096; &#1088;&#1077;&#1085;&#1076;&#1077;&#1088;&#1080;&#1085;&#1075;&#1072;" &#1080;&#1083;&#1080; "&#1059;&#1089;&#1082;&#1086;&#1088;&#1077;&#1085;&#1080;&#1077; &#1088;&#1077;&#1085;&#1076;&#1077;&#1088;&#1080;&#1085;&#1075;&#1072;" &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1099; &#1074; <a rel="nofollow" class="external text" href="https://github.com/realthunder/FreeCAD_assembly3/wiki/Link#render-caching">FreeCAD assembly3 render-caching</a>. &#1044;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1086;&#1087;&#1094;&#1080;&#1080;:
<ul><li><b>&#1040;&#1074;&#1090;&#1086;</b>: Coin3D &#1089;&#1072;&#1084;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;, &#1075;&#1076;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100; &#1082;&#1101;&#1096; (&#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;).</li>
<li><b>&#1056;&#1072;&#1089;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1099;&#1081;</b>: &#1074;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1101;&#1096; &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; &#1082;&#1086;&#1088;&#1085;&#1077;&#1074;&#1099;&#1093; &#1091;&#1079;&#1083;&#1086;&#1074; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1097;&#1080;&#1082;&#1086;&#1074; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1081;.</li>
<li><b>&#1062;&#1077;&#1085;&#1090;&#1088;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081;</b>: &#1074;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102; &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1101;&#1096; &#1074;&#1086; &#1074;&#1089;&#1077;&#1093; &#1091;&#1079;&#1083;&#1072;&#1093; &#1074;&#1089;&#1077;&#1093; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1097;&#1080;&#1082;&#1086;&#1074; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1081;, &#1080; &#1082;&#1101;&#1096; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1082;&#1086;&#1088;&#1085;&#1077;&#1074;&#1086;&#1084; &#1091;&#1079;&#1083;&#1077; &#1075;&#1088;&#1072;&#1092;&#1072; &#1089;&#1094;&#1077;&#1085;&#1099;. &#1069;&#1090;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1100; &#1088;&#1077;&#1085;&#1076;&#1077;&#1088;&#1080;&#1085;&#1075;&#1072;, &#1085;&#1086; &#1079;&#1072;&#1084;&#1077;&#1076;&#1083;&#1103;&#1077;&#1090; &#1088;&#1077;&#1072;&#1082;&#1094;&#1080;&#1102; &#1085;&#1072; &#1083;&#1102;&#1073;&#1099;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1089;&#1094;&#1077;&#1085;&#1099;.</li></ul>
</td></tr>
<tr>
<td><b>&#1057;&#1075;&#1083;&#1072;&#1078;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077;</b>
</td>
<td>&#1059;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1083;&#1080; &#1080; &#1082;&#1072;&#1082;&#1086;&#1081; &#1090;&#1080;&#1087; <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Multisample_anti-aliasing">&#1084;&#1085;&#1086;&#1075;&#1086;&#1076;&#1080;&#1089;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086;&#1075;&#1086; &#1089;&#1075;&#1083;&#1072;&#1078;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103;</a> &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103;.
</td></tr>
<tr>
<td><b>&#1055;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1099;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;</b>
</td>
<td>&#1059;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1090;&#1080;&#1087; &#1088;&#1077;&#1085;&#1076;&#1077;&#1088;&#1080;&#1085;&#1075;&#1072; &#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1099;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;. &#1044;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1099;::
<ul><li><b>&#1054;&#1076;&#1080;&#1085; &#1087;&#1088;&#1086;&#1093;&#1086;&#1076;</b>: &#1056;&#1077;&#1085;&#1076;&#1077;&#1088;&#1080;&#1085;&#1075; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1079;&#1072; &#1086;&#1076;&#1080;&#1085; &#1087;&#1088;&#1086;&#1093;&#1086;&#1076; (&#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;). &#1069;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1088;&#1080;&#1074;&#1077;&#1089;&#1090;&#1080; &#1082; &#1087;&#1086;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1102; &#1090;&#1088;&#1077;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1099;&#1093; &#1072;&#1088;&#1090;&#1077;&#1092;&#1072;&#1082;&#1090;&#1086;&#1074;. &#1045;&#1089;&#1083;&#1080; &#1086;&#1085;&#1080; &#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103;, &#1076;&#1083;&#1103; &#1080;&#1093; &#1091;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1090;&#1080;&#1087; <b>&#1055;&#1088;&#1086;&#1093;&#1086;&#1076; &#1092;&#1086;&#1085;&#1072;</b>.</li>
<li><b>&#1055;&#1088;&#1086;&#1093;&#1086;&#1076; &#1092;&#1086;&#1085;&#1072;</b>: &#1056;&#1077;&#1085;&#1076;&#1077;&#1088;&#1080;&#1085;&#1075; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1079;&#1072; &#1076;&#1074;&#1072; &#1087;&#1088;&#1086;&#1093;&#1086;&#1076;&#1072;. &#1055;&#1086;&#1083;&#1080;&#1075;&#1086;&#1085;&#1099; &#1079;&#1072;&#1076;&#1085;&#1077;&#1081; &#1075;&#1088;&#1072;&#1085;&#1080; &#1086;&#1090;&#1088;&#1080;&#1089;&#1086;&#1074;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084; &#1087;&#1088;&#1086;&#1093;&#1086;&#1076;&#1077;, &#1072; &#1087;&#1086;&#1083;&#1080;&#1075;&#1086;&#1085;&#1099; &#1087;&#1077;&#1088;&#1077;&#1076;&#1085;&#1077;&#1081; &#1075;&#1088;&#1072;&#1085;&#1080; &mdash; &#1074;&#1086; &#1074;&#1090;&#1086;&#1088;&#1086;&#1084;.</li></ul>
</td></tr>
<tr>
<td><b>&#1056;&#1072;&#1079;&#1084;&#1077;&#1088; &#1084;&#1077;&#1090;&#1082;&#1080;</b>
</td>
<td>&#1059;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; <a href="../ru/Glossary.html#Vertex" title="Glossary/ru">&#1074;&#1077;&#1088;&#1096;&#1080;&#1085;</a> (&#1090;&#1086;&#1095;&#1077;&#1082;) &#1074; <a href="../ru/Sketcher_Workbench.html" title="Sketcher Workbench/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1077; &#1057;&#1082;&#1077;&#1090;&#1095;&#1077;&#1088; (Sketcher)</a>. &#1054;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1084;&#1086;&#1078;&#1085;&#1086; &#1097;&#1105;&#1083;&#1082;&#1085;&#1091;&#1090;&#1100; &#1084;&#1099;&#1096;&#1100;&#1102;, &#1084;&#1086;&#1078;&#1085;&#1086; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1090;&#1100;, &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1074; <b> &#1056;&#1072;&#1076;&#1080;&#1091;&#1089; &#1074;&#1099;&#1073;&#1086;&#1088;&#1072;</b>.
</td></tr>
<tr>
<td><b>&#1056;&#1072;&#1089;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1084;&#1077;&#1078;&#1076;&#1091; &#1075;&#1083;&#1072;&#1079; &#1076;&#1083;&#1103; &#1089;&#1090;&#1077;&#1088;&#1077;&#1086; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072;</b>
</td>
<td>&#1059;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1088;&#1072;&#1089;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1084;&#1077;&#1078;&#1076;&#1091; &#1075;&#1083;&#1072;&#1079;&#1072;&#1084;&#1080;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1086;&#1077; &#1076;&#1083;&#1103; &#1089;&#1090;&#1077;&#1088;&#1077;&#1086;&#1087;&#1088;&#1086;&#1077;&#1082;&#1094;&#1080;&#1081;. &#1059;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1101;&#1092;&#1092;&#1080;&#1094;&#1080;&#1077;&#1085;&#1090;&#1086;&#1084;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1073;&#1091;&#1076;&#1077;&#1090; &#1091;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085; &#1085;&#1072; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; <a href="../Property_editor.html#View" class="mw-redirect" title="Property editor">&#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1088;&#1072;&#1084;&#1082;&#1080;</a> 3D-&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1074; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103;.
</td></tr>
<tr>
<td><b>&#1062;&#1074;&#1077;&#1090; &#1087;&#1086;&#1076;&#1089;&#1074;&#1077;&#1090;&#1082;&#1080;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1090;&#1086; &#1087;&#1086;&#1076;&#1089;&#1074;&#1077;&#1090;&#1082;&#1072; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1072; &#1089; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1084; &#1094;&#1074;&#1077;&#1090;&#1086;&#1084;. &#1055;&#1086;&#1076;&#1089;&#1074;&#1077;&#1090;&#1082;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072;&#1076;&#1085;&#1080;&#1093; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085; &#1075;&#1088;&#1072;&#1085;&#1077;&#1081; (&#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1080;&#1093; &#1085;&#1077; &#1074;&#1080;&#1076;&#1085;&#1086; &#1074; &#1090;&#1074;&#1105;&#1088;&#1076;&#1099;&#1093; &#1090;&#1077;&#1083;&#1072;&#1093;, &#1077;&#1089;&#1083;&#1080; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;&#1099; &#1085;&#1077; &#1088;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1077;&#1090;&#1077; &#1080;&#1093; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1100;&#1102; &#1086;&#1090;&#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1080;&#1083;&#1080; &#1077;&#1089;&#1083;&#1080; &#1075;&#1088;&#1072;&#1085;&#1080; &#1085;&#1077; &#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1099; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;). &#1054;&#1085;&#1072; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1072; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1091; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; Lighting - &#1054;&#1089;&#1074;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; (&#1085;&#1072; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; &#1042;&#1080;&#1076;) &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1086; &#1074; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; "One side - &#1054;&#1076;&#1085;&#1072; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1072;". &#1045;&#1089;&#1083;&#1080; &#1101;&#1090;&#1072; &#1086;&#1087;&#1094;&#1080;&#1103; &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1072;, &#1079;&#1072;&#1076;&#1085;&#1080;&#1077; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099; &#1075;&#1088;&#1072;&#1085;&#1077;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; &#1086;&#1089;&#1074;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; "&#1054;&#1076;&#1085;&#1072; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1072;" &#1073;&#1091;&#1076;&#1091;&#1090; &#1095;&#1105;&#1088;&#1085;&#1099;&#1084;&#1080;.
<p>&#1057;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>&#1048;&#1085;&#1090;&#1077;&#1085;&#1089;&#1080;&#1074;&#1085;&#1086;&#1089;&#1090;&#1100;</b> &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1080;&#1085;&#1090;&#1077;&#1085;&#1089;&#1080;&#1074;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1086;&#1076;&#1089;&#1074;&#1077;&#1090;&#1082;&#1080;.
</p>
</td></tr>
<tr>
<td><b>&#1058;&#1080;&#1087; &#1082;&#1072;&#1084;&#1077;&#1088;&#1099;</b>
</td>
<td>&#1059;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1090;&#1080;&#1087; &#1087;&#1088;&#1086;&#1077;&#1082;&#1094;&#1080;&#1080; &#1082;&#1072;&#1084;&#1077;&#1088;&#1099;. &#1044;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1099;:
<ul><li><b>&#1055;&#1088;&#1086;&#1088;&#1080;&#1089;&#1086;&#1074;&#1082;&#1072; &#1087;&#1077;&#1088;&#1089;&#1087;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1081; &#1087;&#1088;&#1086;&#1077;&#1082;&#1094;&#1080;&#1080;</b>: &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1073;&#1091;&#1076;&#1091;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; <a href="../ru/Std_PerspectiveCamera.html" title="Std PerspectiveCamera/ru">&#1087;&#1077;&#1088;&#1089;&#1087;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1081; &#1087;&#1088;&#1086;&#1077;&#1082;&#1094;&#1080;&#1080;</a>.</li>
<li><b>&#1055;&#1088;&#1086;&#1088;&#1080;&#1089;&#1086;&#1074;&#1082;&#1072; &#1086;&#1088;&#1090;&#1086;&#1075;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1087;&#1088;&#1086;&#1077;&#1082;&#1094;&#1080;&#1080;</b>: &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1073;&#1091;&#1076;&#1091;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; <a href="../ru/Std_OrthographicCamera.html" title="Std OrthographicCamera/ru">&#1086;&#1088;&#1090;&#1086;&#1075;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1087;&#1088;&#1086;&#1077;&#1082;&#1094;&#1080;&#1080;</a>.</li></ul>
</td></tr></tbody></table>
<p><span id="Light_Sources"></span>
</p>
<h3><span id=".D0.98.D1.81.D1.82.D0.BE.D1.87.D0.BD.D0.B8.D0.BA.D0.B8_.D0.A1.D0.B2.D0.B5.D1.82.D0.B0"></span><span class="mw-headline" id="&#1048;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1080;_&#1057;&#1074;&#1077;&#1090;&#1072;">&#1048;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1080; &#1057;&#1074;&#1077;&#1090;&#1072;</span></h3>
<p><span style="font-size:small;"><a href="../Release_notes_1.0.html" title="Release notes 1.0">introduced in 1.0</a></span>, page updated for 1.1
</p><p><span typeof="mw:File"><a href="../index.php?title=Preferences_Display_Page_Light_Sources.png&amp;filetimestamp=20250610110533&amp;.html" class="mw-file-description"><img src="../File/Preferences_Display_Page_Light_Sources.png" decoding="async" width="400" height="517" class="mw-file-element" data-file-width="623" data-file-height="806"></a></span>
</p><p>&#1053;&#1072; &#1101;&#1090;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;:
</p>
<table class="wikitable float-right mw-collapsible mw-uncollapsed">
<tbody><tr>
<th style="width: 33%;">Name
</th>
<th style="width: 66%;">Description
</th></tr>
<tr>
<td><b>Main Light</b>
</td>
<td>If checked, the objects in the <a href="../3D_view.html" class="mw-redirect" title="3D view">3D view</a> are lit by main light source of three-point lighting from given Horizontal Angle and Vertical Angle. The specified Color and Intensity will be used for it.
</td></tr>
<tr>
<td><b>Back Light</b>
</td>
<td>If checked, the objects in the <a href="../3D_view.html" class="mw-redirect" title="3D view">3D view</a> are lit by back light source of three-point lighting from given Horizontal Angle and Vertical Angle. The specified Color and Intensity will be used for it.
</td></tr>
<tr>
<td><b>Fill Light</b>
</td>
<td>If checked, the objects in the <a href="../3D_view.html" class="mw-redirect" title="3D view">3D view</a> are lit by fill light source of three-point lighting from given Horizontal Angle and Vertical Angle. The specified Color and Intensity will be used for it.
</td></tr>
<tr>
<td><b>Ambient Light</b>
</td>
<td>Color and Intensity settings for ambient light.
</td></tr>
<tr>
<td><b>Preview</b>
</td>
<td>The preview shows a sphere lit by the currently enabled lights. You can zoom the preview in and out with the buttons in the lower left corner.
</td></tr></tbody></table>
<h3><span class="mw-headline" id="UI">UI</span></h3>
<p><span style="font-size:small;"><a href="../Release_notes_1.0.html" title="Release notes 1.0">introduced in 1.0</a></span>
</p><p><span typeof="mw:File"><a href="../index.php?title=Preferences_Display_Page_UI.png&amp;filetimestamp=20240907090659&amp;.html" class="mw-file-description"><img src="../File/Preferences_Display_Page_UI.png" decoding="async" width="400" height="443" class="mw-file-element" data-file-width="600" data-file-height="664"></a></span>
</p><p><span id="Navigation"></span>
</p>
<h3><span id=".D0.9D.D0.B0.D0.B2.D0.B8.D0.B3.D0.B0.D1.86.D0.B8.D1.8F"></span><span class="mw-headline" id="&#1053;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1103;">&#1053;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1103;</span></h3>
<p><span typeof="mw:File"><a href="../index.php?title=Preferences_Display_Page_Navigation.png&amp;filetimestamp=20250610111528&amp;.html" class="mw-file-description"><img src="../File/Preferences_Display_Page_Navigation.png" decoding="async" width="400" height="503" class="mw-file-element" data-file-width="626" data-file-height="787"></a></span>
</p><p>&#1053;&#1072; &#1101;&#1090;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;:
</p>
<div class="mw-translate-fuzzy">
<table class="wikitable float-right mw-collapsible mw-collapsed">
<tbody><tr>
<th style="width: 33%;">&#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;
</th>
<th style="width: 66%;">&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;
</th></tr>
<tr>
<td><b>&#1050;&#1091;&#1073; &#1085;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1080;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1086;, &#1090;&#1086; <a href="../ru/Navigation_Cube.html" title="Navigation Cube/ru">&#1053;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1081; &#1082;&#1091;&#1073;</a> &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103;.

<p><b>&#1064;&#1072;&#1075;&#1080; &#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103;</b> &#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1096;&#1072;&#1075;&#1086;&#1074; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1084;&#1099;&#1093; &#1076;&#1083;&#1103; &#1087;&#1086;&#1083;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1086;&#1088;&#1086;&#1090;&#1072; &#1085;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1075;&#1086; &#1082;&#1091;&#1073;&#1072; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1089;&#1090;&#1088;&#1077;&#1083;&#1086;&#1082; &#1087;&#1086;&#1074;&#1086;&#1088;&#1086;&#1090;&#1072;.
</p>
<div class="mw-translate-fuzzy">
<p>&#1045;&#1089;&#1083;&#1080; <b>&#1055;&#1086;&#1074;&#1086;&#1088;&#1072;&#1095;&#1080;&#1074;&#1072;&#1090;&#1100; &#1082; &#1073;&#1083;&#1080;&#1078;&#1072;&#1081;&#1096;&#1077;&#1084;&#1091;</b> &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1085;&#1086;, the 3D view is rotated to the nearest most logical state when a cube face is clicked. When it is off, clicking to a cube face will and up always to the same position, no matter in what cube state you were when you clicked the face. <span style="font-size:small;"><a href="../ru/Release_notes_0.20.html" title="Release notes 0.20/ru">&#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1086; &#1074; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 0.20</a></span>
</p>
</div>
<div class="mw-translate-fuzzy">
<p><b>&#1056;&#1072;&#1079;&#1084;&#1077;&#1088; &#1082;&#1091;&#1073;&#1072;</b> &#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1085;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1075;&#1086; &#1082;&#1091;&#1073;&#1072;. <span style="font-size:small;"><a href="../ru/Release_notes_0.20.html" title="Release notes 0.20/ru">&#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1086; &#1074; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 0.20</a></span>
</p>
</div></td></tr>
<tr>
<td><b>&#1058;&#1088;&#1077;&#1093;&#1084;&#1077;&#1088;&#1085;&#1072;&#1103; &#1085;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1103;</b>
</td>
<td>Selection of a <a href="../Mouse_navigation.html" title="Mouse navigation">navigation settings set</a>. To see what each set defines, select it and then press the <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.4em; padding: 0px 10px 1px 10px; font-weight:normal;color: #202122;">Mouse...</span> button.
</td></tr>
<tr>
<td><b>&#1057;&#1090;&#1080;&#1083;&#1100; &#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103;</b>
</td>
<td>Selection of the rotation orbit style. When viewing a part in the x-y plane and being in the rotation mode of the 3D navigation, the difference is: If <b>Trackball</b> is selected, moving the mouse horizontally will rotate the part around the y-axis, if <b>Turntable</b> is selected the part will be rotated around the z-axis.
</td></tr>
<tr>
<td><b>&#1056;&#1077;&#1078;&#1080;&#1084; &#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103;</b>
</td>
<td>&#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1094;&#1077;&#1085;&#1090;&#1088; &#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103;. &#1052;&#1086;&#1078;&#1085;&#1086; &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; <b>&#1062;&#1077;&#1085;&#1090;&#1088; &#1086;&#1082;&#1085;&#1072;</b>, <b>&#1055;&#1077;&#1088;&#1077;&#1085;&#1077;&#1089;&#1090;&#1080; &#1082; &#1082;&#1091;&#1088;&#1089;&#1086;&#1088;&#1091;</b> &#1080;&#1083;&#1080; <b>&#1062;&#1077;&#1085;&#1090;&#1088; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;</b>.
</td></tr>
<tr>
<td><b>&#1054;&#1088;&#1080;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1082;&#1072;&#1084;&#1077;&#1088;&#1099; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;</b>
</td>
<td>Selection of the camera orientation for new documents. This setting is also used by the <a href="../Std_ViewHome.html" title="Std ViewHome">Std ViewHome</a> command.
</td></tr>
<tr>
<td><b>&#1052;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073; &#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;</b>
</td>
<td>Affects the initial camera zoom level for new documents. The value you set is the diameter of a sphere that fits in 3D view. Default is 100 mm. It also sets the initial size of origin features (base planes in new <a href="../PartDesign_Body.html" title="PartDesign Body">PartDesign Bodies</a>).
</td></tr>
<tr>
<td><b>&#1042;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1072;&#1085;&#1080;&#1084;&#1072;&#1094;&#1080;&#1102;</b>
</td>
<td>If checked, rotations can be animated. If for example the <b>3D Navigation</b> set <i>CAD</i> is used and the mouse is moved while the scroll wheel and the right mouse button are pressed, parts are rotated. If one keeps the mouse moving while releasing e.g. the right mouse button, the rotation will continue as animation. To end the animation left-click with the mouse.
</td></tr>
<tr>
<td><b>&#1047;&#1091;&#1084; &#1090;&#1091;&#1076;&#1072;, &#1075;&#1076;&#1077; &#1084;&#1099;&#1096;&#1100;</b>
</td>
<td>If checked, zoom operations will be performed at the position of the mouse pointer. Otherwise zoom operations will be performed at the center of the current view. The <b>Zoom step</b> defines how much will be zoomed. A zoom step of  <b>1</b> means a factor of 7.5 for every zoom step.
</td></tr>
<tr>
<td><b>&#1048;&#1085;&#1074;&#1077;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1079;&#1091;&#1084;</b>
</td>
<td>If checked, the direction of zoom operations will be inverted
</td></tr>
<tr>
<td><b>&#1054;&#1090;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1078;&#1077;&#1089;&#1090; &#1085;&#1072;&#1082;&#1083;&#1086;&#1085;&#1072; &#1076;&#1083;&#1103; &#1089;&#1077;&#1085;&#1089;&#1086;&#1088;&#1085;&#1086;&#1075;&#1086; &#1101;&#1082;&#1088;&#1072;&#1085;&#1072;</b>
</td>
<td>If checked, the tilting gesture will be disabled for pinch-zooming (two-finger zooming). This only affects the <b>3D Navigation</b> set <i>Gesture</i>.
</td></tr></tbody></table>
</div>
<p><b>Color</b> sets the base color for all elements. <span style="font-size:small;"><a href="../Release_notes_0.21.html" title="Release notes 0.21">introduced in 0.21</a></span>
</p>
<div class="mw-translate-fuzzy">
<p><b>&#1059;&#1075;&#1086;&#1083;</b> &#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1084;&#1077;&#1089;&#1090;&#1086; &#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1053;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1075;&#1086; &#1082;&#1091;&#1073;&#1072; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085;&#1077;.
</p>
</div>
<p><b>Font name</b> specifies the font used for the cube's texts. <span style="font-size:small;"><a href="../Release_notes_0.21.html" title="Release notes 0.21">introduced in 0.21</a></span>
</p><p><b>Opacity when inactive</b> Opacity of the Navigation cube when not hovered by the mouse. <span style="font-size:small;"><a href="../Release_notes_1.0.html" title="Release notes 1.0">introduced in 1.0</a></span>
</p><p>|-
| <b>Rotation center indicator</b> <span style="font-size:small;"><a href="../Release_notes_1.0.html" title="Release notes 1.0">introduced in 1.0</a></span>
| If checked, the rotation center of the view is shown when dragging.
The <b>Sphere size</b> and the <b>Color and transparency</b> of the indicator can be specified.
</p><p>|-
| <b>3D Navigation</b>
| Specifies a <a href="../Mouse_navigation.html" title="Mouse navigation">mouse navigation style</a>. To see the details of each style, select it and then press the <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.4em; padding: 0px 10px 1px 10px; font-weight:normal;color: #202122;">Mouse...</span> button.
|-
| <b>Orbit style</b>
| Specifies the rotation orbit style used when in rotation mode. The options are:
</p>
<ul><li><b>Turntable</b>: Moving the mouse will divide the rotation in steps, rotations around the different axes are performed sequentially.</li>
<li><b>Trackball</b>: Rotations around the different axes are performed simultaneously.</li>
<li><b>Free Turntable</b>: Like <b>Trackball</b>, but if possible the rotation axis is kept collinear with the global 3D view axis. <span style="font-size:small;"><a href="../Release_notes_0.21.html" title="Release notes 0.21">introduced in 0.21</a></span></li>
<li><b>Trackball Classic</b>: <span style="font-size:small;"><a href="../Release_notes_1.1.html" title="Release notes 1.1">introduced in 1.1</a></span></li>
<li><b>Rounded Arcball</b>: <span style="font-size:small;"><a href="../Release_notes_1.1.html" title="Release notes 1.1">introduced in 1.1</a></span></li></ul>
<p>|-
| <b>Rotation mode</b>
| Defines the rotation center. The options are:
</p>
<ul><li><b>Window center</b></li>
<li><b>Drag at cursor</b></li>
<li><b>Object center</b></li></ul>
<p>|-
| <b>Default camera orientation</b>
| Specifies the camera orientation for new documents. This setting is also used by the <a href="../Std_ViewHome.html" title="Std ViewHome">Std ViewHome</a> command.
|-
| <b>Camera zoom</b>
| Affects the initial camera zoom level for new documents. The value you set is the diameter of a sphere that fits in the <a href="../3D_view.html" class="mw-redirect" title="3D view">3D view</a>. The default is 100 mm. It also sets the initial size of origin features (base planes in new <a href="../PartDesign_Body.html" title="PartDesign Body">PartDesign Bodies</a> and <a href="../Std_Part.html" title="Std Part">Std Parts</a>).
|-
| <b>Zoom at cursor</b>
| If checked, zoom operations will be performed at the position of the mouse pointer. Otherwise zoom operations will be performed at the center of the current view. The <b>Zoom step</b> defines how much will be zoomed. A zoom step of <b>1</b> means a factor of 7.5 for every zoom step.
|-
| <b>Invert zoom</b>
| If checked, the direction of zoom operations will be inverted.
|-
| <b>Disable touchscreen tilt gesture</b>
| If checked, and <b>3D Navigation</b> is set to <b>Gesture</b>, the tilting gesture will be disabled for pinch-zooming (two-finger zooming).
</p><p>|-
| <b>Enable support of legacy space mouse devices</b> <span style="font-size:small;"><a href="../Release_notes_1.1.html" title="Release notes 1.1">introduced in 1.1</a></span>
| If checked, legacy space mouse devices can be used.
</p><p>|-
| <b>Animations</b>
| If checked, view rotations and zooms, except those invoked by mouse actions, are animated. The <b>Animation duration</b> can be specified.
</p><p><b>Enable spinning animations</b> if checked, and if <b>3D Navigation</b> is set to <b>CAD</b>, rotations invoked by the mouse can be animated as well. If the mouse is moved while the scroll wheel and the right mouse button are pressed, the view is rotated. If one keeps the mouse moving while releasing the right mouse button, the rotation will continue. To end this animation left-click with the mouse.
|}
</p><p><span id="Colors"></span>
</p>
<h3><span id=".D0.A6.D0.B2.D0.B5.D1.82.D0.B0"></span><span class="mw-headline" id="&#1062;&#1074;&#1077;&#1090;&#1072;">&#1062;&#1074;&#1077;&#1090;&#1072;</span></h3>
<p><span typeof="mw:File"><a href="../index.php?title=Preferences_Display_Page_Colors.png&amp;filetimestamp=20240422195401&amp;.html" class="mw-file-description"><img src="../File/Preferences_Display_Page_Colors.png" decoding="async" width="400" height="277" class="mw-file-element" data-file-width="600" data-file-height="415"></a></span>
</p><p>&#1053;&#1072; &#1101;&#1090;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;:
</p>
<div class="mw-translate-fuzzy">
<table class="wikitable float-right mw-collapsible mw-collapsed">
<tbody><tr>
<th style="width: 33%;">&#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;
</th>
<th style="width: 66%;">&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;
</th></tr>
<tr>
<td><b>&#1042;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1087;&#1086;&#1076;&#1089;&#1074;&#1077;&#1095;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1080; &#1085;&#1072;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1080; &#1082;&#1091;&#1088;&#1089;&#1086;&#1088;&#1072;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086;&#1090; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1087;&#1088;&#1077;&#1076;&#1074;&#1072;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1074;&#1099;&#1073;&#1086;&#1088; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085; &#1080; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084; &#1094;&#1074;&#1077;&#1090;&#1086;&#1084;. &#1055;&#1088;&#1077;&#1076;&#1074;&#1072;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1074;&#1099;&#1073;&#1086;&#1088; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1088;&#1077;&#1073;&#1088;&#1072; &#1074; &#1076;&#1077;&#1090;&#1072;&#1083;&#1103;&#1093; &#1073;&#1091;&#1076;&#1091;&#1090; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1099; &#1087;&#1088;&#1080; &#1085;&#1072;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1080; &#1082;&#1091;&#1088;&#1089;&#1086;&#1088;&#1072; &#1085;&#1072; &#1085;&#1080;&#1093;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1086;&#1085;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1099;.
</td></tr>
<tr>
<td><b>&#1042;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1087;&#1086;&#1076;&#1089;&#1074;&#1077;&#1095;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1087;&#1086;&#1076;&#1089;&#1074;&#1077;&#1090;&#1082;&#1072; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1072; &#1080; &#1076;&#1083;&#1103; &#1085;&#1077;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1081; &#1094;&#1074;&#1077;&#1090;
</td></tr>
<tr>
<td><b>&#1054;&#1076;&#1080;&#1085; &#1094;&#1074;&#1077;&#1090;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1087;&#1091;&#1085;&#1082;&#1090; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;, &#1090;&#1086; &#1092;&#1086;&#1085; <a href="../ru/3D_view.html" class="mw-redirect" title="3D view/ru">3D &#1042;&#1080;&#1076;&#1072;</a> &#1076;&#1083;&#1103; &#1076;&#1077;&#1090;&#1072;&#1083;&#1077;&#1081; &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1081; &#1094;&#1074;&#1077;&#1090;
</td></tr>
<tr>
<td><b>&#1062;&#1074;&#1077;&#1090;&#1086;&#1074;&#1086;&#1081; &#1075;&#1088;&#1072;&#1076;&#1080;&#1077;&#1085;&#1090;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1087;&#1091;&#1085;&#1082;&#1090; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;, &#1090;&#1086; &#1092;&#1086;&#1085; <a href="../ru/3D_view.html" class="mw-redirect" title="3D view/ru">3D &#1042;&#1080;&#1076;&#1072;</a> &#1076;&#1083;&#1103; &#1076;&#1077;&#1090;&#1072;&#1083;&#1077;&#1081; &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1081; &#1074;&#1077;&#1088;&#1090;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1094;&#1074;&#1077;&#1090;&#1086;&#1074;&#1086;&#1081; &#1075;&#1088;&#1072;&#1076;&#1080;&#1077;&#1085;&#1090;. &#1055;&#1077;&#1088;&#1074;&#1099;&#1081; &#1094;&#1074;&#1077;&#1090; &#1073;&#1091;&#1076;&#1077;&#1090; &#1094;&#1074;&#1077;&#1090;&#1086;&#1084; &#1074;&#1077;&#1088;&#1093;&#1072; &#1092;&#1086;&#1085;&#1072;, &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; &#1073;&#1091;&#1076;&#1077;&#1090; &#1094;&#1074;&#1077;&#1090;&#1086;&#1084; &#1085;&#1080;&#1079;&#1072;.
</td></tr>
<tr>
<td><b>&#1057;&#1088;&#1077;&#1076;&#1085;&#1080;&#1081; &#1094;&#1074;&#1077;&#1090;</b>
</td>
<td>&#1044;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1077;&#1089;&#1083;&#1080; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1086; <b>&#1062;&#1074;&#1077;&#1090;&#1086;&#1074;&#1086;&#1081; &#1075;&#1088;&#1072;&#1076;&#1080;&#1077;&#1085;&#1090;</b>. &#1045;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086;&#1090; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1094;&#1074;&#1077;&#1090;&#1086;&#1074;&#1086;&#1081; &#1075;&#1088;&#1072;&#1076;&#1080;&#1077;&#1085;&#1090; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1081; &#1094;&#1074;&#1077;&#1090; &#1082;&#1072;&#1082; &#1089;&#1088;&#1077;&#1076;&#1085;&#1080;&#1081; &#1094;&#1074;&#1077;&#1090;.
</td></tr>
<tr>
<td><b>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103;</b>
</td>
<td>&#1042;&#1099;&#1073;&#1086;&#1088; &#1094;&#1074;&#1077;&#1090;&#1072; &#1092;&#1086;&#1085;&#1072; &#1076;&#1083;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1074; &#1074;&#1080;&#1076;&#1077; &#1076;&#1077;&#1088;&#1077;&#1074;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1091;&#1102;&#1090;&#1089;&#1103;
</td></tr>
<tr>
<td><b>&#1040;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1081; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;</b>
</td>
<td>&#1042;&#1099;&#1073;&#1086;&#1088; &#1094;&#1074;&#1077;&#1090;&#1072; &#1092;&#1086;&#1085;&#1072; &#1076;&#1083;&#1103; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1093; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;&#1086;&#1074; &#1074; &#1074;&#1080;&#1076;&#1077; &#1076;&#1077;&#1088;&#1077;&#1074;&#1072;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1077;&#1089;&#1083;&#1080; &#1074; &#1076;&#1088;&#1077;&#1074;&#1086;&#1074;&#1080;&#1076;&#1085;&#1086;&#1084; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080; &#1077;&#1089;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1095;&#1072;&#1089;&#1090;&#1077;&#1081; &#1080; &#1086;&#1076;&#1085;&#1072; &#1095;&#1072;&#1089;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1072;&#1082; <a href="../ru/PartDesign_Body.html#Active_Status" title="PartDesign Body/ru">&#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1077; &#1090;&#1077;&#1083;&#1086;</a>, &#1086;&#1085;&#1072; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1081; &#1094;&#1074;&#1077;&#1090; &#1092;&#1086;&#1085;&#1072; &#1074; &#1076;&#1088;&#1077;&#1074;&#1086;&#1074;&#1080;&#1076;&#1085;&#1086;&#1084; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080;.
</td></tr></tbody></table>
</div>
<h3><span class="mw-headline" id="Advanced">Advanced</span></h3>
<p><span style="font-size:small;"><a href="../Release_notes_1.0.html" title="Release notes 1.0">introduced in 1.0</a></span>
</p><p><span typeof="mw:File"><a href="../index.php?title=Preferences_Display_Page_Advanced.png&amp;filetimestamp=20240704145002&amp;.html" class="mw-file-description"><img src="../File/Preferences_Display_Page_Advanced.png" decoding="async" width="400" height="440" class="mw-file-element" data-file-width="600" data-file-height="660"></a></span>
</p><p><span id="Mesh_view"></span>
</p>
<h3><span id=".D0.9F.D1.80.D0.BE.D1.81.D0.BC.D0.BE.D1.82.D1.80_.D0.B2_.D0.B2.D0.B8.D0.B4.D0.B5_.D0.BF.D0.BE.D0.BB.D0.B8.D0.B3.D0.BE.D0.BD.D0.B0.D0.BB.D1.8C.D0.BD.D0.BE.D0.B9_.D1.81.D0.B5.D1.82.D0.BA.D0.B8"></span><span class="mw-headline" id="&#1055;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;_&#1074;_&#1074;&#1080;&#1076;&#1077;_&#1087;&#1086;&#1083;&#1080;&#1075;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081;_&#1089;&#1077;&#1090;&#1082;&#1080;">&#1055;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088; &#1074; &#1074;&#1080;&#1076;&#1077; &#1087;&#1086;&#1083;&#1080;&#1075;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1077;&#1090;&#1082;&#1080;</span></h3>
<p><span typeof="mw:File"><a href="../index.php?title=Preferences_Display_Page_Mesh_view.png&amp;filetimestamp=20240422195416&amp;.html" class="mw-file-description"><img src="../File/Preferences_Display_Page_Mesh_view.png" decoding="async" width="400" height="220" class="mw-file-element" data-file-width="600" data-file-height="330"></a></span>
</p>
<div class="mw-translate-fuzzy">
<p>&#1044;&#1072;&#1085;&#1085;&#1072;&#1103; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1072; &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1089;&#1103; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086;&#1081;, &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080; <a href="../ru/Mesh_Workbench.html" title="Mesh Workbench/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; Mesh</a>.
</p>
</div>
<p>&#1053;&#1072; &#1101;&#1090;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;:
</p>
<div class="mw-translate-fuzzy">
<table class="wikitable float-right mw-collapsible mw-collapsed">
<tbody><tr>
<th style="width: 33%;">&#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;
</th>
<th style="width: 66%;">&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;
</th></tr>
<tr>
<td><b>&#1062;&#1074;&#1077;&#1090; &#1087;&#1086;&#1083;&#1080;&#1075;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1077;&#1090;&#1082;&#1080; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;</b>
</td>
<td>&#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1094;&#1074;&#1077;&#1090; &#1087;&#1086;&#1083;&#1080;&#1075;&#1086;&#1085;&#1086;&#1074; &#1087;&#1086;&#1083;&#1080;&#1075;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1077;&#1090;&#1082;&#1080; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;
</td></tr>
<tr>
<td><b>&#1062;&#1074;&#1077;&#1090; &#1083;&#1080;&#1085;&#1080;&#1080; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;</b>
</td>
<td>&#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1094;&#1074;&#1077;&#1090; &#1083;&#1080;&#1085;&#1080;&#1081; &#1087;&#1086;&#1083;&#1080;&#1075;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1077;&#1090;&#1082;&#1080; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;
</td></tr>
<tr>
<td><b>&#1055;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1086;&#1083;&#1080;&#1075;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1077;&#1090;&#1082;&#1080;</b>
</td>
<td>&#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1086;&#1083;&#1080;&#1075;&#1086;&#1085;&#1086;&#1074; &#1087;&#1086;&#1083;&#1080;&#1075;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1077;&#1090;&#1082;&#1080; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;
</td></tr>
<tr>
<td><b>&#1055;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100; &#1083;&#1080;&#1085;&#1080;&#1080;</b>
</td>
<td>&#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100; &#1083;&#1080;&#1085;&#1080;&#1081; &#1087;&#1086;&#1083;&#1080;&#1075;&#1086;&#1085;&#1086;&#1074; &#1087;&#1086;&#1083;&#1080;&#1075;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1077;&#1090;&#1082;&#1080; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;
</td></tr>
<tr>
<td><b>&#1044;&#1074;&#1091;&#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1077;&#1077; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1087;&#1091;&#1085;&#1082;&#1090; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;, &#1094;&#1074;&#1077;&#1090; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1093; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085; &#1075;&#1088;&#1072;&#1085;&#1077;&#1081; &#1073;&#1091;&#1076;&#1077;&#1090; &#1090;&#1072;&#1082;&#1080;&#1084; &#1078;&#1077;, &#1082;&#1072;&#1082; &#1080; &#1085;&#1072; &#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1077;. &#1048;&#1085;&#1072;&#1095;&#1077; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1077; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099; &#1075;&#1088;&#1072;&#1085;&#1077;&#1081; &#1073;&#1091;&#1076;&#1091;&#1090; &#1087;&#1086;&#1076;&#1089;&#1074;&#1077;&#1095;&#1077;&#1085;&#1099; <a href="#3D_%D0%92%D0%B8%D0%B4">&#1094;&#1074;&#1077;&#1090;&#1086;&#1084; &#1087;&#1086;&#1076;&#1089;&#1074;&#1077;&#1090;&#1082;&#1080;</a> &#1080;&#1083;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1099; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1095;&#1077;&#1088;&#1085;&#1099;&#1084; &#1094;&#1074;&#1077;&#1090;&#1086;&#1084; &#1077;&#1089;&#1083;&#1080; &#1087;&#1086;&#1076;&#1089;&#1074;&#1077;&#1090;&#1082;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1072;.
</td></tr>
<tr>
<td><b>&#1054;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100; &#1075;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1075;&#1072;&#1073;&#1072;&#1088;&#1080;&#1090;&#1085;&#1099;&#1093; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074; &#1076;&#1083;&#1103; &#1087;&#1086;&#1076;&#1089;&#1074;&#1077;&#1095;&#1077;&#1085;&#1085;&#1099;&#1093; &#1080;&#1083;&#1080; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1093; &#1087;&#1086;&#1083;&#1080;&#1075;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1089;&#1077;&#1090;&#1086;&#1082;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1087;&#1091;&#1085;&#1082;&#1090; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;, &#1090;&#1086;&#1075;&#1076;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1078;&#1077;&#1083;&#1090;&#1099;&#1081; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1099;&#1081; &#1082;&#1072;&#1088;&#1082;&#1072;&#1089;  &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1102;&#1097;&#1080;&#1081; &#1075;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1075;&#1072;&#1073;&#1072;&#1088;&#1080;&#1090;&#1085;&#1099;&#1093; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074; &#1076;&#1083;&#1103; &#1087;&#1086;&#1076;&#1089;&#1074;&#1077;&#1095;&#1077;&#1085;&#1085;&#1099;&#1093; &#1080;&#1083;&#1080; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1093; &#1087;&#1086;&#1083;&#1080;&#1075;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1089;&#1077;&#1090;&#1086;&#1082;.
</td></tr>
<tr>
<td><b>&#1047;&#1072;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100; &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1074;&#1077;&#1088;&#1096;&#1080;&#1085;&#1099;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1087;&#1091;&#1085;&#1082;&#1090; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;, &#1090;&#1086;&#1075;&#1076;&#1072; &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1075;&#1086; &#1079;&#1072;&#1090;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; <a rel="nofollow" class="external text" href="https://ru.wikipedia.org/wiki/%D0%97%D0%B0%D1%82%D0%B5%D0%BD%D0%B5%D0%BD%D0%B8%D0%B5_%D0%BF%D0%BE_%D0%A4%D0%BE%D0%BD%D0%B3%D1%83">&#1079;&#1072;&#1090;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1060;&#1086;&#1085;&#1075;&#1091;</a>. &#1058;&#1080;&#1087; &#1079;&#1072;&#1090;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1081; &#1074;&#1080;&#1076; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081;. &#1055;&#1088;&#1080; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1084; &#1079;&#1072;&#1090;&#1077;&#1085;&#1077;&#1085;&#1080;&#1080; &#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1080; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1080; &#1085;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1074;&#1077;&#1088;&#1096;&#1080;&#1085;&#1099;. &#1069;&#1090;&#1086; &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1080;&#1090; &#1082; &#1085;&#1077;&#1088;&#1077;&#1072;&#1083;&#1080;&#1089;&#1090;&#1080;&#1095;&#1085;&#1086;&#1084;&#1091; &#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1084;&#1091; &#1074;&#1080;&#1076;&#1091; &#1082;&#1088;&#1080;&#1074;&#1086;&#1083;&#1080;&#1085;&#1077;&#1081;&#1085;&#1099;&#1093; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081;. &#1042; &#1090;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103;, &#1082;&#1072;&#1082; &#1079;&#1072;&#1090;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1060;&#1086;&#1085;&#1075;&#1091; &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1080;&#1090; &#1082; &#1073;&#1086;&#1083;&#1077;&#1077; &#1088;&#1077;&#1072;&#1083;&#1080;&#1089;&#1090;&#1080;&#1095;&#1085;&#1086;&#1084;&#1091; &#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1084;&#1091; &#1074;&#1080;&#1076;&#1091;.
</td></tr>
<tr>
<td><b>&#1059;&#1075;&#1086;&#1083; &#1089;&#1075;&#1080;&#1073;&#1072;</b>
</td>
<td>&#1059;&#1075;&#1086;&#1083; &#1089;&#1075;&#1080;&#1073;&#1072;-&#1101;&#1090;&#1086; &#1087;&#1086;&#1088;&#1086;&#1075;&#1086;&#1074;&#1099;&#1081; &#1091;&#1075;&#1086;&#1083; &#1084;&#1077;&#1078;&#1076;&#1091; &#1076;&#1074;&#1091;&#1084;&#1103; &#1075;&#1088;&#1072;&#1085;&#1103;&#1084;&#1080;. &#1054;&#1085; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1072; &#1086;&#1087;&#1094;&#1080;&#1103;: <b>&#1079;&#1072;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100; &#1076;&#1086;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1074;&#1077;&#1088;&#1096;&#1080;&#1085;&#1099;</b>.
<dl><dd>&#1045;&#1089;&#1083;&#1080; &#1091;&#1075;&#1086;&#1083; &#1075;&#1088;&#1072;&#1085;&#1080; &ge; &#1091;&#1075;&#1083;&#1072; &#1089;&#1075;&#1080;&#1073;&#1072;, &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1079;&#1072;&#1090;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1073;&#1077;&#1079; &#1088;&#1072;&#1079;&#1084;&#1099;&#1090;&#1080;&#1103;</dd>
<dd>&#1045;&#1089;&#1083;&#1080; &#1091;&#1075;&#1086;&#1083; &#1075;&#1088;&#1072;&#1085;&#1080; &lt; &#1091;&#1075;&#1083;&#1072; &#1089;&#1075;&#1080;&#1073;&#1072;, &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1083;&#1072;&#1074;&#1085;&#1086;&#1077; &#1079;&#1072;&#1090;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;</dd></dl>
</td></tr></tbody></table>
</div>
<p><span id="Workbenches"></span>
</p>
<h2><span id=".D0.A0.D0.B0.D0.B1.D0.BE.D1.87.D0.B5.D0.B5_.D0.BE.D0.BA.D1.80.D1.83.D0.B6.D0.B5.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1056;&#1072;&#1073;&#1086;&#1095;&#1077;&#1077;_&#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1077;">&#1056;&#1072;&#1073;&#1086;&#1095;&#1077;&#1077; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1077;</span></h2>
<div class="mw-translate-fuzzy">
<p>&#1042; &#1101;&#1090;&#1086;&#1084; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082; &#1077;&#1089;&#1090;&#1100; &#1086;&#1076;&#1085;&#1072; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1072;: &#1044;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1077; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;.
</p>
</div>
<p><span id="Available_Workbenches"></span>
</p>
<h3><span id=".D0.94.D0.BE.D1.81.D1.82.D1.83.D0.BF.D0.BD.D1.8B.D0.B5_.D0.92.D0.B5.D1.80.D1.81.D1.82.D0.B0.D0.BA.D0.B8"></span><span class="mw-headline" id="&#1044;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1077;_&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;">&#1044;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1077; &#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</span></h3>
<p><span typeof="mw:File"><a href="../index.php?title=Preferences_Workbenches_Page_Available_Workbenches.png&amp;filetimestamp=20250610111719&amp;.html" class="mw-file-description"><img src="../File/Preferences_Workbenches_Page_Available_Workbenches.png" decoding="async" width="400" height="539" class="mw-file-element" data-file-width="623" data-file-height="840"></a></span>
</p><p>These preferences control workbench loading.
</p><p>&#1053;&#1072; &#1101;&#1090;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;:
</p>
<table class="wikitable float-right mw-collapsible mw-uncollapsed">
<tbody><tr>
<th style="width: 33%;">Name
</th>
<th style="width: 66%;">Description
</th></tr>
<tr>
<td><b>Workbench list</b>
</td>
<td>The list displays all installed workbenches. The list can be reordered by drag and drop (<span style="font-size:small;"><a href="../Release_notes_0.21.html" title="Release notes 0.21">introduced in 0.21</a></span>) and sorted by right-clicking the list and selecting <b>Sort alphabetically</b> (<span style="font-size:small;"><a href="../Release_notes_1.0.html" title="Release notes 1.0">introduced in 1.0</a></span>). The order of the list also determines the order of the <a href="../Std_Workbench.html" title="Std Workbench">Workbench selector</a>.
<ul><li><span style="font-size:small;"><a href="../Release_notes_0.21.html" title="Release notes 0.21">introduced in 0.21</a></span>: <b>First checkbox in each row</b>: If checked, the workbench will be available in the Workbench selector in the next FreeCAD session. The start up workbench cannot be unchecked. Unchecked workbenches are moved to the bottom of the list.</li>
<li><b>Auto-load</b>: If checked, the workbench will auto-load when FreeCAD starts. Loading more workbenches will make the start up slower, but switching between workbenches that have already been loaded is faster.</li>
<li><span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.4em; padding: 0px 10px 1px 10px; font-weight:normal;color: #202122;">Load</span>: Press this button to load the workbench in the current FreeCAD session.</li></ul>
</td></tr>
<tr>
<td><b>Workbench selector items style</b> <span style="font-size:small;"><a href="../Release_notes_1.0.html" title="Release notes 1.0">introduced in 1.0</a></span>
</td>
<td>The options are:
<ul><li><b>Icon &amp; Text</b></li>
<li><b>Icon</b></li>
<li><b>Text</b></li></ul>
</td></tr>
<tr>
<td><b>Workbench selector type</b> <span style="font-size:small;"><a href="../Release_notes_1.0.html" title="Release notes 1.0">introduced in 1.0</a></span>
</td>
<td>The options are:
<ul><li><b>ComboBox</b>: Workbenches can be selected from a dropdown list.</li>
<li><b>TabBar</b>: Workbenches can be selected from a tab bar. This takes fewer clicks than the previous option, but takes up more screen space.</li></ul>
</td></tr>
<tr>
<td><b>Start up workbench</b>
</td>
<td>The workbench that is activated when FreeCAD starts.
</td></tr>
<tr>
<td><b>Remember active workbench by tab</b>
</td>
<td>If checked, FreeCAD will remember and restore the workbench that was active for each tab in the <a href="../Main_view_area.html" class="mw-redirect" title="Main view area">Main view area</a>.
</td></tr></tbody></table>
<h2><span class="mw-headline" id="Python">Python</span></h2>
<p>This preferences group (<span style="font-size:small;"><a href="../Release_notes_0.21.html" title="Release notes 0.21">introduced in 0.21</a></span>) has three pages: Macro, General and Editor.
</p><p><span id="Macro"></span>
</p>
<h3><span id=".D0.9C.D0.B0.D0.BA.D1.80.D0.BE.D1.81"></span><span class="mw-headline" id="&#1052;&#1072;&#1082;&#1088;&#1086;&#1089;">&#1052;&#1072;&#1082;&#1088;&#1086;&#1089;</span></h3>
<p><span typeof="mw:File"><a href="../index.php?title=Preferences_Python_Page_Macro.png&amp;filetimestamp=20240422195811&amp;.html" class="mw-file-description"><img src="../File/Preferences_Python_Page_Macro.png" decoding="async" width="400" height="323" class="mw-file-element" data-file-width="600" data-file-height="484"></a></span>
</p><p>&#1053;&#1072; &#1101;&#1090;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;:
</p>
<div class="mw-translate-fuzzy">
<table class="wikitable float-right mw-collapsible mw-collapsed">
<tbody><tr>
<th style="width: 33%;">&#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;
</th>
<th style="width: 66%;">&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;
</th></tr>
<tr>
<td><b>&#1047;&#1072;&#1087;&#1091;&#1089;&#1082; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1086;&#1074; &#1074; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1080;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;, &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077;, &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1072;&#1084;&#1080;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1102;&#1090;&#1089;&#1103; &#1082;&#1072;&#1082; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077;, &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1086;&#1085;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1102;&#1090;&#1089;&#1103; &#1082;&#1072;&#1082; &#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077; Python
</td></tr>
<tr>
<td><b>&#1050;&#1091;&#1076;&#1072; &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1090;&#1100; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1099;</b>
</td>
<td>&#1055;&#1091;&#1090;&#1100; &#1082; &#1087;&#1072;&#1087;&#1082;&#1077; &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1099;
</td></tr>
<tr>
<td><b>&#1047;&#1072;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;, <a href="../ru/Std_DlgMacroRecord.html" title="Std DlgMacroRecord/ru">&#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1077; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1099;</a> &#1090;&#1072;&#1082;&#1078;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;
</td></tr>
<tr>
<td><b>&#1047;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1090;&#1100; &#1082;&#1072;&#1082; &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1081;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;, <a href="../ru/Std_DlgMacroRecord.html" title="Std DlgMacroRecord/ru">&#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1077; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1099;</a> &#1090;&#1072;&#1082;&#1078;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;, &#1085;&#1086; &#1074; &#1074;&#1080;&#1076;&#1077; &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1077;&#1074;. &#1069;&#1090;&#1086; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1085;&#1077; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100; &#1074;&#1080;&#1076;&#1080;&#1084;&#1099;&#1077; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; &#1087;&#1088;&#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1077; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1072;, &#1072; &#1074;&#1080;&#1076;&#1077;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1074;&#1080;&#1079;&#1091;&#1072;&#1083;&#1100;&#1085;&#1086;.
</td></tr>
<tr>
<td><b>&#1055;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1072; &#1074; &#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1080; Python</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;, &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;, &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1099;&#1077; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1072;&#1084;&#1080;, &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1080; Python. &#1069;&#1090;&#1072; &#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1100; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1085;&#1102; <b> &#1042;&#1080;&#1076; &rarr; &#1055;&#1072;&#1085;&#1077;&#1083;&#1080; &rarr; &#1050;&#1086;&#1085;&#1089;&#1086;&#1083;&#1100; Python</b>.
</td></tr>
<tr>
<td><b>&#1056;&#1072;&#1079;&#1084;&#1077;&#1088; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1085;&#1077;&#1076;&#1072;&#1074;&#1085;&#1080;&#1093; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1086;&#1074;</b>
</td>
<td>&#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1076;&#1083;&#1080;&#1085;&#1091; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1085;&#1077;&#1076;&#1072;&#1074;&#1085;&#1086; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1093; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1086;&#1074;.
</td></tr>
<tr>
<td><b>&#1050;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1103;&#1088;&#1083;&#1099;&#1082;&#1086;&#1074;</b>
</td>
<td>&#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1076;&#1083;&#1080;&#1085;&#1091; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1085;&#1077;&#1076;&#1072;&#1074;&#1085;&#1086; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1093; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1086;&#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1080; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;
</td></tr>
<tr>
<td><b>&#1050;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1103; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;</b>
</td>
<td>&#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;, &#1082;&#1072;&#1082;&#1072;&#1103; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1103; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1086;&#1074;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1077;&#1089;&#1083;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1088;&#1072;&#1074;&#1085;&#1086; <b>Ctrl+Shift+</b> &#1101;&#1090;&#1086; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090; &#1095;&#1090;&#1086; &#1084;&#1072;&#1077;&#1088;&#1086;&#1089;&#1099; &#1084;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1081; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096; <b>Ctrl+Shift+1</b>, <b>Ctrl+Shift+2</b> &#1080; &#1090;&#1072;&#1082; &#1076;&#1072;&#1083;&#1077;&#1077;.
</td></tr></tbody></table>
</div>
<p><span id="General"></span>
</p>
<div class="mw-translate-fuzzy">
<h3><span id=".D0.9A.D0.BE.D0.BD.D1.81.D0.BE.D0.BB.D1.8C_Python"></span><span class="mw-headline" id="&#1050;&#1086;&#1085;&#1089;&#1086;&#1083;&#1100;_Python">&#1050;&#1086;&#1085;&#1089;&#1086;&#1083;&#1100; Python</span></h3>
</div>
<p><span typeof="mw:File"><a href="../index.php?title=Preferences_Python_Page_General.png&amp;filetimestamp=20240422195759&amp;.html" class="mw-file-description"><img src="../File/Preferences_Python_Page_General.png" decoding="async" width="400" height="171" class="mw-file-element" data-file-width="600" data-file-height="257"></a></span>
</p><p>These preferences control the behavior of the <a href="../Python_console.html" class="mw-redirect" title="Python console">Python console</a>. This console can be opened using the <b>View &rarr; Panels &rarr; Python console</b> menu option.
</p><p>Note that the color and font settings for the console are defined on the <a href="#Editor">Editor</a> page.
</p><p>&#1053;&#1072; &#1101;&#1090;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;:
</p>
<table class="wikitable float-right mw-collapsible mw-uncollapsed">
<tbody><tr>
<th style="width: 33%;">Name
</th>
<th style="width: 66%;">Description
</th></tr>
<tr>
<td><b>Enable word wrap</b>
</td>
<td>If checked, words will be wrapped if they exceed the available horizontal space in the console.
</td></tr>
<tr>
<td><b>Enable block cursor</b>
</td>
<td>If checked, the cursor will have a block shape.
</td></tr>
<tr>
<td><b>Save history</b>
</td>
<td>If checked, Python history is saved across sessions.
</td></tr>
<tr>
<td><b>Python profiler interval (milliseconds)</b> <span style="font-size:small;"><a href="../Release_notes_1.0.html" title="Release notes 1.0">introduced in 1.0</a></span>
</td>
<td>The interval at which the profiler runs when there is Python code running (to keep the GUI responding). Set to 0 to disable.
</td></tr>
<tr>
<td><b>Path to external Python executable (optional)</b>
</td>
<td>Used for package installation with pip and debugging with debugpy. Autodetected if needed and not specified.
</td></tr></tbody></table>
<p><span id="Editor"></span>
</p>
<h3><span id=".D0.A0.D0.B5.D0.B4.D0.B0.D0.BA.D1.82.D0.BE.D1.80_.D0.BA.D0.BE.D0.B4.D0.B0"></span><span class="mw-headline" id="&#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;_&#1082;&#1086;&#1076;&#1072;">&#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088; &#1082;&#1086;&#1076;&#1072;</span></h3>
<p><span typeof="mw:File"><a href="../index.php?title=Preferences_Python_Page_Editor.png&amp;filetimestamp=20240422195749&amp;.html" class="mw-file-description"><img src="../File/Preferences_Python_Page_Editor.png" decoding="async" width="400" height="371" class="mw-file-element" data-file-width="600" data-file-height="556"></a></span>
</p>
<div class="mw-translate-fuzzy">
<p>&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1095;&#1090;&#1077;&#1085;&#1080;&#1081; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;&#1072; &#1074;&#1083;&#1080;&#1103;&#1102;&#1090; &#1085;&#1072; &#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;&#1072; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1086;&#1074;. &#1069;&#1090;&#1086;&#1090; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088; &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1085;&#1102; <b>&#1052;&#1072;&#1082;&#1088;&#1086;&#1089; &rarr; &#1052;&#1072;&#1082;&#1088;&#1086;&#1089;&#1099;... &rarr; &#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;/&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100;</b>.
</p>
</div>
<div class="mw-translate-fuzzy">
<p>&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1094;&#1074;&#1077;&#1090;&#1072; &#1080; &#1096;&#1088;&#1080;&#1092;&#1090;&#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090; &#1074;&#1083;&#1080;&#1103;&#1085;&#1080;&#1077; &#1085;&#1072; <a href="../ru/Python_console.html" class="mw-redirect" title="Python console/ru">&#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1100; Python</a>. &#1069;&#1090;&#1072; &#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1100; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1085;&#1102; <b>&#1042;&#1080;&#1076; &rarr; &#1055;&#1072;&#1085;&#1077;&#1083;&#1080; &rarr; &#1050;&#1086;&#1085;&#1089;&#1086;&#1083;&#1100; Python</b>.
</p>
</div>
<p>&#1053;&#1072; &#1101;&#1090;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;:
</p>
<div class="mw-translate-fuzzy">
<table class="wikitable float-right mw-collapsible mw-collapsed">
<tbody><tr>
<th style="width: 33%;">&#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;
</th>
<th style="width: 66%;">&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;
</th></tr>
<tr>
<td><b>&#1055;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1085;&#1086;&#1084;&#1077;&#1088;&#1072; &#1089;&#1090;&#1088;&#1086;&#1082;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1087;&#1091;&#1085;&#1082;&#1090; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;, &#1090;&#1086; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1082;&#1086;&#1076;&#1072; &#1073;&#1091;&#1076;&#1091;&#1090; &#1087;&#1088;&#1086;&#1085;&#1091;&#1084;&#1077;&#1088;&#1086;&#1074;&#1072;&#1085;&#1099;
</td></tr>
<tr>
<td><b>&#1064;&#1072;&#1075; &#1090;&#1072;&#1073;&#1091;&#1083;&#1103;&#1094;&#1080;&#1080;</b>
</td>
<td>&#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1096;&#1072;&#1075;&#1072; &#1090;&#1072;&#1073;&#1091;&#1083;&#1103;&#1090;&#1086;&#1088;&#1072; (&#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1087;&#1088;&#1086;&#1073;&#1077;&#1083;&#1086;&#1074;). &#1045;&#1089;&#1083;&#1080;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &laquo;6&raquo;, &#1087;&#1088;&#1080; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1080; <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">Tab</span> &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076; &#1082; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1091; 7, 13, 19 &#1080; &#1090;.&#1076;., &#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1081; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1080; &#1082;&#1091;&#1088;&#1089;&#1086;&#1088;&#1072;. &#1069;&#1090;&#1086;&#1090; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085; <b>&#1057;&#1080;&#1084;&#1074;&#1086;&#1083;&#1099; &#1090;&#1072;&#1073;&#1091;&#1083;&#1103;&#1094;&#1080;&#1080;</b>.
</td></tr>
<tr>
<td><b>&#1056;&#1072;&#1079;&#1084;&#1077;&#1088; &#1086;&#1090;&#1089;&#1090;&#1091;&#1087;&#1072;</b>
</td>
<td>&#1059;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;, &#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1088;&#1086;&#1073;&#1077;&#1083;&#1086;&#1074; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1086; &#1087;&#1088;&#1080; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1080; <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">Tab</span>. &#1069;&#1090;&#1086;&#1090; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085; <b>&#1047;&#1072;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1085;&#1072; &#1087;&#1088;&#1086;&#1073;&#1077;&#1083;&#1099;</b>.
</td></tr>
<tr>
<td><b>&#1057;&#1080;&#1084;&#1074;&#1086;&#1083;&#1099; &#1090;&#1072;&#1073;&#1091;&#1083;&#1103;&#1094;&#1080;&#1080;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1087;&#1091;&#1085;&#1082;&#1090; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;, &#1090;&#1086; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077; <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;"> Tab</span> &#1074;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090; &#1090;&#1072;&#1073;&#1091;&#1083;&#1103;&#1090;&#1086;&#1088; &#1089; &#1088;&#1072;&#1089;&#1090;&#1088;&#1086;&#1084;, &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1084;&#1099;&#1084; <b>&#1064;&#1072;&#1075; &#1090;&#1072;&#1073;&#1091;&#1083;&#1103;&#1094;&#1080;&#1080;</b>
</td></tr>
<tr>
<td><b>&#1047;&#1072;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1085;&#1072; &#1087;&#1088;&#1086;&#1073;&#1077;&#1083;&#1099;</b>
</td>
<td>&#1045;&#1089;&#1083;&#1080; &#1087;&#1091;&#1085;&#1082;&#1090; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;, &#1090;&#1086; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077; <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;"> Tab</span> &#1074;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1087;&#1088;&#1086;&#1073;&#1077;&#1083;&#1086;&#1074;, &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1084;&#1099;&#1093; <b>&#1056;&#1072;&#1079;&#1084;&#1077;&#1088; &#1086;&#1090;&#1089;&#1090;&#1091;&#1087;&#1072;</b>
</td></tr>
<tr>
<td><b>&#1055;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1087;&#1091;&#1085;&#1082;&#1090;&#1099;</b>
</td>
<td>&#1042;&#1099;&#1073;&#1086;&#1088; &#1090;&#1080;&#1087;&#1072; &#1082;&#1086;&#1076;&#1072;. &#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1094;&#1074;&#1077;&#1090;&#1072; &#1080; &#1096;&#1088;&#1080;&#1092;&#1090;&#1072; &#1073;&#1091;&#1076;&#1091;&#1090; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1099; &#1082; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1084;&#1091; &#1090;&#1080;&#1087;&#1091;. &#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100; &#1074; &#1086;&#1082;&#1085;&#1077; "&#1055;&#1088;&#1077;&#1076;&#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;".
</td></tr>
<tr>
<td><b>&#1064;&#1088;&#1080;&#1092;&#1090;</b>
</td>
<td>&#1042;&#1099;&#1073;&#1086;&#1088; &#1090;&#1080;&#1087;&#1072; &#1096;&#1088;&#1080;&#1092;&#1090;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1076;&#1083;&#1103; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1090;&#1080;&#1087;&#1072; &#1082;&#1086;&#1076;&#1072;
</td></tr>
<tr>
<td><b>&#1056;&#1072;&#1079;&#1084;&#1077;&#1088;</b>
</td>
<td>&#1042;&#1099;&#1073;&#1086;&#1088; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072; &#1096;&#1088;&#1080;&#1092;&#1090;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1076;&#1083;&#1103; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1090;&#1080;&#1087;&#1072; &#1082;&#1086;&#1076;&#1072;
</td></tr>
<tr>
<td><b>&#1062;&#1074;&#1077;&#1090;</b>
</td>
<td>&#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1094;&#1074;&#1077;&#1090;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1076;&#1083;&#1103; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1090;&#1080;&#1087;&#1072; &#1082;&#1086;&#1076;&#1072;
</td></tr></tbody></table>
</div>
<p><span id="Addon_Manager"></span>
</p>
<h2><span id=".D0.9C.D0.B5.D0.BD.D0.B5.D0.B4.D0.B6.D0.B5.D1.80_.D0.94.D0.BE.D0.BF.D0.BE.D0.BB.D0.BD.D0.B5.D0.BD.D0.B8.D0.B9"></span><span class="mw-headline" id="&#1052;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088;_&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1081;">&#1052;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088; &#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1081;</span></h2>
<p>This preferences group has a single page: Addon manager options.
</p><p><span id="Addon_manager_options"></span>
</p>
<h3><span id=".D0.9D.D0.B0.D1.81.D1.82.D1.80.D0.BE.D0.B9.D0.BA.D0.B8_.D0.BC.D0.B5.D0.BD.D0.B5.D0.B4.D0.B6.D0.B5.D1.80.D0.B0_.D0.B4.D0.BE.D0.BF.D0.BE.D0.BB.D0.BD.D0.B5.D0.BD.D0.B8.D0.B9"></span><span class="mw-headline" id="&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;_&#1084;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088;&#1072;_&#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1081;">&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1084;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088;&#1072; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1081;</span></h3>
<p><span typeof="mw:File"><a href="../index.php?title=Preferences_Addon_Manager_Page_Addon_manager_options.png&amp;filetimestamp=20240422195215&amp;.html" class="mw-file-description"><img src="../File/Preferences_Addon_Manager_Page_Addon_manager_options.png" decoding="async" width="400" height="532" class="mw-file-element" data-file-width="600" data-file-height="798"></a></span>
</p><p>These preferences control the behavior of the <a href="../Std_AddonMgr.html" title="Std AddonMgr">Addon manager</a>.
</p><p>&#1053;&#1072; &#1101;&#1090;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;:
</p>
<table class="wikitable float-right mw-collapsible mw-uncollapsed">
<tbody><tr>
<th style="width: 33%;">Name
</th>
<th style="width: 66%;">Description
</th></tr>
<tr>
<td><b>Automatically check for updates at start (requires git)</b>
</td>
<td>If checked, the Addon manager will check for updates when it is launched. Git must be installed for this to work.
</td></tr>
<tr>
<td><b>Download Macro metadata (approximately 10MB)</b>
</td>
<td>If checked, macro metadata is downloaded for display in the Addon manager's main addon listing. This data is cached locally.
</td></tr>
<tr>
<td><b>Cache update frequency</b>
</td>
<td>Controls the frequency with which the locally cached addon availability and metadata information is updated. The options are:
<ul><li><b>Manual (no automatic updates)</b></li>
<li><b>Daily</b></li>
<li><b>Weekly</b></li></ul>
</td></tr>
<tr>
<td><b>Hide Addons without license</b> <span style="font-size:small;"><a href="../Release_notes_1.0.html" title="Release notes 1.0">introduced in 1.0</a></span>
</td>
<td>If checked, addons without a license are not included in the listing.
</td></tr>
<tr>
<td><b>Hide Addons with non-FSF Free/Libre license</b> <span style="font-size:small;"><a href="../Release_notes_1.0.html" title="Release notes 1.0">introduced in 1.0</a></span>
</td>
<td>If checked, addons with a Free/Libre license not published by the <a rel="nofollow" class="external text" href="https://www.fsf.org/licensing">Free Software Foundation</a> are not included in the listing.
</td></tr>
<tr>
<td><b>Hide Addons with non-OSI-approved license</b> <span style="font-size:small;"><a href="../Release_notes_1.0.html" title="Release notes 1.0">introduced in 1.0</a></span>
</td>
<td>If checked, addons with a license not approved by the <a rel="nofollow" class="external text" href="https://opensource.org/licenses">Open Source Initiative</a> are not included in the listing.
</td></tr>
<tr>
<td><b>Hide Addons marked Python 2 Only</b>
</td>
<td>If checked, addons marked as "Python 2 Only" are not included in the listing. These addons are unlikely to work in the current FreeCAD version.
</td></tr>
<tr>
<td><b>Hide Addons marked Obsolete</b>
</td>
<td>If checked, addons marked as "Obsolete" are not included in the listing.
</td></tr>
<tr>
<td><b>Hide Addons that require a newer version of FreeCAD</b>
</td>
<td>If checked, addons that require a newer FreeCAD version are not included in the listing.
</td></tr>
<tr>
<td><b>Custom repositories</b>
</td>
<td>Custom repositories can be specified here.
<p>To add a repository press the <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.4em; padding: 0px 10px 1px 10px; font-weight:normal;color: #202122;"><span typeof="mw:File"><a href="../index.php?title=List-add.svg&amp;filetimestamp=20240522171753&amp;.html" class="mw-file-description"><img src="../File/List-add.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span></span> button. Both the <b>Repository URL</b> and the <b>Branch</b>, typically <code>master</code> or <code>main</code>, must be specifies in the dialog that opens. <span style="font-size:small;"><a href="../Release_notes_0.21.html" title="Release notes 0.21">introduced in 0.21</a></span>
</p><p>To remove a repository select it in the list and press the <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.4em; padding: 0px 10px 1px 10px; font-weight:normal;color: #202122;"><span typeof="mw:File"><a href="../index.php?title=List-remove.svg&amp;filetimestamp=20240522171811&amp;.html" class="mw-file-description"><img src="../File/List-remove.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span></span> button. <span style="font-size:small;"><a href="../Release_notes_0.21.html" title="Release notes 0.21">introduced in 0.21</a></span>
</p>
</td></tr>
<tr>
<td><b>Proxy</b>
</td>
<td>The Addon manager includes experimental support for proxies requiring authentication, set up as user-defined proxies.
</td></tr>
<tr>
<td><b>Score source URL</b> <span style="font-size:small;"><a href="../Release_notes_1.0.html" title="Release notes 1.0">introduced in 1.0</a></span>
</td>
<td>The URL for the Addon Score data. See <a href="../Std_AddonMgr.html#Sorting_by_score" title="Std AddonMgr">Std AddonMgr</a> for formatting and hosting details.
</td></tr>
<tr>
<td><b>Path to git executable (optional)</b> <span style="font-size:small;"><a href="../Release_notes_0.21.html" title="Release notes 0.21">introduced in 0.21</a></span>
</td>
<td>The Addon manager attempts to determine the git executable. To override this selection, the path to the executable can be set here.
</td></tr>
<tr>
<td><b>Show option to change branches (requires git)</b>
</td>
<td>If checked, the Addon manager provides an interface on the addon's details screen that allows switching which git branch is currently checked out. This is intended for advanced users only, as it is possible that a non-primary-branch version of an addon may result in instability and compatibility issues. Git must be installed for this to work. Use with caution.
</td></tr>
<tr>
<td><b>Disable git (fall back to ZIP downloads only)</b> <span style="font-size:small;"><a href="../Release_notes_0.21.html" title="Release notes 0.21">introduced in 0.21</a></span>
</td>
<td>If checked, git downloads are disabled.
</td></tr>
<tr>
<td><b>Addon developer mode</b> <span style="font-size:small;"><a href="../Release_notes_0.21.html" title="Release notes 0.21">introduced in 0.21</a></span>
</td>
<td>If checked, Addon manager options intended for developers of addons are activated.
</td></tr></tbody></table>
<p><span id="Import-Export"></span>
</p>
<h2><span id=".D0.98.D0.BC.D0.BF.D0.BE.D1.80.D1.82.2F.D0.AD.D0.BA.D1.81.D0.BF.D0.BE.D1.80.D1.82"></span><span class="mw-headline" id="&#1048;&#1084;&#1087;&#1086;&#1088;&#1090;/&#1069;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;">&#1048;&#1084;&#1087;&#1086;&#1088;&#1090;/&#1069;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;</span></h2>
<p>The Import-Export preferences affect how files are imported and exported. They are described on the <a href="../Import_Export_Preferences.html" title="Import Export Preferences">Import Export Preferences</a> page.
</p>
<h2><span class="mw-headline" id="Measure">Measure</span></h2>
<p><span style="font-size:small;"><a href="../Release_notes_1.0.html" title="Release notes 1.0">introduced in 1.0</a></span>
</p><p>This preferences group has a single page: Appearance.
</p>
<h3><span class="mw-headline" id="Appearance">Appearance</span></h3>
<p><span typeof="mw:File"><a href="../index.php?title=Preferences_Measure_Page_Appearance.png&amp;filetimestamp=20240624120738&amp;.html" class="mw-file-description"><img src="../File/Preferences_Measure_Page_Appearance.png" decoding="async" width="400" height="143" class="mw-file-element" data-file-width="600" data-file-height="214"></a></span>
</p><p>&#1053;&#1072; &#1101;&#1090;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;:
</p>
<table class="wikitable float-right mw-collapsible mw-uncollapsed">
<tbody><tr>
<th style="width: 33%;">Name
</th>
<th style="width: 66%;">Description
</th></tr>
<tr>
<td><b>Text size</b>
</td>
<td>Specifies the size of the text in pixels.
</td></tr>
<tr>
<td><b>Text color</b>
</td>
<td>Specifies the color of the text.
</td></tr>
<tr>
<td><b>Line color</b>
</td>
<td>Specifies the color of the line connecting the text label with the measured element(s).
</td></tr>
<tr>
<td><b>Background color</b>
</td>
<td>Specifies the background color of the text label.
</td></tr></tbody></table>
<p><span id="Workbench_related_preferences"></span>
</p>
<div class="mw-translate-fuzzy">
<h2><span id=".D0.9D.D0.B0.D1.81.D1.82.D1.80.D0.BE.D0.B9.D0.BA.D0.B8_.D0.B2.D0.B5.D1.80.D1.81.D1.82.D0.B0.D0.BA.D0.BE.D0.B2"></span><span class="mw-headline" id="&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;_&#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1086;&#1074;">&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1086;&#1074;</span></h2>
</div>
<div class="mw-translate-fuzzy">
<p>&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1076;&#1083;&#1103; &#1073;&#1086;&#1083;&#1077;&#1077; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1085;&#1099;&#1093; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1086;&#1074; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1099; &#1085;&#1080;&#1078;&#1077;.
&#1059; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1086;&#1074; &#1085;&#1077;&#1090; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082;.
&#1044;&#1088;&#1091;&#1075;&#1080;&#1077; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1085;&#1077; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1099;. &#1069;&#1090;&#1080; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1090;&#1072;&#1082; &#1078;&#1077; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1099; &#1074; <a href="../Category;Preferences.html" title="Category:Preferences">Category:Preferences</a>
</p>
</div>
<div class="mw-translate-fuzzy">
<ul><li><a href="../ru/Arch_Preferences.html" class="mw-redirect" title="Arch Preferences/ru">&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; Arch</a></li>
<li><a href="../ru/Draft_Preferences.html" title="Draft Preferences/ru">&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; Draft</a></li>
<li>Drawing Preferences (none) <span style="font-size:small;"><a href="../ru/Release_notes_0.16.html" title="Release notes 0.16/ru">&#1091;&#1087;&#1088;&#1072;&#1079;&#1076;&#1085;&#1077;&#1085;&#1086; &#1074; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 0.16</a></span></li>
<li><a href="../ru/FEM_Preferences.html" title="FEM Preferences/ru">&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; FEM</a></li>
<li>&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; Image (&#1085;&#1077;&#1090;)</li>
<li>&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; Inspection (&#1085;&#1077;&#1090;)</li>
<li>&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; Mesh Design (&#1085;&#1077;&#1090;)</li>
<li><a href="../ru/OpenSCAD_Preferences.html" title="OpenSCAD Preferences/ru">&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; OpenSCAD</a></li>
<li>&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; Part&nbsp;: &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; Part &#1090;&#1072;&#1082; &#1078;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; <a href="../PartDesign_Preferences.html" title="PartDesign Preferences">&#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; PartDesign</a></li>
<li><a href="../ru/PartDesign_Preferences.html" title="PartDesign Preferences/ru">&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; PartDesign</a></li>
<li><a href="../ru/Path_Preferences.html" class="mw-redirect" title="Path Preferences/ru">&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; Path</a></li>
<li>&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; Plot (&#1085;&#1077;&#1090;)</li>
<li>&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; Points (&#1085;&#1077;&#1090;)</li>
<li><a href="../ru/Raytracing_Preferences.html" title="Raytracing Preferences/ru">&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; Raytracing</a></li>
<li>&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; Reverse Engineering (&#1085;&#1077;&#1090;)</li>
<li>&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; Robot (&#1085;&#1077;&#1090;)</li>
<li><a href="../ru/Sketcher_Preferences.html" title="Sketcher Preferences/ru">&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; Sketcher</a></li>
<li>&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; Spreadsheet (&#1085;&#1077;&#1090;)</li>
<li><a href="../ru/Start_Preferences.html" title="Start Preferences/ru">&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1057;&#1090;&#1072;&#1088;&#1090;&#1086;&#1074;&#1086;&#1081; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;</a></li>
<li>&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; Surface (&#1085;&#1077;&#1090;)</li>
<li><a href="../ru/TechDraw_Preferences.html#%D0%9D%D0%B0%D1%81%D1%82%D1%80%D0%BE%D0%B9%D0%BA%D0%B8" title="TechDraw Preferences/ru">&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; TechDraw</a></li>
<li>&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; Test Framework (&#1085;&#1077;&#1090;)</li>
<li>&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; Web (&#1085;&#1077;&#1090;)</li></ul>
</div>
<p><span id="Scripting"></span>
</p>
<h2><span id=".D0.9F.D1.80.D0.BE.D0.B3.D1.80.D0.B0.D0.BC.D0.BC.D0.B8.D1.80.D0.BE.D0.B2.D0.B0.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;">&#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;</span></h2>
<p>See <a href="../Std_DlgParameter.html#Scripting" title="Std DlgParameter">Std DlgParameter</a>.
</p><p><span id="Related"></span>
</p>
<h2><span id=".D0.A1.D0.BE.D0.BF.D1.83.D1.82.D1.81.D1.82.D0.B2.D1.83.D1.8E.D1.89.D0.B0.D1.8F_.D0.B8.D0.BD.D1.84.D0.BE.D1.80.D0.BC.D0.B0.D1.86.D0.B8.D1.8F"></span><span class="mw-headline" id="&#1057;&#1086;&#1087;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1072;&#1103;_&#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;">&#1057;&#1086;&#1087;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;</span></h2>
<ul><li><a href="../ru/Std_DlgParameter.html" title="Std DlgParameter/ru">&#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074;</a></li>
<li><a href="../ru/Fine-tuning.html" title="Fine-tuning/ru">&#1058;&#1086;&#1095;&#1085;&#1072;&#1103; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072;</a></li></ul>
<p><br>
</p>
<div class="docnav">
    <div><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-left.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span> <a href="../ru/Interface_Customization.html" title="Interface Customization/ru">&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072;</a></div>
    <div><a href="../ru/Import_Export_Preferences.html" title="Import Export Preferences/ru">&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1048;&#1084;&#1087;&#1086;&#1088;&#1090;&#1072; &#1069;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1072;</a>
 <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-right.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span></div>
    <div><a href="../ru/Online_Help_Toc.html" title="Online Help Toc/ru">&#1054;&#1075;&#1083;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;</a> <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Online_Help_Toc.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span></div>
</div>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><span typeof="mw:File"><a href="../index.php?title=User_hub.png&amp;filetimestamp=20190221145008&amp;.html" class="mw-file-description"><img src="../File/User_hub.png" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/User_hub.html" title="User hub/ru">&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b><a href="../ru/Getting_started.html" title="Getting started/ru">&#1053;&#1072;&#1095;&#1080;&#1085;&#1072;&#1102;&#1097;&#1080;&#1084;</a></b></li>
<li><b>&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072;:</b> <a href="../ru/Download.html" title="Download/ru">&#1047;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072;</a>, <a href="../ru/Installing_on_Windows.html" title="Installing on Windows/ru">Windows</a>, <a href="../ru/Installing_on_Linux.html" title="Installing on Linux/ru">Linux</a>, <a href="../ru/Installing_on_Mac.html" title="Installing on Mac/ru">Mac</a>, <a href="../ru/Installing_additional_components.html" title="Installing additional components/ru">
&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074;</a>, <a href="../ru/Compile_on_Docker.html" title="Compile on Docker/ru">Docker</a>, <a href="../ru/AppImage.html" title="AppImage/ru">AppImage</a>, <a href="../ru/Ubuntu_Snap.html" title="Ubuntu Snap/ru">Ubuntu Snap</a></li>
<li><b>&#1041;&#1072;&#1079;&#1086;&#1074;&#1072;&#1103;:</b> <a href="../ru/About_FreeCAD.html" title="About FreeCAD/ru">&#1054; FreeCAD</a>, <a href="../ru/Interface.html" title="Interface/ru">&#1048;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;</a>, <a href="../ru/Mouse_navigation.html" title="Mouse navigation/ru">&#1053;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1103; &#1084;&#1099;&#1096;&#1080;</a>, <a href="../ru/Selection_methods.html" title="Selection methods/ru">&#1052;&#1077;&#1090;&#1086;&#1076;&#1099; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103;</a>, <a href="../ru/Object_name.html" title="Object name/ru">&#1048;&#1084;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;</a>, <a class="mw-selflink selflink">&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;</a>, <a href="../ru/Workbenches.html" title="Workbenches/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>, <a href="../ru/Document_structure.html" title="Document structure/ru">&#1057;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;</a>, <a href="../ru/Property.html" title="Property/ru">&#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;</a>, <a href="../ru/Help_FreeCAD.html" title="Help FreeCAD/ru">&#1055;&#1086;&#1084;&#1086;&#1075;&#1080; FreeCAD</a>, <a href="../ru/Donate.html" title="Donate/ru">&#1055;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</a></li></ul>
<hr>
<ul><li><b>&#1055;&#1086;&#1084;&#1086;&#1097;&#1100;:</b> <a href="../ru/Tutorials.html" title="Tutorials/ru">&#1059;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082;&#1080;</a>, <a href="../ru/Video_tutorials.html" title="Video tutorials/ru">&#1042;&#1080;&#1076;&#1077;&#1086; &#1091;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082;&#1080;</a></li>
<li><b><a href="../ru/Workbenches.html" title="Workbenches/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>:</b> <a href="../ru/Std_Base.html" title="Std Base/ru">Std Base</a>, <a href="../ru/Arch_Workbench.html" title="Arch Workbench/ru">Arch</a>, <a href="../ru/Assembly_Workbench.html" title="Assembly Workbench/ru">Assembly</a>, <a href="../ru/CAM_Workbench.html" title="CAM Workbench/ru">CAM</a>, <a href="../ru/Draft_Workbench.html" title="Draft Workbench/ru">Draft</a>, <a href="../ru/FEM_Workbench.html" title="FEM Workbench/ru">FEM</a>, <a href="../ru/Inspection_Workbench.html" title="Inspection Workbench/ru">Inspection</a>, <a href="../ru/Mesh_Workbench.html" title="Mesh Workbench/ru">Mesh</a>, <a href="../ru/OpenSCAD_Workbench.html" title="OpenSCAD Workbench/ru">OpenSCAD</a>, <a href="../ru/Part_Workbench.html" title="Part Workbench/ru">Part</a>, <a href="../ru/PartDesign_Workbench.html" title="PartDesign Workbench/ru">PartDesign</a>, <a href="../ru/Points_Workbench.html" title="Points Workbench/ru">Points</a>, <a href="../ru/Reverse_Engineering_Workbench.html" title="Reverse Engineering Workbench/ru">Reverse Engineering</a>, <a href="../ru/Robot_Workbench.html" title="Robot Workbench/ru">Robot</a>, <a href="../ru/Sketcher_Workbench.html" title="Sketcher Workbench/ru">Sketcher</a>, <a href="../ru/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/ru">Spreadsheet</a>, <a href="../ru/Surface_Workbench.html" title="Surface Workbench/ru">Surface</a>, <a href="../ru/TechDraw_Workbench.html" title="TechDraw Workbench/ru">TechDraw</a>, <a href="../ru/Testing.html" title="Testing/ru">Test Framework</a></li></ul>
<hr>
<ul><li><b><a href="../ru/Addon.html" title="Addon/ru">Addons</a>:</b> <a href="../ru/Std_AddonMgr.html" title="Std AddonMgr/ru">&#1052;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1081;</a>, <a href="../ru/External_workbenches.html" title="External workbenches/ru">&#1042;&#1085;&#1077;&#1096;&#1085;&#1080;&#1077; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;</a>, <a href="../ru/Scripting_and_macros.html" title="Scripting and macros/ru">C&#1082;&#1088;&#1080;&#1087;&#1090;&#1099; &#1080; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1099;</a></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="../ru/User_hub.html" title="User hub/ru">&#1059;&#1075;&#1086;&#1083;&#1086;&#1082; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;</a>, <a href="../ru/Power_users_hub.html" title="Power users hub/ru">&#1059;&#1075;&#1086;&#1083;&#1086;&#1082; &#1086;&#1087;&#1099;&#1090;&#1085;&#1099;&#1093; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;</a>, <a href="../ru/Developer_hub.html" title="Developer hub/ru">&#1059;&#1075;&#1086;&#1083;&#1086;&#1082; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20250822105803
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.229 seconds
Real time usage: 0.305 seconds
Preprocessor visited node count: 2394/1000000
Post&#8208;expand include size: 30383/2097152 bytes
Template argument size: 13813/2097152 bytes
Highest expansion depth: 7/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 4096/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   50.179      1 -total
 15.21%    7.634    239 Template:MenuCommand
  7.20%    3.613      3 Template:Value
  7.17%    3.596      1 Template:PropertyView
  6.11%    3.068     15 Template:FileName
  5.60%    2.810      1 Template:Userdocnavi/ru
  4.89%    2.456      2 Template:Docnav/ru
  4.13%    2.070      1 Template:Obsolete/ru
  3.73%    1.871     28 Template:Version
  3.59%    1.801      3 Template:Incode
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:1055-0!canonical and timestamp 20250822105802 and revision id 1632959. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>