<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Release notes 0.13/ru</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="ru" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Release+notes+0.13&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../id/Release_notes_0.13.html" class="mw-pt-progress mw-pt-progress--low" title="Release notes 013 (0% translated)" lang="id" dir="ltr">Bahasa Indonesia</a></li>
<li><a href="../de/Release_notes_0.13.html" class="mw-pt-progress mw-pt-progress--complete" title="Versionshinweise 0.13 (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Release_notes_0.13.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Release notes 0.13 (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/Release_notes_0.13.html" class="mw-pt-progress mw-pt-progress--med" title="Release notes 013 (61% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/Release_notes_0.13.html" class="mw-pt-progress mw-pt-progress--complete" title="Notes de version 0.13 (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/Release_notes_0.13.html" class="mw-pt-progress mw-pt-progress--complete" title="Note di rilascio della versione 0.13 (100% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Release_notes_0.13.html" class="mw-pt-progress mw-pt-progress--complete" title="Informacje o wydaniu 0.13 (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--med" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</span></li></ul></div>
<p>&#1069;&#1090;&#1086; &#1086;&#1073;&#1079;&#1086;&#1088; &#1089;&#1072;&#1084;&#1099;&#1093; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1099;&#1093; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081; &#1087;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1077;&#1076;&#1096;&#1080;&#1093; &#1074; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; FreeCAD. &#1057;&#1084;&#1086;&#1090;&#1088;&#1080; <a rel="nofollow" class="external text" href="http://www.freecad.org/tracker/changelog_page.php">&#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;</a> &#1076;&#1083;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1086;&#1073; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;&#1093;.
</p>
<div class="mw-translate-fuzzy">
<p>&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1077; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080;: <a href="../Release_notes_0.12.html" title="Release notes 0.12">0.12</a> - <a href="../Release_notes_0.11.html" title="Release notes 0.11">0.11</a>
</p>
</div>
<p><span typeof="mw:File"><a href="../index.php?title=FreeCAD013.jpg&amp;filetimestamp=20120821220919&amp;.html" class="mw-file-description"><img src="../File/FreeCAD013.jpg" decoding="async" width="800" height="481" class="mw-file-element" data-file-width="1280" data-file-height="770"></a></span>
</p><p><small><i>modeled in FreeCAD by psicofil</i></small>
</p><p><br>
</p>
<meta property="mw:PageProp/toc">
<h2><span id=".D0.9E.D1.81.D0.BD.D0.BE.D0.B2.D0.BD.D0.BE.D0.B5"></span><span class="mw-headline" id="&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1077;">&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1077;</span></h2>
<ul><li><b>&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1094;&#1074;&#1077;&#1090;&#1086;&#1074;</b>: &#1042;&#1072;&#1084; &#1085;&#1072;&#1076;&#1086;&#1077;&#1083;&#1080; &#1089;&#1090;&#1072;&#1088;&#1099;&#1077; &#1076;&#1086;&#1073;&#1088;&#1099;&#1077; &#1089;&#1077;&#1088;&#1099;&#1077; &#1092;&#1086;&#1088;&#1084;&#1099; &#1089; &#1095;&#1077;&#1088;&#1085;&#1099;&#1084;&#1080; &#1082;&#1086;&#1085;&#1090;&#1091;&#1088;&#1072;&#1084;&#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1074; FreeCAD &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;? &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1077; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1095;&#1090;&#1077;&#1085;&#1080;&#1103; &#1074; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072;&#1093; (&#1054;&#1090;&#1086;&#1073;&#1088;&#1072;&#1079;&#1080;&#1090;&#1100; -&gt; &#1062;&#1074;&#1077;&#1090;&#1072;), &#1074;&#1084;&#1077;&#1089;&#1090;&#1077; &#1089; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072;&#1084;&#1080; &#1094;&#1074;&#1077;&#1090;&#1086;&#1074; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;.</li></ul>
<div class="mw-translate-fuzzy">
<h2><span id=".D0.9C.D0.BE.D0.B4.D1.83.D0.BB.D1.8C_.D1.81.D0.BE.D0.B7.D0.B4.D0.B0.D0.BD.D0.B8.D1.8F_.D0.BF.D1.80.D0.BE.D0.B5.D0.BA.D1.86.D0.B8.D0.B9"></span><span class="mw-headline" id="&#1052;&#1086;&#1076;&#1091;&#1083;&#1100;_&#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103;_&#1087;&#1088;&#1086;&#1077;&#1082;&#1094;&#1080;&#1081;">&#1052;&#1086;&#1076;&#1091;&#1083;&#1100; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1077;&#1082;&#1094;&#1080;&#1081;</span></h2>
<ul><li><b>&#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1086;&#1073;&#1088;&#1077;&#1079;&#1082;&#1080;</b>: &#1053;&#1086;&#1074;&#1099;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; <a href="../Drawing_Clip.html" title="Drawing Clip">&#1054;&#1073;&#1088;&#1077;&#1079;&#1082;&#1072; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;</a> &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1088;&#1072;&#1079;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1087;&#1088;&#1086;&#1077;&#1082;&#1094;&#1080;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1085;&#1077;&#1074;&#1080;&#1076;&#1080;&#1084;&#1086;&#1075;&#1086; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1086;&#1073;&#1088;&#1077;&#1078;&#1077;&#1090; &#1075;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;.</li>
<li><b>&#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1091;&#1077;&#1084;&#1099;&#1081; &#1096;&#1090;&#1072;&#1084;&#1087; &#1095;&#1077;&#1088;&#1090;&#1077;&#1078;&#1072;</b>: &#1055;&#1088;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1063;&#1077;&#1088;&#1090;&#1077;&#1078;&#1085;&#1099;&#1093; &#1064;&#1072;&#1073;&#1083;&#1086;&#1085;&#1086;&#1074;, &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1090;&#1084;&#1077;&#1090;&#1080;&#1090;&#1100; &#1090;&#1077;&#1082;&#1089;&#1090; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1073;&#1091;&#1076;&#1077;&#1090; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1091;&#1077;&#1084;&#1099;&#1084;. &#1069;&#1090;&#1086;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090; &#1073;&#1091;&#1076;&#1077;&#1090; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072;&#1087;&#1088;&#1103;&#1084;&#1091;&#1102; &#1074; FreeCAD.</li>
<li><b>&#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1072;&#1085;&#1085;&#1086;&#1090;&#1072;&#1094;&#1080;&#1080;</b>: &#1053;&#1086;&#1074;&#1072;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; <a href="../Drawing_Annotation.html" title="Drawing Annotation">&#1040;&#1085;&#1085;&#1086;&#1090;&#1072;&#1094;&#1080;&#1103;</a> , &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1073;&#1083;&#1086;&#1082;&#1072; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1085;&#1072; &#1095;&#1077;&#1088;&#1090;&#1077;&#1078;&#1077;.</li></ul>
</div>
<h2><span id=".D0.AD.D1.81.D0.BA.D0.B8.D0.B7.D0.BD.D1.8B.D0.B9_.D0.BC.D0.BE.D0.B4.D1.83.D0.BB.D1.8C"></span><span class="mw-headline" id="&#1069;&#1089;&#1082;&#1080;&#1079;&#1085;&#1099;&#1081;_&#1084;&#1086;&#1076;&#1091;&#1083;&#1100;">&#1069;&#1089;&#1082;&#1080;&#1079;&#1085;&#1099;&#1081; &#1084;&#1086;&#1076;&#1091;&#1083;&#1100;</span></h2>
<p><b>&#1059;&#1083;&#1091;&#1095;&#1096;&#1077;&#1085;&#1099; &#1052;&#1077;&#1090;&#1082;&#1080; &#1044;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080; &#1054;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1081;:</b>
</p>
<ul><li>&#1050;&#1072;&#1078;&#1076;&#1072;&#1103; &#1084;&#1077;&#1090;&#1082;&#1072; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103; (&#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1103; &#1089;&#1090;&#1088;&#1077;&#1083;&#1082;&#1080;) &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1082;&#1086;&#1088;&#1088;&#1077;&#1082;&#1090;&#1085;&#1086; &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1091; &#1089;&#1094;&#1077;&#1085;&#1099; &#1074; 3D &#1086;&#1082;&#1085;&#1077;</li></ul>
<ul><li>&#1052;&#1077;&#1090;&#1082;&#1080; &#1089; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1099;&#1084;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1076;&#1083;&#1103; &#1056;&#1072;&#1089;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077;, &#1056;&#1072;&#1089;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1087;&#1086; X, &#1056;&#1072;&#1089;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1087;&#1086; Y &#1080; &#1056;&#1072;&#1076;&#1080;&#1091;&#1089; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100;.</li></ul>
<ul><li>&#1053;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1077; &#1091;&#1083;&#1091;&#1095;&#1096;&#1077;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1080;&#1082;&#1086;&#1085;&#1086;&#1082; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1077;&#1088;&#1077;&#1089;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103; &#1080;&#1079;&#1072;&#1084;&#1086;&#1088;&#1086;&#1079;&#1082;&#1080;.</li></ul>
<ul><li>&#1052;&#1077;&#1090;&#1082;&#1072; &#1089; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1099;&#1084;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1088;&#1072;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1075;&#1076;&#1072; &#1074;&#1080;&#1076; &#1087;&#1077;&#1088;&#1077;&#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1087;&#1086;&#1090;&#1080;&#1074;&#1086;&#1087;&#1086;&#1083;&#1086;&#1078;&#1085;&#1091;&#1102; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1091; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072;&#1074; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;(&#1090;&#1088;&#1077;&#1093;&#1084;&#1077;&#1088;&#1085;&#1072;&#1103; &#1089;&#1094;&#1077;&#1085;&#1072; &#1072; &#1085;&#1077; &#1083;&#1080;&#1089;&#1090; &#1095;&#1077;&#1088;&#1090;&#1077;&#1078;&#1072;). &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074;&#1077;&#1082;&#1090;&#1086;&#1088;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1094;&#1080;&#1080;.</li></ul>
<p>Points can now be added and used as a feature within a sketch
</p>
<ul><li><b>Sketch Origin</b></li></ul>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Release-0.13-Origin.png&amp;filetimestamp=20121223163015&amp;.html" class="mw-file-description"><img src="../File/Release-0.13-Origin.png" decoding="async" width="531" height="220" class="mw-file-element" data-file-width="531" data-file-height="220"></a></span>
</p><p>User can now use the sketch's origin to define geometry as well as the sketch axes.
</p>
<ul><li><b>Tangency and perpendicularity constraints for arcs and circles.</b></li>
<li><b>Constraints with respect to external (projected) geometry.</b></li>
<li><b>Improved counting of the sketch degrees of freedom.</b></li>
<li><b>Symmetry constraint with respect to a symmetry point</b> (midpoint constraint).</li></ul>
<ul><li><b>Improved Datum Label and Constraint Visuals:</b></li></ul>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Release-0.13-SketcherDimensions.png&amp;filetimestamp=20121223165034&amp;.html" class="mw-file-description"><img src="../File/Release-0.13-SketcherDimensions.png" decoding="async" width="530" height="376" class="mw-file-element" data-file-width="530" data-file-height="376"></a></span>
</p>
<ul><li><ul><li>Each constraint label (including arrows) will correctly scale to the size of the scene automatically to the 3D viewport</li>
<li>Datum label text for Distance, Distance X, Distance Y and Radius can be freely positioned now with greater control.</li>
<li>Small improvements to overlapping constraint icons and fix freezes.</li>
<li>Datum Label text will reverse when the view is orientated from the opposite side.</li></ul></li></ul>
<p><br>	
</p>
<ul><li><b>Fully constrained Sketches are now highlighted:</b></li></ul>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Release-0.13-SketcherFullyConstrained.png&amp;filetimestamp=20121223165548&amp;.html" class="mw-file-description" title="The sketch color turns from white to green to indicate it is fully constrained. These default colors can be customized."><img alt="The sketch color turns from white to green to indicate it is fully constrained. These default colors can be customized." src="../File/Release-0.13-SketcherFullyConstrained.png" decoding="async" width="530" height="423" class="mw-file-element" data-file-width="530" data-file-height="423"></a></span>
</p><p><br>
</p>
<ul><li><b>Rubber band selection:</b></li></ul>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Release-0.13-RubberBandSelection.png&amp;filetimestamp=20121223163113&amp;.html" class="mw-file-description"><img src="../File/Release-0.13-RubberBandSelection.png" decoding="async" width="533" height="214" class="mw-file-element" data-file-width="533" data-file-height="214"></a></span>
</p><p>Geometry (Points, Lines and Curves) may be selected by dragging on the background to create a rectangular selection. 
</p>
<ul><li><b>Extended functionality of the polyline tool:</b> using the m key one can switch between arc and line mode and among free, tangent and perpendicular transitions from the previous segment.</li></ul>
<ul><li><b>Map sketch to face</b> is a new tool to map (or remap) an existing sketch to the selected face on a solid. This allows the use of this sketch for features such as Pad and Pocket.</li></ul>
<ul><li><b>Small Improvements:</b>
<ul><li>When constructing geometry, tool tip with related information is shown next to cursor.</li>
<li><b>Sketch view</b> which sets the 3D view perpendicular to the sketch plane has now an icon in the Sketcher toolbar.</li></ul></li></ul>
<h2><span id=".D0.A7.D0.B5.D1.80.D1.82.D0.B5.D0.B6.D0.BD.D1.8B.D0.B9_.D0.BC.D0.BE.D0.B4.D1.83.D0.BB.D1.8C"></span><span class="mw-headline" id="&#1063;&#1077;&#1088;&#1090;&#1077;&#1078;&#1085;&#1099;&#1081;_&#1084;&#1086;&#1076;&#1091;&#1083;&#1100;">&#1063;&#1077;&#1088;&#1090;&#1077;&#1078;&#1085;&#1099;&#1081; &#1084;&#1086;&#1076;&#1091;&#1083;&#1100;</span></h2>
<ul><li><b>&#1056;&#1077;&#1078;&#1080;&#1084; &#1079;&#1072;&#1076;&#1072;&#1095;</b>: &#1056;&#1077;&#1078;&#1080;&#1084; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1072; &#1079;&#1072;&#1076;&#1072;&#1095;(Taskview) &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085; &#1074; &#1063;&#1077;&#1088;&#1090;&#1077;&#1078;&#1085;&#1086;&#1084; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;. &#1053;&#1077; &#1073;&#1086;&#1081;&#1090;&#1077;&#1089;&#1100;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1072;&#1084; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1085;&#1088;&#1072;&#1074;&#1080;&#1090;&#1089;&#1103; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;&#1086;&#1085;&#1072; &#1087;&#1086; &#1087;&#1088;&#1077;&#1078;&#1085;&#1077;&#1084;&#1091; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;&#1093; &#1063;&#1077;&#1088;&#1090;&#1077;&#1078;&#1085;&#1099;&#1093; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082;.</li>
<li><b>&#1048;&#1084;&#1087;&#1086;&#1088;&#1090; &#1080;&#1079; DXF</b>: &#1048;&#1084;&#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1097;&#1080;&#1082; &#1080;&#1079; DXF &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1090;&#1086;&#1095;&#1082;&#1080;  (&#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1091;&#1103; &#1080;&#1093; <a href="../Draft_Point.html" title="Draft Point">&#1058;&#1086;&#1095;&#1082;&#1080; &#1063;&#1077;&#1088;&#1090;&#1077;&#1078;&#1085;&#1086;&#1075;&#1086; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103;</a>) &#1080; &#1087;&#1091;&#1085;&#1082;&#1090;&#1080;&#1088;  (&#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1091;&#1077;&#1090; &#1074; &#1051;&#1086;&#1084;&#1072;&#1085;&#1091;&#1102; &#1050;&#1088;&#1080;&#1074;&#1091;&#1102;)</li>
<li><b>&#1057;&#1086;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1085;&#1086; &#1085;&#1086;&#1074;&#1072;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1086;&#1082;</b>:  <a href="../Draft_Snap.html" title="Draft Snap">&#1057;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1086;&#1082;</a> &#1063;&#1077;&#1088;&#1090;&#1077;&#1078;&#1085;&#1086; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103;, &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1087;&#1077;&#1088;&#1077;&#1087;&#1080;&#1089;&#1072;&#1085;&#1072; &#1089; &#1085;&#1091;&#1083;&#1103;. &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1077;&#1105; &#1075;&#1086;&#1088;&#1072;&#1079;&#1076;&#1086; &#1087;&#1088;&#1086;&#1097;&#1077; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1103;&#1090;&#1100; &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1086; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1093; &#1089;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1103;&#1093; &#1080; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103;&#1093;, &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1086;&#1103;&#1074;&#1080;&#1083;&#1080;&#1089;&#1100; &#1085;&#1086;&#1074;&#1099;&#1077; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1102;&#1097;&#1080;&#1077; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1080; , &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1089; &#1085;&#1080;&#1084;&#1080;, &#1075;&#1076;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1074;&#1082;&#1083;/&#1074;&#1099;&#1082;&#1083; &#1082;&#1072;&#1078;&#1076;&#1091;&#1102; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1091; &#1080;&#1085;&#1076;&#1080;&#1074;&#1080;&#1076;&#1091;&#1072;&#1083;&#1100;&#1085;&#1086; &#1080;&#1083;&#1080; &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1074;&#1089;&#1102; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1086;&#1082;.</li></ul>
<p><span typeof="mw:File"><a href="../index.php?title=013-draft-snap.jpg&amp;filetimestamp=20120821195725&amp;.html" class="mw-file-description"><img src="../File/013-draft-snap.jpg" decoding="async" width="800" height="372" class="mw-file-element" data-file-width="800" data-file-height="372"></a></span>
</p>
<ul><li><b>&#1059;&#1083;&#1091;&#1095;&#1096;&#1077;&#1085;&#1080;&#1077; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1081; </b>: &#1050;&#1086;&#1075;&#1076;&#1072; &#1074;&#1099; &#1074;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077; &#1090;&#1086;&#1095;&#1082;&#1091; &#1074; &#1088;&#1077;&#1093;&#1084;&#1077;&#1088;&#1085;&#1086;&#1084; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1077;, &#1087;&#1086; &#1084;&#1080;&#1084;&#1086; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1080; &#1079;&#1072;&#1078;&#1072;&#1090;&#1086;&#1081; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1077;  Shift, &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; X, Y &#1080;&#1083;&#1080; Z &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080; &#1085;&#1072;&#1078;&#1072;&#1074; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080; <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">X</span>, <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">Y</span> &#1080;&#1083;&#1080; <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">Z</span> &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;. &#1055;&#1086;&#1074;&#1090;&#1086;&#1088;&#1085;&#1086;&#1077; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077;, &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077;.</li>
<li><b>&#1055;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1063;&#1077;&#1088;&#1090;&#1077;&#1078; &lt;-&gt; &#1069;&#1089;&#1082;&#1080;&#1079;</b>: &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1063;&#1077;&#1088;&#1090;&#1077;&#1078;&#1085;&#1099;&#1081; &#1084;&#1086;&#1076;&#1091;&#1083;&#1100; &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1077;&#1090; &#1085;&#1086;&#1074;&#1099;&#1084; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084; &#1076;&#1083;&#1103; &#1082;&#1086;&#1085;&#1074;&#1077;&#1088;&#1089;&#1080;&#1080; <a href="../Draft_Draft2Sketch.html" title="Draft Draft2Sketch">Draft2Sketch</a> , &#1086;&#1085; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1077; &#1063;&#1077;&#1088;&#1090;&#1077;&#1078;&#1085;&#1099;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; (&#1080;&#1083;&#1080; &#1083;&#1102;&#1073;&#1091;&#1102; &#1087;&#1083;&#1086;&#1089;&#1082;&#1091;&#1102; &#1092;&#1086;&#1088;&#1084;&#1091;) &#1074; &#1069;&#1089;&#1082;&#1080;&#1079;&#1099; , &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1101;&#1090;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1085;&#1072;&#1086;&#1073;&#1086;&#1088;&#1086;&#1090;.</li>
<li><b>&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1082;&#1083;&#1086;&#1085;&#1086;&#1074;</b>: &#1057;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1082;&#1086;&#1087;&#1080;&#1080;&#1080; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1089; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1086;&#1081; &#1082; &#1086;&#1088;&#1080;&#1075;&#1080;&#1085;&#1072;&#1083;&#1091;. &#1050;&#1086;&#1075;&#1076;&#1072; &#1086;&#1088;&#1080;&#1075;&#1080;&#1085;&#1072;&#1083; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100;&#1089;&#1103;, &#1082;&#1083;&#1086;&#1085;&#1099; &#1086;&#1073;&#1085;&#1086;&#1074;&#1103;&#1090;&#1100;&#1089;&#1103; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;. &#1054;&#1073;&#1098;&#1077;&#1082;&#1090; &#1082;&#1083;&#1086;&#1085; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100;, &#1087;&#1086;&#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1091; &#1085;&#1077;&#1075;&#1086; &#1077;&#1089;&#1090;&#1100; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1072;, &#1095;&#1090;&#1086; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1074;&#1072;&#1084; &#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1082;&#1086;&#1087;&#1080;&#1081;.</li>
<li><b>&#1048;&#1084;&#1087;&#1086;&#1088;&#1090; &#1080;&#1079; SVG</b>: &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1080;&#1084;&#1087;&#1086;&#1088;&#1090;&#1072; &#1080;&#1079; SVG &#1083;&#1091;&#1095;&#1096;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1082;&#1088;&#1080;&#1074;&#1099;&#1077; &#1041;&#1077;&#1079;&#1100;&#1077;.</li>
<li><b>&#1057;&#1082;&#1088;&#1091;&#1075;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1091;&#1075;&#1083;&#1099;</b>: &#1053;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1063;&#1077;&#1088;&#1090;&#1077;&#1078;&#1085;&#1099;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;, &#1082;&#1072;&#1082; (<a href="../Draft_Wire.html" title="Draft Wire">&#1051;&#1086;&#1084;&#1072;&#1085;&#1099;&#1077;</a>, <a href="../Draft_Rectangle.html" title="Draft Rectangle">&#1055;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;</a> &#1080; <a href="../Draft_Polygon.html" title="Draft Polygon">&#1052;&#1085;&#1086;&#1075;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;&#1080;</a>) &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1102;&#1090; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086;&#1084; <b>&#1056;&#1072;&#1076;&#1080;&#1091;&#1089; &#1089;&#1082;&#1088;&#1091;&#1075;&#1083;&#1077;&#1085;&#1080;&#1103;</b> , &#1089;&#1082;&#1088;&#1091;&#1075;&#1083;&#1103;&#1077;&#1090; &#1080;&#1093; &#1091;&#1075;&#1083;&#1099; &#1087;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1084;&#1091; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1102; &#1088;&#1072;&#1076;&#1080;&#1091;&#1089;&#1072;.</li></ul>
<p><span typeof="mw:File"><a href="../index.php?title=013-draft-fillet.jpg&amp;filetimestamp=20120821195542&amp;.html" class="mw-file-description"><img src="../File/013-draft-fillet.jpg" decoding="async" width="800" height="395" class="mw-file-element" data-file-width="800" data-file-height="395"></a></span>
</p>
<ul><li><b>&#1044;&#1074;&#1091;&#1084;&#1077;&#1088;&#1085;&#1072;&#1103; &#1087;&#1088;&#1086;&#1077;&#1082;&#1094;&#1080;&#1103;</b>: &#1053;&#1086;&#1074;&#1099;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; <a href="../Draft_Shape2DView.html" title="Draft Shape2DView">Shape2DView</a> &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086; &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1087;&#1088;&#1086;&#1077;&#1082;&#1094;&#1080;&#1102; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1074; &#1090;&#1088;&#1077;&#1093;&#1084;&#1077;&#1088;&#1085;&#1091;&#1102; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;(&#1085;&#1077; &#1087;&#1091;&#1072;&#1090;&#1100; &#1089; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1084; &#1055;&#1088;&#1086;&#1077;&#1082;&#1094;&#1080;&#1081;). &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074;&#1077;&#1082;&#1090;&#1086;&#1088;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1094;&#1080;&#1080;.</li></ul>
<p><span typeof="mw:File"><a href="../index.php?title=013-draft-shape2dview.jpg&amp;filetimestamp=20120821195636&amp;.html" class="mw-file-description"><img src="../File/013-draft-shape2dview.jpg" decoding="async" width="800" height="452" class="mw-file-element" data-file-width="800" data-file-height="452"></a></span>
</p>
<h2><span id=".D0.90.D1.80.D1.85.D0.B8.D1.82.D0.B5.D0.BA.D1.82.D1.83.D1.80.D0.BD.D1.8B.D0.B9_.D0.BC.D0.BE.D0.B4.D1.83.D0.BB.D1.8C"></span><span class="mw-headline" id="&#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1085;&#1099;&#1081;_&#1084;&#1086;&#1076;&#1091;&#1083;&#1100;">&#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1085;&#1099;&#1081; &#1084;&#1086;&#1076;&#1091;&#1083;&#1100;</span></h2>
<ul><li><b>&#1048;&#1085;&#1090;&#1077;&#1075;&#1088;&#1072;&#1094;&#1080;&#1103; &#1089; &#1063;&#1077;&#1088;&#1090;&#1077;&#1078;&#1085;&#1099;&#1084; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1084;</b>: &#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1085;&#1099;&#1081; &#1080; &#1063;&#1077;&#1088;&#1090;&#1077;&#1078;&#1085;&#1099;&#1081; &#1084;&#1086;&#1076;&#1091;&#1083;&#1100; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1090;&#1077;&#1089;&#1085;&#1086; &#1080;&#1085;&#1090;&#1077;&#1075;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1076;&#1088;&#1091;&#1075; &#1089; &#1076;&#1088;&#1091;&#1075;&#1086;&#1084;. &#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1085;&#1099;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090; <a href="../Draft_Snap.html" title="Draft Snap">&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1086;&#1082; &#1063;&#1077;&#1088;&#1090;&#1077;&#1078;&#1085;&#1086;&#1075;&#1086; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103;</a> , &#1072; &#1074;&#1089;&#1077; &#1095;&#1077;&#1088;&#1090;&#1077;&#1078;&#1085;&#1099;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1099; &#1074; &#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1085;&#1086;&#1084; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;. &#1053;&#1072; &#1089;&#1072;&#1084;&#1086;&#1084; &#1076;&#1077;&#1083;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1089;&#1082;&#1088;&#1099;&#1090;&#1100; &#1063;&#1077;&#1088;&#1090;&#1077;&#1078;&#1085;&#1099;&#1081; &#1084;&#1086;&#1076;&#1091;&#1083;&#1100; (&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; -&gt; Draft -&gt;Hide the Draft workbench)</li>
<li><b>&#1053;&#1086;&#1074;&#1099;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1089;&#1090;&#1077;&#1085;</b>:  <a href="../Arch_Wall.html" title="Arch Wall">&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1089;&#1090;&#1077;&#1085;</a> &#1073;&#1099;&#1083; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1091;&#1089;&#1086;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;, &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1087;&#1086;&#1103;&#1074;&#1080;&#1083;&#1089;&#1103; &#1088;&#1077;&#1078;&#1080;&#1084; &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1085;&#1072;&#1087;&#1088;&#1103;&#1084;&#1091;&#1102;, &#1086;&#1085; &#1072;&#1082;&#1090;&#1080;&#1074;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; , &#1087;&#1088;&#1080; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1080; &#1085;&#1072; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1057;&#1090;&#1077;&#1085;&#1099;, &#1077;&#1089;&#1083;&#1080; &#1085;&#1077; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1086; &#1085;&#1080; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;, &#1101;&#1090;&#1086; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1074;&#1072;&#1084; &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1090;&#1077;&#1085;&#1099;, &#1082;&#1072;&#1082; &#1073;&#1091;&#1076;&#1090;&#1086; &#1074;&#1099; &#1088;&#1080;&#1089;&#1091;&#1077;&#1090;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1099;&#1077; &#1083;&#1080;&#1085;&#1080;&#1080;. &#1042; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; &#1082; &#1101;&#1090;&#1086;&#1084;&#1091;, &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1089;&#1090;&#1077;&#1085;&#1099; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1087;&#1088;&#1080;&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1077;&#1089;&#1100; &#1082; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1081; &#1089;&#1090;&#1077;&#1085;&#1077;.</li></ul>
<p><span typeof="mw:File"><a href="../index.php?title=013-arch-wall.jpg&amp;filetimestamp=20120821195507&amp;.html" class="mw-file-description"><img src="../File/013-arch-wall.jpg" decoding="async" width="800" height="471" class="mw-file-element" data-file-width="800" data-file-height="471"></a></span>
</p><p>!!FUZZY!!* <b>&#1053;&#1086;&#1074;&#1099;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1082;&#1088;&#1099;&#1096;</b>: &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1074; &#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1085;&#1086;&#1084; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1085;&#1086;&#1074;&#1099;&#1081;  <a href="../Arch_Roof.html" title="Arch Roof">&#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1082;&#1088;&#1099;&#1096;</a> , &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1074;&#1072;&#1084; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1089;&#1082;&#1072;&#1090;&#1085;&#1099;&#1077; &#1082;&#1088;&#1099;&#1096;&#1080; &#1080;&#1079; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1093; &#1075;&#1088;&#1072;&#1085;&#1077;&#1081;.
</p>
<ul><li><b>&#1053;&#1086;&#1074;&#1099;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1086;&#1082;&#1086;&#1085;</b>:  &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; <a href="../Arch_Window.html" title="Arch Window">&#1054;&#1082;&#1085;&#1072;</a>  &#1089;&#1086;&#1079;&#1076;&#1072;&#1102;&#1090;&#1089;&#1103; &#1085;&#1072;&#1087;&#1088;&#1103;&#1084;&#1091;&#1102; &#1085;&#1072; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1080; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1081; &#1092;&#1086;&#1088;&#1084;&#1099; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1080;&#1081; &#1086;&#1076;&#1085;&#1091; &#1080; &#1073;&#1086;&#1083;&#1077;&#1077; &#1082;&#1083;&#1086;&#1084;&#1072;&#1085;&#1099;&#1093; &#1082;&#1088;&#1080;&#1074;&#1099;&#1093;(&#1079;&#1072;&#1084;&#1082;&#1085;&#1091;&#1090;&#1099;&#1093;), &#1090;&#1072;&#1082;&#1080;&#1093; &#1082;&#1072;&#1082; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082; &#1080;&#1083;&#1080; &#1101;&#1089;&#1082;&#1080;&#1079;. &#1045;&#1089;&#1083;&#1080; &#1101;&#1090;&#1072; &#1092;&#1086;&#1088;&#1084;&#1072; &#1073;&#1099;&#1083;&#1072; &#1089;&#1088;&#1072;&#1079;&#1091; &#1085;&#1072;&#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1072; &#1085;&#1072; &#1075;&#1088;&#1072;&#1085;&#1080; &#1057;&#1090;&#1077;&#1085;&#1099;, &#1086;&#1082;&#1085;&#1086;, &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1074;&#1099;&#1088;&#1077;&#1079;&#1072;&#1077;&#1090; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1077; &#1074; &#1089;&#1090;&#1077;&#1085;&#1077;.</li>
<li><b>&#1053;&#1086;&#1074;&#1072;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1081;</b>: &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1086;&#1095;&#1077;&#1085;&#1100; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1074;&#1080;&#1076;&#1099;, &#1088;&#1072;&#1079;&#1088;&#1077;&#1079;&#1099; &#1080; &#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1080;&#1079; &#1074;&#1072;&#1096;&#1077;&#1081; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;: &#1055;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1077; <a href="../Arch_SectionPlane.html" title="Arch SectionPlane">&#1057;&#1077;&#1082;&#1091;&#1097;&#1091;&#1102; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1100;</a> , &#1089;&#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077;  &#1077;&#1105;, &#1086;&#1090;&#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1090;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1086;&#1085;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1080; .... &#1075;&#1086;&#1090;&#1086;&#1074;&#1086;!</li>
<li><b>&#1053;&#1086;&#1074;&#1072;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1086;&#1090;&#1088;&#1080;&#1089;&#1086;&#1074;&#1082;&#1080; &#1090;&#1074;&#1077;&#1088;&#1076;&#1099;&#1093; &#1090;&#1077;&#1083;</b>: &#1042; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; &#1082;  &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1084; &#1085;&#1072; OpenCasCADe &#1082;&#1072;&#1088;&#1082;&#1072;&#1089;&#1085;&#1086;&#1081; 2D &#1074;&#1080;&#1079;&#1091;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; , &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1089;&#1077;&#1081;&#1095;&#1072;&#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103;  <a href="../Drawing_Workbench.html" title="Drawing Workbench">&#1052;&#1086;&#1076;&#1091;&#1083;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1077;&#1082;&#1094;&#1080;&#1081;</a>, &#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1085;&#1099;&#1081; &#1084;&#1086;&#1076;&#1091;&#1083;&#1100; &#1090;&#1087;&#1077;&#1088;&#1100; &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1077;&#1090; &#1085;&#1086;&#1074;&#1099;&#1084; &#1076;&#1074;&#1091;&#1084;&#1077;&#1088;&#1085;&#1099;&#1084; &#1074;&#1080;&#1079;&#1091;&#1072;&#1083;&#1080;&#1079;&#1072;&#1090;&#1086;&#1088;&#1086;&#1084;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1086;&#1090;&#1088;&#1080;&#1089;&#1086;&#1074;&#1099;&#1074;&#1072;&#1090;&#1100; &#1086;&#1082;&#1088;&#1072;&#1096;&#1077;&#1085;&#1085;&#1099;&#1077; &#1075;&#1088;&#1072;&#1085;&#1080; &#1074; SVG &#1063;&#1077;&#1088;&#1090;&#1077;&#1078;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1103; &#1087;&#1088;&#1077;&#1082;&#1088;&#1072;&#1089;&#1085;&#1099;&#1077;  2D &#1074;&#1080;&#1076;&#1099;.</li></ul>
<p><span typeof="mw:File"><a href="../index.php?title=013-arch-vrm.jpg&amp;filetimestamp=20120821195430&amp;.html" class="mw-file-description"><img src="../File/013-arch-vrm.jpg" decoding="async" width="800" height="333" class="mw-file-element" data-file-width="800" data-file-height="333"></a></span>
</p>
<ul><li><b>&#1048;&#1084;&#1087;&#1086;&#1088;&#1090; &#1080;&#1079; IFC &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <a rel="nofollow" class="external text" href="http://www.ifcopenshell.org">IfcOpenShell</a></b>: &#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1085;&#1099;&#1081; &#1084;&#1086;&#1076;&#1091;&#1083;&#1100; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; <a rel="nofollow" class="external text" href="http://www.ifcopenshell.org">IfcOpenShell</a> &#1077;&#1089;&#1083;&#1080; &#1086;&#1085; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085; &#1074; &#1074;&#1072;&#1096;&#1077;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077;. &#1054;&#1085; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090; &#1074;&#1072;&#1084; , &#1084;&#1086;&#1097;&#1085;&#1077;&#1081;&#1096;&#1080;&#1081; &#1080;&#1084;&#1087;&#1086;&#1088;&#1090; &#1080;&#1079; IFC , &#1074;&#1089;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;   IFC &#1092;&#1072;&#1081;&#1083;&#1072; &#1075;&#1072;&#1088;&#1072;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1084;&#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1086;.</li>
<li><b>&#1053;&#1086;&#1074;&#1099;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1101;&#1090;&#1072;&#1078; &#1080; &#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1077;</b>: &#1057;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1077; &#1080; &#1101;&#1090;&#1072;&#1078;&#1080; &#1101;&#1090;&#1086; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099;, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1080; &#1091;&#1076;&#1072;&#1083;&#1103;&#1090;&#1100; &#1080;&#1079; &#1085;&#1080;&#1093; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1075;&#1086; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074; &#1086;&#1082;&#1085;&#1077; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1102;&#1097;&#1077;&#1084; &#1076;&#1088;&#1077;&#1074;&#1086;&#1074;&#1080;&#1076;&#1085;&#1091;&#1102; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1091; &#1087;&#1072;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;.</li>
<li><b>&#1053;&#1086;&#1074;&#1072;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1086;&#1089;&#1077;&#1081;</b>: A new <a href="../Arch_Axis.html" title="Arch Axis">axes system</a> feature has been added, that allows to quickly layout complex axes systems. These axes can then be added to <a href="../Arch_Structure.html" title="Arch Structure">Structure</a> objects, so they spread automatically on the grid nodes.</li></ul>
<p><span typeof="mw:File"><a href="../index.php?title=013-arch-axes.jpg&amp;filetimestamp=20120821195340&amp;.html" class="mw-file-description"><img src="../File/013-arch-axes.jpg" decoding="async" width="800" height="436" class="mw-file-element" data-file-width="800" data-file-height="436"></a></span>
</p>
<ul><li><b>&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1080;&#1079; &#1087;&#1086;&#1083;&#1080;&#1075;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086;</b>: &#1058;&#1077;&#1087;&#1077;&#1088;&#1100;, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1087;&#1088;&#1103;&#1084;&#1091;&#1102; &#1080;&#1079; &#1087;&#1086;&#1083;&#1080;&#1075;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1084;&#1086;&#1076;&#1077;&#1083;&#1077;&#1081; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; <a href="../Arch_Wall.html" title="Arch Wall">&#1089;&#1090;&#1077;&#1085;&#1099;</a> &#1080; <a href="../Arch_Structure.html" title="Arch Structure">&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1099;</a>, &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1077;&#1089;&#1083;&#1080; &#1079;&#1072;&#1084;&#1082;&#1085;&#1091;&#1090;&#1099; &#1072; &#1090;&#1077;&#1083;&#1072; &#1080; &#1088;&#1077;&#1073;&#1088;&#1072; <a rel="nofollow" class="external text" href="http://doc.spatial.com/index.php/Manifold_and_Non-manifold_Objects">&#1084;&#1085;&#1086;&#1075;&#1086;&#1086;&#1073;&#1088;&#1072;&#1079;&#1085;&#1099;</a>. &#1069;&#1090;&#1086; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1099;&#1074;&#1072;&#1090;&#1100; &#1080;&#1084;&#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1091;&#1102; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1102; &#1080;&#1079; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;, &#1090;&#1072;&#1082;&#1080;&#1093; &#1082;&#1072;&#1082; <a rel="nofollow" class="external text" href="http://www.blender.org">blender</a> &#1074; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1085;&#1086;&#1075;&#1086; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103;.</li></ul>
<h2><span class="mw-headline" id="Part_module">Part module</span></h2>
<ul><li><b>Refine shape</b> is a new utility that cleans up faces after a few operations on a shape. It can be set to run automatically after boolean operations in the Preferences.</li>
<li><b>New Loft tool</b> can extrude a complex set of surfaces or a solid shape through a series of sketches or Draft objects.</li>
<li><b>New Sweep tool</b> can extrude a complex set of surfaces or a solid shape through a series of sketches or Draft objects and a trajectory (sketch, edge or Draft object).</li>
<li><b>New Offset tool</b> can offset a single surface or a shape.</li>
<li><b>New Thickness tool</b> can hollow out a solid shape by setting a wall thickness and opening one or more faces.</li>
<li><b>Shape Builder</b> and <b>Create primitives</b> are now in the Part toolbar for quick access.</li></ul>
<h2><span class="mw-headline" id="Part_Design_module">Part Design module</span></h2>
<ul><li><b>Pad</b> and <b>Pocket</b> are now more powerful thanks to more parameters, such as extrude to first/to last, up to face, 2 dimensions, symmetric to plane.</li>
<li><b>Chamfer</b> and <b>Fillet</b> got an upgrade: selecting a face is now allowed, all the outer and inner edges of this face will be processed.</li>
<li><b>Revolution</b>: a construction line can now be used as a revolution axis.</li>
<li><b>New Groove tool</b>: cut matter from your solid by revolving a sketch.</li>
<li><b>Linear pattern</b>, <b>Mirrored</b>, <b>Polar pattern</b> and <b>Multipattern</b> tools, that allow you to align and distribute pads and pockets on a feature.</li>
<li>A <b>Shaft Wizard</b> to help you design shaft objects</li></ul>
<h2><span id=".D0.9C.D0.BE.D0.B4.D1.83.D0.BB.D1.8C_.D0.BF.D1.80.D0.BE.D0.B5.D0.BA.D1.82.D0.B8.D1.80.D0.BE.D0.B2.D0.B0.D0.BD.D0.B8.D1.8F_.D0.BA.D0.BE.D1.80.D0.B0.D0.B1.D0.BB.D0.B5.D0.B9"></span><span class="mw-headline" id="&#1052;&#1086;&#1076;&#1091;&#1083;&#1100;_&#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;_&#1082;&#1086;&#1088;&#1072;&#1073;&#1083;&#1077;&#1081;">&#1052;&#1086;&#1076;&#1091;&#1083;&#1100; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1082;&#1086;&#1088;&#1072;&#1073;&#1083;&#1077;&#1081;</span></h2>
<ul><li>&#1053;&#1086;&#1074;&#1099;&#1081; &#1084;&#1086;&#1076;&#1091;&#1083;&#1100; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1076;&#1085;&#1080;&#1097; &#1082;&#1086;&#1088;&#1072;&#1073;&#1083;&#1077;&#1081;</li></ul>
<h2><span class="mw-headline" id="3D_mice">3D mice</span></h2>
<ul><li>Support for 3D mice (Spaceball, Space Navigator) has been added to the Windows version.</li>
<li>A new <b>Spaceball Motion</b> tab in the Customize dialog allows for fine tuning your 3D mouse to the settings you want, directly from FreeCAD.</li></ul>
<h2><span class="mw-headline" id="OpenSCAD_module">OpenSCAD module</span></h2>
<ul><li>This brand new (experimental) module brings OpenSCAD files import capability into FreeCAD. This file format is wildly popular in the RepRap community and on digital designs sharing site Thingiverse.</li>
<li>OpenSCAD script can be executed from within FreeCAD, by OpenSCAD (if installed on your computer), with the result appearing in your FreeCAD document.</li>
<li>For more information see the <a href="../OpenSCAD_Workbench.html" title="OpenSCAD Workbench">OpenSCAD Workbench</a> page on the FreeCAD wiki</li></ul>
<!-- 
NewPP limit report
Cached time: 20251009171941
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.081 seconds
Real time usage: 0.105 seconds
Preprocessor visited node count: 92/1000000
Post&#8208;expand include size: 906/2097152 bytes
Template argument size: 3/2097152 bytes
Highest expansion depth: 3/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1716/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    3.424      1 -total
 92.26%    3.159      3 Template:KEY
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:2798-0!canonical and timestamp 20251009171941 and revision id 1659685. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>