<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Scenegraph/ru</span></h1><?xml encoding="UTF-8"><div class="mw-parser-output"><div class="mw-pt-languages noprint" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../id/Scenegraph.html" class="mw-pt-progress mw-pt-progress--stub" title="Scenegraph (5% translated)" lang="id" dir="ltr">Bahasa Indonesia</a></li>
<li><a href="../de/Scenegraph.html" class="mw-pt-progress mw-pt-progress--complete" title="Szenengraph (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Scenegraph.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Scenegraph (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../tr/Scenegraph.html" class="mw-pt-progress mw-pt-progress--stub" title="Scenegraph (5% translated)" lang="tr" dir="ltr">T&uuml;rk&ccedil;e</a></li>
<li><a href="../es/Scenegraph.html" class="mw-pt-progress mw-pt-progress--stub" title="Scenegraph (5% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/Scenegraph.html" class="mw-pt-progress mw-pt-progress--complete" title="Graphe de sc&egrave;ne (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/Scenegraph.html" class="mw-pt-progress mw-pt-progress--complete" title="Grafo della Scena (100% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Scenegraph.html" class="mw-pt-progress mw-pt-progress--complete" title="Scenogram (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt/Scenegraph.html" class="mw-pt-progress mw-pt-progress--stub" title="Scenegraph (5% translated)" lang="pt" dir="ltr">portugu&ecirc;s</a></li>
<li><a href="../pt-br/Scenegraph.html" class="mw-pt-progress mw-pt-progress--stub" title="Grafo de cena (10% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../ro/Scenegraph.html" class="mw-pt-progress mw-pt-progress--stub" title="Descrierea scenelor 3D (5% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><a href="../sv/Scenegraph.html" class="mw-pt-progress mw-pt-progress--stub" title="Scenegraph (5% translated)" lang="sv" dir="ltr">svenska</a></li>
<li><a href="../cs/Scenegraph.html" class="mw-pt-progress mw-pt-progress--stub" title="Scenegraph/cs (0% translated)" lang="cs" dir="ltr">&#269;e&scaron;tina</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--low" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</span></li></ul></div>
<div class="docnav" style="background-color: #ececef; border: 1px solid #a2a9b1; padding: 2px 10px; margin: 10px 0; line-height: 1; clear: both; overflow: hidden;">
    <div style="margin: 4px 0; float: left;"><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-left.svg" decoding="async" width="16" height="16"></span></span> <a href="../ru/Scripted_objects.html" title="Scripted objects/ru">&#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1091;&#1077;&#1084;&#1099;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;</a></div>
    <div style="margin: 4px 0; float: right;"><a href="../ru/Pivy.html" title="Pivy/ru">Pivy</a>
 <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-right.svg" decoding="async" width="16" height="16"></span></span></div>
    <div style="text-align:center"><a href="../ru/Online_Help_Toc.html" title="Online Help Toc/ru">&#1054;&#1075;&#1083;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;</a> <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Online_Help_Toc.svg" decoding="async" width="24" height="24"></span></span></div>
</div>
<div style="clear:right; margin-bottom: .5em; float: right; padding: .5em 0 .8em 1.4em; background: none;"><meta property="mw:PageProp/toc"></div>
<p><span id="Introduction"></span>
</p>
<h2><span id=".D0.92.D0.B2.D0.B5.D0.B4.D0.B5.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;">&#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;</span></h2>
<div class="mw-translate-fuzzy">
<p>&#1043;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1103; &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074; <a href="../ru/3D_view.html" title="3D view/ru">&#1090;&#1088;&#1105;&#1093;&#1084;&#1077;&#1088;&#1085;&#1099;&#1093; &#1074;&#1080;&#1076;&#1072;&#1093;</a> FreeCAD, &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082; <a rel="nofollow" class="external text" href="https://ru.wikipedia.org/wiki/Coin3D">Coin3d</a>. Coin3D &#1101;&#1090;&#1086; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1072; <a rel="nofollow" class="external text" href="https://ru.wikipedia.org/wiki/Open_Inventor">OpenInventor</a>. <a rel="nofollow" class="external text" href="https://ru.wikipedia.org/wiki/Open_Cascade_Technology">OpenCASCADE</a> &#1090;&#1086;&#1078;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1093;&#1086;&#1078;&#1091;&#1102; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100;, &#1085;&#1086; &#1087;&#1088;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1080; FreeCAD &#1073;&#1099;&#1083;&#1086; &#1088;&#1077;&#1096;&#1077;&#1085;&#1086; &#1085;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1099;&#1081; &#1074; OpenCASCADE &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1097;&#1080;&#1082;, &#1072; &#1089;&#1082;&#1086;&#1088;&#1077;&#1077; &#1087;&#1077;&#1088;&#1077;&#1081;&#1090;&#1080; &#1085;&#1072; &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; Coin3D. &#1044;&#1083;&#1103; &#1080;&#1079;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1101;&#1090;&#1086;&#1081; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1090;&#1089;&#1103; &#1082;&#1085;&#1080;&#1075;&#1072; <a rel="nofollow" class="external text" href="http://www-evasion.imag.fr/Membres/Francois.Faure/doc/inventorMentor/sgi_html/">Open Inventor Mentor</a>.
</p>
</div>
<p><span id="Description"></span>
</p>
<h2><span id=".D0.9E.D0.BF.D0.B8.D1.81.D0.B0.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;">&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;</span></h2>
<div class="mw-translate-fuzzy">
<p><a rel="nofollow" class="external text" href="https://ru.wikipedia.org/wiki/Open_Inventor">OpenInventor</a> &#1101;&#1090;&#1086; &#1103;&#1079;&#1099;&#1082; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; <a rel="nofollow" class="external text" href="https://ru.wikipedia.org/wiki/%D0%93%D1%80%D0%B0%D1%84_%D1%81%D1%86%D0%B5%D0%BD%D1%8B">&#1090;&#1088;&#1105;&#1093;&#1084;&#1077;&#1088;&#1085;&#1086;&#1081; &#1089;&#1094;&#1077;&#1085;&#1099;</a>. &#1057;&#1094;&#1077;&#1085;&#1072;, &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1072;&#1103; &#1074; OpenInventor, &#1079;&#1072;&#1090;&#1077;&#1084; &#1086;&#1090;&#1088;&#1080;&#1089;&#1086;&#1074;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; OpenGL &#1085;&#1072; &#1074;&#1072;&#1096;&#1077;&#1084;  &#1101;&#1082;&#1088;&#1072;&#1085;&#1077;. &#1054;&#1073; &#1101;&#1090;&#1086;&#1084; &#1079;&#1072;&#1073;&#1086;&#1090;&#1080;&#1090;&#1089;&#1103; Coin3D, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1091; &#1085;&#1077; &#1085;&#1072;&#1076;&#1086; &#1080;&#1084;&#1077;&#1090;&#1100; &#1076;&#1077;&#1083;&#1086; &#1089;&#1086; &#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1084;&#1080; &#1074;&#1099;&#1079;&#1086;&#1074;&#1072;&#1084;&#1080; OpenGL, &#1086;&#1085; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1082;&#1086;&#1088;&#1088;&#1077;&#1082;&#1090;&#1085;&#1099;&#1081; (&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1097;&#1080;&#1081;) &#1082;&#1086;&#1076; OpenInventor. &#1041;&#1086;&#1083;&#1100;&#1096;&#1080;&#1084; &#1087;&#1088;&#1077;&#1080;&#1084;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1084; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;, &#1095;&#1090;&#1086; OpenInventor &#1101;&#1090;&#1086; &#1096;&#1080;&#1088;&#1086;&#1082;&#1086; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1099;&#1081; &#1080; &#1093;&#1086;&#1088;&#1086;&#1096;&#1086; &#1079;&#1072;&#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;.
</p>
</div>
<div class="mw-translate-fuzzy">
<p>&#1054;&#1076;&#1085;&#1091; &#1080;&#1079; &#1075;&#1083;&#1072;&#1074;&#1085;&#1099;&#1093; &#1088;&#1072;&#1073;&#1086;&#1090;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; FreeCAD &#1076;&#1077;&#1083;&#1072;&#1077;&#1090; &#1079;&#1072; &#1074;&#1072;&#1089;, &#1101;&#1090;&#1086; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1086; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080; OpenCASCADE  &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1103;&#1079;&#1099;&#1082;&#1072; OpenInventor.
</p>
</div>
<div class="mw-translate-fuzzy">
<p>OpenInventor &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090; &#1090;&#1088;&#1077;&#1093;&#1084;&#1077;&#1088;&#1085;&#1091;&#1102; &#1089;&#1094;&#1077;&#1085;&#1091; &#1074; &#1092;&#1086;&#1088;&#1084;&#1077; <a rel="nofollow" class="external text" href="https://ru.wikipedia.org/wiki/%D0%93%D1%80%D0%B0%D1%84_%D1%81%D1%86%D0%B5%D0%BD%D1%8B">&#1076;&#1088;&#1077;&#1074;&#1072; &#1089;&#1094;&#1077;&#1085;</a>, &#1082;&#1072;&#1082; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1085;&#1080;&#1078;&#1077;:
</p>
</div>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Scenegraph.gif&amp;filetimestamp=20200530144446&amp;.html" class="mw-file-description"><img src="../File/Scenegraph.gif" decoding="async" width="422" height="444"></a></span>
</p>
<div class="mw-translate-fuzzy">
<p style="text-align:left; font-style:italic; width:800px; margin-left:1em; margin-right:1em;">
&#1056;&#1080;&#1089;&#1091;&#1085;&#1086;&#1082;, &#1074;&#1079;&#1103;&#1090;&#1099;&#1081; &#1089; &#1089;&#1072;&#1081;&#1090;&#1072; <a rel="nofollow" class="external text" href="http://www-evasion.imag.fr/~Francois.Faure/doc/inventorMentor/sgi_html/">Inventor mentor</a></p>
</div>
<div class="mw-translate-fuzzy">
<p>&#1044;&#1077;&#1088;&#1077;&#1074;&#1086; &#1089;&#1094;&#1077;&#1085; &#1074; openInventor &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090; &#1074;&#1089;&#1077; &#1095;&#1072;&#1089;&#1090;&#1080; &#1090;&#1088;&#1105;&#1093;&#1084;&#1077;&#1088;&#1085;&#1086;&#1081; &#1089;&#1094;&#1077;&#1085;&#1099;, &#1090;&#1072;&#1082;&#1080;&#1077; &#1082;&#1072;&#1082; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1103;, &#1094;&#1074;&#1077;&#1090;&#1072;, &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083;&#1099;, &#1086;&#1089;&#1074;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077;, &#1080; &#1090;.&#1076;. &#1080; &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1091;&#1077;&#1090; &#1074;&#1089;&#1077; &#1101;&#1090;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1074; &#1091;&#1076;&#1086;&#1073;&#1085;&#1086;&#1081; &#1080; &#1095;&#1077;&#1090;&#1082;&#1086;&#1081; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1077;. &#1042;&#1089;&#1077; &#1095;&#1090;&#1086; &#1091;&#1075;&#1086;&#1076;&#1085;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1089;&#1075;&#1088;&#1091;&#1087;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1086; &#1074; &#1089;&#1091;&#1073;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1099;, &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1103; &#1074;&#1072;&#1084; &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1086;&#1074;&#1099;&#1074;&#1072;&#1090;&#1100; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077; &#1074;&#1072;&#1096;&#1077;&#1081; &#1089;&#1094;&#1077;&#1085;&#1099; &#1090;&#1077;&#1084; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1086;&#1084;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1074;&#1072;&#1084; &#1085;&#1088;&#1072;&#1074;&#1080;&#1090;&#1089;&#1103;. &#1042;&#1086;&#1090; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1092;&#1072;&#1081;&#1083;&#1072; &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077; openInventor:
</p>
</div>
<div class="mw-highlight mw-highlight-lang-bash mw-content-ltr" dir="ltr"><pre><span></span><span class="c1">#Inventor V2.0 ascii</span>
 
Separator <span class="o">{</span> 
    RotationXYZ <span class="o">{</span>	
       axis Z
       angle <span class="m">0</span>
    <span class="o">}</span>
    Transform <span class="o">{</span>
       translation <span class="m">0</span> <span class="m">0</span> <span class="m">0</span>.5
    <span class="o">}</span>
    Separator <span class="o">{</span>	
       Material <span class="o">{</span>
          diffuseColor <span class="m">0</span>.05 <span class="m">0</span>.05 <span class="m">0</span>.05
       <span class="o">}</span>
       Transform <span class="o">{</span>
          rotation <span class="m">1</span> <span class="m">0</span> <span class="m">0</span> <span class="m">1</span>.5708
          scaleFactor <span class="m">0</span>.2 <span class="m">0</span>.5 <span class="m">0</span>.2
       <span class="o">}</span>
       Cylinder <span class="o">{</span>
       <span class="o">}</span>
    <span class="o">}</span>
<span class="o">}</span>
</pre></div>
<p>&#1050;&#1072;&#1082; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1074;&#1080;&#1076;&#1077;&#1090;&#1100;, &#1077;&#1075;&#1086; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; &#1087;&#1088;&#1086;&#1089;&#1090;&#1072;. &#1042;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1077; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077;&#1083;&#1080; (separator), &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1091;&#1103; &#1074;&#1072;&#1096;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1074; &#1073;&#1083;&#1086;&#1082;&#1080;, &#1101;&#1090;&#1086; &#1085;&#1077;&#1084;&#1085;&#1086;&#1075;&#1086; &#1087;&#1086;&#1093;&#1086;&#1078;&#1077; &#1085;&#1072; &#1090;&#1086;, &#1082;&#1072;&#1082; &#1074;&#1099; &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1091;&#1077;&#1090;&#1077; &#1074;&#1072;&#1096;&#1080; &#1092;&#1072;&#1081;&#1083;&#1099; &#1074; &#1087;&#1072;&#1087;&#1082;&#1072;&#1093;. &#1050;&#1072;&#1078;&#1076;&#1099;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088; &#1074;&#1083;&#1080;&#1103;&#1077;&#1090; &#1085;&#1072; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1076;&#1072;&#1083;&#1100;&#1096;&#1077;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1087;&#1077;&#1088;&#1074;&#1099;&#1077; &#1076;&#1074;&#1072; &#1087;&#1091;&#1085;&#1082;&#1090;&#1072; &#1074; &#1074;&#1072;&#1096;&#1077;&#1084; &#1082;&#1086;&#1088;&#1085;&#1077;&#1074;&#1086;&#1084; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077;&#1083;&#1077; &#1101;&#1090;&#1086; &#1087;&#1086;&#1074;&#1086;&#1088;&#1086;&#1090; &#1080; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;(&#1090;&#1088;&#1072;&#1085;&#1089;&#1083;&#1103;&#1094;&#1080;&#1103;), &#1082;&#1072;&#1082; &#1086;&#1085;&#1080; &#1087;&#1086;&#1074;&#1083;&#1080;&#1103;&#1102;&#1090; &#1085;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1090;&#1086;&#1078;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077;&#1083;&#1077;&#1084;. &#1042; &#1101;&#1090;&#1086;&#1084; &#1089;&#1077;&#1087;&#1072;&#1088;&#1072;&#1090;&#1086;&#1088;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083; &#1080; &#1076;&#1088;&#1091;&#1075;&#1086;&#1077; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1085;&#1072;&#1096; &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1086;&#1076;&#1074;&#1077;&#1088;&#1078;&#1077;&#1085; &#1086;&#1073;&#1077;&#1080;&#1084; &#1090;&#1088;&#1072;&#1085;&#1089;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;&#1084;, &#1090;&#1086; &#1095;&#1090;&#1086; &#1073;&#1099;&#1083;&#1086; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1086; &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1082; &#1085;&#1077;&#1084;&#1091;, &#1090;&#1072;&#1082; &#1080; &#1090;&#1086; &#1095;&#1090;&#1086; &#1073;&#1099;&#1083;&#1086; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1086; &#1082; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1084;&#1091; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077;&#1083;&#1102;.
</p>
<div class="mw-translate-fuzzy">
<p>&#1052;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1077;&#1084; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1090;&#1080;&#1087;&#1086;&#1074; &#1076;&#1083;&#1103; &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1085;&#1072;&#1096;&#1077;&#1081; &#1089;&#1094;&#1077;&#1085;&#1099;, &#1090;&#1072;&#1082;&#1080;&#1093; &#1082;&#1072;&#1082; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099;, &#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1077;&#1083;&#1080; &#1080; &#1072;&#1085;&#1085;&#1086;&#1090;&#1072;&#1094;&#1080;&#1080;. &#1052;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1086;&#1095;&#1077;&#1085;&#1100; &#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1077; &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083;&#1099; &#1076;&#1083;&#1103; &#1074;&#1072;&#1096;&#1080;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1089; &#1094;&#1074;&#1077;&#1090;&#1072;&#1084;&#1080;, &#1090;&#1077;&#1082;&#1089;&#1090;&#1091;&#1088;&#1086;&#1081;, &#1090;&#1077;&#1085;&#1077;&#1074;&#1099;&#1084;&#1080; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072;&#1084;&#1080; &#1080; &#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;. &#1052;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1084; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1086;&#1089;&#1074;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077;, &#1082;&#1072;&#1084;&#1077;&#1088;&#1099;, &#1080; &#1076;&#1072;&#1078;&#1077; &#1076;&#1074;&#1080;&#1078;&#1077;&#1085;&#1080;&#1077;. &#1052;&#1086;&#1078;&#1085;&#1086; &#1076;&#1072;&#1078;&#1077; &#1074;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1082;&#1091;&#1089;&#1086;&#1095;&#1082;&#1080; &#1089;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1077;&#1074; &#1074; openInventor &#1092;&#1072;&#1081;&#1083;&#1099;, &#1076;&#1083;&#1103; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1103; &#1073;&#1086;&#1083;&#1077;&#1077; &#1089;&#1083;&#1086;&#1078;&#1085;&#1086;&#1075;&#1086; &#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103;.
</p>
</div>
<div class="mw-translate-fuzzy">
<p>&#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1079;&#1072;&#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1086;&#1074;&#1072;&#1085;&#1099; &#1074; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1080; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1086; openInventor, &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1081;&#1090;&#1077;&#1089;&#1100; &#1085;&#1072;&#1087;&#1088;&#1103;&#1084;&#1091;&#1102; &#1082; &#1089;&#1072;&#1084;&#1086;&#1084;&#1091; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1086;&#1084;&#1091; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1091;: <a rel="nofollow" class="external text" href="http://www-evasion.imag.fr/~Francois.Faure/doc/inventorMentor/sgi_html/index.html">Inventor mentor</a>.
</p>
</div>
<div class="mw-translate-fuzzy">
<p>&#1042; FreeCAD, &#1082;&#1072;&#1082; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1086;. &#1085;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1085;&#1072;&#1087;&#1088;&#1103;&#1084;&#1091;&#1102; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089; &#1076;&#1088;&#1077;&#1074;&#1086;&#1084; &#1089;&#1094;&#1077;&#1085; openInventor. &#1050;&#1072;&#1078;&#1076;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1074; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1077; FreeCAD, &#1073;&#1091;&#1076;&#1100; &#1090;&#1086;  &#1087;&#1086;&#1083;&#1080;&#1075;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100; (mesh), &#1092;&#1086;&#1088;&#1084;&#1072; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080;, &#1080;&#1083;&#1080; &#1095;&#1090;&#1086;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100; &#1077;&#1097;&#1105;, &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074; &#1082;&#1086;&#1076; OpenInventor &#1080; &#1074;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1077; &#1076;&#1077;&#1088;&#1077;&#1074;&#1086; &#1089;&#1094;&#1077;&#1085;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1074;&#1099; &#1074;&#1080;&#1076;&#1080;&#1090;&#1077; &#1074; &#1086;&#1082;&#1085;&#1077; <a href="../ru/3D_view.html" title="3D view/ru">&#1090;&#1088;&#1105;&#1093;&#1084;&#1077;&#1088;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1072;</a>. &#1069;&#1090;&#1086; &#1076;&#1088;&#1077;&#1074;&#1086; &#1089;&#1094;&#1077;&#1085; &#1085;&#1077;&#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1085;&#1086; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1074;&#1099; &#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1091;&#1077;&#1090;&#1077;, &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1077; &#1080;&#1083;&#1080; &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;. &#1042; &#1089;&#1072;&#1084;&#1086;&#1084; &#1076;&#1077;&#1083;&#1077; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; (&#1074; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1077; App) &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1077;&#1090; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1097;&#1080;&#1082;&#1086;&#1084; &#1074;&#1080;&#1079;&#1091;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; (&#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1074; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1077; Gui), &#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1079;&#1072; &#1074;&#1099;&#1076;&#1072;&#1095;&#1091; &#1082;&#1086;&#1076;&#1072; OpenInventor.
</p>
</div>
<p>&#1053;&#1086; &#1077;&#1089;&#1090;&#1100; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1087;&#1088;&#1077;&#1080;&#1084;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099; &#1087;&#1088;&#1080; &#1087;&#1088;&#1103;&#1084;&#1086;&#1084; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1084;&#1099; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086; &#1084;&#1086;&#1078;&#1077;&#1084; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1081; &#1074;&#1080;&#1076; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;, &#1080;&#1083;&#1080; &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1074; &#1089;&#1094;&#1077;&#1085;&#1091; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1077; &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1102;&#1090; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084; &#1074; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1077; FreeCAD, &#1090;&#1072;&#1082;&#1080;&#1077; &#1082;&#1072;&#1082; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1103; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1081;, &#1087;&#1086;&#1084;&#1086;&#1097;&#1085;&#1080;&#1082;&#1080;, &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1087;&#1086;&#1076;&#1089;&#1082;&#1072;&#1079;&#1082;&#1080; &#1080;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;, &#1090;&#1072;&#1082;&#1080;&#1077; &#1082;&#1072;&#1082; &#1084;&#1072;&#1085;&#1080;&#1087;&#1091;&#1083;&#1103;&#1090;&#1086;&#1088;&#1099; &#1080;&#1083;&#1080; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1102;&#1097;&#1072;&#1103;&#1089;&#1103; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085;&#1077; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;.
</p>
<div class="mw-translate-fuzzy">
<p>FreeCAD  &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1077;&#1090; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1084;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1072; &#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; openInventor &#1082;&#1086;&#1076;&#1072;. &#1053;&#1072; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1085;&#1080;&#1078;&#1077;&#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1082;&#1086;&#1076; &#1085;&#1072; python &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1079;&#1080;&#1090; openInventor &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;:
</p>
</div>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">obj</span> <span class="o">=</span> <span class="n">FreeCAD</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">ActiveObject</span>
<span class="n">viewprovider</span> <span class="o">=</span> <span class="n">obj</span><span class="o">.</span><span class="n">ViewObject</span>
<span class="nb">print</span> <span class="n">viewprovider</span><span class="o">.</span><span class="n">toString</span><span class="p">()</span>
</pre></div>
<div class="mw-translate-fuzzy">
<p>&#1040; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1099; &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1077;&#1084; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1084; python &#1086;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1077;&#1090; &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1102; &#1095;&#1077;&#1084; &#1091;&#1075;&#1086;&#1076;&#1085;&#1086; &#1074;  Coin3D, &#1090;&#1072;&#1082;&#1086;&#1084;&#1091; &#1082;&#1072;&#1082; &#1074;&#1072;&#1096;&#1077; &#1076;&#1077;&#1088;&#1077;&#1074;&#1086; &#1089;&#1094;&#1077;&#1085; &#1074; FreeCAD. &#1058;&#1072;&#1082;&#1078;&#1077; &#1095;&#1080;&#1090;&#1072;&#1081;&#1090;&#1077; &#1086;&#1073; &#1101;&#1090;&#1086;&#1084; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; <a href="../ru/Pivy.html" title="Pivy/ru">Pivy</a>.
</p>
</div>
<h2><span class="mw-headline" id="Coding_examples">Coding examples</span></h2>
<p>See <a href="../Coin3d_snippets.html" title="Coin3d snippets">Coin3d snippets</a> courtesy of MariwanJ's research for the <a href="../Design456_Workbench.html" title="Design456 Workbench">Design456 Workbench</a>. The code repository can be found at <a rel="nofollow" class="external free" href="https://github.com/MariwanJ/COIN3D_Snippet">https://github.com/MariwanJ/COIN3D_Snippet</a>.
</p>
<p><a href="#top">&#1085;&#1072;&#1074;&#1077;&#1088;&#1093;</a></p>
<div class="docnav" style="background-color: #ececef; border: 1px solid #a2a9b1; padding: 2px 10px; margin: 10px 0; line-height: 1; clear: both; overflow: hidden;">
    <div style="margin: 4px 0; float: left;"><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-left.svg" decoding="async" width="16" height="16"></span></span> <a href="../ru/Mesh_to_Part.html" title="Mesh to Part/ru">Mesh to Part</a></div>
    <div style="margin: 4px 0; float: right;"><a href="../ru/Pivy.html" title="Pivy/ru">Pivy</a>
 <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-right.svg" decoding="async" width="16" height="16"></span></span></div>
    <div style="text-align:center"><a href="../ru/Online_Help_Toc.html" title="Online Help Toc/ru">&#1054;&#1075;&#1083;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;</a> <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Online_Help_Toc.svg" decoding="async" width="24" height="24"></span></span></div>
</div>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: #fefefe;"><span typeof="mw:File"><a href="../index.php?title=Power_user_hub.png&amp;filetimestamp=20200511213015&amp;.html" class="mw-file-description"><img src="../File/Power_user_hub.png" decoding="async" width="24" height="24"></a></span> <a href="../ru/Power_users_hub.html" title="Power users hub/ru">Power user documentation</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid #aaaaaa; text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: #fefefe;">
<ul><li><b>FreeCAD scripting:</b> <a href="../ru/Python.html" title="Python/ru">Python</a>, <a href="../ru/Introduction_to_Python.html" title="Introduction to Python/ru">Introduction to Python</a>, <a href="../ru/Python_scripting_tutorial.html" title="Python scripting tutorial/ru">Python scripting tutorial</a>, <a href="../ru/FreeCAD_Scripting_Basics.html" title="FreeCAD Scripting Basics/ru">FreeCAD Scripting Basics</a></li></ul>
<hr>
<ul><li><b>Modules:</b> <a href="../ru/Builtin_modules.html" title="Builtin modules/ru">Builtin modules</a>, <a href="../ru/Units.html" title="Units/ru">Units</a>, <a href="../index.php?title=Quantity/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Quantity/ru (page does not exist)">Quantity</a></li>
<li><b>Workbenches:</b> <a href="../ru/Workbench_creation.html" title="Workbench creation/ru">Workbench creation</a>, <a href="../ru/Gui_Command.html" title="Gui Command/ru">Gui Commands</a>, <a href="../ru/Command.html" title="Command/ru">Commands</a>, <a href="../ru/Installing_more_workbenches.html" title="Installing more workbenches/ru">Installing more workbenches</a></li>
<li><b>Meshes and Parts:</b> <a href="../ru/Mesh_Scripting.html" title="Mesh Scripting/ru">Mesh Scripting</a>, <a href="../ru/Topological_data_scripting.html" title="Topological data scripting/ru">Topological data scripting</a>, <a href="../ru/Mesh_to_Part.html" title="Mesh to Part/ru">Mesh to Part</a>, <a href="../ru/PythonOCC.html" title="PythonOCC/ru">PythonOCC</a></li></ul>
<hr>
<ul><li><b>Parametric objects:</b> <a href="../ru/Scripted_objects.html" title="Scripted objects/ru">Scripted objects</a>, <a href="../ru/Viewprovider.html" title="Viewprovider/ru">Viewproviders</a> <small>(<a href="../index.php?title=Custom_icon_in_tree_view/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Custom icon in tree view/ru (page does not exist)">Custom icon in tree view</a>)</small></li>
<li><b>Scenegraph:</b> <a class="mw-selflink selflink">Coin (Inventor) scenegraph</a>, <a href="../ru/Pivy.html" title="Pivy/ru">Pivy</a></li>
<li><b>Graphical interface:</b> <a href="../ru/Interface_creation.html" title="Interface creation/ru">Interface creation</a>, <a href="../ru/Dialog_creation.html" title="Dialog creation/ru">Interface creation completely in Python</a> <small>(<a href="../index.php?title=Dialog_creation_with_various_widgets/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation with various widgets/ru (page does not exist)">1</a>, <a href="../index.php?title=Dialog_creation_reading_and_writing_files/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation reading and writing files/ru (page does not exist)">2</a>, <a href="../index.php?title=Dialog_creation_setting_colors/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation setting colors/ru (page does not exist)">3</a>, <a href="../index.php?title=Dialog_creation_image_and_animated_GIF/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation image and animated GIF/ru (page does not exist)">4</a>, <a href="../index.php?title=PySide_usage_snippets/ru&amp;action=edit&amp;redlink=1.html" class="new" title="PySide usage snippets/ru (page does not exist)">5</a>)</small>, <a href="../ru/PySide.html" title="PySide/ru">PySide</a>, PySide examples <a href="../ru/PySide_Beginner_Examples.html" title="PySide Beginner Examples/ru">beginner</a>, <a href="../ru/PySide_Intermediate_Examples.html" title="PySide Intermediate Examples/ru">intermediate</a>, <a href="../ru/PySide_Advanced_Examples.html" title="PySide Advanced Examples/ru">advanced</a></li>
<li><b>Macros:</b> <a href="../ru/Macros.html" title="Macros/ru">Macros</a>, <a href="../ru/How_to_install_macros.html" title="How to install macros/ru">How to install macros</a></li>
<li><b>Embedding:</b> <a href="../ru/Embedding_FreeCAD.html" title="Embedding FreeCAD/ru">Embedding FreeCAD</a>, <a href="../ru/Embedding_FreeCADGui.html" title="Embedding FreeCADGui/ru">Embedding FreeCADGui</a></li></ul>
<hr>
<ul><li><b>Other:</b> <a href="../ru/Expressions.html" title="Expressions/ru">Expressions</a>, <a href="../ru/Code_snippets.html" title="Code snippets/ru">Code snippets</a>, <a href="../ru/Line_drawing_function.html" title="Line drawing function/ru">Line drawing function</a>, <a href="../ru/FreeCAD_vector_math_library.html" title="FreeCAD vector math library/ru">FreeCAD vector math library</a> <small>(deprecated)</small></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="../ru/User_hub.html" title="User hub/ru">User hub</a>, <a href="../ru/Power_users_hub.html" title="Power users hub/ru">Power users hub</a>, <a href="../ru/Developer_hub.html" title="Developer hub/ru">Developer hub</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20250622001746
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc, no&#8208;toc&#8208;conversion]
CPU time usage: 0.163 seconds
Real time usage: 0.586 seconds
Preprocessor visited node count: 205/1000000
Post&#8208;expand include size: 8539/2097152 bytes
Template argument size: 3016/2097152 bytes
Highest expansion depth: 5/100
Expensive parser function count: 2/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 4101/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%  289.772      1 -total
 93.30%  270.359      2 Template:Code
  2.50%    7.255      1 Template:Powerdocnavi/ru
  1.47%    4.246      2 Template:Docnav/ru
  1.07%    3.094      1 Template:Caption
  0.88%    2.563      1 Template:Navigation_menu_2
  0.82%    2.364      1 Template:Top
  0.47%    1.366      1 Template:TOCright
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:1058-0!canonical and timestamp 20250622001746 and revision id 1595156. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>