<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Scripted objects/ru</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="ru" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Scripted+objects&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../id/Scripted_objects.html" class="mw-pt-progress mw-pt-progress--low" title="Scripted objects (1% translated)" lang="id" dir="ltr">Bahasa Indonesia</a></li>
<li><a href="../de/Scripted_objects.html" class="mw-pt-progress mw-pt-progress--high" title="Skriptgenerierte Objekte (99% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Scripted_objects.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Scripted objects (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../tr/Scripted_objects.html" class="mw-pt-progress mw-pt-progress--low" title="Scripted objects (1% translated)" lang="tr" dir="ltr">T&uuml;rk&ccedil;e</a></li>
<li><a href="../es/Scripted_objects.html" class="mw-pt-progress mw-pt-progress--low" title="Scripted objects (5% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/Scripted_objects.html" class="mw-pt-progress mw-pt-progress--high" title="Objets cr&eacute;&eacute;s par script (99% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/Scripted_objects.html" class="mw-pt-progress mw-pt-progress--high" title="Oggetti creati da script (99% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Scripted_objects.html" class="mw-pt-progress mw-pt-progress--high" title="Obiekty tworzone skryptami (99% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt/Scripted_objects.html" class="mw-pt-progress mw-pt-progress--low" title="Scripted objects (1% translated)" lang="pt" dir="ltr">portugu&ecirc;s</a></li>
<li><a href="../pt-br/Scripted_objects.html" class="mw-pt-progress mw-pt-progress--low" title="Objetos com Script (3% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../ro/Scripted_objects.html" class="mw-pt-progress mw-pt-progress--low" title="Obiecte create prin script-programare (8% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><a href="../fi/Scripted_objects.html" class="mw-pt-progress mw-pt-progress--low" title="Scripted objects (1% translated)" lang="fi" dir="ltr">suomi</a></li>
<li><a href="../sv/Scripted_objects.html" class="mw-pt-progress mw-pt-progress--low" title="Scripted objects (5% translated)" lang="sv" dir="ltr">svenska</a></li>
<li><a href="../cs/Scripted_objects.html" class="mw-pt-progress mw-pt-progress--low" title="Skriptovan&eacute; objekty (7% translated)" lang="cs" dir="ltr">&#269;e&scaron;tina</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--high" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</span></li>
<li><a href="../zh-cn/Scripted_objects.html" class="mw-pt-progress mw-pt-progress--low" title="&#33050;&#26412;&#21270;&#29289;&#20307; (4% translated)" lang="zh-Hans-CN" dir="ltr">&#20013;&#25991;&#65288;&#20013;&#22269;&#22823;&#38470;&#65289;</a></li>
<li><a href="../ja/Scripted_objects.html" class="mw-pt-progress mw-pt-progress--low" title="&#12473;&#12463;&#12522;&#12503;&#12488;&#12395;&#12424;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#29983;&#25104; (1% translated)" lang="ja" dir="ltr">&#26085;&#26412;&#35486;</a></li></ul></div>
<div class="docnav">
    <div><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-left.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span> <a href="../ru/Topological_data_scripting.html" title="Topological data scripting/ru">&#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1090;&#1086;&#1087;&#1086;&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;</a></div>
    <div><a href="../ru/Scenegraph.html" title="Scenegraph/ru">&#1043;&#1088;&#1072;&#1092; &#1089;&#1094;&#1077;&#1085;&#1099;</a>
 <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-right.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span></div>
    <div><a href="../ru/Online_Help_Toc.html" title="Online Help Toc/ru">&#1054;&#1075;&#1083;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;</a> <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Online_Help_Toc.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span></div>
</div>
<div style="clear:right; margin-bottom: .5em; float: right; padding: .5em 0 .8em 1.4em; background: none;"><meta property="mw:PageProp/toc"></div>
<p><span id="Introduction"></span>
</p>
<h2><span id=".D0.92.D0.B2.D0.B5.D0.B4.D0.B5.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;">&#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;</span></h2>
<p>&#1050;&#1088;&#1086;&#1084;&#1077; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1093; &#1090;&#1080;&#1087;&#1086;&#1074; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1090;&#1072;&#1082;&#1080;&#1093; &#1082;&#1072;&#1082; &#1072;&#1085;&#1085;&#1086;&#1090;&#1072;&#1094;&#1080;&#1080;, &#1087;&#1086;&#1083;&#1080;&#1075;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1089;&#1077;&#1090;&#1082;&#1080; &#1080; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080;, FreeCAD &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090; &#1091;&#1076;&#1080;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1091;&#1102; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;, 100% &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1077; &#1085;&#1072; Python, &#1090;&#1072;&#1082;&#1080;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; (<a href="../ru/App_FeaturePython.html" title="App FeaturePython/ru">Python Features (&#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;)</a>). &#1054;&#1085;&#1080; &#1074;&#1077;&#1076;&#1091;&#1090; &#1089;&#1077;&#1073;&#1103; &#1090;&#1086;&#1095;&#1085;&#1086; &#1090;&#1072;&#1082; &#1078;&#1077;, &#1082;&#1072;&#1082; &#1083;&#1102;&#1073;&#1086;&#1081; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; FreeCAD, &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1080; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1080; &#1080;&#1083;&#1080; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1077; &#1092;&#1072;&#1081;&#1083;&#1072;.
</p><p>&#1053;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1090;&#1100; &#1086;&#1076;&#1085;&#1091; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100;: &#1087;&#1086; &#1089;&#1086;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080; &#1092;&#1072;&#1081;&#1083;&#1099; FreeCAD &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090; &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072;. &#1050;&#1086;&#1076; &#1085;&#1072; Python, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1074;&#1099; &#1087;&#1080;&#1096;&#1077;&#1090;&#1077; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1092;&#1072;&#1081;&#1083;&#1072;. &#1069;&#1090;&#1086; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1086;&#1090;&#1082;&#1088;&#1086;&#1077;&#1090;&#1077; &#1092;&#1072;&#1081;&#1083;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1080;&#1081; &#1090;&#1072;&#1082;&#1086;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;, &#1085;&#1072; &#1076;&#1088;&#1091;&#1075;&#1086;&#1084; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086;&#1090; &#1082;&#1086;&#1076; Python &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1085;&#1072; &#1101;&#1090;&#1086;&#1084; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1077;, &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1074;&#1086;&#1089;&#1089;&#1086;&#1079;&#1076;&#1072;&#1085;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1103;&#1077;&#1090;&#1077; &#1090;&#1072;&#1082;&#1080;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1089;&#1088;&#1077;&#1076;&#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;, &#1074;&#1072;&#1084; &#1090;&#1072;&#1082;&#1078;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1089;&#1074;&#1086;&#1081; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090; &#1085;&#1072; Python, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1074; &#1074;&#1080;&#1076;&#1077; <a href="../ru/Macros.html" title="Macros/ru">&#1052;&#1072;&#1082;&#1088;&#1086;&#1089;&#1072;</a>.
</p><p><b>&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;</b>: &#1048;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1091;&#1087;&#1072;&#1082;&#1086;&#1074;&#1082;&#1080; Python &#1082;&#1086;&#1076;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1100; FreeCAD &#1092;&#1072;&#1081;&#1083;&#1072;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; json &#1089;&#1077;&#1088;&#1080;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1102; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; App::PropertyPythonObject, &#1085;&#1086; &#1101;&#1090;&#1086;&#1090; &#1082;&#1086;&#1076; &#1074; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;&#1084; &#1089;&#1095;&#1105;&#1090;&#1077; &#1085;&#1077;&#1083;&#1100;&#1079;&#1103; &#1073;&#1091;&#1076;&#1077;&#1090; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1085;&#1072;&#1087;&#1088;&#1103;&#1084;&#1091;&#1102;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1101;&#1090;&#1086; &#1084;&#1072;&#1083;&#1086; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1080;&#1090; &#1076;&#1083;&#1103; &#1085;&#1072;&#1096;&#1080;&#1093; &#1094;&#1077;&#1083;&#1077;&#1081;.
</p><p><a href="../ru/App_FeaturePython.html" title="App FeaturePython/ru">Python Features (&#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;)</a> &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1090; &#1090;&#1086;&#1084;&#1091; &#1078;&#1077; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1091; &#1095;&#1090;&#1086; &#1080; &#1074;&#1089;&#1077; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; FreeCAD features: &#1086;&#1085;&#1080; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1099; &#1085;&#1072; App &#1080; GUI &#1095;&#1072;&#1089;&#1090;&#1080;. App &#1095;&#1072;&#1089;&#1090;&#1100;, &#1054;&#1073;&#1098;&#1077;&#1082;&#1090; &#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; (Document Object), &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1102; &#1085;&#1072;&#1096;&#1077;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;, &#1090;&#1086;&#1075;&#1076;&#1072; &#1082;&#1072;&#1082; &#1077;&#1075;&#1086; GUI &#1095;&#1072;&#1089;&#1090;&#1100;, &#1054;&#1073;&#1098;&#1077;&#1082;&#1090; &#1042;&#1080;&#1079;&#1091;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1055;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; (View Provider Object) &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;, &#1082;&#1072;&#1082; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085;&#1077;. &#1054;&#1073;&#1098;&#1077;&#1082;&#1090; View Provider, &#1082;&#1072;&#1082; &#1080; &#1083;&#1102;&#1073;&#1072;&#1103; &#1076;&#1088;&#1091;&#1075;&#1072;&#1103; FreeCAD feature, &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1088;&#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1077; FreeCAD &#1074; &#1077;&#1075;&#1086; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1084; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1077;.  &#1057;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; &#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074;, &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1093; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;. &#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1087;&#1088;&#1080;&#1085;&#1072;&#1076;&#1083;&#1077;&#1078;&#1072;&#1090;&#1100; &#1082; &#1083;&#1102;&#1073;&#1086;&#1084;&#1091; &#1080;&#1079; &#1087;&#1088;&#1077;&#1076;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1099;&#1093; &#1090;&#1080;&#1087;&#1086;&#1074; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;, &#1087;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1077;&#1084;&#1099;&#1093; FreeCAD, &#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1086;&#1082;&#1085;&#1077; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1072; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; &#1084;&#1086;&#1075; &#1080;&#1093; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;. &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; Feature Python &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1085;&#1099;. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1086; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1082;&#1072;&#1082; &#1044;&#1072;&#1085;&#1085;&#1099;&#1093; (Object), &#1090;&#1072;&#1082; &#1080; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1042;&#1080;&#1076;&#1072; (ViewObject).
</p><p><span id="Basic_example"></span>
</p>
<h2><span id=".D0.9F.D1.80.D0.BE.D1.81.D1.82.D0.BE.D0.B9_.D0.BF.D1.80.D0.B8.D0.BC.D0.B5.D1.80"></span><span class="mw-headline" id="&#1055;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081;_&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;">&#1055;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;</span></h2>
<p>&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1081;&#1090;&#1080; &#1074; &#1092;&#1072;&#1081;&#1083;&#1077; <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/blob/master/src/Mod/TemplatePyMod/FeaturePython.py">src/Mod/TemplatePyMod/FeaturePython.py</a> &#1074;&#1084;&#1077;&#1089;&#1090;&#1077; &#1089; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1084;&#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072;&#1084;&#1080;:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="sd">'''Examples for a feature class and its view provider.'''</span>

<span class="kn">import</span> <span class="nn">FreeCAD</span><span class="o">,</span> <span class="nn">FreeCADGui</span>
<span class="kn">from</span> <span class="nn">pivy</span> <span class="kn">import</span> <span class="n">coin</span>

<span class="k">class</span> <span class="nc">Box</span><span class="p">:</span>
    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">obj</span><span class="p">):</span>
<span class="w">        </span><span class="sd">'''Add some custom properties to our box feature'''</span>
        <span class="n">obj</span><span class="o">.</span><span class="n">addProperty</span><span class="p">(</span><span class="s2">"App::PropertyLength"</span><span class="p">,</span> <span class="s2">"Length"</span><span class="p">,</span> <span class="s2">"Box"</span><span class="p">,</span> <span class="s2">"Length of the box"</span><span class="p">)</span><span class="o">.</span><span class="n">Length</span> <span class="o">=</span> <span class="mf">1.0</span>
        <span class="n">obj</span><span class="o">.</span><span class="n">addProperty</span><span class="p">(</span><span class="s2">"App::PropertyLength"</span><span class="p">,</span> <span class="s2">"Width"</span><span class="p">,</span> <span class="s2">"Box"</span><span class="p">,</span> <span class="s2">"Width of the box"</span><span class="p">)</span><span class="o">.</span><span class="n">Width</span> <span class="o">=</span> <span class="mf">1.0</span>
        <span class="n">obj</span><span class="o">.</span><span class="n">addProperty</span><span class="p">(</span><span class="s2">"App::PropertyLength"</span><span class="p">,</span> <span class="s2">"Height"</span><span class="p">,</span> <span class="s2">"Box"</span><span class="p">,</span> <span class="s2">"Height of the box"</span><span class="p">)</span><span class="o">.</span><span class="n">Height</span> <span class="o">=</span> <span class="mf">1.0</span>
        <span class="n">obj</span><span class="o">.</span><span class="n">Proxy</span> <span class="o">=</span> <span class="bp">self</span>

    <span class="k">def</span> <span class="nf">onChanged</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">fp</span><span class="p">,</span> <span class="n">prop</span><span class="p">):</span>
<span class="w">        </span><span class="sd">'''Do something when a property has changed'''</span>
        <span class="n">FreeCAD</span><span class="o">.</span><span class="n">Console</span><span class="o">.</span><span class="n">PrintMessage</span><span class="p">(</span><span class="s2">"Change property: "</span> <span class="o">+</span> <span class="nb">str</span><span class="p">(</span><span class="n">prop</span><span class="p">)</span> <span class="o">+</span> <span class="s2">"</span><span class="se">\n</span><span class="s2">"</span><span class="p">)</span>

    <span class="k">def</span> <span class="nf">execute</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">fp</span><span class="p">):</span>
<span class="w">        </span><span class="sd">'''Do something when doing a recomputation, this method is mandatory'''</span>
        <span class="n">FreeCAD</span><span class="o">.</span><span class="n">Console</span><span class="o">.</span><span class="n">PrintMessage</span><span class="p">(</span><span class="s2">"Recompute Python Box feature</span><span class="se">\n</span><span class="s2">"</span><span class="p">)</span>

<span class="k">class</span> <span class="nc">ViewProviderBox</span><span class="p">:</span>
    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">obj</span><span class="p">):</span>
<span class="w">        </span><span class="sd">'''Set this object to the proxy object of the actual view provider'''</span>
        <span class="n">obj</span><span class="o">.</span><span class="n">addProperty</span><span class="p">(</span><span class="s2">"App::PropertyColor"</span><span class="p">,</span><span class="s2">"Color"</span><span class="p">,</span> <span class="s2">"Box"</span><span class="p">,</span> <span class="s2">"Color of the box"</span><span class="p">)</span><span class="o">.</span><span class="n">Color</span> <span class="o">=</span> <span class="p">(</span><span class="mf">1.0</span><span class="p">,</span> <span class="mf">0.0</span><span class="p">,</span> <span class="mf">0.0</span><span class="p">)</span>
        <span class="n">obj</span><span class="o">.</span><span class="n">Proxy</span> <span class="o">=</span> <span class="bp">self</span>

    <span class="k">def</span> <span class="nf">attach</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">obj</span><span class="p">):</span>
<span class="w">        </span><span class="sd">'''Setup the scene sub-graph of the view provider, this method is mandatory'''</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">shaded</span> <span class="o">=</span> <span class="n">coin</span><span class="o">.</span><span class="n">SoGroup</span><span class="p">()</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">wireframe</span> <span class="o">=</span> <span class="n">coin</span><span class="o">.</span><span class="n">SoGroup</span><span class="p">()</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">scale</span> <span class="o">=</span> <span class="n">coin</span><span class="o">.</span><span class="n">SoScale</span><span class="p">()</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">color</span> <span class="o">=</span> <span class="n">coin</span><span class="o">.</span><span class="n">SoBaseColor</span><span class="p">()</span>

        <span class="n">data</span><span class="o">=</span><span class="n">coin</span><span class="o">.</span><span class="n">SoCube</span><span class="p">()</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">shaded</span><span class="o">.</span><span class="n">addChild</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">scale</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">shaded</span><span class="o">.</span><span class="n">addChild</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">color</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">shaded</span><span class="o">.</span><span class="n">addChild</span><span class="p">(</span><span class="n">data</span><span class="p">)</span>
        <span class="n">obj</span><span class="o">.</span><span class="n">addDisplayMode</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">shaded</span><span class="p">,</span> <span class="s2">"Shaded"</span><span class="p">);</span>
        <span class="n">style</span><span class="o">=</span><span class="n">coin</span><span class="o">.</span><span class="n">SoDrawStyle</span><span class="p">()</span>
        <span class="n">style</span><span class="o">.</span><span class="n">style</span> <span class="o">=</span> <span class="n">coin</span><span class="o">.</span><span class="n">SoDrawStyle</span><span class="o">.</span><span class="n">LINES</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">wireframe</span><span class="o">.</span><span class="n">addChild</span><span class="p">(</span><span class="n">style</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">wireframe</span><span class="o">.</span><span class="n">addChild</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">scale</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">wireframe</span><span class="o">.</span><span class="n">addChild</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">color</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">wireframe</span><span class="o">.</span><span class="n">addChild</span><span class="p">(</span><span class="n">data</span><span class="p">)</span>
        <span class="n">obj</span><span class="o">.</span><span class="n">addDisplayMode</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">wireframe</span><span class="p">,</span> <span class="s2">"Wireframe"</span><span class="p">);</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">onChanged</span><span class="p">(</span><span class="n">obj</span><span class="p">,</span><span class="s2">"Color"</span><span class="p">)</span>

    <span class="k">def</span> <span class="nf">updateData</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">fp</span><span class="p">,</span> <span class="n">prop</span><span class="p">):</span>
<span class="w">        </span><span class="sd">'''If a property of the handled feature has changed we have the chance to handle this here'''</span>
        <span class="c1"># fp is the handled feature, prop is the name of the property that has changed</span>
        <span class="n">l</span> <span class="o">=</span> <span class="n">fp</span><span class="o">.</span><span class="n">getPropertyByName</span><span class="p">(</span><span class="s2">"Length"</span><span class="p">)</span>
        <span class="n">w</span> <span class="o">=</span> <span class="n">fp</span><span class="o">.</span><span class="n">getPropertyByName</span><span class="p">(</span><span class="s2">"Width"</span><span class="p">)</span>
        <span class="n">h</span> <span class="o">=</span> <span class="n">fp</span><span class="o">.</span><span class="n">getPropertyByName</span><span class="p">(</span><span class="s2">"Height"</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">scale</span><span class="o">.</span><span class="n">scaleFactor</span><span class="o">.</span><span class="n">setValue</span><span class="p">(</span><span class="nb">float</span><span class="p">(</span><span class="n">l</span><span class="p">),</span> <span class="nb">float</span><span class="p">(</span><span class="n">w</span><span class="p">),</span> <span class="nb">float</span><span class="p">(</span><span class="n">h</span><span class="p">))</span>
        <span class="k">pass</span>

    <span class="k">def</span> <span class="nf">getDisplayModes</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span><span class="n">obj</span><span class="p">):</span>
<span class="w">        </span><span class="sd">'''Return a list of display modes.'''</span>
        <span class="n">modes</span><span class="o">=</span><span class="p">[]</span>
        <span class="n">modes</span><span class="o">.</span><span class="n">append</span><span class="p">(</span><span class="s2">"Shaded"</span><span class="p">)</span>
        <span class="n">modes</span><span class="o">.</span><span class="n">append</span><span class="p">(</span><span class="s2">"Wireframe"</span><span class="p">)</span>
        <span class="k">return</span> <span class="n">modes</span>

    <span class="k">def</span> <span class="nf">getDefaultDisplayMode</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
<span class="w">        </span><span class="sd">'''Return the name of the default display mode. It must be defined in getDisplayModes.'''</span>
        <span class="k">return</span> <span class="s2">"Shaded"</span>

    <span class="k">def</span> <span class="nf">setDisplayMode</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span><span class="n">mode</span><span class="p">):</span>
<span class="w">        </span><span class="sd">'''Map the display mode defined in attach with those defined in getDisplayModes.\</span>
<span class="sd">                Since they have the same names nothing needs to be done. This method is optional'''</span>
        <span class="k">return</span> <span class="n">mode</span>

    <span class="k">def</span> <span class="nf">onChanged</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">vp</span><span class="p">,</span> <span class="n">prop</span><span class="p">):</span>
<span class="w">        </span><span class="sd">'''Here we can do something when a single property got changed'''</span>
        <span class="n">FreeCAD</span><span class="o">.</span><span class="n">Console</span><span class="o">.</span><span class="n">PrintMessage</span><span class="p">(</span><span class="s2">"Change property: "</span> <span class="o">+</span> <span class="nb">str</span><span class="p">(</span><span class="n">prop</span><span class="p">)</span> <span class="o">+</span> <span class="s2">"</span><span class="se">\n</span><span class="s2">"</span><span class="p">)</span>
        <span class="k">if</span> <span class="n">prop</span> <span class="o">==</span> <span class="s2">"Color"</span><span class="p">:</span>
            <span class="n">c</span> <span class="o">=</span> <span class="n">vp</span><span class="o">.</span><span class="n">getPropertyByName</span><span class="p">(</span><span class="s2">"Color"</span><span class="p">)</span>
            <span class="bp">self</span><span class="o">.</span><span class="n">color</span><span class="o">.</span><span class="n">rgb</span><span class="o">.</span><span class="n">setValue</span><span class="p">(</span><span class="n">c</span><span class="p">[</span><span class="mi">0</span><span class="p">],</span> <span class="n">c</span><span class="p">[</span><span class="mi">1</span><span class="p">],</span> <span class="n">c</span><span class="p">[</span><span class="mi">2</span><span class="p">])</span>

    <span class="k">def</span> <span class="nf">getIcon</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
<span class="w">        </span><span class="sd">'''Return the icon in XPM format which will appear in the tree view. This method is\</span>
<span class="sd">                optional and if not defined a default icon is shown.'''</span>
        <span class="k">return</span> <span class="s2">"""</span>
<span class="s2">            /* XPM */</span>
<span class="s2">            static const char * ViewProviderBox_xpm[] = {</span>
<span class="s2">            "16 16 6 1",</span>
<span class="s2">            "   c None",</span>
<span class="s2">            ".  c #141010",</span>
<span class="s2">            "+  c #615BD2",</span>
<span class="s2">            "@  c #C39D55",</span>
<span class="s2">            "#  c #000000",</span>
<span class="s2">            "$  c #57C355",</span>
<span class="s2">            "        ........",</span>
<span class="s2">            "   ......++..+..",</span>
<span class="s2">            "   .@@@@.++..++.",</span>
<span class="s2">            "   .@@@@.++..++.",</span>
<span class="s2">            "   .@@  .++++++.",</span>
<span class="s2">            "  ..@@  .++..++.",</span>
<span class="s2">            "###@@@@ .++..++.",</span>
<span class="s2">            "##$.@@$#.++++++.",</span>
<span class="s2">            "#$#$.$$$........",</span>
<span class="s2">            "#$$#######      ",</span>
<span class="s2">            "#$$#$$$$$#      ",</span>
<span class="s2">            "#$$#$$$$$#      ",</span>
<span class="s2">            "#$$#$$$$$#      ",</span>
<span class="s2">            " #$#$$$$$#      ",</span>
<span class="s2">            "  ##$$$$$#      ",</span>
<span class="s2">            "   #######      "};</span>
<span class="s2">            """</span>

    <span class="k">def</span> <span class="nf">dumps</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
<span class="w">        </span><span class="sd">'''When saving the document this object gets stored using Python's json module.\</span>
<span class="sd">                Since we have some un-serializable parts here -- the Coin stuff -- we must define this method\</span>
<span class="sd">                to return a tuple of all serializable objects or None.'''</span>
        <span class="k">return</span> <span class="kc">None</span>

    <span class="k">def</span> <span class="nf">loads</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span><span class="n">state</span><span class="p">):</span>
<span class="w">        </span><span class="sd">'''When restoring the serialized object from document we have the chance to set some internals here.\</span>
<span class="sd">                Since no data were serialized nothing needs to be done here.'''</span>
        <span class="k">return</span> <span class="kc">None</span>

<span class="k">def</span> <span class="nf">makeBox</span><span class="p">():</span>
    <span class="n">FreeCAD</span><span class="o">.</span><span class="n">newDocument</span><span class="p">()</span>
    <span class="n">a</span><span class="o">=</span><span class="n">FreeCAD</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">addObject</span><span class="p">(</span><span class="s2">"App::FeaturePython"</span><span class="p">,</span> <span class="s2">"Box"</span><span class="p">)</span>
    <span class="n">Box</span><span class="p">(</span><span class="n">a</span><span class="p">)</span>
    <span class="n">ViewProviderBox</span><span class="p">(</span><span class="n">a</span><span class="o">.</span><span class="n">ViewObject</span><span class="p">)</span>

<span class="n">makeBox</span><span class="p">()</span>
</pre></div>
<p><span id="Things_to_note"></span>
</p>
<h3><span id=".D0.A7.D1.82.D0.BE_.D0.BD.D0.B5.D0.BE.D0.B1.D1.85.D0.BE.D0.B4.D0.B8.D0.BC.D0.BE_.D0.BE.D1.82.D0.BC.D0.B5.D1.82.D0.B8.D1.82.D1.8C"></span><span class="mw-headline" id="&#1063;&#1090;&#1086;_&#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;_&#1086;&#1090;&#1084;&#1077;&#1090;&#1080;&#1090;&#1100;">&#1063;&#1090;&#1086; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1086;&#1090;&#1084;&#1077;&#1090;&#1080;&#1090;&#1100;</span></h3>
<p>&#1045;&#1089;&#1083;&#1080; &#1042;&#1072;&#1096; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1089;&#1095;&#1080;&#1090;&#1072;&#1085; &#1074;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103;, &#1042;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086; &#1074;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102; &#1074; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; <code>__init__</code>, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1087;&#1077;&#1088;&#1077;&#1089;&#1095;&#1105;&#1090; &#1085;&#1077; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;. &#1069;&#1090;&#1086;&#1090; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1085;&#1077; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090; &#1101;&#1090;&#1086;&#1075;&#1086; &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1084;&#1077;&#1090;&#1086;&#1076; <code>onChanged</code> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <code>Box</code> &#1080;&#1084;&#1077;&#1077;&#1090; &#1090;&#1086;&#1090; &#1078;&#1077; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;, &#1095;&#1090;&#1086; &#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; <code>execute</code>, &#1085;&#1086; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1085;&#1080;&#1078;&#1077; &#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1089;&#1095;&#1080;&#1090;&#1072;&#1085; &#1087;&#1077;&#1088;&#1077;&#1076; &#1090;&#1077;&#1084; &#1082;&#1072;&#1082; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085; &#1074; &#1086;&#1082;&#1085;&#1077; &#1090;&#1088;&#1105;&#1093;&#1084;&#1077;&#1088;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1072;. &#1042; &#1101;&#1090;&#1080;&#1093; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072;&#1093; &#1101;&#1090;&#1086; &#1076;&#1077;&#1083;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <code>ActiveDocument.recompute()</code>, &#1085;&#1086; &#1074; &#1073;&#1086;&#1083;&#1077;&#1077; &#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1093; &#1089;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1103;&#1093; &#1042;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1088;&#1077;&#1096;&#1080;&#1090;&#1100;, &#1075;&#1076;&#1077; &#1087;&#1077;&#1088;&#1077;&#1089;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1083;&#1080;&#1073;&#1086; &#1074;&#1077;&#1089;&#1100; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;, &#1080;&#1083;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; FeaturePython.
</p><p>&#1069;&#1090;&#1086;&#1090; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1089;&#1086;&#1079;&#1076;&#1072;&#1105;&#1090; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1081; &#1090;&#1088;&#1072;&#1089;&#1089; &#1089;&#1090;&#1077;&#1082;&#1072; &#1074; &#1086;&#1082;&#1085;&#1077; &#1086;&#1090;&#1095;&#1105;&#1090;&#1086;&#1074;. &#1069;&#1090;&#1086; &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1084;&#1077;&#1090;&#1086;&#1076;  <code>onChanged</code> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <code>Box</code> &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1088;&#1072;&#1079; &#1082;&#1072;&#1082; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074; <code>__init__</code>. &#1050;&#1086;&#1075;&#1076;&#1072; &#1087;&#1077;&#1088;&#1074;&#1086;&#1077; &#1073;&#1099;&#1083;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1086;, &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; Width &#1080; Height &#1080; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1087;&#1086;&#1087;&#1099;&#1090;&#1082;&#1080; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1082; &#1085;&#1080;&#1084; &#1073;&#1077;&#1079;&#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1099;.
</p><p>&#1054;&#1073;&#1098;&#1103;&#1089;&#1085;&#1077;&#1085;&#1080;&#1077; <code>__getstate__</code> &#1080; <code>__setstate__</code>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1099;&#1083;&#1080; &#1079;&#1072;&#1084;&#1077;&#1085;&#1077;&#1085;&#1099; &#1085;&#1072; <code>dumps</code> &#1080; <code>loads</code>, &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1090;&#1077;&#1084;&#1077; &#1092;&#1086;&#1088;&#1091;&#1084;&#1072;. <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?f=18&amp;t=44009&amp;start=10#p377892">obj.Proxy.Type is a dict, not a string (obj.Proxy.Type &#1101;&#1090;&#1086; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1100;, &#1072; &#1085;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072;)</a>.
</p><p><code>obj.addProperty(...)</code> &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <code>obj</code>, &#1090;&#1072;&#1082; &#1095;&#1090;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1079;&#1072;&#1076;&#1072;&#1085;&#1086; &#1074; &#1090;&#1086;&#1081; &#1078;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077;:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">obj</span><span class="o">.</span><span class="n">addProperty</span><span class="p">(</span><span class="s2">"App::PropertyLength"</span><span class="p">,</span> <span class="s2">"Length"</span><span class="p">,</span> <span class="s2">"Box"</span><span class="p">,</span> <span class="s2">"Length of the box"</span><span class="p">)</span><span class="o">.</span><span class="n">Length</span> <span class="o">=</span> <span class="mf">1.0</span>
</pre></div>
<p>&#1063;&#1090;&#1086; &#1101;&#1082;&#1074;&#1080;&#1074;&#1072;&#1083;&#1077;&#1085;&#1090;&#1085;&#1086;:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">obj</span><span class="o">.</span><span class="n">addProperty</span><span class="p">(</span><span class="s2">"App::PropertyLength"</span><span class="p">,</span> <span class="s2">"Length"</span><span class="p">,</span> <span class="s2">"Box"</span><span class="p">,</span> <span class="s2">"Length of the box"</span><span class="p">)</span>
<span class="n">obj</span><span class="o">.</span><span class="n">Length</span> <span class="o">=</span> <span class="mf">1.0</span>
</pre></div>
<p><span id="Other_more_complex_example"></span>
</p>
<h2><span id=".D0.94.D1.80.D1.83.D0.B3.D0.BE.D0.B9_.D0.B1.D0.BE.D0.BB.D0.B5.D0.B5_.D1.81.D0.BB.D0.BE.D0.B6.D0.BD.D1.8B.D0.B9_.D0.BF.D1.80.D0.B8.D0.BC.D0.B5.D1.80"></span><span class="mw-headline" id="&#1044;&#1088;&#1091;&#1075;&#1086;&#1081;_&#1073;&#1086;&#1083;&#1077;&#1077;_&#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1081;_&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;">&#1044;&#1088;&#1091;&#1075;&#1086;&#1081; &#1073;&#1086;&#1083;&#1077;&#1077; &#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1081; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;</span></h2>
<p>&#1042; &#1101;&#1090;&#1086;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1084;&#1086;&#1076;&#1091;&#1083;&#1100; Part (&#1044;&#1077;&#1090;&#1072;&#1083;&#1100;) &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1086;&#1082;&#1090;&#1072;&#1101;&#1076;&#1088;&#1072;, &#1079;&#1072;&#1090;&#1077;&#1084; &#1089;&#1086;&#1079;&#1076;&#1072;&#1105;&#1090;&#1089;&#1103; &#1077;&#1075;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Coin3D">Coin</a> &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <a href="../ru/Pivy.html" title="Pivy/ru">Pivy</a>.
</p><p>&#1057;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1089;&#1072;&#1084;  &#1054;&#1073;&#1098;&#1077;&#1082;&#1090; &#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; (Document object):
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="kn">import</span> <span class="nn">FreeCAD</span><span class="o">,</span> <span class="nn">FreeCADGui</span><span class="o">,</span> <span class="nn">Part</span>
<span class="kn">import</span> <span class="nn">pivy</span>
<span class="kn">from</span> <span class="nn">pivy</span> <span class="kn">import</span> <span class="n">coin</span>

<span class="k">class</span> <span class="nc">Octahedron</span><span class="p">:</span>
  <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">obj</span><span class="p">):</span>
     <span class="s2">"Add some custom properties to our box feature"</span>
     <span class="n">obj</span><span class="o">.</span><span class="n">addProperty</span><span class="p">(</span><span class="s2">"App::PropertyLength"</span><span class="p">,</span><span class="s2">"Length"</span><span class="p">,</span><span class="s2">"Octahedron"</span><span class="p">,</span><span class="s2">"Length of the octahedron"</span><span class="p">)</span><span class="o">.</span><span class="n">Length</span><span class="o">=</span><span class="mf">1.0</span>
     <span class="n">obj</span><span class="o">.</span><span class="n">addProperty</span><span class="p">(</span><span class="s2">"App::PropertyLength"</span><span class="p">,</span><span class="s2">"Width"</span><span class="p">,</span><span class="s2">"Octahedron"</span><span class="p">,</span><span class="s2">"Width of the octahedron"</span><span class="p">)</span><span class="o">.</span><span class="n">Width</span><span class="o">=</span><span class="mf">1.0</span>
     <span class="n">obj</span><span class="o">.</span><span class="n">addProperty</span><span class="p">(</span><span class="s2">"App::PropertyLength"</span><span class="p">,</span><span class="s2">"Height"</span><span class="p">,</span><span class="s2">"Octahedron"</span><span class="p">,</span> <span class="s2">"Height of the octahedron"</span><span class="p">)</span><span class="o">.</span><span class="n">Height</span><span class="o">=</span><span class="mf">1.0</span>
     <span class="n">obj</span><span class="o">.</span><span class="n">addProperty</span><span class="p">(</span><span class="s2">"Part::PropertyPartShape"</span><span class="p">,</span><span class="s2">"Shape"</span><span class="p">,</span><span class="s2">"Octahedron"</span><span class="p">,</span> <span class="s2">"Shape of the octahedron"</span><span class="p">)</span>
     <span class="n">obj</span><span class="o">.</span><span class="n">Proxy</span> <span class="o">=</span> <span class="bp">self</span>

  <span class="k">def</span> <span class="nf">execute</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">fp</span><span class="p">):</span>
     <span class="c1"># Define six vetices for the shape</span>
     <span class="n">v1</span> <span class="o">=</span> <span class="n">FreeCAD</span><span class="o">.</span><span class="n">Vector</span><span class="p">(</span><span class="mi">0</span><span class="p">,</span><span class="mi">0</span><span class="p">,</span><span class="mi">0</span><span class="p">)</span>
     <span class="n">v2</span> <span class="o">=</span> <span class="n">FreeCAD</span><span class="o">.</span><span class="n">Vector</span><span class="p">(</span><span class="n">fp</span><span class="o">.</span><span class="n">Length</span><span class="p">,</span><span class="mi">0</span><span class="p">,</span><span class="mi">0</span><span class="p">)</span>
     <span class="n">v3</span> <span class="o">=</span> <span class="n">FreeCAD</span><span class="o">.</span><span class="n">Vector</span><span class="p">(</span><span class="mi">0</span><span class="p">,</span><span class="n">fp</span><span class="o">.</span><span class="n">Width</span><span class="p">,</span><span class="mi">0</span><span class="p">)</span>
     <span class="n">v4</span> <span class="o">=</span> <span class="n">FreeCAD</span><span class="o">.</span><span class="n">Vector</span><span class="p">(</span><span class="n">fp</span><span class="o">.</span><span class="n">Length</span><span class="p">,</span><span class="n">fp</span><span class="o">.</span><span class="n">Width</span><span class="p">,</span><span class="mi">0</span><span class="p">)</span>
     <span class="n">v5</span> <span class="o">=</span> <span class="n">FreeCAD</span><span class="o">.</span><span class="n">Vector</span><span class="p">(</span><span class="n">fp</span><span class="o">.</span><span class="n">Length</span><span class="o">/</span><span class="mi">2</span><span class="p">,</span><span class="n">fp</span><span class="o">.</span><span class="n">Width</span><span class="o">/</span><span class="mi">2</span><span class="p">,</span><span class="n">fp</span><span class="o">.</span><span class="n">Height</span><span class="o">/</span><span class="mi">2</span><span class="p">)</span>
     <span class="n">v6</span> <span class="o">=</span> <span class="n">FreeCAD</span><span class="o">.</span><span class="n">Vector</span><span class="p">(</span><span class="n">fp</span><span class="o">.</span><span class="n">Length</span><span class="o">/</span><span class="mi">2</span><span class="p">,</span><span class="n">fp</span><span class="o">.</span><span class="n">Width</span><span class="o">/</span><span class="mi">2</span><span class="p">,</span><span class="o">-</span><span class="n">fp</span><span class="o">.</span><span class="n">Height</span><span class="o">/</span><span class="mi">2</span><span class="p">)</span>

     <span class="c1"># Make the wires/faces</span>
     <span class="n">f1</span> <span class="o">=</span> <span class="bp">self</span><span class="o">.</span><span class="n">make_face</span><span class="p">(</span><span class="n">v1</span><span class="p">,</span><span class="n">v2</span><span class="p">,</span><span class="n">v5</span><span class="p">)</span>
     <span class="n">f2</span> <span class="o">=</span> <span class="bp">self</span><span class="o">.</span><span class="n">make_face</span><span class="p">(</span><span class="n">v2</span><span class="p">,</span><span class="n">v4</span><span class="p">,</span><span class="n">v5</span><span class="p">)</span>
     <span class="n">f3</span> <span class="o">=</span> <span class="bp">self</span><span class="o">.</span><span class="n">make_face</span><span class="p">(</span><span class="n">v4</span><span class="p">,</span><span class="n">v3</span><span class="p">,</span><span class="n">v5</span><span class="p">)</span>
     <span class="n">f4</span> <span class="o">=</span> <span class="bp">self</span><span class="o">.</span><span class="n">make_face</span><span class="p">(</span><span class="n">v3</span><span class="p">,</span><span class="n">v1</span><span class="p">,</span><span class="n">v5</span><span class="p">)</span>
     <span class="n">f5</span> <span class="o">=</span> <span class="bp">self</span><span class="o">.</span><span class="n">make_face</span><span class="p">(</span><span class="n">v2</span><span class="p">,</span><span class="n">v1</span><span class="p">,</span><span class="n">v6</span><span class="p">)</span>
     <span class="n">f6</span> <span class="o">=</span> <span class="bp">self</span><span class="o">.</span><span class="n">make_face</span><span class="p">(</span><span class="n">v4</span><span class="p">,</span><span class="n">v2</span><span class="p">,</span><span class="n">v6</span><span class="p">)</span>
     <span class="n">f7</span> <span class="o">=</span> <span class="bp">self</span><span class="o">.</span><span class="n">make_face</span><span class="p">(</span><span class="n">v3</span><span class="p">,</span><span class="n">v4</span><span class="p">,</span><span class="n">v6</span><span class="p">)</span>
     <span class="n">f8</span> <span class="o">=</span> <span class="bp">self</span><span class="o">.</span><span class="n">make_face</span><span class="p">(</span><span class="n">v1</span><span class="p">,</span><span class="n">v3</span><span class="p">,</span><span class="n">v6</span><span class="p">)</span>
     <span class="n">shell</span><span class="o">=</span><span class="n">Part</span><span class="o">.</span><span class="n">makeShell</span><span class="p">([</span><span class="n">f1</span><span class="p">,</span><span class="n">f2</span><span class="p">,</span><span class="n">f3</span><span class="p">,</span><span class="n">f4</span><span class="p">,</span><span class="n">f5</span><span class="p">,</span><span class="n">f6</span><span class="p">,</span><span class="n">f7</span><span class="p">,</span><span class="n">f8</span><span class="p">])</span>
     <span class="n">solid</span><span class="o">=</span><span class="n">Part</span><span class="o">.</span><span class="n">makeSolid</span><span class="p">(</span><span class="n">shell</span><span class="p">)</span>
     <span class="n">fp</span><span class="o">.</span><span class="n">Shape</span> <span class="o">=</span> <span class="n">solid</span>

  <span class="c1"># helper mehod to create the faces</span>
  <span class="k">def</span> <span class="nf">make_face</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span><span class="n">v1</span><span class="p">,</span><span class="n">v2</span><span class="p">,</span><span class="n">v3</span><span class="p">):</span>
     <span class="n">wire</span> <span class="o">=</span> <span class="n">Part</span><span class="o">.</span><span class="n">makePolygon</span><span class="p">([</span><span class="n">v1</span><span class="p">,</span><span class="n">v2</span><span class="p">,</span><span class="n">v3</span><span class="p">,</span><span class="n">v1</span><span class="p">])</span>
     <span class="n">face</span> <span class="o">=</span> <span class="n">Part</span><span class="o">.</span><span class="n">Face</span><span class="p">(</span><span class="n">wire</span><span class="p">)</span>
     <span class="k">return</span> <span class="n">face</span>
</pre></div>
<p>&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; , &#1084;&#1099; &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1077;&#1084; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1084; View Provider, &#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084; &#1079;&#1072; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1074; 3D &#1089;&#1094;&#1077;&#1085;&#1077;:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="k">class</span> <span class="nc">ViewProviderOctahedron</span><span class="p">:</span>
  <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">obj</span><span class="p">):</span>
     <span class="s2">"Set this object to the proxy object of the actual view provider"</span>
     <span class="n">obj</span><span class="o">.</span><span class="n">addProperty</span><span class="p">(</span><span class="s2">"App::PropertyColor"</span><span class="p">,</span><span class="s2">"Color"</span><span class="p">,</span><span class="s2">"Octahedron"</span><span class="p">,</span><span class="s2">"Color of the octahedron"</span><span class="p">)</span><span class="o">.</span><span class="n">Color</span><span class="o">=</span><span class="p">(</span><span class="mf">1.0</span><span class="p">,</span><span class="mf">0.0</span><span class="p">,</span><span class="mf">0.0</span><span class="p">)</span>
     <span class="n">obj</span><span class="o">.</span><span class="n">Proxy</span> <span class="o">=</span> <span class="bp">self</span>

  <span class="k">def</span> <span class="nf">attach</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">obj</span><span class="p">):</span>
     <span class="s2">"Setup the scene sub-graph of the view provider, this method is mandatory"</span>
     <span class="bp">self</span><span class="o">.</span><span class="n">shaded</span> <span class="o">=</span> <span class="n">coin</span><span class="o">.</span><span class="n">SoGroup</span><span class="p">()</span>
     <span class="bp">self</span><span class="o">.</span><span class="n">wireframe</span> <span class="o">=</span> <span class="n">coin</span><span class="o">.</span><span class="n">SoGroup</span><span class="p">()</span>
     <span class="bp">self</span><span class="o">.</span><span class="n">scale</span> <span class="o">=</span> <span class="n">coin</span><span class="o">.</span><span class="n">SoScale</span><span class="p">()</span>
     <span class="bp">self</span><span class="o">.</span><span class="n">color</span> <span class="o">=</span> <span class="n">coin</span><span class="o">.</span><span class="n">SoBaseColor</span><span class="p">()</span>

     <span class="bp">self</span><span class="o">.</span><span class="n">data</span><span class="o">=</span><span class="n">coin</span><span class="o">.</span><span class="n">SoCoordinate3</span><span class="p">()</span>
     <span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="o">=</span><span class="n">coin</span><span class="o">.</span><span class="n">SoIndexedFaceSet</span><span class="p">()</span>

     <span class="bp">self</span><span class="o">.</span><span class="n">shaded</span><span class="o">.</span><span class="n">addChild</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">scale</span><span class="p">)</span>
     <span class="bp">self</span><span class="o">.</span><span class="n">shaded</span><span class="o">.</span><span class="n">addChild</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">color</span><span class="p">)</span>
     <span class="bp">self</span><span class="o">.</span><span class="n">shaded</span><span class="o">.</span><span class="n">addChild</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">data</span><span class="p">)</span>
     <span class="bp">self</span><span class="o">.</span><span class="n">shaded</span><span class="o">.</span><span class="n">addChild</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="p">)</span>
     <span class="n">obj</span><span class="o">.</span><span class="n">addDisplayMode</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">shaded</span><span class="p">,</span><span class="s2">"Shaded"</span><span class="p">);</span>
     <span class="n">style</span><span class="o">=</span><span class="n">coin</span><span class="o">.</span><span class="n">SoDrawStyle</span><span class="p">()</span>
     <span class="n">style</span><span class="o">.</span><span class="n">style</span> <span class="o">=</span> <span class="n">coin</span><span class="o">.</span><span class="n">SoDrawStyle</span><span class="o">.</span><span class="n">LINES</span>
     <span class="bp">self</span><span class="o">.</span><span class="n">wireframe</span><span class="o">.</span><span class="n">addChild</span><span class="p">(</span><span class="n">style</span><span class="p">)</span>
     <span class="bp">self</span><span class="o">.</span><span class="n">wireframe</span><span class="o">.</span><span class="n">addChild</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">scale</span><span class="p">)</span>
     <span class="bp">self</span><span class="o">.</span><span class="n">wireframe</span><span class="o">.</span><span class="n">addChild</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">color</span><span class="p">)</span>
     <span class="bp">self</span><span class="o">.</span><span class="n">wireframe</span><span class="o">.</span><span class="n">addChild</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">data</span><span class="p">)</span>
     <span class="bp">self</span><span class="o">.</span><span class="n">wireframe</span><span class="o">.</span><span class="n">addChild</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="p">)</span>
     <span class="n">obj</span><span class="o">.</span><span class="n">addDisplayMode</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">wireframe</span><span class="p">,</span><span class="s2">"Wireframe"</span><span class="p">);</span>
     <span class="bp">self</span><span class="o">.</span><span class="n">onChanged</span><span class="p">(</span><span class="n">obj</span><span class="p">,</span><span class="s2">"Color"</span><span class="p">)</span>

  <span class="k">def</span> <span class="nf">updateData</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">fp</span><span class="p">,</span> <span class="n">prop</span><span class="p">):</span>
     <span class="s2">"If a property of the handled feature has changed we have the chance to handle this here"</span>
     <span class="c1"># fp is the handled feature, prop is the name of the property that has changed</span>
     <span class="k">if</span> <span class="n">prop</span> <span class="o">==</span> <span class="s2">"Shape"</span><span class="p">:</span>
        <span class="n">s</span> <span class="o">=</span> <span class="n">fp</span><span class="o">.</span><span class="n">getPropertyByName</span><span class="p">(</span><span class="s2">"Shape"</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">data</span><span class="o">.</span><span class="n">point</span><span class="o">.</span><span class="n">setNum</span><span class="p">(</span><span class="mi">6</span><span class="p">)</span>
        <span class="n">cnt</span><span class="o">=</span><span class="mi">0</span>
        <span class="k">for</span> <span class="n">i</span> <span class="ow">in</span> <span class="n">s</span><span class="o">.</span><span class="n">Vertexes</span><span class="p">:</span>
           <span class="bp">self</span><span class="o">.</span><span class="n">data</span><span class="o">.</span><span class="n">point</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="n">cnt</span><span class="p">,</span><span class="n">i</span><span class="o">.</span><span class="n">X</span><span class="p">,</span><span class="n">i</span><span class="o">.</span><span class="n">Y</span><span class="p">,</span><span class="n">i</span><span class="o">.</span><span class="n">Z</span><span class="p">)</span>
           <span class="n">cnt</span><span class="o">=</span><span class="n">cnt</span><span class="o">+</span><span class="mi">1</span>

        <span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">0</span><span class="p">,</span><span class="mi">0</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">1</span><span class="p">,</span><span class="mi">1</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">2</span><span class="p">,</span><span class="mi">2</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">3</span><span class="p">,</span><span class="o">-</span><span class="mi">1</span><span class="p">)</span>

        <span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">4</span><span class="p">,</span><span class="mi">1</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">5</span><span class="p">,</span><span class="mi">3</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">6</span><span class="p">,</span><span class="mi">2</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">7</span><span class="p">,</span><span class="o">-</span><span class="mi">1</span><span class="p">)</span>

        <span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">8</span><span class="p">,</span><span class="mi">3</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">9</span><span class="p">,</span><span class="mi">4</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">10</span><span class="p">,</span><span class="mi">2</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">11</span><span class="p">,</span><span class="o">-</span><span class="mi">1</span><span class="p">)</span>

        <span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">12</span><span class="p">,</span><span class="mi">4</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">13</span><span class="p">,</span><span class="mi">0</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">14</span><span class="p">,</span><span class="mi">2</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">15</span><span class="p">,</span><span class="o">-</span><span class="mi">1</span><span class="p">)</span>

        <span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">16</span><span class="p">,</span><span class="mi">1</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">17</span><span class="p">,</span><span class="mi">0</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">18</span><span class="p">,</span><span class="mi">5</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">19</span><span class="p">,</span><span class="o">-</span><span class="mi">1</span><span class="p">)</span>

        <span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">20</span><span class="p">,</span><span class="mi">3</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">21</span><span class="p">,</span><span class="mi">1</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">22</span><span class="p">,</span><span class="mi">5</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">23</span><span class="p">,</span><span class="o">-</span><span class="mi">1</span><span class="p">)</span>

        <span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">24</span><span class="p">,</span><span class="mi">4</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">25</span><span class="p">,</span><span class="mi">3</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">26</span><span class="p">,</span><span class="mi">5</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">27</span><span class="p">,</span><span class="o">-</span><span class="mi">1</span><span class="p">)</span>

        <span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">28</span><span class="p">,</span><span class="mi">0</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">29</span><span class="p">,</span><span class="mi">4</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">30</span><span class="p">,</span><span class="mi">5</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">face</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">31</span><span class="p">,</span><span class="o">-</span><span class="mi">1</span><span class="p">)</span>

  <span class="k">def</span> <span class="nf">getDisplayModes</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span><span class="n">obj</span><span class="p">):</span>
     <span class="s2">"Return a list of display modes."</span>
     <span class="n">modes</span><span class="o">=</span><span class="p">[]</span>
     <span class="n">modes</span><span class="o">.</span><span class="n">append</span><span class="p">(</span><span class="s2">"Shaded"</span><span class="p">)</span>
     <span class="n">modes</span><span class="o">.</span><span class="n">append</span><span class="p">(</span><span class="s2">"Wireframe"</span><span class="p">)</span>
     <span class="k">return</span> <span class="n">modes</span>

  <span class="k">def</span> <span class="nf">getDefaultDisplayMode</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
     <span class="s2">"Return the name of the default display mode. It must be defined in getDisplayModes."</span>
     <span class="k">return</span> <span class="s2">"Shaded"</span>

  <span class="k">def</span> <span class="nf">setDisplayMode</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span><span class="n">mode</span><span class="p">):</span>
     <span class="k">return</span> <span class="n">mode</span>

  <span class="k">def</span> <span class="nf">onChanged</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">vp</span><span class="p">,</span> <span class="n">prop</span><span class="p">):</span>
     <span class="s2">"Here we can do something when a single property got changed"</span>
     <span class="n">FreeCAD</span><span class="o">.</span><span class="n">Console</span><span class="o">.</span><span class="n">PrintMessage</span><span class="p">(</span><span class="s2">"Change property: "</span> <span class="o">+</span> <span class="nb">str</span><span class="p">(</span><span class="n">prop</span><span class="p">)</span> <span class="o">+</span> <span class="s2">"</span><span class="se">\n</span><span class="s2">"</span><span class="p">)</span>
     <span class="k">if</span> <span class="n">prop</span> <span class="o">==</span> <span class="s2">"Color"</span><span class="p">:</span>
        <span class="n">c</span> <span class="o">=</span> <span class="n">vp</span><span class="o">.</span><span class="n">getPropertyByName</span><span class="p">(</span><span class="s2">"Color"</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">color</span><span class="o">.</span><span class="n">rgb</span><span class="o">.</span><span class="n">setValue</span><span class="p">(</span><span class="n">c</span><span class="p">[</span><span class="mi">0</span><span class="p">],</span><span class="n">c</span><span class="p">[</span><span class="mi">1</span><span class="p">],</span><span class="n">c</span><span class="p">[</span><span class="mi">2</span><span class="p">])</span>

  <span class="k">def</span> <span class="nf">getIcon</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
     <span class="k">return</span> <span class="s2">"""</span>
<span class="s2">        /* XPM */</span>
<span class="s2">        static const char * ViewProviderBox_xpm[] = {</span>
<span class="s2">        "16 16 6 1",</span>
<span class="s2">        "    c None",</span>
<span class="s2">        ".   c #141010",</span>
<span class="s2">        "+   c #615BD2",</span>
<span class="s2">        "@   c #C39D55",</span>
<span class="s2">        "#   c #000000",</span>
<span class="s2">        "$   c #57C355",</span>
<span class="s2">        "        ........",</span>
<span class="s2">        "   ......++..+..",</span>
<span class="s2">        "   .@@@@.++..++.",</span>
<span class="s2">        "   .@@@@.++..++.",</span>
<span class="s2">        "   .@@  .++++++.",</span>
<span class="s2">        "  ..@@  .++..++.",</span>
<span class="s2">        "###@@@@ .++..++.",</span>
<span class="s2">        "##$.@@$#.++++++.",</span>
<span class="s2">        "#$#$.$$$........",</span>
<span class="s2">        "#$$#######      ",</span>
<span class="s2">        "#$$#$$$$$#      ",</span>
<span class="s2">        "#$$#$$$$$#      ",</span>
<span class="s2">        "#$$#$$$$$#      ",</span>
<span class="s2">        " #$#$$$$$#      ",</span>
<span class="s2">        "  ##$$$$$#      ",</span>
<span class="s2">        "   #######      "};</span>
<span class="s2">        """</span>

  <span class="k">def</span> <span class="nf">dumps</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
     <span class="k">return</span> <span class="kc">None</span>

  <span class="k">def</span> <span class="nf">loads</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span><span class="n">state</span><span class="p">):</span>
     <span class="k">return</span> <span class="kc">None</span>
</pre></div>
<p>&#1053;&#1072;&#1082;&#1086;&#1085;&#1077;&#1094;, &#1082;&#1072;&#1082; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1072;&#1096; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1080; &#1077;&#1075;&#1086; viewobject &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1099;, &#1085;&#1072;&#1084; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1085;&#1091;&#1078;&#1085;&#1086; &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1080;&#1093; (&#1082;&#1086;&#1076; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; Octahedron &#1080; viewprovider &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1089;&#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085; &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1074; Python &#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1100; FreeCAD):
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">FreeCAD</span><span class="o">.</span><span class="n">newDocument</span><span class="p">()</span>
<span class="n">a</span><span class="o">=</span><span class="n">FreeCAD</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">addObject</span><span class="p">(</span><span class="s2">"App::FeaturePython"</span><span class="p">,</span><span class="s2">"Octahedron"</span><span class="p">)</span>
<span class="n">Octahedron</span><span class="p">(</span><span class="n">a</span><span class="p">)</span>
<span class="n">ViewProviderOctahedron</span><span class="p">(</span><span class="n">a</span><span class="o">.</span><span class="n">ViewObject</span><span class="p">)</span>
</pre></div>
<p><span id="Making_objects_selectable"></span>
</p>
<h2><span id=".D0.A1.D0.BE.D0.B7.D0.B4.D0.B0.D0.BD.D0.B8.D0.B5_.D0.B2.D1.8B.D0.B4.D0.B5.D0.BB.D1.8F.D0.B5.D0.BC.D1.8B.D1.85_.D0.BE.D0.B1.D1.8A.D0.B5.D0.BA.D1.82.D0.BE.D0.B2"></span><span class="mw-headline" id="&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077;_&#1074;&#1099;&#1076;&#1077;&#1083;&#1103;&#1077;&#1084;&#1099;&#1093;_&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;">&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1074;&#1099;&#1076;&#1077;&#1083;&#1103;&#1077;&#1084;&#1099;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;</span></h2>
<p>&#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1072;&#1096; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1084;&#1086;&#1078;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086; &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100;, &#1080;&#1083;&#1080; &#1087;&#1086; &#1082;&#1088;&#1072;&#1081;&#1085;&#1077;&#1081; &#1084;&#1077;&#1088;&#1077; &#1077;&#1075;&#1086; &#1095;&#1072;&#1089;&#1090;&#1100;, &#1097;&#1077;&#1083;&#1082;&#1085;&#1091;&#1074; &#1087;&#1086; &#1085;&#1077;&#1084;&#1091; &#1074; &#1086;&#1082;&#1085;&#1077;, &#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086; Coin &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1102; &#1074;&#1085;&#1091;&#1090;&#1088;&#1100; &#1091;&#1079;&#1083;&#1072; SoFCSelection. &#1045;&#1089;&#1083;&#1080; &#1074;&#1072;&#1096; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1077;&#1090; &#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1084; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084;, &#1089; &#1074;&#1080;&#1076;&#1078;&#1077;&#1090;&#1072;&#1084;&#1080;, &#1072;&#1085;&#1085;&#1086;&#1090;&#1072;&#1094;&#1080;&#1103;&#1084;&#1080;, &#1080; &#1090;.&#1076;, &#1074;&#1072;&#1084; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1095;&#1072;&#1089;&#1090;&#1100; &#1077;&#1075;&#1086; &#1074; SoFCSelection. &#1042;&#1089;&#1105;, &#1095;&#1090;&#1086; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; SoFCSelection &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1086; &#1089;&#1082;&#1072;&#1085;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; FreeCAD &#1076;&#1083;&#1103; &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1103; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103;/&#1087;&#1088;&#1077;&#1076;&#1074;&#1072;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1086;&#1090;&#1073;&#1086;&#1088;&#1072;, &#1090;&#1072;&#1082; &#1095;&#1090;&#1086; &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1084;&#1099;&#1089;&#1083; &#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1086;&#1074;&#1072;&#1090;&#1100; &#1085;&#1077; &#1087;&#1077;&#1088;&#1077;&#1075;&#1088;&#1091;&#1078;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1085;&#1077;&#1085;&#1091;&#1078;&#1085;&#1099;&#1084; &#1089;&#1082;&#1072;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084;.
</p><p>&#1050;&#1072;&#1082; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1095;&#1072;&#1089;&#1090;&#1080; scenegraph, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1099;, &#1086;&#1082;&#1072;&#1078;&#1091;&#1090;&#1089;&#1103; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1091;&#1079;&#1083;&#1086;&#1074; SoFCSelection, &#1074;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1076;&#1074;&#1072; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; &#1076;&#1083;&#1103; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1087;&#1091;&#1090;&#1080; &#1074;&#1099;&#1073;&#1086;&#1088;&#1072;. &#1055;&#1091;&#1090;&#1100; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; &#1092;&#1086;&#1088;&#1084;&#1091; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1077;&#1081; &#1080;&#1084;&#1077;&#1085;&#1072; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1074; &#1087;&#1091;&#1090;&#1080;, &#1080;&#1083;&#1080; &#1084;&#1072;&#1089;&#1089;&#1080;&#1074;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; scenegraph. &#1057;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1076;&#1074;&#1072; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;: <code>getDetailPath</code>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1091;&#1077;&#1090; &#1087;&#1091;&#1090;&#1100; &#1080;&#1079; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1074; &#1084;&#1072;&#1089;&#1089;&#1080;&#1074; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; scenegraph, &#1080; <code>getElementPicked</code>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1073;&#1077;&#1088;&#1105;&#1090; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1073;&#1099;&#1083; &#1089;&#1076;&#1077;&#1083;&#1072;&#1085; &#1097;&#1077;&#1083;&#1095;&#1086;&#1082; &#1074; scenegraph, &#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1077;&#1075;&#1086; &#1089;&#1090;&#1088;&#1086;&#1082;&#1086;&#1074;&#1086;&#1077; &#1080;&#1084;&#1103; (&#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1085;&#1077; &#1077;&#1075;&#1086; &#1089;&#1090;&#1088;&#1086;&#1082;&#1086;&#1074;&#1099;&#1081; &#1087;&#1091;&#1090;&#1100;).
</p><p>&#1042;&#1086;&#1090; &#1074;&#1099;&#1096;&#1077;&#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1105;&#1085;&#1085;&#1099;&#1081; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1089; &#1052;&#1086;&#1083;&#1077;&#1082;&#1091;&#1083;&#1086;&#1081;, &#1072;&#1076;&#1072;&#1087;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1076;&#1083;&#1103; &#1074;&#1099;&#1073;&#1086;&#1088;&#1072; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1052;&#1086;&#1083;&#1077;&#1082;&#1091;&#1083;&#1099;:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="k">class</span> <span class="nc">Molecule</span><span class="p">:</span>
    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">obj</span><span class="p">):</span>
<span class="w">        </span><span class="sd">''' Add two point properties '''</span>
        <span class="n">obj</span><span class="o">.</span><span class="n">addProperty</span><span class="p">(</span><span class="s2">"App::PropertyVector"</span><span class="p">,</span><span class="s2">"p1"</span><span class="p">,</span><span class="s2">"Line"</span><span class="p">,</span><span class="s2">"Start point"</span><span class="p">)</span>
        <span class="n">obj</span><span class="o">.</span><span class="n">addProperty</span><span class="p">(</span><span class="s2">"App::PropertyVector"</span><span class="p">,</span><span class="s2">"p2"</span><span class="p">,</span><span class="s2">"Line"</span><span class="p">,</span><span class="s2">"End point"</span><span class="p">)</span><span class="o">.</span><span class="n">p2</span><span class="o">=</span><span class="n">FreeCAD</span><span class="o">.</span><span class="n">Vector</span><span class="p">(</span><span class="mi">5</span><span class="p">,</span><span class="mi">0</span><span class="p">,</span><span class="mi">0</span><span class="p">)</span>

        <span class="n">obj</span><span class="o">.</span><span class="n">Proxy</span> <span class="o">=</span> <span class="bp">self</span>

    <span class="k">def</span> <span class="nf">onChanged</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">fp</span><span class="p">,</span> <span class="n">prop</span><span class="p">):</span>
        <span class="k">if</span> <span class="n">prop</span> <span class="o">==</span> <span class="s2">"p1"</span> <span class="ow">or</span> <span class="n">prop</span> <span class="o">==</span> <span class="s2">"p2"</span><span class="p">:</span>
<span class="w">            </span><span class="sd">''' Print the name of the property that has changed '''</span>
            <span class="n">fp</span><span class="o">.</span><span class="n">Shape</span> <span class="o">=</span> <span class="n">Part</span><span class="o">.</span><span class="n">makeLine</span><span class="p">(</span><span class="n">fp</span><span class="o">.</span><span class="n">p1</span><span class="p">,</span><span class="n">fp</span><span class="o">.</span><span class="n">p2</span><span class="p">)</span>

    <span class="k">def</span> <span class="nf">execute</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">fp</span><span class="p">):</span>
<span class="w">        </span><span class="sd">''' Print a short message when doing a recomputation, this method is mandatory '''</span>
        <span class="n">fp</span><span class="o">.</span><span class="n">Shape</span> <span class="o">=</span> <span class="n">Part</span><span class="o">.</span><span class="n">makeLine</span><span class="p">(</span><span class="n">fp</span><span class="o">.</span><span class="n">p1</span><span class="p">,</span><span class="n">fp</span><span class="o">.</span><span class="n">p2</span><span class="p">)</span>

<span class="k">class</span> <span class="nc">ViewProviderMolecule</span><span class="p">:</span>
    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">obj</span><span class="p">):</span>
<span class="w">        </span><span class="sd">''' Set this object to the proxy object of the actual view provider '''</span>
        <span class="n">obj</span><span class="o">.</span><span class="n">Proxy</span> <span class="o">=</span> <span class="bp">self</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">ViewObject</span> <span class="o">=</span> <span class="n">obj</span>
        <span class="n">sep1</span><span class="o">=</span><span class="n">coin</span><span class="o">.</span><span class="n">SoSeparator</span><span class="p">()</span>
        <span class="n">sel1</span> <span class="o">=</span> <span class="n">coin</span><span class="o">.</span><span class="n">SoType</span><span class="o">.</span><span class="n">fromName</span><span class="p">(</span><span class="s1">'SoFCSelection'</span><span class="p">)</span><span class="o">.</span><span class="n">createInstance</span><span class="p">()</span>
        <span class="c1"># sel1.policy.setValue(coin.SoSelection.SHIFT)</span>
        <span class="n">sel1</span><span class="o">.</span><span class="n">ref</span><span class="p">()</span>
        <span class="n">sep1</span><span class="o">.</span><span class="n">addChild</span><span class="p">(</span><span class="n">sel1</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">trl1</span><span class="o">=</span><span class="n">coin</span><span class="o">.</span><span class="n">SoTranslation</span><span class="p">()</span>
        <span class="n">sel1</span><span class="o">.</span><span class="n">addChild</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">trl1</span><span class="p">)</span>
        <span class="n">sel1</span><span class="o">.</span><span class="n">addChild</span><span class="p">(</span><span class="n">coin</span><span class="o">.</span><span class="n">SoSphere</span><span class="p">())</span>
        <span class="n">sep2</span><span class="o">=</span><span class="n">coin</span><span class="o">.</span><span class="n">SoSeparator</span><span class="p">()</span>
        <span class="n">sel2</span> <span class="o">=</span> <span class="n">coin</span><span class="o">.</span><span class="n">SoType</span><span class="o">.</span><span class="n">fromName</span><span class="p">(</span><span class="s1">'SoFCSelection'</span><span class="p">)</span><span class="o">.</span><span class="n">createInstance</span><span class="p">()</span>
        <span class="n">sel2</span><span class="o">.</span><span class="n">ref</span><span class="p">()</span>
        <span class="n">sep2</span><span class="o">.</span><span class="n">addChild</span><span class="p">(</span><span class="n">sel2</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">trl2</span><span class="o">=</span><span class="n">coin</span><span class="o">.</span><span class="n">SoTranslation</span><span class="p">()</span>
        <span class="n">sel2</span><span class="o">.</span><span class="n">addChild</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">trl2</span><span class="p">)</span>
        <span class="n">sel2</span><span class="o">.</span><span class="n">addChild</span><span class="p">(</span><span class="n">coin</span><span class="o">.</span><span class="n">SoSphere</span><span class="p">())</span>
        <span class="n">obj</span><span class="o">.</span><span class="n">RootNode</span><span class="o">.</span><span class="n">addChild</span><span class="p">(</span><span class="n">sep1</span><span class="p">)</span>
        <span class="n">obj</span><span class="o">.</span><span class="n">RootNode</span><span class="o">.</span><span class="n">addChild</span><span class="p">(</span><span class="n">sep2</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">updateData</span><span class="p">(</span><span class="n">obj</span><span class="o">.</span><span class="n">Object</span><span class="p">,</span> <span class="s1">'p2'</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">sel1</span> <span class="o">=</span> <span class="n">sel1</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">sel2</span> <span class="o">=</span> <span class="n">sel2</span>

    <span class="k">def</span> <span class="nf">getDetailPath</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">subname</span><span class="p">,</span> <span class="n">path</span><span class="p">,</span> <span class="n">append</span><span class="p">):</span>
        <span class="n">vobj</span> <span class="o">=</span> <span class="bp">self</span><span class="o">.</span><span class="n">ViewObject</span>
        <span class="k">if</span> <span class="n">append</span><span class="p">:</span>
            <span class="n">path</span><span class="o">.</span><span class="n">append</span><span class="p">(</span><span class="n">vobj</span><span class="o">.</span><span class="n">RootNode</span><span class="p">)</span>
            <span class="n">path</span><span class="o">.</span><span class="n">append</span><span class="p">(</span><span class="n">vobj</span><span class="o">.</span><span class="n">SwitchNode</span><span class="p">)</span>

            <span class="n">mode</span> <span class="o">=</span> <span class="n">vobj</span><span class="o">.</span><span class="n">SwitchNode</span><span class="o">.</span><span class="n">whichChild</span><span class="o">.</span><span class="n">getValue</span><span class="p">()</span>
            <span class="k">if</span> <span class="n">mode</span> <span class="o">&gt;=</span> <span class="mi">0</span><span class="p">:</span>
                <span class="n">mode</span> <span class="o">=</span> <span class="n">vobj</span><span class="o">.</span><span class="n">SwitchNode</span><span class="o">.</span><span class="n">getChild</span><span class="p">(</span><span class="n">mode</span><span class="p">)</span>
                <span class="n">path</span><span class="o">.</span><span class="n">append</span><span class="p">(</span><span class="n">mode</span><span class="p">)</span>
                <span class="n">sub</span> <span class="o">=</span> <span class="n">Part</span><span class="o">.</span><span class="n">splitSubname</span><span class="p">(</span><span class="n">subname</span><span class="p">)[</span><span class="o">-</span><span class="mi">1</span><span class="p">]</span>
                <span class="k">if</span> <span class="n">sub</span> <span class="o">==</span> <span class="s1">'Atom1'</span><span class="p">:</span>
                    <span class="n">path</span><span class="o">.</span><span class="n">append</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">sel1</span><span class="p">)</span>
                <span class="k">elif</span> <span class="n">sub</span> <span class="o">==</span> <span class="s1">'Atom2'</span><span class="p">:</span>
                    <span class="n">path</span><span class="o">.</span><span class="n">append</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">sel2</span><span class="p">)</span>
                <span class="k">else</span><span class="p">:</span>
                    <span class="n">path</span><span class="o">.</span><span class="n">append</span><span class="p">(</span><span class="n">mode</span><span class="o">.</span><span class="n">getChild</span><span class="p">(</span><span class="mi">0</span><span class="p">))</span>
        <span class="k">return</span> <span class="kc">True</span>

    <span class="k">def</span> <span class="nf">getElementPicked</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">pp</span><span class="p">):</span>
        <span class="n">path</span> <span class="o">=</span> <span class="n">pp</span><span class="o">.</span><span class="n">getPath</span><span class="p">()</span>
        <span class="k">if</span> <span class="n">path</span><span class="o">.</span><span class="n">findNode</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">sel1</span><span class="p">)</span> <span class="o">&gt;=</span> <span class="mi">0</span><span class="p">:</span>
            <span class="k">return</span> <span class="s1">'Atom1'</span>
        <span class="k">if</span> <span class="n">path</span><span class="o">.</span><span class="n">findNode</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">sel2</span><span class="p">)</span> <span class="o">&gt;=</span> <span class="mi">0</span><span class="p">:</span>
            <span class="k">return</span> <span class="s1">'Atom2'</span>
        <span class="k">raise</span> <span class="ne">NotImplementedError</span>

    <span class="k">def</span> <span class="nf">updateData</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">fp</span><span class="p">,</span> <span class="n">prop</span><span class="p">):</span>
        <span class="s2">"If a property of the handled feature has changed we have the chance to handle this here"</span>
        <span class="c1"># fp is the handled feature, prop is the name of the property that has changed</span>
        <span class="k">if</span> <span class="n">prop</span> <span class="o">==</span> <span class="s2">"p1"</span><span class="p">:</span>
            <span class="n">p</span> <span class="o">=</span> <span class="n">fp</span><span class="o">.</span><span class="n">getPropertyByName</span><span class="p">(</span><span class="s2">"p1"</span><span class="p">)</span>
            <span class="bp">self</span><span class="o">.</span><span class="n">trl1</span><span class="o">.</span><span class="n">translation</span><span class="o">=</span><span class="p">(</span><span class="n">p</span><span class="o">.</span><span class="n">x</span><span class="p">,</span><span class="n">p</span><span class="o">.</span><span class="n">y</span><span class="p">,</span><span class="n">p</span><span class="o">.</span><span class="n">z</span><span class="p">)</span>
        <span class="k">elif</span> <span class="n">prop</span> <span class="o">==</span> <span class="s2">"p2"</span><span class="p">:</span>
            <span class="n">p</span> <span class="o">=</span> <span class="n">fp</span><span class="o">.</span><span class="n">getPropertyByName</span><span class="p">(</span><span class="s2">"p2"</span><span class="p">)</span>
            <span class="bp">self</span><span class="o">.</span><span class="n">trl2</span><span class="o">.</span><span class="n">translation</span><span class="o">=</span><span class="p">(</span><span class="n">p</span><span class="o">.</span><span class="n">x</span><span class="p">,</span><span class="n">p</span><span class="o">.</span><span class="n">y</span><span class="p">,</span><span class="n">p</span><span class="o">.</span><span class="n">z</span><span class="p">)</span>

    <span class="k">def</span> <span class="nf">dumps</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
        <span class="k">return</span> <span class="kc">None</span>

    <span class="k">def</span> <span class="nf">loads</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span><span class="n">state</span><span class="p">):</span>
        <span class="k">return</span> <span class="kc">None</span>

<span class="k">def</span> <span class="nf">makeMolecule</span><span class="p">():</span>
    <span class="n">FreeCAD</span><span class="o">.</span><span class="n">newDocument</span><span class="p">()</span>
    <span class="n">a</span><span class="o">=</span><span class="n">FreeCAD</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">addObject</span><span class="p">(</span><span class="s2">"Part::FeaturePython"</span><span class="p">,</span><span class="s2">"Molecule"</span><span class="p">)</span>
    <span class="n">Molecule</span><span class="p">(</span><span class="n">a</span><span class="p">)</span>
    <span class="n">ViewProviderMolecule</span><span class="p">(</span><span class="n">a</span><span class="o">.</span><span class="n">ViewObject</span><span class="p">)</span>
    <span class="n">FreeCAD</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">recompute</span><span class="p">()</span>
</pre></div>
<p><span id="Working_with_simple_shapes"></span>
</p>
<h2><span id=".D0.A0.D0.B0.D0.B1.D0.BE.D1.82.D0.B0_.D1.81_.D0.BF.D1.80.D0.BE.D1.81.D1.82.D1.8B.D0.BC.D0.B8_.D1.84.D0.BE.D1.80.D0.BC.D0.B0.D0.BC.D0.B8"></span><span class="mw-headline" id="&#1056;&#1072;&#1073;&#1086;&#1090;&#1072;_&#1089;_&#1087;&#1088;&#1086;&#1089;&#1090;&#1099;&#1084;&#1080;_&#1092;&#1086;&#1088;&#1084;&#1072;&#1084;&#1080;">&#1056;&#1072;&#1073;&#1086;&#1090;&#1072; &#1089; &#1087;&#1088;&#1086;&#1089;&#1090;&#1099;&#1084;&#1080; &#1092;&#1086;&#1088;&#1084;&#1072;&#1084;&#1080;</span></h2>
<p>&#1045;&#1089;&#1083;&#1080; &#1074;&#1072;&#1096; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; - &#1101;&#1090;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1092;&#1086;&#1088;&#1084;&#1072;, &#1090;&#1086; &#1074;&#1072;&#1084; &#1085;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; view provider &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;. &#1060;&#1086;&#1088;&#1084;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1084;&#1080; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1072;&#1084;&#1080; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1092;&#1086;&#1088;&#1084; FreeCAD:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="kn">import</span> <span class="nn">FreeCAD</span> <span class="k">as</span> <span class="nn">App</span>
<span class="kn">import</span> <span class="nn">FreeCADGui</span>
<span class="kn">import</span> <span class="nn">FreeCAD</span>
<span class="kn">import</span> <span class="nn">Part</span>
<span class="k">class</span> <span class="nc">Line</span><span class="p">:</span>
    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">obj</span><span class="p">):</span>
<span class="w">        </span><span class="sd">'''"App two point properties" '''</span>
        <span class="n">obj</span><span class="o">.</span><span class="n">addProperty</span><span class="p">(</span><span class="s2">"App::PropertyVector"</span><span class="p">,</span><span class="s2">"p1"</span><span class="p">,</span><span class="s2">"Line"</span><span class="p">,</span><span class="s2">"Start point"</span><span class="p">)</span>
        <span class="n">obj</span><span class="o">.</span><span class="n">addProperty</span><span class="p">(</span><span class="s2">"App::PropertyVector"</span><span class="p">,</span><span class="s2">"p2"</span><span class="p">,</span><span class="s2">"Line"</span><span class="p">,</span><span class="s2">"End point"</span><span class="p">)</span><span class="o">.</span><span class="n">p2</span><span class="o">=</span><span class="n">FreeCAD</span><span class="o">.</span><span class="n">Vector</span><span class="p">(</span><span class="mi">1</span><span class="p">,</span><span class="mi">0</span><span class="p">,</span><span class="mi">0</span><span class="p">)</span>
        <span class="n">obj</span><span class="o">.</span><span class="n">Proxy</span> <span class="o">=</span> <span class="bp">self</span>

    <span class="k">def</span> <span class="nf">execute</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">fp</span><span class="p">):</span>
<span class="w">        </span><span class="sd">'''"Print a short message when doing a recomputation, this method is mandatory" '''</span>
        <span class="n">fp</span><span class="o">.</span><span class="n">Shape</span> <span class="o">=</span> <span class="n">Part</span><span class="o">.</span><span class="n">makeLine</span><span class="p">(</span><span class="n">fp</span><span class="o">.</span><span class="n">p1</span><span class="p">,</span><span class="n">fp</span><span class="o">.</span><span class="n">p2</span><span class="p">)</span>

<span class="n">a</span><span class="o">=</span><span class="n">FreeCAD</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">addObject</span><span class="p">(</span><span class="s2">"Part::FeaturePython"</span><span class="p">,</span><span class="s2">"Line"</span><span class="p">)</span>
<span class="n">Line</span><span class="p">(</span><span class="n">a</span><span class="p">)</span>
<span class="n">a</span><span class="o">.</span><span class="n">ViewObject</span><span class="o">.</span><span class="n">Proxy</span><span class="o">=</span><span class="mi">0</span> <span class="c1"># just set it to something different from None (this assignment is needed to run an internal notification)</span>
<span class="n">FreeCAD</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">recompute</span><span class="p">()</span>
</pre></div>
<p>&#1058;&#1086;&#1090; &#1078;&#1077; &#1082;&#1086;&#1076; &#1089; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084; <b>ViewProviderLine</b>
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="kn">import</span> <span class="nn">FreeCAD</span> <span class="k">as</span> <span class="nn">App</span>
<span class="kn">import</span> <span class="nn">FreeCADGui</span>
<span class="kn">import</span> <span class="nn">FreeCAD</span>
<span class="kn">import</span> <span class="nn">Part</span>

<span class="k">class</span> <span class="nc">Line</span><span class="p">:</span>
    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">obj</span><span class="p">):</span>
<span class="w">         </span><span class="sd">'''"App two point properties" '''</span>
         <span class="n">obj</span><span class="o">.</span><span class="n">addProperty</span><span class="p">(</span><span class="s2">"App::PropertyVector"</span><span class="p">,</span><span class="s2">"p1"</span><span class="p">,</span><span class="s2">"Line"</span><span class="p">,</span><span class="s2">"Start point"</span><span class="p">)</span>
         <span class="n">obj</span><span class="o">.</span><span class="n">addProperty</span><span class="p">(</span><span class="s2">"App::PropertyVector"</span><span class="p">,</span><span class="s2">"p2"</span><span class="p">,</span><span class="s2">"Line"</span><span class="p">,</span><span class="s2">"End point"</span><span class="p">)</span><span class="o">.</span><span class="n">p2</span><span class="o">=</span><span class="n">FreeCAD</span><span class="o">.</span><span class="n">Vector</span><span class="p">(</span><span class="mi">100</span><span class="p">,</span><span class="mi">0</span><span class="p">,</span><span class="mi">0</span><span class="p">)</span>
         <span class="n">obj</span><span class="o">.</span><span class="n">Proxy</span> <span class="o">=</span> <span class="bp">self</span>

    <span class="k">def</span> <span class="nf">execute</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">fp</span><span class="p">):</span>
<span class="w">        </span><span class="sd">'''"Print a short message when doing a recomputation, this method is mandatory" '''</span>
        <span class="n">fp</span><span class="o">.</span><span class="n">Shape</span> <span class="o">=</span> <span class="n">Part</span><span class="o">.</span><span class="n">makeLine</span><span class="p">(</span><span class="n">fp</span><span class="o">.</span><span class="n">p1</span><span class="p">,</span><span class="n">fp</span><span class="o">.</span><span class="n">p2</span><span class="p">)</span>

<span class="k">class</span> <span class="nc">ViewProviderLine</span><span class="p">:</span>
   <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">obj</span><span class="p">):</span>
<span class="w">      </span><span class="sd">''' Set this object to the proxy object of the actual view provider '''</span>
      <span class="n">obj</span><span class="o">.</span><span class="n">Proxy</span> <span class="o">=</span> <span class="bp">self</span>

   <span class="k">def</span> <span class="nf">getDefaultDisplayMode</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
<span class="w">      </span><span class="sd">''' Return the name of the default display mode. It must be defined in getDisplayModes. '''</span>
      <span class="k">return</span> <span class="s2">"Flat Lines"</span>

<span class="n">a</span><span class="o">=</span><span class="n">FreeCAD</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">addObject</span><span class="p">(</span><span class="s2">"Part::FeaturePython"</span><span class="p">,</span><span class="s2">"Line"</span><span class="p">)</span>
<span class="n">Line</span><span class="p">(</span><span class="n">a</span><span class="p">)</span>
<span class="n">ViewProviderLine</span><span class="p">(</span><span class="n">a</span><span class="o">.</span><span class="n">ViewObject</span><span class="p">)</span>
<span class="n">App</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">recompute</span><span class="p">()</span>
</pre></div>
<p><span id="Scenegraph_Structure"></span>
</p>
<h2><span id=".D0.A1.D1.82.D1.80.D1.83.D0.BA.D1.82.D1.83.D1.80.D0.B0_Scenegraph_.28.D0.B3.D1.80.D0.B0.D1.84.D0.B0_.D1.81.D1.86.D0.B5.D0.BD.D1.8B.29"></span><span class="mw-headline" id="&#1057;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072;_Scenegraph_(&#1075;&#1088;&#1072;&#1092;&#1072;_&#1089;&#1094;&#1077;&#1085;&#1099;)">&#1057;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; Scenegraph (&#1075;&#1088;&#1072;&#1092;&#1072; &#1089;&#1094;&#1077;&#1085;&#1099;)</span></h2>
<p>&#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1074;&#1099; &#1079;&#1072;&#1084;&#1077;&#1090;&#1080;&#1083;&#1080;, &#1095;&#1090;&#1086; &#1074; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1099;&#1093; &#1074;&#1099;&#1096;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072;&#1093; scenegraphs &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1099; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086;-&#1088;&#1072;&#1079;&#1085;&#1086;&#1084;&#1091;. &#1053;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090; <code>obj.addDisplayMode(node, "modename")</code>, &#1074; &#1090;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1082;&#1072;&#1082; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090; <code>obj.SwitchNode.getChild(x).addChild(y)</code>.
</p><p>&#1050;&#1072;&#1078;&#1076;&#1099;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; feature &#1074; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1077; FreeCAD &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085; &#1085;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1081; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1077; scenegraph:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">RootNode</span>
 \<span class="o">-</span> <span class="n">SwitchNode</span>
     \<span class="o">-</span> <span class="n">Shaded</span>
      <span class="o">-</span> <span class="n">Wireframe</span>
      <span class="o">-</span> <span class="n">etc</span>
</pre></div>
<p>&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <code>SwitchNode</code> &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1089;&#1074;&#1086;&#1080;&#1093; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1093; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082;&#1086;&#1081; &#1088;&#1077;&#1078;&#1080;&#1084; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; (display mode) &#1074;&#1099;&#1073;&#1088;&#1072;&#1085; &#1074; FreeCAD.
</p><p>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090; <code>addDisplayMode</code>, &#1089;&#1090;&#1088;&#1086;&#1103;&#1090; &#1089;&#1074;&#1086;&#1080; scenegraphs &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1080;&#1079; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; coin3d scenegraph. &#1042;  &#1089;&#1091;&#1097;&#1085;&#1086;&#1089;&#1090;&#1080;, <code>addDisplayMode</code> &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1085;&#1086;&#1074;&#1099;&#1081; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1081; &#1091;&#1079;&#1077;&#1083; &#1082; <code>SwitchNode</code>; &#1080;&#1084;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1091;&#1079;&#1083;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1088;&#1077;&#1078;&#1080;&#1084;&#1091; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1086;&#1085; &#1073;&#1099;&#1083; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;.
</p><p>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; <code>SwitchNode.getChild(x).addChild</code>, &#1090;&#1072;&#1082;&#1078;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1102;&#1090; &#1095;&#1072;&#1089;&#1090;&#1100; &#1089;&#1074;&#1086;&#1077;&#1081; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1080;&#1079; &#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; Part (&#1044;&#1077;&#1090;&#1072;&#1083;&#1100;), &#1090;&#1072;&#1082;&#1080;&#1077; &#1082;&#1072;&#1082; <code>fp.Shape = Part.makeLine(fp.p1,fp.p2)</code>. &#1069;&#1090;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1105;&#1090; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; scenegraphs &#1074; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1074; <code>SwitchNode</code>; &#1082;&#1086;&#1075;&#1076;&#1072; &#1084;&#1099; &#1087;&#1086;&#1079;&#1078;&#1077; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1084; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; coin3d &#1074; scenegraph, &#1085;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1080;&#1093; &#1082; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1084; scenegraphs &#1074; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <code>addChild</code>, &#1072; &#1085;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1081; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1074; <code>SwitchNode</code>.
</p><p>&#1055;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; <code>addDisplayMode()</code> &#1076;&#1083;&#1103; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080; &#1074; scenegraph &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1088;&#1077;&#1078;&#1080;&#1084; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; (display mode) &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1080;&#1084;&#1077;&#1090;&#1100; &#1089;&#1074;&#1086;&#1081; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1091;&#1079;&#1077;&#1083;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1105;&#1090;&#1089;&#1103; &#1074; <code>addDisplayMode()</code>; &#1085;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1076;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1085;&#1086; &#1086;&#1076;&#1080;&#1085; &#1080; &#1090;&#1086;&#1090; &#1078;&#1077; &#1091;&#1079;&#1077;&#1083;. &#1069;&#1090;&#1086; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1105;&#1090; &#1082; &#1087;&#1091;&#1090;&#1072;&#1085;&#1080;&#1094;&#1077; &#1074; &#1084;&#1077;&#1093;&#1072;&#1085;&#1080;&#1079;&#1084;&#1077; &#1074;&#1099;&#1073;&#1086;&#1088;&#1072;. &#1053;&#1080;&#1095;&#1077;&#1075;&#1086; &#1089;&#1090;&#1088;&#1072;&#1096;&#1085;&#1086;&#1075;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1087;&#1086;&#1076; &#1082;&#1072;&#1078;&#1076;&#1099;&#1084; &#1091;&#1079;&#1083;&#1086;&#1084; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; (display mode) &#1073;&#1091;&#1076;&#1091;&#1090; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1099; &#1086;&#1076;&#1080;&#1085;&#1072;&#1082;&#1086;&#1074;&#1099;&#1077; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1091;&#1079;&#1083;&#1099;, &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1082;&#1086;&#1088;&#1077;&#1085;&#1100; - root &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1088;&#1072;&#1079;&#1085;&#1099;&#1084;.
</p><p>&#1042;&#1086;&#1090; &#1087;&#1088;&#1080;&#1074;&#1105;&#1076;&#1077;&#1085;&#1085;&#1099;&#1081; &#1074;&#1099;&#1096;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; molecule, &#1085;&#1086; &#1091;&#1078;&#1077; &#1072;&#1076;&#1072;&#1087;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1076;&#1083;&#1103; &#1086;&#1090;&#1088;&#1080;&#1089;&#1086;&#1074;&#1082;&#1080; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; Coin3D scenegraph &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1080;&#1079; &#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; &#1044;&#1077;&#1090;&#1072;&#1083;&#1100; (Part):
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="kn">import</span> <span class="nn">Part</span>
<span class="kn">from</span> <span class="nn">pivy</span> <span class="kn">import</span> <span class="n">coin</span>

<span class="k">class</span> <span class="nc">Molecule</span><span class="p">:</span>
    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">obj</span><span class="p">):</span>
<span class="w">        </span><span class="sd">''' Add two point properties '''</span>
        <span class="n">obj</span><span class="o">.</span><span class="n">addProperty</span><span class="p">(</span><span class="s2">"App::PropertyVector"</span><span class="p">,</span><span class="s2">"p1"</span><span class="p">,</span><span class="s2">"Line"</span><span class="p">,</span><span class="s2">"Start point"</span><span class="p">)</span>
        <span class="n">obj</span><span class="o">.</span><span class="n">addProperty</span><span class="p">(</span><span class="s2">"App::PropertyVector"</span><span class="p">,</span><span class="s2">"p2"</span><span class="p">,</span><span class="s2">"Line"</span><span class="p">,</span><span class="s2">"End point"</span><span class="p">)</span><span class="o">.</span><span class="n">p2</span><span class="o">=</span><span class="n">FreeCAD</span><span class="o">.</span><span class="n">Vector</span><span class="p">(</span><span class="mi">5</span><span class="p">,</span><span class="mi">0</span><span class="p">,</span><span class="mi">0</span><span class="p">)</span>

        <span class="n">obj</span><span class="o">.</span><span class="n">Proxy</span> <span class="o">=</span> <span class="bp">self</span>

    <span class="k">def</span> <span class="nf">onChanged</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">fp</span><span class="p">,</span> <span class="n">prop</span><span class="p">):</span>
        <span class="k">pass</span>

    <span class="k">def</span> <span class="nf">execute</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">fp</span><span class="p">):</span>
<span class="w">        </span><span class="sd">''' Print a short message when doing a recomputation, this method is mandatory '''</span>
        <span class="k">pass</span>

<span class="k">class</span> <span class="nc">ViewProviderMolecule</span><span class="p">:</span>
    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">obj</span><span class="p">):</span>
<span class="w">        </span><span class="sd">''' Set this object to the proxy object of the actual view provider '''</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">constructed</span> <span class="o">=</span> <span class="kc">False</span>
        <span class="n">obj</span><span class="o">.</span><span class="n">Proxy</span> <span class="o">=</span> <span class="bp">self</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">ViewObject</span> <span class="o">=</span> <span class="n">obj</span>

    <span class="k">def</span> <span class="nf">attach</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">obj</span><span class="p">):</span>
        <span class="n">material</span> <span class="o">=</span> <span class="n">coin</span><span class="o">.</span><span class="n">SoMaterial</span><span class="p">()</span>
        <span class="n">material</span><span class="o">.</span><span class="n">diffuseColor</span> <span class="o">=</span> <span class="p">(</span><span class="mf">1.0</span><span class="p">,</span> <span class="mf">0.0</span><span class="p">,</span> <span class="mf">0.0</span><span class="p">)</span>
        <span class="n">material</span><span class="o">.</span><span class="n">emissiveColor</span> <span class="o">=</span> <span class="p">(</span><span class="mf">1.0</span><span class="p">,</span> <span class="mf">0.0</span><span class="p">,</span> <span class="mf">0.0</span><span class="p">)</span>
        <span class="n">drawStyle</span> <span class="o">=</span> <span class="n">coin</span><span class="o">.</span><span class="n">SoDrawStyle</span><span class="p">()</span>
        <span class="n">drawStyle</span><span class="o">.</span><span class="n">pointSize</span><span class="o">.</span><span class="n">setValue</span><span class="p">(</span><span class="mi">10</span><span class="p">)</span>
        <span class="n">drawStyle</span><span class="o">.</span><span class="n">style</span> <span class="o">=</span> <span class="n">coin</span><span class="o">.</span><span class="n">SoDrawStyle</span><span class="o">.</span><span class="n">LINES</span>
        <span class="n">wireframe</span> <span class="o">=</span> <span class="n">coin</span><span class="o">.</span><span class="n">SoGroup</span><span class="p">()</span>
        <span class="n">shaded</span> <span class="o">=</span> <span class="n">coin</span><span class="o">.</span><span class="n">SoGroup</span><span class="p">()</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">wireframe</span> <span class="o">=</span> <span class="n">wireframe</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">shaded</span> <span class="o">=</span> <span class="n">shaded</span>

        <span class="bp">self</span><span class="o">.</span><span class="n">coords</span> <span class="o">=</span> <span class="n">coin</span><span class="o">.</span><span class="n">SoCoordinate3</span><span class="p">()</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">coords</span><span class="o">.</span><span class="n">point</span><span class="o">.</span><span class="n">setValues</span><span class="p">(</span><span class="mi">0</span><span class="p">,</span> <span class="mi">2</span><span class="p">,</span> <span class="p">[</span><span class="n">FreeCAD</span><span class="o">.</span><span class="n">Vector</span><span class="p">(</span><span class="mi">0</span><span class="p">,</span> <span class="mi">0</span><span class="p">,</span> <span class="mi">0</span><span class="p">),</span> <span class="n">FreeCAD</span><span class="o">.</span><span class="n">Vector</span><span class="p">(</span><span class="mi">1</span><span class="p">,</span> <span class="mi">0</span><span class="p">,</span> <span class="mi">0</span><span class="p">)])</span>
        <span class="n">wireframe</span> <span class="o">+=</span> <span class="bp">self</span><span class="o">.</span><span class="n">coords</span>
        <span class="n">wireframe</span> <span class="o">+=</span> <span class="n">drawStyle</span>
        <span class="n">wireframe</span> <span class="o">+=</span> <span class="n">material</span>
        <span class="n">shaded</span> <span class="o">+=</span> <span class="bp">self</span><span class="o">.</span><span class="n">coords</span>
        <span class="n">shaded</span> <span class="o">+=</span> <span class="n">drawStyle</span>
        <span class="n">shaded</span> <span class="o">+=</span> <span class="n">material</span>

        <span class="n">g</span> <span class="o">=</span> <span class="n">coin</span><span class="o">.</span><span class="n">SoGroup</span><span class="p">()</span>
        <span class="n">sel1</span> <span class="o">=</span> <span class="n">coin</span><span class="o">.</span><span class="n">SoType</span><span class="o">.</span><span class="n">fromName</span><span class="p">(</span><span class="s1">'SoFCSelection'</span><span class="p">)</span><span class="o">.</span><span class="n">createInstance</span><span class="p">()</span>
        <span class="n">sel1</span><span class="o">.</span><span class="n">style</span> <span class="o">=</span> <span class="s1">'EMISSIVE_DIFFUSE'</span>
        <span class="n">p1</span> <span class="o">=</span> <span class="n">coin</span><span class="o">.</span><span class="n">SoType</span><span class="o">.</span><span class="n">fromName</span><span class="p">(</span><span class="s1">'SoIndexedPointSet'</span><span class="p">)</span><span class="o">.</span><span class="n">createInstance</span><span class="p">()</span>
        <span class="n">p1</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">0</span><span class="p">,</span> <span class="mi">0</span><span class="p">)</span>
        <span class="n">sel1</span> <span class="o">+=</span> <span class="n">p1</span>
        <span class="n">g</span> <span class="o">+=</span> <span class="n">sel1</span>
        <span class="n">wireframe</span> <span class="o">+=</span> <span class="n">g</span>
        <span class="n">shaded</span> <span class="o">+=</span> <span class="n">g</span>

        <span class="n">g</span> <span class="o">=</span> <span class="n">coin</span><span class="o">.</span><span class="n">SoGroup</span><span class="p">()</span>
        <span class="n">sel2</span> <span class="o">=</span> <span class="n">coin</span><span class="o">.</span><span class="n">SoType</span><span class="o">.</span><span class="n">fromName</span><span class="p">(</span><span class="s1">'SoFCSelection'</span><span class="p">)</span><span class="o">.</span><span class="n">createInstance</span><span class="p">()</span>
        <span class="n">sel2</span><span class="o">.</span><span class="n">style</span> <span class="o">=</span> <span class="s1">'EMISSIVE_DIFFUSE'</span>
        <span class="n">p2</span> <span class="o">=</span> <span class="n">coin</span><span class="o">.</span><span class="n">SoType</span><span class="o">.</span><span class="n">fromName</span><span class="p">(</span><span class="s1">'SoIndexedPointSet'</span><span class="p">)</span><span class="o">.</span><span class="n">createInstance</span><span class="p">()</span>
        <span class="n">p2</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">0</span><span class="p">,</span> <span class="mi">1</span><span class="p">)</span>
        <span class="n">sel2</span> <span class="o">+=</span> <span class="n">p2</span>
        <span class="n">g</span> <span class="o">+=</span> <span class="n">sel2</span>
        <span class="n">wireframe</span> <span class="o">+=</span> <span class="n">g</span>
        <span class="n">shaded</span> <span class="o">+=</span> <span class="n">g</span>

        <span class="n">g</span> <span class="o">=</span> <span class="n">coin</span><span class="o">.</span><span class="n">SoGroup</span><span class="p">()</span>
        <span class="n">sel3</span> <span class="o">=</span> <span class="n">coin</span><span class="o">.</span><span class="n">SoType</span><span class="o">.</span><span class="n">fromName</span><span class="p">(</span><span class="s1">'SoFCSelection'</span><span class="p">)</span><span class="o">.</span><span class="n">createInstance</span><span class="p">()</span>
        <span class="n">sel3</span><span class="o">.</span><span class="n">style</span> <span class="o">=</span> <span class="s1">'EMISSIVE_DIFFUSE'</span>
        <span class="n">p3</span> <span class="o">=</span> <span class="n">coin</span><span class="o">.</span><span class="n">SoType</span><span class="o">.</span><span class="n">fromName</span><span class="p">(</span><span class="s1">'SoIndexedLineSet'</span><span class="p">)</span><span class="o">.</span><span class="n">createInstance</span><span class="p">()</span>
        <span class="n">p3</span><span class="o">.</span><span class="n">coordIndex</span><span class="o">.</span><span class="n">setValues</span><span class="p">(</span><span class="mi">0</span><span class="p">,</span> <span class="mi">2</span><span class="p">,</span> <span class="p">[</span><span class="mi">0</span><span class="p">,</span> <span class="mi">1</span><span class="p">])</span>
        <span class="n">sel3</span> <span class="o">+=</span> <span class="n">p3</span>
        <span class="n">g</span> <span class="o">+=</span> <span class="n">sel3</span>
        <span class="n">wireframe</span> <span class="o">+=</span> <span class="n">g</span>
        <span class="n">shaded</span> <span class="o">+=</span> <span class="n">g</span>

        <span class="n">obj</span><span class="o">.</span><span class="n">addDisplayMode</span><span class="p">(</span><span class="n">wireframe</span><span class="p">,</span> <span class="s1">'Wireframe'</span><span class="p">)</span>
        <span class="n">obj</span><span class="o">.</span><span class="n">addDisplayMode</span><span class="p">(</span><span class="n">shaded</span><span class="p">,</span> <span class="s1">'Shaded'</span><span class="p">)</span>

        <span class="bp">self</span><span class="o">.</span><span class="n">sel1</span> <span class="o">=</span> <span class="n">sel1</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">sel2</span> <span class="o">=</span> <span class="n">sel2</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">sel3</span> <span class="o">=</span> <span class="n">sel3</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">constructed</span> <span class="o">=</span> <span class="kc">True</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">updateData</span><span class="p">(</span><span class="n">obj</span><span class="o">.</span><span class="n">Object</span><span class="p">,</span> <span class="s1">'p2'</span><span class="p">)</span>

    <span class="k">def</span> <span class="nf">getDetailPath</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">subname</span><span class="p">,</span> <span class="n">path</span><span class="p">,</span> <span class="n">append</span><span class="p">):</span>
        <span class="n">vobj</span> <span class="o">=</span> <span class="bp">self</span><span class="o">.</span><span class="n">ViewObject</span>
        <span class="k">if</span> <span class="n">append</span><span class="p">:</span>
            <span class="n">path</span><span class="o">.</span><span class="n">append</span><span class="p">(</span><span class="n">vobj</span><span class="o">.</span><span class="n">RootNode</span><span class="p">)</span>
            <span class="n">path</span><span class="o">.</span><span class="n">append</span><span class="p">(</span><span class="n">vobj</span><span class="o">.</span><span class="n">SwitchNode</span><span class="p">)</span>

            <span class="n">mode</span> <span class="o">=</span> <span class="n">vobj</span><span class="o">.</span><span class="n">SwitchNode</span><span class="o">.</span><span class="n">whichChild</span><span class="o">.</span><span class="n">getValue</span><span class="p">()</span>
            <span class="n">FreeCAD</span><span class="o">.</span><span class="n">Console</span><span class="o">.</span><span class="n">PrintWarning</span><span class="p">(</span><span class="s2">"getDetailPath: mode </span><span class="si">{}</span><span class="s2"> is active</span><span class="se">\n</span><span class="s2">"</span><span class="o">.</span><span class="n">format</span><span class="p">(</span><span class="n">mode</span><span class="p">))</span>
            <span class="k">if</span> <span class="n">mode</span> <span class="o">&gt;=</span> <span class="mi">0</span><span class="p">:</span>
                <span class="n">mode</span> <span class="o">=</span> <span class="n">vobj</span><span class="o">.</span><span class="n">SwitchNode</span><span class="o">.</span><span class="n">getChild</span><span class="p">(</span><span class="n">mode</span><span class="p">)</span>
                <span class="n">path</span><span class="o">.</span><span class="n">append</span><span class="p">(</span><span class="n">mode</span><span class="p">)</span>
                <span class="n">sub</span> <span class="o">=</span> <span class="n">Part</span><span class="o">.</span><span class="n">splitSubname</span><span class="p">(</span><span class="n">subname</span><span class="p">)[</span><span class="o">-</span><span class="mi">1</span><span class="p">]</span>
                <span class="nb">print</span><span class="p">(</span><span class="n">sub</span><span class="p">)</span>
                <span class="k">if</span> <span class="n">sub</span> <span class="o">==</span> <span class="s1">'Atom1'</span><span class="p">:</span>
                    <span class="n">path</span><span class="o">.</span><span class="n">append</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">sel1</span><span class="p">)</span>
                <span class="k">elif</span> <span class="n">sub</span> <span class="o">==</span> <span class="s1">'Atom2'</span><span class="p">:</span>
                    <span class="n">path</span><span class="o">.</span><span class="n">append</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">sel2</span><span class="p">)</span>
                <span class="k">elif</span> <span class="n">sub</span> <span class="o">==</span> <span class="s1">'Line'</span><span class="p">:</span>
                    <span class="n">path</span><span class="o">.</span><span class="n">append</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">sel3</span><span class="p">)</span>
                <span class="k">else</span><span class="p">:</span>
                    <span class="n">path</span><span class="o">.</span><span class="n">append</span><span class="p">(</span><span class="n">mode</span><span class="o">.</span><span class="n">getChild</span><span class="p">(</span><span class="mi">0</span><span class="p">))</span>
        <span class="k">return</span> <span class="kc">True</span>

    <span class="k">def</span> <span class="nf">getElementPicked</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">pp</span><span class="p">):</span>
        <span class="n">path</span> <span class="o">=</span> <span class="n">pp</span><span class="o">.</span><span class="n">getPath</span><span class="p">()</span>
        <span class="k">if</span> <span class="n">path</span><span class="o">.</span><span class="n">findNode</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">sel1</span><span class="p">)</span> <span class="o">&gt;=</span> <span class="mi">0</span><span class="p">:</span>
            <span class="k">return</span> <span class="s1">'Atom1'</span>
        <span class="k">if</span> <span class="n">path</span><span class="o">.</span><span class="n">findNode</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">sel2</span><span class="p">)</span> <span class="o">&gt;=</span> <span class="mi">0</span><span class="p">:</span>
            <span class="k">return</span> <span class="s1">'Atom2'</span>
        <span class="k">if</span> <span class="n">path</span><span class="o">.</span><span class="n">findNode</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">sel3</span><span class="p">)</span> <span class="o">&gt;=</span> <span class="mi">0</span><span class="p">:</span>
            <span class="k">return</span> <span class="s1">'Line'</span>
        <span class="k">raise</span> <span class="ne">NotImplementedError</span>

    <span class="k">def</span> <span class="nf">updateData</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">fp</span><span class="p">,</span> <span class="n">prop</span><span class="p">):</span>
        <span class="s2">"If a property of the handled feature has changed we have the chance to handle this here"</span>
        <span class="c1"># fp is the handled feature, prop is the name of the property that has changed</span>
        <span class="k">if</span> <span class="ow">not</span> <span class="bp">self</span><span class="o">.</span><span class="n">constructed</span><span class="p">:</span>
            <span class="k">return</span>
        <span class="k">if</span> <span class="n">prop</span> <span class="o">==</span> <span class="s2">"p1"</span><span class="p">:</span>
            <span class="n">p</span> <span class="o">=</span> <span class="n">fp</span><span class="o">.</span><span class="n">getPropertyByName</span><span class="p">(</span><span class="s2">"p1"</span><span class="p">)</span>
            <span class="bp">self</span><span class="o">.</span><span class="n">coords</span><span class="o">.</span><span class="n">point</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">0</span><span class="p">,</span> <span class="n">p</span><span class="p">)</span>
        <span class="k">elif</span> <span class="n">prop</span> <span class="o">==</span> <span class="s2">"p2"</span><span class="p">:</span>
            <span class="n">p</span> <span class="o">=</span> <span class="n">fp</span><span class="o">.</span><span class="n">getPropertyByName</span><span class="p">(</span><span class="s2">"p2"</span><span class="p">)</span>
            <span class="bp">self</span><span class="o">.</span><span class="n">coords</span><span class="o">.</span><span class="n">point</span><span class="o">.</span><span class="n">set1Value</span><span class="p">(</span><span class="mi">1</span><span class="p">,</span> <span class="n">p</span><span class="p">)</span>

    <span class="k">def</span> <span class="nf">getDisplayModes</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">obj</span><span class="p">):</span>
        <span class="k">return</span> <span class="p">[</span><span class="s1">'Wireframe'</span><span class="p">,</span> <span class="s1">'Shaded'</span><span class="p">]</span>

    <span class="k">def</span> <span class="nf">getDefaultDisplayMode</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
        <span class="k">return</span> <span class="s1">'Shaded'</span>

    <span class="k">def</span> <span class="nf">setDisplayMode</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">mode</span><span class="p">):</span>
        <span class="k">return</span> <span class="n">mode</span>

    <span class="k">def</span> <span class="nf">dumps</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
        <span class="k">return</span> <span class="kc">None</span>

    <span class="k">def</span> <span class="nf">loads</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span><span class="n">state</span><span class="p">):</span>
        <span class="k">return</span> <span class="kc">None</span>

<span class="k">def</span> <span class="nf">makeMolecule</span><span class="p">():</span>
    <span class="n">FreeCAD</span><span class="o">.</span><span class="n">newDocument</span><span class="p">()</span>
    <span class="n">a</span><span class="o">=</span><span class="n">FreeCAD</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">addObject</span><span class="p">(</span><span class="s2">"App::FeaturePython"</span><span class="p">,</span><span class="s2">"Molecule"</span><span class="p">)</span>
    <span class="n">Molecule</span><span class="p">(</span><span class="n">a</span><span class="p">)</span>
    <span class="n">b</span><span class="o">=</span><span class="n">ViewProviderMolecule</span><span class="p">(</span><span class="n">a</span><span class="o">.</span><span class="n">ViewObject</span><span class="p">)</span>
    <span class="n">a</span><span class="o">.</span><span class="n">touch</span><span class="p">()</span>
    <span class="n">FreeCAD</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">recompute</span><span class="p">()</span>
    <span class="k">return</span> <span class="n">a</span><span class="p">,</span><span class="n">b</span>

<span class="n">a</span><span class="p">,</span><span class="n">b</span> <span class="o">=</span> <span class="n">makeMolecule</span><span class="p">()</span>
</pre></div>
<p><span id="Part_Design_scripted_objects"></span>
</p>
<h2><span id=".D0.9F.D1.80.D0.BE.D0.B3.D1.80.D0.B0.D0.BC.D0.BC.D0.B8.D1.80.D1.83.D0.B5.D0.BC.D1.8B.D0.B9_.D0.BE.D0.B1.D1.8A.D0.B5.D0.BA.D1.82_Part_Design_.28.D0.9F.D1.80.D0.BE.D0.B5.D0.BA.D1.82.D0.BD.D0.B0.D1.8F_.D0.94.D0.B5.D1.82.D0.B0.D0.BB.D1.8C.29"></span><span class="mw-headline" id="&#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1091;&#1077;&#1084;&#1099;&#1081;_&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;_Part_Design_(&#1055;&#1088;&#1086;&#1077;&#1082;&#1090;&#1085;&#1072;&#1103;_&#1044;&#1077;&#1090;&#1072;&#1083;&#1100;)">&#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1091;&#1077;&#1084;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; Part Design (&#1055;&#1088;&#1086;&#1077;&#1082;&#1090;&#1085;&#1072;&#1103; &#1044;&#1077;&#1090;&#1072;&#1083;&#1100;)</span></h2>
<p>&#1055;&#1088;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1080; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1074;&#1099;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1074; PartDesign (&#1055;&#1088;&#1086;&#1077;&#1082;&#1090;&#1085;&#1072;&#1103;&#1044;&#1077;&#1090;&#1072;&#1083;&#1100;) &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1085; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1084; &#1074;&#1099;&#1096;&#1077; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1074;&#1099;&#1084; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084;, &#1085;&#1086; &#1089; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084;&#1080; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080; &#1089;&#1086;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;. &#1052;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; 2 &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1092;&#1086;&#1088;&#1084;&#1099;, &#1086;&#1076;&#1085;&#1086; &#1076;&#1083;&#1103; &#1092;&#1086;&#1088;&#1084;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1084;&#1099; &#1074;&#1080;&#1076;&#1080;&#1084; &#1074; 3D-&#1074;&#1080;&#1076;&#1077;, &#1072; &#1076;&#1088;&#1091;&#1075;&#1086;&#1077; &#1076;&#1083;&#1103; &#1092;&#1086;&#1088;&#1084;&#1099;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1086;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1084;&#1072;&#1089;&#1089;&#1080;&#1074;&#1086;&#1074;/&#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1086;&#1074;, &#1090;&#1072;&#1082;&#1080;&#1084;&#1080; &#1082;&#1072;&#1082; &#1082;&#1088;&#1091;&#1075;&#1086;&#1074;&#1099;&#1077; &#1084;&#1072;&#1089;&#1089;&#1080;&#1074;&#1099;. &#1060;&#1086;&#1088;&#1084;&#1099; (shape) &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1090;&#1072;&#1082;&#1078;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1099; &#1089; &#1083;&#1102;&#1073;&#1099;&#1084; &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083;&#1086;&#1084;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1091;&#1078;&#1077; &#1077;&#1089;&#1090;&#1100; &#1074; &#1058;&#1077;&#1083;&#1077; - Body (&#1080;&#1083;&#1080; &#1074;&#1099;&#1088;&#1077;&#1079;&#1072;&#1085; &#1080;&#1079; &#1085;&#1077;&#1075;&#1086; &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1057;&#1091;&#1073;&#1090;&#1088;&#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1093; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074;&#1099;&#1088;&#1077;&#1079;&#1072;&#1085;&#1080;&#1103;). &#1048; &#1084;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1101;&#1090;&#1086; &#1091;&#1095;&#1077;&#1089;&#1090;&#1080; &#1080; &#1085;&#1077;&#1084;&#1085;&#1086;&#1075;&#1086; &#1087;&#1086;-&#1076;&#1088;&#1091;&#1075;&#1086;&#1084;&#1091; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1080;&#1090;&#1100; &#1082; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1102; &#1080; &#1087;&#1088;&#1080;&#1082;&#1088;&#1077;&#1087;&#1083;&#1077;&#1085;&#1080;&#1102; &#1085;&#1072;&#1096;&#1080;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;.
</p><p>&#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; (features) &#1090;&#1074;&#1105;&#1088;&#1076;&#1086;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1055;&#1088;&#1086;&#1077;&#1082;&#1090;&#1085;&#1086;&#1081;&#1044;&#1077;&#1090;&#1072;&#1083;&#1080;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1074;, &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1086;&#1089;&#1085;&#1086;&#1074;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1083;&#1080;&#1073;&#1086; &#1085;&#1072; PartDesign::FeaturePython, &#1083;&#1080;&#1073;&#1086; &#1085;&#1072; PartDesign::FeatureAdditivePython, &#1083;&#1080;&#1073;&#1086; &#1085;&#1072; PartDesign::FeatureSubtractivePython, &#1072; &#1085;&#1077; &#1085;&#1072; Part::FeaturePython. &#1042; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103;&#1093; &#1084;&#1072;&#1089;&#1089;&#1080;&#1074;&#1086;&#1074; &#1084;&#1086;&#1075;&#1091;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1072;&#1076;&#1076;&#1080;&#1090;&#1080;&#1074;&#1085;&#1099;&#1081; (&#1074;&#1099;&#1076;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103;) &#1080; &#1089;&#1091;&#1073;&#1090;&#1088;&#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1081; (&#1074;&#1099;&#1088;&#1077;&#1079;&#1072;&#1085;&#1080;&#1103;) &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1099;, &#1080; &#1077;&#1089;&#1083;&#1080; &#1086;&#1085;&#1080; &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1099; &#1085;&#1072; Part::FeaturePython, &#1090;&#1086; &#1082;&#1086;&#1075;&#1076;&#1072; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1074; &#1058;&#1077;&#1083;&#1086; - Body &#1055;&#1088;&#1086;&#1077;&#1082;&#1090;&#1085;&#1086;&#1081;&#1044;&#1077;&#1090;&#1072;&#1083;&#1080;, &#1086;&#1085;&#1086; &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1089;&#1103; BaseFeature - &#1041;&#1072;&#1079;&#1086;&#1074;&#1086;&#1081;&#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1077;&#1081;, &#1072; &#1085;&#1077; &#1086;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1072;&#1082; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1058;&#1077;&#1083;&#1086; - Body &#1055;&#1088;&#1086;&#1077;&#1082;&#1090;&#1085;&#1086;&#1081;&#1044;&#1077;&#1090;&#1072;&#1083;&#1080;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;: &#1086;&#1078;&#1080;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1095;&#1090;&#1086; &#1074;&#1089;&#1077; &#1086;&#1085;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1090;&#1074;&#1105;&#1088;&#1076;&#1086;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1105;&#1090;&#1077; &#1085;&#1077;&#1090;&#1074;&#1105;&#1088;&#1076;&#1086;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;, &#1090;&#1086; &#1086;&#1085; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085; &#1085;&#1072; Part::FeaturePython, &#1080;&#1085;&#1072;&#1095;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1072;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; (feature) &#1074; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1087;&#1086;&#1087;&#1099;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1080;&#1090;&#1100;&#1089;&#1103; &#1074; &#1090;&#1074;&#1105;&#1088;&#1076;&#1086;&#1077; &#1090;&#1077;&#1083;&#1086;, &#1080; &#1101;&#1090;&#1086; &#1085;&#1077; &#1091;&#1076;&#1072;&#1089;&#1090;&#1089;&#1103;.
</p><p>&#1042;&#1086;&#1090; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1087;&#1088;&#1080;&#1084;&#1080;&#1090;&#1080;&#1074;&#1072; &#1058;&#1088;&#1091;&#1073;&#1072; (Tube), &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1080;&#1084;&#1080;&#1090;&#1080;&#1074;&#1091; &#1058;&#1088;&#1091;&#1073;&#1072; &#1074; &#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1077; &#1044;&#1077;&#1090;&#1072;&#1083;&#1100; (Part), &#1079;&#1072; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; solid feature &#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; &#1055;&#1088;&#1086;&#1077;&#1082;&#1090;&#1085;&#1072;&#1103;&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; (PartDesign).  &#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1084;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1076;&#1080;&#1084; 2 &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1092;&#1072;&#1081;&#1083;&#1072;: pdtube.FCMacro &#1080; pdtube.py. &#1060;&#1072;&#1081;&#1083; .FCMacro &#1073;&#1091;&#1076;&#1077;&#1090; &#1079;&#1072;&#1087;&#1091;&#1097;&#1077;&#1085; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;. &#1060;&#1072;&#1081;&#1083; .py &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074;, &#1080;&#1084;&#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; .FCMacro. &#1055;&#1088;&#1080;&#1095;&#1080;&#1085;&#1072;, &#1087;&#1086; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1084;&#1099; &#1076;&#1077;&#1083;&#1072;&#1077;&#1084; &#1101;&#1090;&#1086; &#1090;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1087;&#1088;&#1080;&#1088;&#1086;&#1076;&#1099; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1087;&#1086;&#1089;&#1083;&#1077; &#1087;&#1077;&#1088;&#1077;&#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072; FreeCAD &#1080; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1080;&#1103; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1077;&#1075;&#1086; &#1086;&#1076;&#1085;&#1091; &#1080;&#1079; &#1085;&#1072;&#1096;&#1080;&#1093; &#1058;&#1088;&#1091;&#1073;.
</p><p>&#1057;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072;, &#1092;&#1072;&#1081;&#1083; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="c1"># -*- coding: utf-8 -*-</span>
<span class="c1">#classes should go in pdtube.py</span>
<span class="kn">import</span> <span class="nn">FreeCAD</span><span class="o">,</span> <span class="nn">FreeCADGui</span><span class="o">,</span> <span class="nn">Part</span>
<span class="k">class</span> <span class="nc">PDTube</span><span class="p">:</span>
    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span><span class="n">obj</span><span class="p">):</span>
        <span class="n">obj</span><span class="o">.</span><span class="n">addProperty</span><span class="p">(</span><span class="s2">"App::PropertyLength"</span><span class="p">,</span><span class="s2">"Radius1"</span><span class="p">,</span><span class="s2">"Tube"</span><span class="p">,</span><span class="s2">"Radius1"</span><span class="p">)</span><span class="o">.</span><span class="n">Radius1</span> <span class="o">=</span> <span class="mi">5</span>
        <span class="n">obj</span><span class="o">.</span><span class="n">addProperty</span><span class="p">(</span><span class="s2">"App::PropertyLength"</span><span class="p">,</span><span class="s2">"Radius2"</span><span class="p">,</span><span class="s2">"Tube"</span><span class="p">,</span><span class="s2">"Radius2"</span><span class="p">)</span><span class="o">.</span><span class="n">Radius2</span> <span class="o">=</span> <span class="mi">10</span>
        <span class="n">obj</span><span class="o">.</span><span class="n">addProperty</span><span class="p">(</span><span class="s2">"App::PropertyLength"</span><span class="p">,</span><span class="s2">"Height"</span><span class="p">,</span><span class="s2">"Tube"</span><span class="p">,</span><span class="s2">"Height of tube"</span><span class="p">)</span><span class="o">.</span><span class="n">Height</span> <span class="o">=</span> <span class="mi">10</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">makeAttachable</span><span class="p">(</span><span class="n">obj</span><span class="p">)</span>
        <span class="n">obj</span><span class="o">.</span><span class="n">Proxy</span> <span class="o">=</span> <span class="bp">self</span>

    <span class="k">def</span> <span class="nf">makeAttachable</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">obj</span><span class="p">):</span>

        <span class="k">if</span> <span class="nb">int</span><span class="p">(</span><span class="n">FreeCAD</span><span class="o">.</span><span class="n">Version</span><span class="p">()[</span><span class="mi">1</span><span class="p">])</span> <span class="o">&gt;=</span> <span class="mi">19</span><span class="p">:</span>
            <span class="n">obj</span><span class="o">.</span><span class="n">addExtension</span><span class="p">(</span><span class="s1">'Part::AttachExtensionPython'</span><span class="p">)</span>
        <span class="k">else</span><span class="p">:</span>
            <span class="n">obj</span><span class="o">.</span><span class="n">addExtension</span><span class="p">(</span><span class="s1">'Part::AttachExtensionPython'</span><span class="p">,</span> <span class="n">obj</span><span class="p">)</span>

        <span class="n">obj</span><span class="o">.</span><span class="n">setEditorMode</span><span class="p">(</span><span class="s1">'Placement'</span><span class="p">,</span> <span class="mi">0</span><span class="p">)</span> <span class="c1">#non-readonly non-hidden</span>

    <span class="k">def</span> <span class="nf">execute</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span><span class="n">fp</span><span class="p">):</span>
        <span class="n">outer_cylinder</span> <span class="o">=</span> <span class="n">Part</span><span class="o">.</span><span class="n">makeCylinder</span><span class="p">(</span><span class="n">fp</span><span class="o">.</span><span class="n">Radius2</span><span class="p">,</span> <span class="n">fp</span><span class="o">.</span><span class="n">Height</span><span class="p">)</span>
        <span class="n">inner_cylinder</span> <span class="o">=</span> <span class="n">Part</span><span class="o">.</span><span class="n">makeCylinder</span><span class="p">(</span><span class="n">fp</span><span class="o">.</span><span class="n">Radius1</span><span class="p">,</span> <span class="n">fp</span><span class="o">.</span><span class="n">Height</span><span class="p">)</span>
        <span class="k">if</span> <span class="n">fp</span><span class="o">.</span><span class="n">Radius1</span> <span class="o">==</span> <span class="n">fp</span><span class="o">.</span><span class="n">Radius2</span><span class="p">:</span> <span class="c1">#just make cylinder</span>
            <span class="n">tube_shape</span> <span class="o">=</span> <span class="n">outer_cylinder</span>
        <span class="k">elif</span> <span class="n">fp</span><span class="o">.</span><span class="n">Radius1</span> <span class="o">&lt;</span> <span class="n">fp</span><span class="o">.</span><span class="n">Radius2</span><span class="p">:</span>
            <span class="n">tube_shape</span> <span class="o">=</span> <span class="n">outer_cylinder</span><span class="o">.</span><span class="n">cut</span><span class="p">(</span><span class="n">inner_cylinder</span><span class="p">)</span>
        <span class="k">else</span><span class="p">:</span> <span class="c1">#invert rather than error out</span>
            <span class="n">tube_shape</span> <span class="o">=</span> <span class="n">inner_cylinder</span><span class="o">.</span><span class="n">cut</span><span class="p">(</span><span class="n">outer_cylinder</span><span class="p">)</span>

        <span class="k">if</span> <span class="ow">not</span> <span class="nb">hasattr</span><span class="p">(</span><span class="n">fp</span><span class="p">,</span> <span class="s2">"positionBySupport"</span><span class="p">):</span>
            <span class="bp">self</span><span class="o">.</span><span class="n">makeAttachable</span><span class="p">(</span><span class="n">fp</span><span class="p">)</span>
        <span class="n">fp</span><span class="o">.</span><span class="n">positionBySupport</span><span class="p">()</span>
        <span class="n">tube_shape</span><span class="o">.</span><span class="n">Placement</span> <span class="o">=</span> <span class="n">fp</span><span class="o">.</span><span class="n">Placement</span>

        <span class="c1">#BaseFeature (shape property of type Part::PropertyPartShape) is provided for us</span>
        <span class="c1">#with the PartDesign::FeaturePython and related classes, but it might be empty</span>
        <span class="c1">#if our object is the first object in the tree.  it's a good idea to check</span>
        <span class="c1">#for its existence in case we want to make type Part::FeaturePython, which won't have it</span>

        <span class="k">if</span> <span class="nb">hasattr</span><span class="p">(</span><span class="n">fp</span><span class="p">,</span> <span class="s2">"BaseFeature"</span><span class="p">)</span> <span class="ow">and</span> <span class="n">fp</span><span class="o">.</span><span class="n">BaseFeature</span> <span class="o">!=</span> <span class="kc">None</span><span class="p">:</span>
            <span class="k">if</span> <span class="s2">"Subtractive"</span> <span class="ow">in</span> <span class="n">fp</span><span class="o">.</span><span class="n">TypeId</span><span class="p">:</span>
                <span class="n">full_shape</span> <span class="o">=</span> <span class="n">fp</span><span class="o">.</span><span class="n">BaseFeature</span><span class="o">.</span><span class="n">Shape</span><span class="o">.</span><span class="n">cut</span><span class="p">(</span><span class="n">tube_shape</span><span class="p">)</span>
            <span class="k">else</span><span class="p">:</span>
                <span class="n">full_shape</span> <span class="o">=</span> <span class="n">fp</span><span class="o">.</span><span class="n">BaseFeature</span><span class="o">.</span><span class="n">Shape</span><span class="o">.</span><span class="n">fuse</span><span class="p">(</span><span class="n">tube_shape</span><span class="p">)</span>
            <span class="n">full_shape</span><span class="o">.</span><span class="n">transformShape</span><span class="p">(</span><span class="n">fp</span><span class="o">.</span><span class="n">Placement</span><span class="o">.</span><span class="n">inverse</span><span class="p">()</span><span class="o">.</span><span class="n">toMatrix</span><span class="p">(),</span> <span class="kc">True</span><span class="p">)</span> <span class="c1">#borrowed from gears workbench</span>
            <span class="n">fp</span><span class="o">.</span><span class="n">Shape</span> <span class="o">=</span> <span class="n">full_shape</span>
        <span class="k">else</span><span class="p">:</span>
            <span class="n">fp</span><span class="o">.</span><span class="n">Shape</span> <span class="o">=</span> <span class="n">tube_shape</span>
        <span class="k">if</span> <span class="nb">hasattr</span><span class="p">(</span><span class="n">fp</span><span class="p">,</span><span class="s2">"AddSubShape"</span><span class="p">):</span> <span class="c1">#PartDesign::FeatureAdditivePython and</span>
                                      <span class="c1">#PartDesign::FeatureSubtractivePython have this</span>
                                      <span class="c1">#property but PartDesign::FeaturePython does not</span>
                                      <span class="c1">#It is the shape used for copying in pattern features</span>
                                      <span class="c1">#for example in making a polar pattern</span>
            <span class="n">tube_shape</span><span class="o">.</span><span class="n">transformShape</span><span class="p">(</span><span class="n">fp</span><span class="o">.</span><span class="n">Placement</span><span class="o">.</span><span class="n">inverse</span><span class="p">()</span><span class="o">.</span><span class="n">toMatrix</span><span class="p">(),</span> <span class="kc">True</span><span class="p">)</span>
            <span class="n">fp</span><span class="o">.</span><span class="n">AddSubShape</span> <span class="o">=</span> <span class="n">tube_shape</span>

<span class="k">class</span> <span class="nc">PDTubeVP</span><span class="p">:</span>
    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">obj</span><span class="p">):</span>
<span class="w">        </span><span class="sd">'''Set this object to the proxy object of the actual view provider'''</span>
        <span class="n">obj</span><span class="o">.</span><span class="n">Proxy</span> <span class="o">=</span> <span class="bp">self</span>

    <span class="k">def</span> <span class="nf">attach</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span><span class="n">vobj</span><span class="p">):</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">vobj</span> <span class="o">=</span> <span class="n">vobj</span>

    <span class="k">def</span> <span class="nf">updateData</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">fp</span><span class="p">,</span> <span class="n">prop</span><span class="p">):</span>
<span class="w">        </span><span class="sd">'''If a property of the handled feature has changed we have the chance to handle this here'''</span>
        <span class="k">pass</span>

    <span class="k">def</span> <span class="nf">getDisplayModes</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span><span class="n">obj</span><span class="p">):</span>
<span class="w">        </span><span class="sd">'''Return a list of display modes.'''</span>
        <span class="n">modes</span><span class="o">=</span><span class="p">[]</span>
        <span class="n">modes</span><span class="o">.</span><span class="n">append</span><span class="p">(</span><span class="s2">"Flat Lines"</span><span class="p">)</span>
        <span class="n">modes</span><span class="o">.</span><span class="n">append</span><span class="p">(</span><span class="s2">"Shaded"</span><span class="p">)</span>
        <span class="n">modes</span><span class="o">.</span><span class="n">append</span><span class="p">(</span><span class="s2">"Wireframe"</span><span class="p">)</span>
        <span class="k">return</span> <span class="n">modes</span>

    <span class="k">def</span> <span class="nf">getDefaultDisplayMode</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
<span class="w">        </span><span class="sd">'''Return the name of the default display mode. It must be defined in getDisplayModes.'''</span>
        <span class="k">return</span> <span class="s2">"Flat Lines"</span>

    <span class="k">def</span> <span class="nf">setDisplayMode</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span><span class="n">mode</span><span class="p">):</span>
<span class="w">        </span><span class="sd">'''Map the display mode defined in attach with those defined in getDisplayModes.\</span>
<span class="sd">                Since they have the same names nothing needs to be done. This method is optional'''</span>
        <span class="k">return</span> <span class="n">mode</span>

    <span class="k">def</span> <span class="nf">onChanged</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">vp</span><span class="p">,</span> <span class="n">prop</span><span class="p">):</span>
<span class="w">        </span><span class="sd">'''Here we can do something when a single property got changed'''</span>
        <span class="c1">#FreeCAD.Console.PrintMessage("Change property: " + str(prop) + "\n")</span>
        <span class="k">pass</span>

    <span class="k">def</span> <span class="nf">getIcon</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
<span class="w">        </span><span class="sd">'''Return the icon in XPM format which will appear in the tree view. This method is\</span>
<span class="sd">                optional and if not defined a default icon is shown.'''</span>
        <span class="k">return</span> <span class="s2">"""</span>
<span class="s2">            /* XPM */</span>
<span class="s2">            static const char * ViewProviderBox_xpm[] = {</span>
<span class="s2">            "16 16 6 1",</span>
<span class="s2">            "   c None",</span>
<span class="s2">            ".  c #141010",</span>
<span class="s2">            "+  c #615BD2",</span>
<span class="s2">            "@  c #C39D55",</span>
<span class="s2">            "#  c #000000",</span>
<span class="s2">            "$  c #57C355",</span>
<span class="s2">            "        ........",</span>
<span class="s2">            "   ......++..+..",</span>
<span class="s2">            "   .@@@@.++..++.",</span>
<span class="s2">            "   .@@@@.++..++.",</span>
<span class="s2">            "   .@@  .++++++.",</span>
<span class="s2">            "  ..@@  .++..++.",</span>
<span class="s2">            "###@@@@ .++..++.",</span>
<span class="s2">            "##$.@@$#.++++++.",</span>
<span class="s2">            "#$#$.$$$........",</span>
<span class="s2">            "#$$#######      ",</span>
<span class="s2">            "#$$#$$$$$#      ",</span>
<span class="s2">            "#$$#$$$$$#      ",</span>
<span class="s2">            "#$$#$$$$$#      ",</span>
<span class="s2">            " #$#$$$$$#      ",</span>
<span class="s2">            "  ##$$$$$#      ",</span>
<span class="s2">            "   #######      "};</span>
<span class="s2">            """</span>

    <span class="k">def</span> <span class="nf">dumps</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
<span class="w">        </span><span class="sd">'''When saving the document this object gets stored using Python's json module.\</span>
<span class="sd">                Since we have some un-serializable parts here -- the Coin stuff -- we must define this method\</span>
<span class="sd">                to return a tuple of all serializable objects or None.'''</span>
        <span class="k">return</span> <span class="kc">None</span>

    <span class="k">def</span> <span class="nf">loads</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span><span class="n">state</span><span class="p">):</span>
<span class="w">        </span><span class="sd">'''When restoring the serialized object from document we have the chance to set some internals here.\</span>
<span class="sd">                Since no data were serialized nothing needs to be done here.'''</span>
        <span class="k">return</span> <span class="kc">None</span>
</pre></div>
<p>&#1040; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1092;&#1072;&#1081;&#1083; &#1084;&#1072;&#1082;&#1088;&#1086; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="c1"># -*- coding: utf-8 -*-</span>

<span class="c1">#pdtube.FCMacro</span>
<span class="kn">import</span> <span class="nn">pdtube</span>
<span class="c1">#above line needed if the class definitions above are place in another file: PDTube.py</span>
<span class="c1">#this is needed if the tube object is to remain parametric after restarting FreeCAD and loading</span>
<span class="c1">#a document containing the object</span>

<span class="n">body</span> <span class="o">=</span> <span class="n">FreeCADGui</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">ActiveView</span><span class="o">.</span><span class="n">getActiveObject</span><span class="p">(</span><span class="s2">"pdbody"</span><span class="p">)</span>
<span class="k">if</span> <span class="ow">not</span> <span class="n">body</span><span class="p">:</span>
    <span class="n">FreeCAD</span><span class="o">.</span><span class="n">Console</span><span class="o">.</span><span class="n">PrintError</span><span class="p">(</span><span class="s2">"No active body.</span><span class="se">\n</span><span class="s2">"</span><span class="p">)</span>
<span class="k">else</span><span class="p">:</span>
    <span class="kn">from</span> <span class="nn">PySide</span> <span class="kn">import</span> <span class="n">QtGui</span>
    <span class="n">window</span> <span class="o">=</span> <span class="n">FreeCADGui</span><span class="o">.</span><span class="n">getMainWindow</span><span class="p">()</span>
    <span class="n">items</span> <span class="o">=</span> <span class="p">[</span><span class="s2">"Additive"</span><span class="p">,</span><span class="s2">"Subtractive"</span><span class="p">,</span><span class="s2">"Neither additive nor subtractive"</span><span class="p">]</span>
    <span class="n">item</span><span class="p">,</span><span class="n">ok</span> <span class="o">=</span><span class="n">QtGui</span><span class="o">.</span><span class="n">QInputDialog</span><span class="o">.</span><span class="n">getItem</span><span class="p">(</span><span class="n">window</span><span class="p">,</span><span class="s2">"Select tube type"</span><span class="p">,</span><span class="s2">"Select whether you want additive, subtractive, or neither:"</span><span class="p">,</span><span class="n">items</span><span class="p">,</span><span class="mi">0</span><span class="p">,</span><span class="kc">False</span><span class="p">)</span>
    <span class="k">if</span> <span class="n">ok</span><span class="p">:</span>
        <span class="k">if</span> <span class="n">item</span> <span class="o">==</span> <span class="n">items</span><span class="p">[</span><span class="mi">0</span><span class="p">]:</span>
            <span class="n">className</span> <span class="o">=</span> <span class="s2">"PartDesign::FeatureAdditivePython"</span>
        <span class="k">elif</span> <span class="n">item</span> <span class="o">==</span> <span class="n">items</span><span class="p">[</span><span class="mi">1</span><span class="p">]:</span>
            <span class="n">className</span> <span class="o">=</span> <span class="s2">"PartDesign::FeatureSubtractivePython"</span>
        <span class="k">else</span><span class="p">:</span>
            <span class="n">className</span> <span class="o">=</span> <span class="s2">"PartDesign::FeaturePython"</span> <span class="c1">#not usable in pattern features, such as polar pattern</span>

        <span class="n">tube</span> <span class="o">=</span> <span class="n">FreeCAD</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">addObject</span><span class="p">(</span><span class="n">className</span><span class="p">,</span><span class="s2">"Tube"</span><span class="p">)</span>
        <span class="n">pdtube</span><span class="o">.</span><span class="n">PDTube</span><span class="p">(</span><span class="n">tube</span><span class="p">)</span>
        <span class="n">pdtube</span><span class="o">.</span><span class="n">PDTubeVP</span><span class="p">(</span><span class="n">tube</span><span class="o">.</span><span class="n">ViewObject</span><span class="p">)</span>
        <span class="n">body</span><span class="o">.</span><span class="n">addObject</span><span class="p">(</span><span class="n">tube</span><span class="p">)</span> <span class="c1">#optionally we can also use body.insertObject() for placing at particular place in tree</span>
</pre></div>
<p><span id="Available_object_types"></span>
</p>
<h2><span id=".D0.94.D0.BE.D1.81.D1.82.D1.83.D0.BF.D0.BD.D1.8B.D0.B5_.D1.82.D0.B8.D0.BF.D1.8B_.D0.BE.D0.B1.D1.8A.D0.B5.D0.BA.D1.82.D0.BE.D0.B2"></span><span class="mw-headline" id="&#1044;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1077;_&#1090;&#1080;&#1087;&#1099;_&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;">&#1044;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1077; &#1090;&#1080;&#1087;&#1099; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;</span></h2>
<p>&#1058;&#1080;&#1087;&#1099; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <code>FreeCAD.ActiveDocument.AddObject()</code>, &#1079;&#1072;&#1074;&#1080;&#1089;&#1103;&#1090; &#1086;&#1090; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085;&#1085;&#1099;&#1093; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1081;. &#1055;&#1086;&#1089;&#1083;&#1077; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080; &#1074;&#1089;&#1077;&#1093; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1093; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1086;&#1074; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <code>FreeCAD.ActiveDocument.SupportedTypes()</code>. &#1044;&#1083;&#1103; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1074;&#1099;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1090;&#1080;&#1087;&#1099; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1080;&#1084;&#1103; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1079;&#1072;&#1082;&#1072;&#1085;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; <code>Python</code>. &#1054;&#1085;&#1080; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1099; &#1079;&#1076;&#1077;&#1089;&#1100; (&#1076;&#1083;&#1103; FreeCAD &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 1.0):
</p>
<ul><li><code>App::DocumentObjectGroupPython</code></li>
<li><code>App::FeaturePython</code></li>
<li><code>App::GeometryPython</code></li>
<li><code>App::LinkElementPython</code></li>
<li><code>App::LinkGroupPython</code></li>
<li><code>App::LinkPython</code></li>
<li><code>App::MaterialObjectPython</code></li>
<li><code>App::PlacementPython</code></li>
<li><code>Fem::ConstraintPython</code></li>
<li><code>Fem::FeaturePython</code></li>
<li><code>Fem::FemAnalysisPython</code></li>
<li><code>Fem::FemMeshObjectPython</code></li>
<li><code>Fem::FemResultObjectPython</code></li>
<li><code>Fem::FemSolverObjectPython</code></li>
<li><code>Measure::MeasurePython</code></li>
<li><code>Mesh::FeaturePython</code></li>
<li><code>Part::CustomFeaturePython</code></li>
<li><code>Part::FeaturePython</code></li>
<li><code>Part::Part2DObjectPython</code></li>
<li><code>PartDesign::FeatureAdditivePython</code></li>
<li><code>PartDesign::FeatureAddSubPython</code></li>
<li><code>PartDesign::FeaturePython</code></li>
<li><code>PartDesign::FeatureSubtractivePython</code></li>
<li><code>PartDesign::SubShapeBinderPython</code></li>
<li><code>Path::FeatureAreaPython</code></li>
<li><code>Path::FeatureAreaViewPython</code></li>
<li><code>Path::FeatureCompoundPython</code></li>
<li><code>Path::FeaturePython</code></li>
<li><code>Path::FeatureShapePython</code></li>
<li><code>Points::FeaturePython</code></li>
<li><code>Sketcher::SketchObjectPython</code></li>
<li><code>Spreadsheet::SheetPython</code></li>
<li><code>TechDraw::DrawBrokenViewPython</code></li>
<li><code>TechDraw::DrawComplexSectionPython</code></li>
<li><code>TechDraw::DrawLeaderLinePython</code></li>
<li><code>TechDraw::DrawPagePython</code></li>
<li><code>TechDraw::DrawRichAnnoPython</code></li>
<li><code>TechDraw::DrawTemplatePython</code></li>
<li><code>TechDraw::DrawTilePython</code></li>
<li><code>TechDraw::DrawTileWeldPython</code></li>
<li><code>TechDraw::DrawViewPartPython</code></li>
<li><code>TechDraw::DrawViewPython</code></li>
<li><code>TechDraw::DrawViewSectionPython</code></li>
<li><code>TechDraw::DrawViewSymbolPython</code></li>
<li><code>TechDraw::DrawWeldSymbolPython</code></li></ul>
<p><span id="Available_methods"></span>
</p>
<h2><span id=".D0.94.D0.BE.D1.81.D1.82.D1.83.D0.BF.D0.BD.D1.8B.D0.B5_.D0.BC.D0.B5.D1.82.D0.BE.D0.B4.D1.8B"></span><span class="mw-headline" id="&#1044;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1077;_&#1084;&#1077;&#1090;&#1086;&#1076;&#1099;">&#1044;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;</span></h2>
<p>&#1055;&#1086;&#1083;&#1085;&#1086;&#1077; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; <a href="../ru/FeaturePython_methods.html" title="FeaturePython methods/ru">&#1084;&#1077;&#1090;&#1086;&#1076;&#1099; FeaturePython</a>.
</p><p><span id="Available_properties"></span>
</p>
<h2><span id=".D0.94.D0.BE.D1.81.D1.82.D1.83.D0.BF.D0.BD.D1.8B.D0.B5_.D1.81.D0.B2.D0.BE.D0.B9.D1.81.D1.82.D0.B2.D0.B0"></span><span class="mw-headline" id="&#1044;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1077;_&#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;">&#1044;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;</span></h2>
<p>&#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; - &#1101;&#1090;&#1086; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1080;&#1077; &#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1073;&#1083;&#1086;&#1082;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; FeaturePython. &#1057; &#1080;&#1093; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1090;&#1099; &#1089;&#1084;&#1086;&#1078;&#1077;&#1096;&#1100; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1084; &#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1077;&#1075;&#1086;. &#1055;&#1086;&#1089;&#1083;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; FeaturePython &#1074; &#1089;&#1074;&#1086;&#1105;&#1084; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1077; &#1090;&#1099; &#1084;&#1086;&#1078;&#1077;&#1096;&#1100; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1093; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">obj</span> <span class="o">=</span> <span class="n">FreeCAD</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">addObject</span><span class="p">(</span><span class="s2">"App::FeaturePython"</span><span class="p">,</span> <span class="s2">"Box"</span><span class="p">)</span>
<span class="n">obj</span><span class="o">.</span><span class="n">supportedProperties</span><span class="p">()</span>
</pre></div>
<p>&#1057;&#1084;&#1086;&#1090;&#1088;&#1080; <a href="../ru/FeaturePython_Custom_Properties.html" title="FeaturePython Custom Properties/ru">&#1055;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; FeaturePython</a> &#1076;&#1083;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073;&#1097;&#1077;&#1075;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;.
</p><p>&#1055;&#1088;&#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080; &#1085;&#1086;&#1074;&#1099;&#1093; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; &#1082;  &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1084; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084;, &#1087;&#1086;&#1079;&#1072;&#1073;&#1086;&#1090;&#1100;&#1090;&#1077;&#1089;&#1100; &#1086;&#1073; &#1101;&#1090;&#1086;&#1084;:
</p>
<ul><li>&#1053;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1099; <code>&lt;</code> &#1080;&#1083;&#1080; <code>&gt;</code> &#1074; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1080; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; (&#1101;&#1090;&#1086; &#1074;&#1099;&#1079;&#1099;&#1074;&#1077;&#1090; &#1087;&#1086;&#1083;&#1086;&#1084;&#1082;&#1091; xml &#1095;&#1072;&#1089;&#1090;&#1080; .FCStd &#1092;&#1072;&#1081;&#1083;&#1072;).</li>
<li>&#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1089;&#1103; &#1074; &#1092;&#1072;&#1081;&#1083;&#1077; .FCStd &#1074; &#1072;&#1083;&#1092;&#1072;&#1074;&#1080;&#1090;&#1085;&#1086;&#1084; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077;. &#1045;&#1089;&#1083;&#1080; &#1074; &#1074;&#1072;&#1096;&#1080;&#1093; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;&#1093; &#1077;&#1089;&#1090;&#1100; &#1092;&#1080;&#1075;&#1091;&#1088;&#1072; (shape), &#1090;&#1086; &#1083;&#1102;&#1073;&#1086;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086;, &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1079;&#1072; &#1089;&#1083;&#1086;&#1074;&#1086;&#1084; "Shape" &#1087;&#1086; &#1072;&#1083;&#1092;&#1072;&#1074;&#1080;&#1090;&#1085;&#1086;&#1084;&#1091; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1091;, &#1073;&#1091;&#1076;&#1077;&#1090; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077; Shape, &#1095;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1088;&#1080;&#1074;&#1077;&#1089;&#1090;&#1080; &#1082; &#1089;&#1090;&#1088;&#1072;&#1085;&#1085;&#1086;&#1084;&#1091; &#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1102;.</li></ul>
<p>&#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1099; &#1074; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1095;&#1085;&#1086;&#1084; &#1092;&#1072;&#1081;&#1083;&#1077; <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/blob/master/src/App/PropertyStandard.h">PropertyStandard C++</a>.
</p><p><span id="Property_attributes"></span>
</p>
<h3><span id=".D0.90.D1.82.D1.80.D0.B8.D0.B1.D1.83.D1.82.D1.8B_.D0.A1.D0.B2.D0.BE.D0.B9.D1.81.D1.82.D0.B2"></span><span class="mw-headline" id="&#1040;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099;_&#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;">&#1040;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;</span></h3>
<p>&#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1099; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084;, &#1085;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1084;&#1080; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1095;&#1090;&#1077;&#1085;&#1080;&#1103;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1077;&#1089;&#1083;&#1080; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1079;&#1080;&#1090;&#1100; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;. &#1058;&#1072;&#1082;&#1078;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1082;&#1088;&#1099;&#1090;&#1100; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086;. &#1069;&#1090;&#1080; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1084;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102;:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">obj</span><span class="o">.</span><span class="n">setEditorMode</span><span class="p">(</span><span class="s2">"MyPropertyName"</span><span class="p">,</span> <span class="n">mode</span><span class="p">)</span>
</pre></div>
<p>&#1043;&#1076;&#1077; mode &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;:
</p>
<pre> 0 - &#1088;&#1077;&#1078;&#1080;&#1084; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;, &#1095;&#1090;&#1077;&#1085;&#1080;&#1077; &#1080; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100;
 1 - &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1095;&#1090;&#1077;&#1085;&#1080;&#1103;
 2 - &#1089;&#1082;&#1088;&#1099;&#1090;&#1099;&#1081;
 3 - &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1095;&#1090;&#1077;&#1085;&#1080;&#1103; &#1080; &#1089;&#1082;&#1088;&#1099;&#1090;&#1099;&#1081;
</pre>
<p>&#1040;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1099; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1089;&#1090;&#1088;&#1086;&#1082;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; <code>obj.setEditorMode("Placement", ["ReadOnly", "Hidden"])</code>.
</p><p>&#1040;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099;, &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <code>setEditorMode</code>, &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1099; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084;. &#1057;&#1084;&#1086;&#1090;&#1088;&#1080; <a href="../ru/Property_editor.html#Context_menu" class="mw-redirect" title="Property editor/ru">&#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;</a>. &#1054;&#1073;&#1088;&#1072;&#1090;&#1080; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;, &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1095;&#1090;&#1077;&#1085;&#1080;&#1103;, &#1074;&#1089;&#1105; &#1077;&#1097;&#1105; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; Python.
</p><p>&#1042;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1101;&#1090;&#1080; &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; <code>addProperty</code>. &#1040;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099;, &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1101;&#1090;&#1086;&#1081; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;, &#1085;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1099; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084;. &#1048;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1086;&#1081; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1084;&#1077;&#1090;&#1082;&#1072; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1082;&#1072;&#1082; &#1074;&#1099;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;. &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, FreeCAD &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1086;&#1084;&#1077;&#1095;&#1072;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1082;&#1072;&#1082; &#1079;&#1072;&#1090;&#1088;&#1086;&#1085;&#1091;&#1090;&#1099;&#1081; &#1087;&#1088;&#1080; &#1077;&#1075;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1080; (&#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1085;&#1077;&#1090; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1074; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1085;&#1099;&#1093; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103;&#1093;).
</p><p>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1074;&#1099;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; (&#1089;&#1084;&#1086;&#1090;&#1088;&#1080; &#1090;&#1072;&#1082;&#1078;&#1077; <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?t=24928">https://forum.freecad.org/viewtopic.php?t=24928</a>):
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">obj</span><span class="o">.</span><span class="n">addProperty</span><span class="p">(</span><span class="s2">"App::PropertyString"</span><span class="p">,</span> <span class="s2">"MyCustomProperty"</span><span class="p">,</span> <span class="s2">""</span><span class="p">,</span> <span class="s2">""</span><span class="p">,</span> <span class="mi">8</span><span class="p">)</span>
</pre></div>
<p>&#1053;&#1080;&#1078;&#1077; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1099; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <code>addProperty</code>. &#1055;&#1091;&#1090;&#1105;&#1084; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081; &#1084;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074;.
</p>
<pre>  0 -- Prop_None, &#1053;&#1077;&#1090; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1072; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;
  1 -- Prop_ReadOnly, &#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1095;&#1090;&#1077;&#1085;&#1080;&#1103; &#1074; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;&#1077;.
  2 -- Prop_Transient, &#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1086; &#1074; &#1092;&#1072;&#1081;&#1083;&#1077;
  4 -- Prop_Hidden, &#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; &#1085;&#1077; &#1087;&#1086;&#1103;&#1074;&#1080;&#1090;&#1089;&#1103; &#1074; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;&#1077;
  8 -- Prop_Output, &#1048;&#1079;&#1084;&#1077;&#1085;&#1105;&#1085;&#1085;&#1086;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; &#1085;&#1077; &#1079;&#1072;&#1090;&#1088;&#1072;&#1075;&#1080;&#1074;&#1072;&#1077;&#1090; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1081; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;
 16 -- Prop_NoRecompute, &#1048;&#1079;&#1084;&#1077;&#1085;&#1105;&#1085;&#1085;&#1086;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; &#1085;&#1077; &#1079;&#1072;&#1090;&#1088;&#1072;&#1075;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1074;&#1086;&#1081; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088; &#1076;&#1083;&#1103; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1085;&#1086;&#1075;&#1086; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103;
 32 -- Prop_NoPersist, &#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; &#1074;&#1086;&#1086;&#1073;&#1097;&#1077; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1086; &#1074; &#1092;&#1072;&#1081;&#1083;
</pre>
<p>&#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1099; &#1074; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1095;&#1085;&#1086;&#1084; &#1092;&#1072;&#1081;&#1083;&#1077; <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/blob/master/src/App/PropertyContainer.h">PropertyContainer C++</a>.
</p><p>&#1044;&#1083;&#1103; <code>Prop_ReadOnly</code> &#1080; <code>Prop_Hidden</code> &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; <code>addProperty</code> &#1090;&#1072;&#1082;&#1078;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1073;&#1091;&#1083;&#1077;&#1074;&#1099; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">obj</span><span class="o">.</span><span class="n">addProperty</span><span class="p">(</span><span class="s2">"App::PropertyString"</span><span class="p">,</span> <span class="s2">"MyCustomProperty"</span><span class="p">,</span> <span class="s2">""</span><span class="p">,</span> <span class="s2">""</span><span class="p">,</span> <span class="mi">0</span><span class="p">,</span> <span class="kc">True</span><span class="p">,</span> <span class="kc">True</span><span class="p">)</span>
</pre></div>
<p>&#1063;&#1090;&#1086; &#1101;&#1082;&#1074;&#1080;&#1074;&#1072;&#1083;&#1077;&#1085;&#1090;&#1085;&#1086;:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">obj</span><span class="o">.</span><span class="n">addProperty</span><span class="p">(</span><span class="s2">"App::PropertyString"</span><span class="p">,</span> <span class="s2">"MyCustomProperty"</span><span class="p">,</span> <span class="s2">""</span><span class="p">,</span> <span class="s2">""</span><span class="p">,</span> <span class="mi">1</span><span class="o">+</span><span class="mi">4</span><span class="p">)</span>
</pre></div>
<p><span style="font-size:small;"><a href="../ru/Release_notes_1.0.html" title="Release notes 1.0/ru">&#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1086; &#1074; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 1.0</a></span>: &#1055;&#1086;&#1083;&#1085;&#1072;&#1103; &#1089;&#1080;&#1075;&#1085;&#1072;&#1090;&#1091;&#1088;&#1072; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1090;&#1072;&#1082;&#1086;&#1074;&#1072;:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">obj</span><span class="o">.</span><span class="n">addProperty</span><span class="p">(</span><span class="nb">type</span><span class="p">:</span> <span class="n">string</span><span class="p">,</span> <span class="n">name</span><span class="p">:</span> <span class="n">string</span><span class="p">,</span> <span class="n">group</span><span class="o">=</span><span class="s2">""</span><span class="p">,</span> <span class="n">doc</span><span class="o">=</span><span class="s2">""</span><span class="p">,</span> <span class="n">attr</span><span class="o">=</span><span class="mi">0</span><span class="p">,</span> <span class="n">read_only</span><span class="o">=</span><span class="kc">False</span><span class="p">,</span> <span class="n">hidden</span><span class="o">=</span><span class="kc">False</span><span class="p">,</span> <span class="n">enum_vals</span><span class="o">=</span><span class="p">[])</span>
</pre></div>
<ul><li><code>type</code>: &#1058;&#1080;&#1087; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;.</li>
<li><code>name</code>: &#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;.</li>
<li><code>group</code>: &#1055;&#1086;&#1076;&#1088;&#1072;&#1079;&#1076;&#1077;&#1083; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; (&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074; <a href="../ru/Property_editor.html" class="mw-redirect" title="Property editor/ru">&#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;</a>).</li>
<li><code>doc</code>: &#1042;&#1089;&#1087;&#1083;&#1099;&#1074;&#1072;&#1102;&#1097;&#1072;&#1103; &#1087;&#1086;&#1076;&#1089;&#1082;&#1072;&#1079;&#1082;&#1072; (&#1090;&#1072;&#1084; &#1078;&#1077;).</li>
<li><code>attr</code>: &#1040;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;, &#1089;&#1084;&#1086;&#1090;&#1088;&#1080; &#1074;&#1099;&#1096;&#1077;.</li>
<li><code>read_only</code>: &#1057;&#1084;&#1086;&#1090;&#1088;&#1080; &#1074;&#1099;&#1096;&#1077;.</li>
<li><code>hidden</code>: &#1057;&#1084;&#1086;&#1090;&#1088;&#1080; &#1074;&#1099;&#1096;&#1077;.</li>
<li><code>enum_vals</code>: &#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103; (&#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089;&#1090;&#1088;&#1086;&#1082;), &#1072;&#1082;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1090;&#1080;&#1087; <code>"App::PropertyEnumeration"</code>.</li></ul>
<p><span id="Available_extensions"></span>
</p>
<h2><span id=".D0.94.D0.BE.D1.81.D1.82.D1.83.D0.BF.D0.BD.D1.8B.D0.B5_.D1.80.D0.B0.D1.81.D1.88.D0.B8.D1.80.D0.B5.D0.BD.D0.B8.D1.8F"></span><span class="mw-headline" id="&#1044;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1077;_&#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1103;">&#1044;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1077; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1103;</span></h2>
<div class="mw-translate-fuzzy">
<p>&#1057;&#1087;&#1080;&#1089;&#1086;&#1082; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1093; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1081; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <code>grep -RI EXTENSION_PROPERTY_SOURCE_TEMPLATE</code> &#1074; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1077; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072; &#1080; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1105;&#1085; &#1079;&#1076;&#1077;&#1089;&#1100; (&#1076;&#1083;&#1103; FreeCAD &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 0.21).
</p>
</div>
<p>&#1044;&#1083;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; (objects):
</p>
<ul><li><code>App::GeoFeatureGroupExtensionPython</code></li>
<li><code>App::GroupExtensionPython</code></li>
<li><code>App::LinkBaseExtensionPython</code></li>
<li><code>App::LinkExtensionPython</code></li>
<li><code>App::OriginGroupExtensionPython</code></li>
<li><code>App::SuppressibleExtensionPython</code></li>
<li><code>Part::AttachExtensionPython</code></li>
<li><code>TechDraw::CosmeticExtensionPython</code></li></ul>
<p>&#1044;&#1083;&#1103; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; (view objects):
</p>
<ul><li><code>Gui::ViewProviderExtensionPython</code></li>
<li><code>Gui::ViewProviderGeoFeatureGroupExtensionPython</code></li>
<li><code>Gui::ViewProviderGroupExtensionPython</code></li>
<li><code>Gui::ViewProviderOriginGroupExtensionPython</code></li>
<li><code>Gui::ViewProviderSuppressibleExtensionPython</code></li>
<li><code>PartGui::ViewProviderAttachExtensionPython</code></li>
<li><code>PartGui::ViewProviderGridExtensionPython</code></li>
<li><code>PartGui::ViewProviderSplineExtensionPython</code></li></ul>
<p>&#1057;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1103;, &#1085;&#1086; &#1086;&#1085;&#1080; &#1085;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1090; &#1082;&#1072;&#1082; &#1090;&#1072;&#1082;&#1086;&#1074;&#1099;&#1077;:
</p>
<ul><li><code>App::ExtensionPython</code></li>
<li><code>Part::PreviewExtensionPython</code></li>
<li><code>PartGui::ViewProviderPreviewExtensionPython</code></li>
<li><code>TechDrawGui::ViewProviderCosmeticExtensionPython</code></li>
<li><code>TechDrawGui::ViewProviderDrawingViewExtensionPython</code></li>
<li><code>TechDrawGui::ViewProviderPageExtensionPython</code></li>
<li><code>TechDrawGui::ViewProviderTemplateExtensionPython</code></li></ul>
<p><span id="Further_information"></span>
</p>
<h2><span id=".D0.94.D0.BE.D0.BF.D0.BE.D0.BB.D0.BD.D0.B8.D1.82.D0.B5.D0.BB.D1.8C.D0.BD.D0.B0.D1.8F_.D0.B8.D0.BD.D1.84.D0.BE.D1.80.D0.BC.D0.B0.D1.86.D0.B8.D1.8F"></span><span class="mw-headline" id="&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103;_&#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;">&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;</span></h2>
<p>&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1042;&#1080;&#1082;&#1080; FreeCAD&#1072;:
</p>
<ul><li><a href="../ru/Scripted_objects_saving_attributes.html" title="Scripted objects saving attributes/ru">&#1057;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1074;&#1099;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;, &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099;</a></li>
<li><a href="../ru/Scripted_objects_migration.html" title="Scripted objects migration/ru">&#1052;&#1080;&#1075;&#1088;&#1072;&#1094;&#1080;&#1103; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1074;&#1099;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;</a></li>
<li><a href="../ru/Scripted_objects_with_attachment.html" title="Scripted objects with attachment/ru">&#1057;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1074;&#1099;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1089; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084;</a></li>
<li><a href="../ru/Viewprovider.html" title="Viewprovider/ru">Viewproviders (&#1055;&#1088;&#1086;&#1074;&#1072;&#1081;&#1076;&#1077;&#1088; &#1042;&#1080;&#1076;&#1072;)</a></li></ul>
<p>&#1048;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1099;&#1077; &#1090;&#1077;&#1084;&#1099; &#1092;&#1086;&#1088;&#1091;&#1084;&#1072; &#1087;&#1088;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1074;:
</p>
<ul><li><a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?f=22&amp;t=13740">Python object attributes lost at load</a></li>
<li><a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=12139">New FeaturePython is grey</a></li>
<li><a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?f=18&amp;t=44009">Explanation on dumps and loads</a>, <a rel="nofollow" class="external text" href="https://docs.python.org/3/library/pickle.html#object.__getstate__">official documentation</a></li>
<li><a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?f=18&amp;t=13460&amp;start=20#p109709">Eigenmode frequency always 0?</a></li>
<li><a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?f=22&amp;t=21330">how to implement python feature's setEdit properly?</a></li></ul>
<p>&#1042; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; &#1082; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072;&#1084;, &#1087;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; FreeCAD <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/blob/master/src/Mod/TemplatePyMod/FeaturePython.py">src/Mod/TemplatePyMod/FeaturePython.py</a>, &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1097;&#1080;&#1081;&#1089;&#1103; &#1074; &#1087;&#1072;&#1087;&#1082;&#1077; &#1089; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084;&#1080; &#1082;&#1086;&#1076;&#1072;&#1084;&#1080; FreeCAD.
</p><p><br>
</p>
<div class="docnav">
    <div><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-left.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span> <a href="../ru/Topological_data_scripting.html" title="Topological data scripting/ru">&#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1090;&#1086;&#1087;&#1086;&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;</a></div>
    <div><a href="../ru/Scenegraph.html" title="Scenegraph/ru">&#1043;&#1088;&#1072;&#1092; &#1089;&#1094;&#1077;&#1085;&#1099;</a>
 <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-right.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span></div>
    <div><a href="../ru/Online_Help_Toc.html" title="Online Help Toc/ru">&#1054;&#1075;&#1083;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;</a> <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Online_Help_Toc.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span></div>
</div>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><span typeof="mw:File"><a href="../index.php?title=Power_user_hub.png&amp;filetimestamp=20200511213015&amp;.html" class="mw-file-description"><img src="../File/Power_user_hub.png" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="128" data-file-height="128"></a></span> <a href="../ru/Power_users_hub.html" title="Power users hub/ru">Power user documentation</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b>FreeCAD scripting:</b> <a href="../ru/Python.html" title="Python/ru">Python</a>, <a href="../ru/Introduction_to_Python.html" title="Introduction to Python/ru">Introduction to Python</a>, <a href="../ru/Python_scripting_tutorial.html" title="Python scripting tutorial/ru">Python scripting tutorial</a>, <a href="../ru/FreeCAD_Scripting_Basics.html" title="FreeCAD Scripting Basics/ru">FreeCAD Scripting Basics</a></li></ul>
<hr>
<ul><li><b>Modules:</b> <a href="../ru/Builtin_modules.html" title="Builtin modules/ru">Builtin modules</a>, <a href="../ru/Units.html" title="Units/ru">Units</a>, <a href="../ru/Quantity.html" title="Quantity/ru">Quantity</a></li>
<li><b>Workbenches:</b> <a href="../ru/Workbench_creation.html" title="Workbench creation/ru">Workbench creation</a>, <a href="../ru/Gui_Command.html" title="Gui Command/ru">Gui Commands</a>, <a href="../ru/Command.html" title="Command/ru">Commands</a>, <a href="../ru/Installing_more_workbenches.html" title="Installing more workbenches/ru">Installing more workbenches</a></li>
<li><b>Meshes and Parts:</b> <a href="../ru/Mesh_Scripting.html" title="Mesh Scripting/ru">Mesh Scripting</a>, <a href="../ru/Topological_data_scripting.html" title="Topological data scripting/ru">Topological data scripting</a>, <a href="../ru/Mesh_to_Part.html" title="Mesh to Part/ru">Mesh to Part</a>, <a href="../ru/PythonOCC.html" title="PythonOCC/ru">PythonOCC</a></li></ul>
<hr>
<ul><li><b>Parametric objects:</b> <a class="mw-selflink selflink">Scripted objects</a>, <a href="../ru/Viewprovider.html" title="Viewprovider/ru">Viewproviders</a> <small>(<a href="../ru/Custom_icon_in_tree_view.html" title="Custom icon in tree view/ru">Custom icon in tree view</a>)</small></li>
<li><b>Scenegraph:</b> <a href="../ru/Scenegraph.html" title="Scenegraph/ru">Coin (Inventor) scenegraph</a>, <a href="../ru/Pivy.html" title="Pivy/ru">Pivy</a></li>
<li><b>Graphical interface:</b> <a href="../ru/Interface_creation.html" title="Interface creation/ru">Interface creation</a>, <a href="../ru/Dialog_creation.html" title="Dialog creation/ru">Interface creation completely in Python</a> <small>(<a href="../index.php?title=Dialog_creation_with_various_widgets/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation with various widgets/ru (page does not exist)">1</a>, <a href="../index.php?title=Dialog_creation_reading_and_writing_files/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation reading and writing files/ru (page does not exist)">2</a>, <a href="../index.php?title=Dialog_creation_setting_colors/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation setting colors/ru (page does not exist)">3</a>, <a href="../index.php?title=Dialog_creation_image_and_animated_GIF/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation image and animated GIF/ru (page does not exist)">4</a>, <a href="../index.php?title=PySide_usage_snippets/ru&amp;action=edit&amp;redlink=1.html" class="new" title="PySide usage snippets/ru (page does not exist)">5</a>)</small>, <a href="../ru/PySide.html" title="PySide/ru">PySide</a>, PySide examples <a href="../ru/PySide_Beginner_Examples.html" title="PySide Beginner Examples/ru">beginner</a>, <a href="../ru/PySide_Intermediate_Examples.html" title="PySide Intermediate Examples/ru">intermediate</a>, <a href="../ru/PySide_Advanced_Examples.html" title="PySide Advanced Examples/ru">advanced</a></li>
<li><b>Macros:</b> <a href="../ru/Macros.html" title="Macros/ru">Macros</a>, <a href="../ru/How_to_install_macros.html" title="How to install macros/ru">How to install macros</a></li>
<li><b>Embedding:</b> <a href="../ru/Embedding_FreeCAD.html" title="Embedding FreeCAD/ru">Embedding FreeCAD</a>, <a href="../ru/Embedding_FreeCADGui.html" title="Embedding FreeCADGui/ru">Embedding FreeCADGui</a></li></ul>
<hr>
<ul><li><b>Other:</b> <a href="../ru/Expressions.html" title="Expressions/ru">Expressions</a>, <a href="../ru/Code_snippets.html" title="Code snippets/ru">Code snippets</a>, <a href="../ru/Line_drawing_function.html" title="Line drawing function/ru">Line drawing function</a>, <a href="../ru/FreeCAD_vector_math_library.html" title="FreeCAD vector math library/ru">FreeCAD vector math library</a> <small>(deprecated)</small></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="../ru/User_hub.html" title="User hub/ru">User hub</a>, <a href="../ru/Power_users_hub.html" title="Power users hub/ru">Power users hub</a>, <a href="../ru/Developer_hub.html" title="Developer hub/ru">Developer hub</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20260121205649
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.204 seconds
Real time usage: 0.834 seconds
Preprocessor visited node count: 1150/1000000
Post&#8208;expand include size: 14053/2097152 bytes
Template argument size: 33895/2097152 bytes
Highest expansion depth: 5/100
Expensive parser function count: 19/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 137473/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%  108.980      1 -total
 34.26%   37.337     19 Template:Code
 30.59%   33.340      1 Template:Powerdocnavi/ru
 10.45%   11.387    119 Template:Incode
  6.65%    7.243      1 Template:TOCright
  4.51%    4.915      1 Template:Navigation_menu_2
  4.32%    4.703      2 Template:Docnav/ru
  3.25%    3.547      1 Template:Version/ru
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:1121-0!canonical and timestamp 20260121205648 and revision id 1742083. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>