<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Template:UnfinishedDocu/ru</span></h1><?xml encoding="UTF-8"><div class="mw-parser-output"><div class="redirectMsg"><p>Redirect to:</p><ul class="redirectText"><li><a href="../Template;UnfinishedDocu.html" title="Template:UnfinishedDocu">Template:UnfinishedDocu</a></li></ul></div><div style="text-align:center; background:#FDE0A8;margin:1em 7em;padding:0.5em 2em;border:2px solid #FF5706;">
<p>&#1069;&#1090;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1085;&#1077; &#1079;&#1072;&#1082;&#1086;&#1085;&#1095;&#1077;&#1085;&#1072;. &#1055;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1087;&#1086;&#1084;&#1086;&#1075;&#1080;&#1090;&#1077; &#1080; &#1074;&#1085;&#1077;&#1089;&#1080;&#1090;&#1077; &#1089;&#1074;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076; &#1074; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1091; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080;.
</p><p><a href="../ru/GuiCommand_model.html" title="GuiCommand model/ru">&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; Gui</a> &#1086;&#1073;&#1098;&#1103;&#1089;&#1085;&#1103;&#1077;&#1090;, &#1082;&#1072;&#1082; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1079;&#1072;&#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1099; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;. &#1055;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; <a href="../Category;UnfinishedDocu.html" title="Category:UnfinishedDocu"> Category:UnfinishedDocu</a>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1085;&#1077;&#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1105;&#1085;&#1085;&#1099;&#1093; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;, &#1087;&#1086;&#1076;&#1086;&#1073;&#1085;&#1099;&#1093; &#1101;&#1090;&#1086;&#1081;. &#1057;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; <a href="../Category;Command_Reference.html" title="Category:Command Reference"> Category:Command Reference</a> &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;.
</p><p>&#1057;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; <a href="../ru/WikiPages.html" title="WikiPages/ru">Wiki &#1057;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;</a>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1079;&#1085;&#1072;&#1090;&#1100; &#1086; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1074;&#1080;&#1082;&#1080;-&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;, &#1080; &#1079;&#1072;&#1081;&#1076;&#1080;&#1090;&#1077; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; <a href="../ru/Help_FreeCAD.html" title="Help FreeCAD/ru">&#1055;&#1086;&#1084;&#1086;&#1075;&#1080; FreeCAD</a>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1079;&#1085;&#1072;&#1090;&#1100; &#1086; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1072;&#1093;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084;&#1080; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1074;&#1085;&#1077;&#1089;&#1090;&#1080; &#1089;&#1074;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076;.
</p>
</div>
<hr>
<p>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1101;&#1090;&#1086;&#1090; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;&#1093; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1074; &#1089;&#1090;&#1072;&#1076;&#1080;&#1080; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1080;&#1083;&#1080; &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1074;&#1072;&#1078;&#1085;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;.
</p><p>&#1064;&#1072;&#1073;&#1083;&#1086;&#1085; &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; &#1074; <a href="../ru/Category;UnfinishedDocu.html" title="Category:UnfinishedDocu/ru">Category:UnfinishedDocu/ru</a>. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1101;&#1090;&#1091; &#1082;&#1072;&#1090;&#1077;&#1075;&#1086;&#1088;&#1080;&#1102;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1099;&#1083;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1099;, &#1085;&#1086; &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103;.
</p>
<!-- 
NewPP limit report
Cached time: 20250419181514
Cache expiry: 86400
Reduced expiry: false
Complications: [no&#8208;toc&#8208;conversion]
CPU time usage: 0.004 seconds
Real time usage: 0.005 seconds
Preprocessor visited node count: 6/1000000
Post&#8208;expand include size: 12/2097152 bytes
Template argument size: 0/2097152 bytes
Highest expansion depth: 2/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 0/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    0.000      1 -total
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:170203-0!canonical and timestamp 20250419181514 and revision id 1578226. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>