<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Viewprovider/ru</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="ru" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Viewprovider&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/Viewprovider.html" class="mw-pt-progress mw-pt-progress--complete" title="Viewprovider (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Viewprovider.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Viewprovider (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../fr/Viewprovider.html" class="mw-pt-progress mw-pt-progress--complete" title="Viewprovider (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/Viewprovider.html" class="mw-pt-progress mw-pt-progress--complete" title="Viewprovider (100% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Viewprovider.html" class="mw-pt-progress mw-pt-progress--complete" title="Dostawca widoku (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</span></li></ul></div>
<p><span id="Introduction"></span>
</p>
<h2><span id=".D0.92.D0.B2.D0.B5.D0.B4.D0.B5.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;">&#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;</span></h2>
<p><a class="mw-selflink selflink">Viewproviders - &#1055;&#1086;&#1089;&#1090;&#1072;&#1074;&#1097;&#1080;&#1082;&#1042;&#1080;&#1076;&#1072;</a> - &#1101;&#1090;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099;, &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1102;&#1097;&#1080;&#1077;, &#1082;&#1072;&#1082; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1073;&#1091;&#1076;&#1091;&#1090; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1077;&#1090;&#1100; &#1074; <a href="../ru/Tree_view.html" title="Tree view/ru">&#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;</a> &#1080; <a href="../ru/3D_view.html" title="3D view/ru">3D &#1074;&#1080;&#1076;&#1077;</a>, &#1080; &#1082;&#1072;&#1082; &#1086;&#1085;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1099;&#1084;&#1080; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;&#1080; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103;&#1084;&#1080;, &#1090;&#1072;&#1082;&#1080;&#1084;&#1080; &#1082;&#1072;&#1082; <a href="../ru/Selection_methods.html" title="Selection methods/ru">&#1074;&#1099;&#1073;&#1086;&#1088;</a>.
</p><p>&#1054;&#1085;&#1080; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1103;&#1102;&#1090; <a href="../ru/Scripted_objects.html" title="Scripted objects/ru">&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1074;</a>. &#1042; &#1090;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1082;&#1072;&#1082; &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1081; &#1082;&#1083;&#1072;&#1089;&#1089; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1074;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1077;&#1075;&#1086; <a href="../ru/Property.html" title="Property/ru">properties - &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;</a> <i>data - &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;</i> , viewprovider &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1077;&#1075;&#1086; <a href="../ru/Property.html" title="Property/ru">properties - &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;</a> <i>view - &#1074;&#1080;&#1076;</i> . &#1069;&#1090;&#1080; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081; &#1086;&#1073; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1077;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1086;&#1085;&#1080; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1085;&#1091;&#1102; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102;, &#1090;&#1072;&#1082;&#1091;&#1102; &#1082;&#1072;&#1082; &#1096;&#1080;&#1088;&#1080;&#1085;&#1072; &#1083;&#1080;&#1085;&#1080;&#1080;, &#1094;&#1074;&#1077;&#1090; &#1083;&#1080;&#1085;&#1080;&#1080;, &#1094;&#1074;&#1077;&#1090; &#1075;&#1088;&#1072;&#1085;&#1080; &#1080; &#1090;. &#1076;. &#1042; &#1089;&#1077;&#1072;&#1085;&#1089;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1072;&#1083;&#1086;&#1084; viewprovider &#1085;&#1077; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072; &#1076;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; &#1101;&#1090;&#1080;&#1084;&#1080; &#1074;&#1080;&#1076;&#1080;&#1084;&#1099;&#1084;&#1080; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;&#1084;&#1080;.
</p><p>&#1050;&#1072;&#1082; &#1080; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1074;&#1080;&#1076;&#1072; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099; &#1095;&#1077;&#1088;&#1077;&#1079; <a href="../ru/Property_editor.html" title="Property editor/ru">&#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;</a>.
</p><p><span id="Python_view_providers"></span>
</p>
<h2><span id="Python_.D0.9F.D0.BE.D1.81.D1.82.D0.B0.D0.B2.D1.89.D0.B8.D0.BA.D0.92.D0.B8.D0.B4.D0.B0"></span><span class="mw-headline" id="Python_&#1055;&#1086;&#1089;&#1090;&#1072;&#1074;&#1097;&#1080;&#1082;&#1042;&#1080;&#1076;&#1072;">Python &#1055;&#1086;&#1089;&#1090;&#1072;&#1074;&#1097;&#1080;&#1082;&#1042;&#1080;&#1076;&#1072;</span></h2>
<p>&#1050;&#1083;&#1072;&#1089;&#1089;&#1099; viewproviders &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090; <code>ViewProvider</code> &#1074; &#1089;&#1074;&#1086;&#1077;&#1084; &#1080;&#1084;&#1077;&#1085;&#1080;. &#1054;&#1085;&#1080; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103; &#1085;&#1072; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; <code>ViewObject</code> &#1073;&#1072;&#1079;&#1086;&#1074;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;.
</p><p>&#1042; &#1101;&#1090;&#1086;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; &#1084;&#1099; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1084; &#1076;&#1074;&#1072; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1076;&#1083;&#1103; viewprovider, &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1077;&#1089;&#1083;&#1080; &#1086;&#1085;&#1080; &#1077;&#1097;&#1105; &#1085;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090;, &#1080; &#1087;&#1088;&#1080;&#1089;&#1074;&#1072;&#1080;&#1074;&#1072;&#1077;&#1084; &#1080;&#1084; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;. &#1052;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076; <code>onChanged</code>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1088;&#1072;&#1079;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103;. &#1053;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086; &#1080;&#1084;&#1077;&#1085;&#1080;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1076;&#1074;&#1091;&#1093; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090; &#1092;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1091;&#1102; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091; &#1087;&#1086; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1102; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1072; &#1080;&#1083;&#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1077; &#1077;&#1075;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072;.
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="c1"># views/view_custom.py</span>
<span class="k">class</span> <span class="nc">ViewProviderCustom</span><span class="p">:</span>
<span class="w">    </span><span class="sd">"""Viewprovider of the custom object."""</span>

    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">vobj</span><span class="p">):</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">Object</span> <span class="o">=</span> <span class="n">vobj</span><span class="o">.</span><span class="n">Object</span>

        <span class="bp">self</span><span class="o">.</span><span class="n">_set_properties</span><span class="p">(</span><span class="n">vobj</span><span class="p">)</span>
        <span class="n">vobj</span><span class="o">.</span><span class="n">Proxy</span> <span class="o">=</span> <span class="bp">self</span>

    <span class="k">def</span> <span class="nf">_set_properties</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">vobj</span><span class="p">):</span>
        <span class="k">if</span> <span class="ow">not</span> <span class="nb">hasattr</span><span class="p">(</span><span class="n">vobj</span><span class="p">,</span> <span class="s2">"Pattern"</span><span class="p">):</span>
            <span class="n">vobj</span><span class="o">.</span><span class="n">addProperty</span><span class="p">(</span><span class="s2">"App::PropertyEnumeration"</span><span class="p">,</span>
                             <span class="s2">"Pattern"</span><span class="p">,</span>
                             <span class="s2">"Custom"</span><span class="p">,</span>
                             <span class="s2">"Defines a hatch pattern for this object."</span><span class="p">)</span>
            <span class="n">vobj</span><span class="o">.</span><span class="n">Pattern</span> <span class="o">=</span> <span class="p">[</span><span class="s2">"None"</span><span class="p">,</span> <span class="s2">"diagonals"</span><span class="p">,</span> <span class="s2">"cross"</span><span class="p">,</span> <span class="s2">"brick"</span><span class="p">]</span>

        <span class="k">if</span> <span class="ow">not</span> <span class="nb">hasattr</span><span class="p">(</span><span class="n">vobj</span><span class="p">,</span> <span class="s2">"PatternSize"</span><span class="p">):</span>
            <span class="n">vobj</span><span class="o">.</span><span class="n">addProperty</span><span class="p">(</span><span class="s2">"App::PropertyFloat"</span><span class="p">,</span>
                             <span class="s2">"PatternSize"</span><span class="p">,</span>
                             <span class="s2">"Custom"</span><span class="p">,</span>
                             <span class="s2">"Defines the size of the hatch pattern."</span><span class="p">)</span>
            <span class="n">vobj</span><span class="o">.</span><span class="n">PatternSize</span> <span class="o">=</span> <span class="mi">1</span>

    <span class="k">def</span> <span class="nf">onChanged</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">vobj</span><span class="p">,</span> <span class="n">prop</span><span class="p">):</span>
        <span class="k">if</span> <span class="n">prop</span> <span class="ow">in</span> <span class="s2">"Pattern"</span><span class="p">:</span>
            <span class="bp">self</span><span class="o">.</span><span class="n">_set_pattern</span><span class="p">(</span><span class="n">vobj</span><span class="o">.</span><span class="n">Pattern</span><span class="p">)</span>
        <span class="k">if</span> <span class="n">prop</span> <span class="ow">in</span> <span class="s2">"PatternSize"</span><span class="p">:</span>
            <span class="bp">self</span><span class="o">.</span><span class="n">_set_size</span><span class="p">(</span><span class="n">vobj</span><span class="o">.</span><span class="n">PatternSize</span><span class="p">)</span>

    <span class="k">def</span> <span class="nf">_set_pattern</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">pattern</span><span class="p">):</span>
        <span class="o">...</span>

    <span class="k">def</span> <span class="nf">_set_size</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">size</span><span class="p">):</span>
        <span class="o">...</span>
</pre></div>
<p>&#1054;&#1073;&#1099;&#1095;&#1085;&#1086; &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1086;&#1082;&#1089;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, <code>CustomObject</code>, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; viewprovider, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, <code>ViewProviderCustom</code>. Viewprovider &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1072;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082; &#1084;&#1099; &#1091;&#1073;&#1077;&#1076;&#1080;&#1083;&#1080;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; <code>ViewObject</code> &#1085;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090;, &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1074;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1076;&#1083;&#1103; &#1085;&#1072;&#1096;&#1077;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1105;&#1090; &#1082; &#1086;&#1096;&#1080;&#1073;&#1082;&#1077;.
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="kn">import</span> <span class="nn">FreeCAD</span> <span class="k">as</span> <span class="nn">App</span>
<span class="kn">import</span> <span class="nn">objects.custom</span> <span class="k">as</span> <span class="nn">custom</span>
<span class="kn">import</span> <span class="nn">views.view_custom</span> <span class="k">as</span> <span class="nn">view_custom</span>

<span class="n">doc</span> <span class="o">=</span> <span class="n">App</span><span class="o">.</span><span class="n">newDocument</span><span class="p">()</span>
<span class="n">obj</span> <span class="o">=</span> <span class="n">doc</span><span class="o">.</span><span class="n">addObject</span><span class="p">(</span><span class="s2">"Part::FeaturePython"</span><span class="p">,</span> <span class="s2">"Custom"</span><span class="p">)</span>

<span class="n">custom</span><span class="o">.</span><span class="n">CustomObject</span><span class="p">(</span><span class="n">obj</span><span class="p">)</span>

<span class="k">if</span> <span class="n">App</span><span class="o">.</span><span class="n">GuiUp</span><span class="p">:</span>
    <span class="n">view_custom</span><span class="o">.</span><span class="n">ViewProviderCustom</span><span class="p">(</span><span class="n">obj</span><span class="o">.</span><span class="n">ViewObject</span><span class="p">)</span>
</pre></div>
<p><span id="Custom_icons"></span>
</p>
<h2><span id=".D0.9F.D0.BE.D0.BB.D1.8C.D0.B7.D0.BE.D0.B2.D0.B0.D1.82.D0.B5.D0.BB.D1.8C.D1.81.D0.BA.D0.B8.D0.B5_.D0.B8.D0.BA.D0.BE.D0.BD.D0.BA.D0.B8"></span><span class="mw-headline" id="&#1055;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1077;_&#1080;&#1082;&#1086;&#1085;&#1082;&#1080;">&#1055;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1077; &#1080;&#1082;&#1086;&#1085;&#1082;&#1080;</span></h2>
<p>&#1056;&#1077;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1074; &#1084;&#1077;&#1090;&#1086;&#1076; <code>getIcon</code>, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1080;&#1082;&#1086;&#1085;&#1082;&#1091;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; <a href="../ru/Tree_view.html" title="Tree view/ru">&#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;</a> &#1074; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080; <a href="../ru/Combo_view.html" title="Combo view/ru">&#1082;&#1086;&#1084;&#1073;&#1086; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080;</a>.
</p><p>&#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1084;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1086;&#1083;&#1085;&#1099;&#1084; &#1087;&#1091;&#1090;&#1105;&#1084; &#1082; &#1080;&#1082;&#1086;&#1085;&#1082;&#1077;.
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="kn">import</span> <span class="nn">os</span>
<span class="n">some_path</span> <span class="o">=</span> <span class="s2">"/home/user/.FreeCAD/custom_icons"</span>

<span class="k">class</span> <span class="nc">ViewProviderCustom</span><span class="p">:</span>
    <span class="o">...</span>

    <span class="k">def</span> <span class="nf">getIcon</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
        <span class="k">return</span> <span class="n">os</span><span class="o">.</span><span class="n">path</span><span class="o">.</span><span class="n">join</span><span class="p">(</span><span class="n">some_path</span><span class="p">,</span> <span class="s2">"my_icon.svg"</span><span class="p">)</span>
</pre></div>
<p>&#1054;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1091;&#1090;&#1100; &#1082; &#1080;&#1082;&#1086;&#1085;&#1082;&#1077; &#1074; &#1089;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1084; &#1092;&#1072;&#1081;&#1083;&#1077; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1072;.
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="kn">import</span> <span class="nn">MyModule_rc.py</span>

<span class="k">class</span> <span class="nc">ViewProviderCustom</span><span class="p">:</span>
    <span class="o">...</span>

    <span class="k">def</span> <span class="nf">getIcon</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
        <span class="k">return</span> <span class="s2">":/icons/my_icon.svg"</span>
</pre></div>
<p>&#1053;&#1077;&#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085;&#1085;&#1072;&#1103; <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/X_PixMap">&#1080;&#1082;&#1086;&#1085;&#1082;&#1072; XPM (&#1072;&#1085;&#1075;&#1083;.)</a> <a rel="nofollow" class="external text" href="https://ru.wikipedia.org/wiki/X_Pixmap">(&#1088;&#1091;&#1089;.)</a>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1087;&#1086; &#1089;&#1091;&#1090;&#1080; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; ASCII-&#1075;&#1088;&#1072;&#1092;&#1080;&#1082;&#1086;&#1081;.
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="kn">import</span> <span class="nn">MyModule_rc.py</span>

<span class="k">class</span> <span class="nc">ViewProviderCustom</span><span class="p">:</span>
    <span class="o">...</span>

    <span class="k">def</span> <span class="nf">getIcon</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
        <span class="k">return</span> <span class="s2">"""</span>
<span class="s2">               /* XPM */</span>
<span class="s2">               static char *Some_icon_xpm[] = {</span>
<span class="s2">               /* columns rows colors chars-per-pixel */</span>
<span class="s2">               "16 16 3 1 ",</span>
<span class="s2">               "  c None",</span>
<span class="s2">               ". c #D71414",</span>
<span class="s2">               "+ c #AA1919",</span>
<span class="s2">               /* pixels */</span>
<span class="s2">               "                ",</span>
<span class="s2">               "  +          +  ",</span>
<span class="s2">               " +.+        +.+ ",</span>
<span class="s2">               "  +.+      +.+  ",</span>
<span class="s2">               "   +        +   ",</span>
<span class="s2">               "      ++++      ",</span>
<span class="s2">               "     +....+     ",</span>
<span class="s2">               "     +...++     ",</span>
<span class="s2">               "     +..+++     ",</span>
<span class="s2">               "     +.++.+     ",</span>
<span class="s2">               "      ++++      ",</span>
<span class="s2">               "   +        +   ",</span>
<span class="s2">               "  +.+      +.+  ",</span>
<span class="s2">               " +.+        +.+ ",</span>
<span class="s2">               "  +          +  ",</span>
<span class="s2">               "                "</span>
<span class="s2">               };</span>
<span class="s2">               """</span>
</pre></div>
<p>&#1057;&#1084;&#1086;&#1090;&#1088;&#1080; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; <a href="../ru/Custom_icon_in_tree_view.html" title="Custom icon in tree view/ru">&#1055;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1077; &#1080;&#1082;&#1086;&#1085;&#1082;&#1080; &#1074; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;</a>.
</p>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: #fefefe;"><span typeof="mw:File"><a href="../index.php?title=Power_user_hub.png&amp;filetimestamp=20200511213015&amp;.html" class="mw-file-description"><img src="../File/Power_user_hub.png" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="128" data-file-height="128"></a></span> <a href="../ru/Power_users_hub.html" title="Power users hub/ru">Power user documentation</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid #aaaaaa; text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: #fefefe;">
<ul><li><b>FreeCAD scripting:</b> <a href="../ru/Python.html" title="Python/ru">Python</a>, <a href="../ru/Introduction_to_Python.html" title="Introduction to Python/ru">Introduction to Python</a>, <a href="../ru/Python_scripting_tutorial.html" title="Python scripting tutorial/ru">Python scripting tutorial</a>, <a href="../ru/FreeCAD_Scripting_Basics.html" title="FreeCAD Scripting Basics/ru">FreeCAD Scripting Basics</a></li></ul>
<hr>
<ul><li><b>Modules:</b> <a href="../ru/Builtin_modules.html" title="Builtin modules/ru">Builtin modules</a>, <a href="../ru/Units.html" title="Units/ru">Units</a>, <a href="../ru/Quantity.html" title="Quantity/ru">Quantity</a></li>
<li><b>Workbenches:</b> <a href="../ru/Workbench_creation.html" title="Workbench creation/ru">Workbench creation</a>, <a href="../ru/Gui_Command.html" title="Gui Command/ru">Gui Commands</a>, <a href="../ru/Command.html" title="Command/ru">Commands</a>, <a href="../ru/Installing_more_workbenches.html" title="Installing more workbenches/ru">Installing more workbenches</a></li>
<li><b>Meshes and Parts:</b> <a href="../ru/Mesh_Scripting.html" title="Mesh Scripting/ru">Mesh Scripting</a>, <a href="../ru/Topological_data_scripting.html" title="Topological data scripting/ru">Topological data scripting</a>, <a href="../ru/Mesh_to_Part.html" title="Mesh to Part/ru">Mesh to Part</a>, <a href="../ru/PythonOCC.html" title="PythonOCC/ru">PythonOCC</a></li></ul>
<hr>
<ul><li><b>Parametric objects:</b> <a href="../ru/Scripted_objects.html" title="Scripted objects/ru">Scripted objects</a>, <a class="mw-selflink selflink">Viewproviders</a> <small>(<a href="../ru/Custom_icon_in_tree_view.html" title="Custom icon in tree view/ru">Custom icon in tree view</a>)</small></li>
<li><b>Scenegraph:</b> <a href="../ru/Scenegraph.html" title="Scenegraph/ru">Coin (Inventor) scenegraph</a>, <a href="../ru/Pivy.html" title="Pivy/ru">Pivy</a></li>
<li><b>Graphical interface:</b> <a href="../ru/Interface_creation.html" title="Interface creation/ru">Interface creation</a>, <a href="../ru/Dialog_creation.html" title="Dialog creation/ru">Interface creation completely in Python</a> <small>(<a href="../index.php?title=Dialog_creation_with_various_widgets/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation with various widgets/ru (page does not exist)">1</a>, <a href="../index.php?title=Dialog_creation_reading_and_writing_files/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation reading and writing files/ru (page does not exist)">2</a>, <a href="../index.php?title=Dialog_creation_setting_colors/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation setting colors/ru (page does not exist)">3</a>, <a href="../index.php?title=Dialog_creation_image_and_animated_GIF/ru&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation image and animated GIF/ru (page does not exist)">4</a>, <a href="../index.php?title=PySide_usage_snippets/ru&amp;action=edit&amp;redlink=1.html" class="new" title="PySide usage snippets/ru (page does not exist)">5</a>)</small>, <a href="../ru/PySide.html" title="PySide/ru">PySide</a>, PySide examples <a href="../ru/PySide_Beginner_Examples.html" title="PySide Beginner Examples/ru">beginner</a>, <a href="../ru/PySide_Intermediate_Examples.html" title="PySide Intermediate Examples/ru">intermediate</a>, <a href="../ru/PySide_Advanced_Examples.html" title="PySide Advanced Examples/ru">advanced</a></li>
<li><b>Macros:</b> <a href="../ru/Macros.html" title="Macros/ru">Macros</a>, <a href="../ru/How_to_install_macros.html" title="How to install macros/ru">How to install macros</a></li>
<li><b>Embedding:</b> <a href="../ru/Embedding_FreeCAD.html" title="Embedding FreeCAD/ru">Embedding FreeCAD</a>, <a href="../ru/Embedding_FreeCADGui.html" title="Embedding FreeCADGui/ru">Embedding FreeCADGui</a></li></ul>
<hr>
<ul><li><b>Other:</b> <a href="../ru/Expressions.html" title="Expressions/ru">Expressions</a>, <a href="../ru/Code_snippets.html" title="Code snippets/ru">Code snippets</a>, <a href="../ru/Line_drawing_function.html" title="Line drawing function/ru">Line drawing function</a>, <a href="../ru/FreeCAD_vector_math_library.html" title="FreeCAD vector math library/ru">FreeCAD vector math library</a> <small>(deprecated)</small></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="../ru/User_hub.html" title="User hub/ru">User hub</a>, <a href="../ru/Power_users_hub.html" title="Power users hub/ru">Power users hub</a>, <a href="../ru/Developer_hub.html" title="Developer hub/ru">Developer hub</a></li></ul></div>
    </div></div>
<div style="clear:both"></div>
<!-- 
NewPP limit report
Cached time: 20250726050007
Cache expiry: 86400
Reduced expiry: false
Complications: []
CPU time usage: 0.056 seconds
Real time usage: 0.073 seconds
Preprocessor visited node count: 198/1000000
Post&#8208;expand include size: 6597/2097152 bytes
Template argument size: 4927/2097152 bytes
Highest expansion depth: 5/100
Expensive parser function count: 5/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 11535/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    9.272      1 -total
 35.25%    3.268      1 Template:Powerdocnavi/ru
 23.74%    2.201      5 Template:Code
 16.64%    1.543      1 Template:Navigation_menu_2
 12.47%    1.156      7 Template:Incode
 11.55%    1.071      2 Template:Emphasis
  7.81%    0.724      1 Template:Clear
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:303199-0!canonical and timestamp 20250726050007 and revision id 1618774. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>