<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">WebTools Git/ru</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="ru" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-WebTools+Git&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/WebTools_Git.html" class="mw-pt-progress mw-pt-progress--med" title="WebWerkzeuge Git (69% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../WebTools_Git.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="WebTools Git (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/WebTools_Git.html" class="mw-pt-progress mw-pt-progress--med" title="HerramientasWeb Git (62% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/WebTools_Git.html" class="mw-pt-progress mw-pt-progress--complete" title="WebTools Git (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/WebTools_Git.html" class="mw-pt-progress mw-pt-progress--med" title="Arch Git (31% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/WebTools_Git.html" class="mw-pt-progress mw-pt-progress--complete" title="Narz&#281;dzia Web Git (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../ro/WebTools_Git.html" class="mw-pt-progress mw-pt-progress--med" title="Arch: Git (31% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--med" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</span></li></ul></div>
<table class="fcinfobox wikitable ct" width="100%" style="float: right; width: 230px; margin-left: 1em">
<tbody><tr>
<td class="ctTitle" style="font-weight: bold; font-size: 125%;">
<p><span class="mw-default-size" typeof="mw:File"><span><img src="../File/WebTools_Git.svg" decoding="async" width="32" height="32" class="mw-file-element" data-file-width="97" data-file-height="97"></span></span><span> </span>WebTools Git&rlm;&lrm;
</p>
</td></tr>
<tr>
<th class="ctOdd">&#1056;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074; &#1084;&#1077;&#1085;&#1102;
</th></tr>
<tr>
<td class="ctEven">Web Tools &rarr; Git
</td></tr>
<tr>
<th class="ctOdd">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;
</th></tr>
<tr>
<td class="ctEven"><a href="../ru/WebTools_Workbench.html" title="WebTools Workbench/ru">WebTools - &#1042;&#1077;&#1073;&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;</a>
</td></tr>
<tr>
<th class="ctOdd">&#1041;&#1099;&#1089;&#1090;&#1088;&#1099;&#1077; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080;
</th></tr>
<tr>
<td class="ctEven"><i>&#1053;&#1077;&#1090;</i>
</td></tr>
<tr>
<th class="ctOdd">&#1055;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1086; &#1074; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080;
</th></tr>
<tr>
<td class="ctEven">0.17
</td></tr>
<tr>
<th class="ctOdd">&#1057;&#1084;. &#1090;&#1072;&#1082;&#1078;&#1077;
</th></tr>
<tr>
<td class="ctEven"><i>&#1053;&#1077;&#1090;</i>
</td></tr>
<tr>
<td class="ctToc"><br><meta property="mw:PageProp/toc">
</td></tr></tbody></table>
<div id="itsfree" style="text-align:center;color:black;background:#FDE0A8;margin:1em 7em;padding:0.5em 2em;border:2px solid #FF5706;">&#1053;&#1072;&#1095;&#1080;&#1085;&#1072;&#1103; &#1089; FreeCAD v0.17, &#1101;&#1090;&#1086;&#1090; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1073;&#1099;&#1083; &#1091;&#1076;&#1072;&#1083;&#1105;&#1085; &#1080;&#1079; &#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; Arch &#1080; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100;&#1102; &#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1075;&#1086; <a href="../ru/WebTools_Workbench.html" title="WebTools Workbench/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; WebTools (&#1042;&#1077;&#1073;&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;)</a>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1095;&#1077;&#1088;&#1077;&#1079; &#1084;&#1077;&#1085;&#1102; &#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &rarr; <span typeof="mw:File"><a href="../index.php?title=AddonManager.svg&amp;filetimestamp=20250123011258&amp;.html" class="mw-file-description"><img src="../File/AddonManager.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Std_AddonMgr.html" title="Std AddonMgr/ru">&#1052;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1081;</a>.
</div>
<p><span id="Description"></span>
</p>
<h2><span id=".D0.9E.D0.BF.D0.B8.D1.81.D0.B0.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;">&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;</span></h2>
<p>&#1069;&#1090;&#1086;&#1090; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1090;&#1077;&#1073;&#1077; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; <a rel="nofollow" class="external text" href="https://ru.wikipedia.org/wiki/Git_%28software%29">Git</a>. Git &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1084;&#1086;&#1097;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1086;&#1081; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1103; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1084;&#1086;&#1078;&#1077;&#1090; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1084;&#1080; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103;&#1084;&#1080; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1080; &#1086;&#1090;&#1089;&#1083;&#1077;&#1078;&#1080;&#1074;&#1072;&#1090;&#1100; &#1080;&#1093; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;.
</p><p>Git &#1076;&#1086;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086; &#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;, &#1090;&#1077;&#1073;&#1077; &#1083;&#1091;&#1095;&#1096;&#1077; &#1080;&#1079;&#1091;&#1095;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086; &#1086;&#1089;&#1085;&#1086;&#1074;&#1099;, &#1087;&#1077;&#1088;&#1077;&#1076; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1101;&#1090;&#1086;&#1075;&#1086; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1079;&#1073;&#1077;&#1078;&#1072;&#1090;&#1100; &#1087;&#1086;&#1090;&#1077;&#1088;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1042;&#1089;&#1077;&#1086;&#1073;&#1098;&#1077;&#1084;&#1083;&#1102;&#1097;&#1072;&#1103; &#1083;&#1080;&#1090;&#1077;&#1088;&#1072;&#1090;&#1091;&#1088;&#1072; &#1086; Git &#1083;&#1077;&#1075;&#1082;&#1086; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1080;&#1085;&#1090;&#1077;&#1088;&#1085;&#1077;&#1090;&#1077;.
</p><p><b>&#1053;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1077; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077;:</b> &#1063;&#1090;&#1086;&#1073;&#1099; &#1080;&#1084;&#1077;&#1090;&#1100; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084;, &#1087;&#1072;&#1082;&#1077;&#1090; <a rel="nofollow" class="external text" href="https://github.com/gitpython-developers/GitPython">gitpython</a> &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085; &#1074; &#1090;&#1074;&#1086;&#1077;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077;. &#1042; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077; linux &#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074;&#1086;&#1074;, gitpython &#1077;&#1089;&#1090;&#1100; &#1074; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1086;&#1084; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1080; &#1087;&#1086;&#1076; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; <i>gitpython</i> &#1080;&#1083;&#1080; <i>python-git</i>.
</p><p><span id="Usage"></span>
</p>
<h2><span id=".D0.9F.D1.80.D0.B8.D0.BC.D0.B5.D0.BD.D0.B5.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1055;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;">&#1055;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;</span></h2>
<ol><li>&#1059;&#1073;&#1077;&#1076;&#1080;&#1089;&#1100;, &#1095;&#1090;&#1086; <a href="../ru/Report_view.html" title="Report view/ru">&#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1055;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1072; &#1086;&#1090;&#1095;&#1105;&#1090;&#1072;</a> &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1072;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; Git &#1073;&#1091;&#1076;&#1091;&#1090; &#1087;&#1077;&#1095;&#1072;&#1090;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1085;&#1077;&#1081;.</li>
<li>&#1057;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1081; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1081; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;, &#1091;&#1073;&#1077;&#1076;&#1080;&#1074;&#1096;&#1080;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1105;&#1085;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1084; git-&#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1077;. &#1054;&#1085; &#1084;&#1086;&#1078;&#1077;&#1090; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103; &#1074; &#1087;&#1086;&#1076;&#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1077;.</li>
<li>&#1042;&#1099;&#1073;&#1077;&#1088;&#1080; &#1084;&#1077;&#1085;&#1102; <b>Web Tools &rarr; <span typeof="mw:File"><a href="../index.php?title=WebTools_Git.svg&amp;filetimestamp=20201228195436&amp;.html" class="mw-file-description"><img src="../File/WebTools_Git.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="97" data-file-height="97"></a></span> <a class="mw-selflink selflink">Git</a></b></li>
<li>&#1069;&#1090;&#1086; &#1086;&#1090;&#1082;&#1088;&#1086;&#1077;&#1090; <a href="../ru/Task_panel.html" title="Task panel/ru">&#1055;&#1072;&#1085;&#1077;&#1083;&#1100; &#1079;&#1072;&#1076;&#1072;&#1095;</a> &#1074; <a href="../ru/Combo_view.html" title="Combo view/ru">&#1050;&#1086;&#1084;&#1073;&#1086; &#1074;&#1080;&#1076;&#1077;</a>.</li></ol>
<p><span id="Options"></span>
</p>
<h2><span id=".D0.9F.D0.B0.D1.80.D0.B0.D0.BC.D0.B5.D1.82.D1.80.D1.8B"></span><span class="mw-headline" id="&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;">&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;</span></h2>
<figure class="mw-default-size" typeof="mw:File/Thumb"><a href="../index.php?title=Arch_Git_panel.jpg&amp;filetimestamp=20160706152521&amp;.html" class="mw-file-description"><img src="../File/Arch_Git_panel.jpg" decoding="async" width="259" height="667" class="mw-file-element" data-file-width="259" data-file-height="667"></a><figcaption>&#1042;&#1082;&#1083;&#1072;&#1076;&#1082;&#1072; &#1047;&#1072;&#1076;&#1072;&#1095;&#1080; &#1089; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1086;&#1084; Git</figcaption></figure>
<ul><li>&#1050;&#1085;&#1086;&#1087;&#1082;&#1072; <b>Log</b> &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;, &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1077; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1074; &#1078;&#1091;&#1088;&#1085;&#1072;&#1083;&#1077;. &#1042;&#1099;&#1074;&#1086;&#1076; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; <code>git log</code>.</li>
<li>&#1050;&#1085;&#1086;&#1087;&#1082;&#1072; <b>Refresh</b> &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1085;&#1086; &#1087;&#1088;&#1086;&#1089;&#1082;&#1072;&#1085;&#1080;&#1088;&#1091;&#1077;&#1090; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1077; &#1085;&#1072; &#1087;&#1088;&#1077;&#1076;&#1084;&#1077;&#1090; &#1080;&#1079;&#1084;&#1077;&#1085;&#1105;&#1085;&#1085;&#1099;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;. &#1055;&#1086;&#1089;&#1083;&#1077; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102;.</li>
<li>&#1050;&#1085;&#1086;&#1087;&#1082;&#1072; <b>Diff</b> &#1087;&#1086;&#1082;&#1072;&#1078;&#1077;&#1090; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1080;&#1103; &#1084;&#1077;&#1078;&#1076;&#1091; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1077;&#1081; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; &#1080; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1077;&#1081;, &#1093;&#1088;&#1072;&#1085;&#1103;&#1097;&#1077;&#1081;&#1089;&#1103; &#1074; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1080;. &#1042;&#1099;&#1074;&#1086;&#1076; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; <code>git diff</code>.
<ul><li>&#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1073;&#1080;&#1085;&#1072;&#1088;&#1085;&#1099;&#1081; diff, &#1076;&#1083;&#1103; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1075;&#1086; diff-&#1072; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; <code>fcinfo</code>.</li></ul></li>
<li>&#1050;&#1085;&#1086;&#1087;&#1082;&#1072; <b>Select all</b> &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090; &#1074;&#1089;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; &#1076;&#1083;&#1103; &#1092;&#1080;&#1082;&#1089;&#1072;&#1094;&#1080;&#1080;.</li>
<li>&#1050;&#1085;&#1086;&#1087;&#1082;&#1072; <i>Commit'</i> &#1079;&#1072;&#1092;&#1080;&#1082;&#1089;&#1080;&#1088;&#1091;&#1077;&#1090; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099;. &#1053;&#1077; &#1079;&#1072;&#1073;&#1091;&#1076;&#1100;&#1090;&#1077; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1086; &#1092;&#1080;&#1082;&#1089;&#1072;&#1094;&#1080;&#1080;, &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1102;&#1097;&#1077;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1099; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1077;.</li>
<li>&#1050;&#1085;&#1086;&#1087;&#1082;&#1072; <b>Pull</b> &#1073;&#1091;&#1076;&#1077;&#1090; <b>&#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1090;&#1100;</b> &#1074;&#1089;&#1077; &#1085;&#1086;&#1074;&#1099;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1074; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1077; &#1089; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1091;&#1076;&#1072;&#1083;&#1105;&#1085;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072;. &#1045;&#1089;&#1083;&#1080; &#1092;&#1072;&#1081;&#1083;, &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1081; &#1074; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1074; FreeCAD, &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1090;&#1086; &#1087;&#1086;&#1103;&#1074;&#1080;&#1090;&#1089;&#1103; &#1087;&#1088;&#1077;&#1076;&#1091;&#1087;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077;, &#1080; &#1074;&#1099; &#1089;&#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1083;&#1080;&#1073;&#1086; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1092;&#1072;&#1081;&#1083; &#1089;&#1085;&#1086;&#1074;&#1072;, &#1083;&#1080;&#1073;&#1086; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086; &#1074; &#1076;&#1088;&#1091;&#1075;&#1086;&#1084; &#1084;&#1077;&#1089;&#1090;&#1077;.</li>
<li>&#1050;&#1085;&#1086;&#1087;&#1082;&#1072; <b>Push</b> &#1073;&#1091;&#1076;&#1077;&#1090; <b>&#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1090;&#1100;</b> &#1074;&#1072;&#1096;&#1080; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1077; &#1092;&#1080;&#1082;&#1089;&#1072;&#1094;&#1080;&#1080; &#1085;&#1072; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1081; &#1091;&#1076;&#1072;&#1083;&#1105;&#1085;&#1085;&#1099;&#1081; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;.</li></ul>
<p><span id="Limitations"></span>
</p>
<h2><span id=".D0.9E.D0.B3.D1.80.D0.B0.D0.BD.D0.B8.D1.87.D0.B5.D0.BD.D0.B8.D1.8F"></span><span class="mw-headline" id="&#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103;">&#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103;</span></h2>
<ul><li>The tool cannot create new repositories yet. You must have an existing local repository already created. (FreeCAD will check if the current document file is inside a Git repository.)</li>
<li>The tool cannot change or create branches. You must do that manually with standard Git tools.</li></ul>
<h2><span class="mw-headline" id="Enabling_human-readable_diffs_for_FCStd_files_with_the_fcinfo_utility">Enabling human-readable diffs for FCStd files with the fcinfo utility</span></h2>
<p>FreeCAD's <a href="../File_Format_FCStd.html" title="File Format FCStd">FCStd file format</a> is a zip-based binary format, for which Git cannot produce proper diffs. This means that you cannot see what has changed between one version and another, and also that each new version stored in the Git repository is a full copy of the file.
</p><p>Although the second problem currently has no solution, the first one can be solved with a little tool available from the FreeCAD source code, called <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/blob/master/src/Tools/fcinfo">fcinfo</a>.  Git can be told to use the fcinfo utility to print a human-friendly report of a FCStd file, and, when asked to produce a diff between two FCStd files, will produce a diff between the two fcinfo reports instead. Please note that this is only visual feedback,  a full copy of the file will still be stored internally.
</p><p>Example of a diff produced with fcinfo:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">diff</span> <span class="o">--</span><span class="n">git</span> <span class="n">a</span><span class="o">/</span><span class="n">testhouse</span><span class="o">.</span><span class="n">FcStd</span> <span class="n">b</span><span class="o">/</span><span class="n">testhouse</span><span class="o">.</span><span class="n">FcStd</span>
<span class="n">index</span> <span class="mi">08077</span><span class="n">b6</span><span class="o">.</span><span class="mf">.985</span><span class="n">b1d8</span> <span class="mi">100644</span>
<span class="o">---</span> <span class="n">a</span><span class="o">/</span><span class="n">testhouse</span><span class="o">.</span><span class="n">FcStd</span>
<span class="o">+++</span> <span class="n">b</span><span class="o">/</span><span class="n">testhouse</span><span class="o">.</span><span class="n">FcStd</span>
<span class="o">@@</span> <span class="o">-</span><span class="mi">1</span><span class="p">,</span><span class="mi">26</span> <span class="o">+</span><span class="mi">1</span><span class="p">,</span><span class="mi">25</span> <span class="o">@@</span>
<span class="o">-</span><span class="n">Document</span><span class="p">:</span> <span class="o">/</span><span class="n">tmp</span><span class="o">/</span><span class="mi">43</span><span class="n">un09_testhouse</span><span class="o">.</span><span class="n">FcStd</span> <span class="p">(</span><span class="mi">442</span><span class="n">K</span><span class="p">)</span>
<span class="o">-</span>   <span class="n">SHA1</span><span class="p">:</span> <span class="mi">67</span><span class="n">c1985a45d93cba57d5bf44490897aba460100d</span>
<span class="o">+</span><span class="n">Document</span><span class="p">:</span> <span class="o">/</span><span class="n">tmp</span><span class="o">/</span><span class="n">zfXoDd_testhouse</span><span class="o">.</span><span class="n">FcStd</span> <span class="p">(</span><span class="mi">370</span><span class="n">K</span><span class="p">)</span>
<span class="o">+</span>   <span class="n">SHA1</span><span class="p">:</span> <span class="n">db1cb5fca18af7bfdca849028f40550df4d845cb</span>
    <span class="n">Comment</span> <span class="p">:</span> <span class="n">This</span> <span class="ow">is</span> <span class="n">a</span> <span class="n">test</span> <span class="n">house</span> <span class="n">to</span> <span class="n">showcase</span> <span class="n">FreeCAD</span><span class="s1">'s BIM worflow and IFC export capabilities</span>
    <span class="n">Company</span> <span class="p">:</span> <span class="n">uncreated</span><span class="o">.</span><span class="n">net</span>
    <span class="n">CreatedBy</span> <span class="p">:</span> <span class="n">Yorik</span> <span class="n">van</span> <span class="n">Havre</span>
    <span class="n">CreationDate</span> <span class="p">:</span> <span class="n">Fri</span> <span class="n">May</span>  <span class="mi">9</span> <span class="mi">12</span><span class="p">:</span><span class="mi">05</span><span class="p">:</span><span class="mi">54</span> <span class="mi">2014</span> 
    <span class="n">FileVersion</span> <span class="p">:</span> <span class="mi">1</span>
    <span class="n">Id</span> <span class="p">:</span> 
<span class="o">-</span>   <span class="n">Label</span> <span class="p">:</span> <span class="n">testhouse</span>
<span class="o">-</span>   <span class="n">LastModifiedBy</span> <span class="p">:</span> <span class="n">Yorik</span> <span class="n">van</span> <span class="n">Havre</span>
<span class="o">-</span>   <span class="n">LastModifiedDate</span> <span class="p">:</span> <span class="mi">2016</span><span class="o">-</span><span class="mi">06</span><span class="o">-</span><span class="mi">28</span><span class="n">T17</span><span class="p">:</span><span class="mi">05</span><span class="p">:</span><span class="mi">57</span><span class="o">-</span><span class="mi">03</span><span class="p">:</span><span class="mi">00</span>
<span class="o">+</span>   <span class="n">Label</span> <span class="p">:</span> <span class="n">testhouse2</span>
<span class="o">+</span>   <span class="n">LastModifiedBy</span> <span class="p">:</span> <span class="n">Yorik</span> <span class="n">van</span> <span class="n">Havre</span>
<span class="o">+</span>   <span class="n">LastModifiedDate</span> <span class="p">:</span> <span class="n">Sat</span> <span class="n">Sep</span> <span class="mi">13</span> <span class="mi">20</span><span class="p">:</span><span class="mi">46</span><span class="p">:</span><span class="mi">36</span> <span class="mi">2014</span>
<span class="o">+</span>
    <span class="n">License</span> <span class="p">:</span> <span class="n">CC</span><span class="o">-</span><span class="n">BY</span> <span class="mf">3.0</span>
    <span class="n">LicenseURL</span> <span class="p">:</span> <span class="n">http</span><span class="p">:</span><span class="o">//</span><span class="n">creativecommons</span><span class="o">.</span><span class="n">org</span><span class="o">/</span><span class="n">licenses</span><span class="o">/</span><span class="n">by</span><span class="o">/</span><span class="mf">3.0</span><span class="o">/</span>
<span class="o">-</span>   <span class="n">ProgramVersion</span> <span class="p">:</span> <span class="mf">0.17</span><span class="n">R7800</span> <span class="p">(</span><span class="n">Git</span><span class="p">)</span>
<span class="o">-</span>   <span class="n">TipName</span> <span class="p">:</span> 
<span class="o">+</span>   <span class="n">ProgramVersion</span> <span class="p">:</span> <span class="mf">0.15</span><span class="n">R3989</span> <span class="p">(</span><span class="n">Git</span><span class="p">)</span>
    <span class="n">Uid</span> <span class="p">:</span> <span class="mf">67e62</span><span class="n">d8a</span><span class="o">-</span><span class="mi">6674</span><span class="o">-</span><span class="mi">4358</span><span class="o">-</span><span class="mi">92</span><span class="n">fe</span><span class="o">-</span><span class="mi">615443</span><span class="n">be887a</span>
<span class="o">-</span>   <span class="n">Objects</span><span class="p">:</span> <span class="p">(</span><span class="mi">231</span><span class="p">)</span>
<span class="o">+</span>   <span class="n">Objects</span><span class="p">:</span> <span class="p">(</span><span class="mi">221</span><span class="p">)</span>
        <span class="n">Annotation</span> <span class="p">:</span> <span class="n">Drawing</span><span class="p">::</span><span class="n">FeatureViewAnnotation</span>
        <span class="n">Annotation001</span> <span class="p">:</span> <span class="n">Drawing</span><span class="p">::</span><span class="n">FeatureViewAnnotation</span>
        <span class="n">Annotation002</span> <span class="p">:</span> <span class="n">Drawing</span><span class="p">::</span><span class="n">FeatureViewAnnotation</span>
        <span class="n">Annotation003</span> <span class="p">:</span> <span class="n">Drawing</span><span class="p">::</span><span class="n">FeatureViewAnnotation</span>
<span class="o">-</span>       <span class="n">Annotation004</span> <span class="p">:</span> <span class="n">Drawing</span><span class="p">::</span><span class="n">FeatureViewAnnotation</span>
<span class="o">-</span>       <span class="n">Annotation005</span> <span class="p">:</span> <span class="n">Drawing</span><span class="p">::</span><span class="n">FeatureViewAnnotation</span>
        <span class="n">Array</span> <span class="p">:</span> <span class="n">Part</span><span class="p">::</span><span class="n">FeaturePython</span> <span class="p">(</span><span class="mi">9</span><span class="n">K</span><span class="p">)</span>
        <span class="n">Box</span> <span class="p">:</span> <span class="n">Part</span><span class="p">::</span><span class="n">Box</span> <span class="p">(</span><span class="mi">2</span><span class="n">K</span><span class="p">)</span>
        <span class="n">Building</span> <span class="p">:</span> <span class="n">App</span><span class="p">::</span><span class="n">DocumentObjectGroupPython</span>
<span class="o">@@</span> <span class="o">-</span><span class="mi">110</span><span class="p">,</span><span class="mi">7</span> <span class="o">+</span><span class="mi">109</span><span class="p">,</span><span class="mi">7</span> <span class="o">@@</span> <span class="n">Document</span><span class="p">:</span> <span class="o">/</span><span class="n">tmp</span><span class="o">/</span><span class="mi">43</span><span class="n">un09_testhouse</span><span class="o">.</span><span class="n">FcStd</span> <span class="p">(</span><span class="mi">442</span><span class="n">K</span><span class="p">)</span>
        <span class="n">Floor</span> <span class="p">:</span> <span class="n">App</span><span class="p">::</span><span class="n">DocumentObjectGroupPython</span>
        <span class="n">Floor001</span> <span class="p">:</span> <span class="n">App</span><span class="p">::</span><span class="n">DocumentObjectGroupPython</span>
        <span class="n">Floor002</span> <span class="p">:</span> <span class="n">App</span><span class="p">::</span><span class="n">DocumentObjectGroupPython</span>
<span class="o">-</span>       <span class="n">Frame</span> <span class="p">:</span> <span class="n">Part</span><span class="p">::</span><span class="n">FeaturePython</span> <span class="p">(</span><span class="mi">89</span><span class="n">K</span><span class="p">)</span>
</pre></div>
<p>Each FreeCAD file contains a SHA1 checksum number, which will change each time the file is saved, even if no contents was changed. So fcinfo will always print something, no matter of the contents changes.
</p><p>To enable the use of fcinfo (Linux and Mac only - TODO: add Windows instructions)
</p>
<h3><span class="mw-headline" id="Using_fcinfo_on_a_single_Git_repository">Using fcinfo on a single Git repository</span></h3>
<p>These are the steps to enable the use of fcinfo tool in a repository basis.
</p>
<ul><li>Save the fcinfo file somewhere in your system path.</li></ul>
<dl><dd>Note: Since 2023-12-09, on Arch Linux systems the <code>fcinfo</code> script is included on <code>freecad</code> package, <a rel="nofollow" class="external text" href="https://gitlab.archlinux.org/archlinux/packaging/packages/freecad/-/commit/4419bfbfdb670abebd7f2e6ed93194e819781f7d">patch here</a>.</dd></dl>
<ul><li>Make it executable.</li></ul>
<dl><dd>Note: Since 2023-12-09, on Arch Linux systems the <code>fcinfo</code> is available at <code>/usr/bin/fcinfo</code>.</dd></dl>
<ul><li>Create a <code>.gitattributes</code> file in your Git repository and add the following line in it:</li></ul>
<dl><dd><div class="mw-highlight mw-highlight-lang-text mw-content-ltr" dir="ltr"><pre><span></span>*.FCStd diff=fcinfo
</pre></div></dd></dl>
<ul><li>Add the following lines to the <code>.gitconfig</code> file in your home directory:</li></ul>
<dl><dd><div class="mw-highlight mw-highlight-lang-text mw-content-ltr" dir="ltr"><pre><span></span>[diff "fcinfo"]
textconv = /path/to/fcinfo
</pre></div></dd></dl>
<ul><li>Alternatively, if you want to invoke fcinfo with arguments (e.g., <code>--gui</code>) use <a rel="nofollow" class="external text" href="https://stackoverflow.com/questions/55601430/how-to-pass-a-filename-argument-gitconfig-diff-textconv">this approach</a>:</li></ul>
<dl><dd><div class="mw-highlight mw-highlight-lang-text mw-content-ltr" dir="ltr"><pre><span></span>[diff "fcinfo"]
textconv = sh -c '/path/to/fcinfo --gui "$0"'XD
</pre></div></dd></dl>
<p>Note that if you are working in a collaborative project you may want to include the fcinfo tool in your repository, in that case the path is relative to your Git repository root directory.
</p>
<h3><span class="mw-headline" id="Enabling_fcinfo_globally">Enabling fcinfo globally</span></h3>
<p>If you are working on many projects that need fcinfo tool you can enable it globally for your user.
</p>
<ul><li>Create a <code>$HOME/.config/git/attributes</code> file and add the following line on it:</li></ul>
<dl><dd><div class="mw-highlight mw-highlight-lang-text mw-content-ltr" dir="ltr"><pre><span></span>*.FCStd diff=fcinfo
</pre></div></dd></dl>
<ul><li>Add the following lines to the <code>$HOME/.config/git/config</code> file:
<ul><li>It's equivalent command is <code>git config --global diff.fcinfo.textconv "/path/to/fcinfo"</code>.</li>
<li>Arch Linux users using <code>freecad</code> package can use <code>{{{1}}}</code> since it's already installed on their system.</li></ul></li></ul>
<dl><dd><div class="mw-highlight mw-highlight-lang-text mw-content-ltr" dir="ltr"><pre><span></span>[diff "fcinfo"]
textconv = /path/to/fcinfo
</pre></div></dd></dl>
<p>Note that any configuration made in a repository basis overrides global configurations.
</p>
<!-- 
NewPP limit report
Cached time: 20250725181633
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.041 seconds
Real time usage: 0.055 seconds
Preprocessor visited node count: 251/1000000
Post&#8208;expand include size: 2670/2097152 bytes
Template argument size: 2845/2097152 bytes
Highest expansion depth: 6/100
Expensive parser function count: 7/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 12220/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   10.527      1 -total
 29.14%    3.068      1 Template:GuiCommand/ru
 24.61%    2.591      6 Template:Code
 14.77%    1.555     15 Template:Incode
 11.65%    1.227      1 Template:VeryImportantMessage
 10.19%    1.073      1 Template:MenuCommand
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:72068-0!canonical and timestamp 20250725181633 and revision id 1618492. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>