<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">WebTools Sketchfab/ru</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="ru" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-WebTools+Sketchfab&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/WebTools_Sketchfab.html" class="mw-pt-progress mw-pt-progress--complete" title="WebWerkzeuge Sketchfab (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../WebTools_Sketchfab.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="WebTools Sketchfab (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/WebTools_Sketchfab.html" class="mw-pt-progress mw-pt-progress--med" title="HerramientasWeb Sketchfab (56% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/WebTools_Sketchfab.html" class="mw-pt-progress mw-pt-progress--complete" title="WebTools Sketchfab (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/WebTools_Sketchfab.html" class="mw-pt-progress mw-pt-progress--med" title="WebTools Sketchfab (56% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/WebTools_Sketchfab.html" class="mw-pt-progress mw-pt-progress--complete" title="Narz&#281;dzie Web Sketchfab (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../ro/WebTools_Sketchfab.html" class="mw-pt-progress mw-pt-progress--med" title="WebTools Sketchfab (44% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</span></li></ul></div>
<table class="fcinfobox wikitable ct" width="100%" style="float: right; width: 230px; margin-left: 1em">
<tbody><tr>
<td class="ctTitle" style="font-weight: bold; font-size: 125%;">
<p><span class="mw-default-size" typeof="mw:File"><span><img src="../File/WebTools_Sketchfab.svg" decoding="async" width="32" height="32" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span><span> </span>&#1042;&#1077;&#1073;&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; Sketchfab (&#1069;&#1089;&#1082;&#1080;&#1079;&#1085;&#1072;&#1103; &#1083;&#1072;&#1073;&#1086;&#1088;&#1072;&#1090;&#1086;&#1088;&#1080;&#1103;)
</p>
</td></tr>
<tr>
<th class="ctOdd">&#1056;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074; &#1084;&#1077;&#1085;&#1102;
</th></tr>
<tr>
<td class="ctEven">Web Tools &rarr; Sketchfab
</td></tr>
<tr>
<th class="ctOdd">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;
</th></tr>
<tr>
<td class="ctEven"><a href="../ru/WebTools_Workbench.html" title="WebTools Workbench/ru">WebTools - &#1042;&#1077;&#1073;&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;</a>
</td></tr>
<tr>
<th class="ctOdd">&#1041;&#1099;&#1089;&#1090;&#1088;&#1099;&#1077; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080;
</th></tr>
<tr>
<td class="ctEven"><i>&#1053;&#1077;&#1090;</i>
</td></tr>
<tr>
<th class="ctOdd">&#1055;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1086; &#1074; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080;
</th></tr>
<tr>
<td class="ctEven">-
</td></tr>
<tr>
<th class="ctOdd">&#1057;&#1084;. &#1090;&#1072;&#1082;&#1078;&#1077;
</th></tr>
<tr>
<td class="ctEven"><i>&#1053;&#1077;&#1090;</i>
</td></tr>
<tr>
<td class="ctToc"><br><meta property="mw:PageProp/toc">
</td></tr></tbody></table>
<p><span id="Description"></span>
</p>
<h2><span id=".D0.9E.D0.BF.D0.B8.D1.81.D0.B0.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;">&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;</span></h2>
<p>&#1069;&#1090;&#1086;&#1090; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1101;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1074; &#1090;&#1074;&#1086;&#1102; &#1091;&#1095;&#1105;&#1090;&#1085;&#1091;&#1102; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; <a rel="nofollow" class="external text" href="https://sketchfab.com">SketchFab</a>. <span style="font-size:small;"><a href="../ru/Release_notes_0.17.html" title="Release notes 0.17/ru">&#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1086; &#1074; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 0.17</a></span>
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Sketchfab_exporter.jpg&amp;filetimestamp=20170316172538&amp;.html" class="mw-file-description"><img src="../File/Sketchfab_exporter.jpg" decoding="async" width="991" height="862" class="mw-file-element" data-file-width="991" data-file-height="862"></a></span>
</p><p><span id="Usage"></span>
</p>
<h2><span id=".D0.9F.D1.80.D0.B8.D0.BC.D0.B5.D0.BD.D0.B5.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1055;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;">&#1055;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;</span></h2>
<ol><li>&#1047;&#1072;&#1074;&#1077;&#1076;&#1080; &#1089;&#1077;&#1073;&#1077; &#1072;&#1082;&#1082;&#1072;&#1091;&#1085;&#1090; &#1085;&#1072; <a rel="nofollow" class="external text" href="https://sketchfab.com">SketchFab</a>, &#1077;&#1089;&#1083;&#1080; &#1091; &#1090;&#1077;&#1073;&#1103; &#1077;&#1075;&#1086; &#1077;&#1097;&#1105; &#1085;&#1077;&#1090;. &#1041;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1099;&#1077; &#1072;&#1082;&#1082;&#1072;&#1091;&#1085;&#1090;&#1099; &#1074;&#1087;&#1086;&#1083;&#1085;&#1077; &#1087;&#1086;&#1076;&#1086;&#1081;&#1076;&#1091;&#1090;, &#1072; &#1087;&#1083;&#1072;&#1090;&#1085;&#1099;&#1077; &#1076;&#1086;&#1073;&#1072;&#1074;&#1103;&#1090; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1095;&#1072;&#1089;&#1090;&#1085;&#1099;&#1093; &#1084;&#1086;&#1076;&#1077;&#1083;&#1077;&#1081; &#1080; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1081; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1077;&#1084;&#1099;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;.</li>
<li>&#1055;&#1086;&#1076;&#1075;&#1086;&#1090;&#1086;&#1074;&#1100; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1090;&#1099; &#1093;&#1086;&#1095;&#1077;&#1096;&#1100; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1100;</li>
<li>&#1053;&#1072;&#1078;&#1084;&#1080; &#1085;&#1072; &#1080;&#1082;&#1086;&#1085;&#1082;&#1091; <span typeof="mw:File"><a href="../index.php?title=WebTools_Sketchfab.svg&amp;filetimestamp=20201228195520&amp;.html" class="mw-file-description"><img src="../File/WebTools_Sketchfab.svg" decoding="async" width="32" height="32" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> &#1085;&#1072; &#1075;&#1083;&#1072;&#1074;&#1085;&#1086;&#1081; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; <a href="../ru/WebTools_Workbench.html" title="WebTools Workbench/ru">WebTools</a>.</li>
<li>&#1047;&#1072;&#1087;&#1086;&#1083;&#1085;&#1080; &#1087;&#1086;&#1083;&#1103;. &#1048;&#1084;&#1103; &#1080; &#1082;&#1083;&#1102;&#1095; API &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080;.</li>
<li>&#1053;&#1072;&#1078;&#1084;&#1080; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; "&#1047;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1100;"</li></ol>
<p><span id="Options"></span>
</p>
<h2><span id=".D0.9F.D0.B0.D1.80.D0.B0.D0.BC.D0.B5.D1.82.D1.80.D1.8B"></span><span class="mw-headline" id="&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;">&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;</span></h2>
<ul><li>&#1063;&#1090;&#1086;&#1073;&#1099; &#1101;&#1090;&#1086;&#1090; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1101;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1072; &#1084;&#1086;&#1075; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100;&#1089;&#1103; &#1082; &#1090;&#1074;&#1086;&#1077;&#1081; &#1091;&#1095;&#1105;&#1090;&#1085;&#1086;&#1081; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; Sketchfab, &#1090;&#1077;&#1073;&#1077; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084; &#1082;&#1083;&#1102;&#1095; API Sketchfab. &#1053;&#1072;&#1078;&#1072;&#1074; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; "Obtain - &#1055;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100;", &#1090;&#1099; &#1087;&#1077;&#1088;&#1077;&#1081;&#1076;&#1105;&#1096;&#1100; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082; Sketchfab, &#1075;&#1076;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085; &#1101;&#1090;&#1086;&#1090; API-&#1082;&#1083;&#1102;&#1095; (&#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1076;&#1083;&#1103; &#1090;&#1074;&#1086;&#1077;&#1081; &#1091;&#1095;&#1105;&#1090;&#1085;&#1086;&#1081; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080;). &#1057;&#1082;&#1086;&#1087;&#1080;&#1088;&#1091;&#1081; &#1082;&#1083;&#1102;&#1095; &#1080; &#1074;&#1089;&#1090;&#1072;&#1074;&#1100;&#1090;&#1077; &#1077;&#1075;&#1086; &#1074; &#1087;&#1086;&#1083;&#1077; "API-&#1082;&#1083;&#1102;&#1095;" &#1074; &#1101;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1105;&#1088;&#1077;. &#1069;&#1090;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1086; FreeCAD, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1090;&#1077;&#1073;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1076;&#1080;&#1085; &#1088;&#1072;&#1079;</li>
<li>&#1055;&#1086;&#1083;&#1077; &#1080;&#1084;&#1077;&#1085;&#1080; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;, &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1087;&#1086;&#1083;&#1103; &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1087;&#1091;&#1089;&#1090;&#1099;&#1084;&#1080;.</li>
<li>&#1069;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1105;&#1088; &#1087;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1086;&#1074; &#1101;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1072;. &#1042;&#1099;&#1073;&#1086;&#1088; &#1086;&#1087;&#1090;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1090; &#1086;&#1090; &#1090;&#1080;&#1087;&#1072; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; &#1080; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1090;&#1099; &#1093;&#1086;&#1095;&#1077;&#1096;&#1100; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1086;&#1090;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1090;&#1077;&#1073;&#1077; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1080;&#1090;. &#1050;&#1072;&#1082; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1086;, OBJ + MTL &#1076;&#1072;&#1102;&#1090; &#1083;&#1091;&#1095;&#1096;&#1080;&#1081; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100; &#1085;&#1072;&#1076; &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083;&#1072;&#1084;&#1080;, &#1072; IV (OpenInventor) - &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;, &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1086;&#1093;&#1086;&#1078;&#1080;&#1081; &#1085;&#1072; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1090;&#1099; &#1074;&#1080;&#1076;&#1080;&#1096;&#1100; &#1074; 3D-&#1074;&#1080;&#1076;&#1077; FreeCAD.</li>
<li>&#1055;&#1086;&#1089;&#1083;&#1077; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; Sketchfab &#1087;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090; &#1076;&#1086;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086; &#1087;&#1088;&#1086;&#1076;&#1074;&#1080;&#1085;&#1091;&#1090;&#1099;&#1081; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1090;&#1099; &#1084;&#1086;&#1078;&#1077;&#1096;&#1100; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083;&#1099;, &#1086;&#1089;&#1074;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1080; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1077;.</li>
<li>&#1050;&#1086;&#1075;&#1076;&#1072; &#1090;&#1099; &#1085;&#1072;&#1078;&#1080;&#1084;&#1072;&#1077;&#1096;&#1100; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; "Upload - &#1047;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1100;", &#1087;&#1086;&#1089;&#1083;&#1077; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1089;&#1105; &#1087;&#1088;&#1086;&#1096;&#1083;&#1086; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086;, &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; &#1087;&#1088;&#1077;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; "View your model online - &#1055;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1042;&#1072;&#1096;&#1091; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100; &#1086;&#1085;&#1083;&#1072;&#1081;&#1085;", &#1085;&#1072;&#1078;&#1072;&#1074; &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102;, &#1090;&#1099; &#1087;&#1077;&#1088;&#1077;&#1081;&#1076;&#1105;&#1096;&#1100; &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; &#1085;&#1072; Sketchfab.</li>
<li>&#1053;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; OBJ, &#1087;&#1086;-&#1088;&#1072;&#1079;&#1085;&#1086;&#1084;&#1091; &#1080;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1077;&#1090;&#1080;&#1088;&#1091;&#1102;&#1090;&#1089;&#1103; Sketchfab &#1080; FreeCAD. FreeCAD &#1089;&#1095;&#1080;&#1090;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1086;&#1089;&#1100; Z &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1072; &#1074;&#1074;&#1077;&#1088;&#1093;, &#1072; Sketchfab &#1089;&#1095;&#1080;&#1090;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1086;&#1085;&#1072; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1072; &#1085;&#1072; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1072; &#1079;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085;&#1086;&#1084;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1080;&#1090;&#1100; &#1101;&#1090;&#1086;, &#1087;&#1086;&#1089;&#1083;&#1077; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080; &#1101;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1105;&#1088; &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; Sketchfab API &#1076;&#1083;&#1103; &#1087;&#1086;&#1074;&#1086;&#1088;&#1086;&#1090;&#1072; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; &#1074; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;&#1077; &#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;. &#1045;&#1089;&#1083;&#1080; &#1101;&#1090;&#1072; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1085;&#1077; &#1091;&#1076;&#1072;&#1089;&#1090;&#1089;&#1103;, &#1090;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1096;&#1100; &#1087;&#1088;&#1077;&#1076;&#1091;&#1087;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077;, &#1085;&#1086; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100; &#1074;&#1089;&#1105; &#1088;&#1072;&#1074;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085;&#1072; &#1082;&#1086;&#1088;&#1088;&#1077;&#1082;&#1090;&#1085;&#1086;. &#1058;&#1099; &#1084;&#1086;&#1078;&#1077;&#1096;&#1100; &#1087;&#1086;&#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100; &#1077;&#1105; &#1074;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102; &#1074; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1077; Sketchfab, &#1085;&#1072;&#1078;&#1072;&#1074; &#1089;&#1090;&#1088;&#1077;&#1083;&#1082;&#1091; &#1074;&#1087;&#1088;&#1072;&#1074;&#1086; &#1087;&#1086;&#1084;&#1080;&#1084;&#1086; &#1086;&#1089;&#1080; &laquo;X&raquo; &#1085;&#1072; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; &#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;.</li></ul>
<!-- 
NewPP limit report
Cached time: 20250725174546
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.020 seconds
Real time usage: 0.027 seconds
Preprocessor visited node count: 69/1000000
Post&#8208;expand include size: 1326/2097152 bytes
Template argument size: 315/2097152 bytes
Highest expansion depth: 6/100
Expensive parser function count: 1/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1696/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    2.921      1 -total
 59.15%    1.728      1 Template:GuiCommand/ru
 38.79%    1.133      1 Template:Version/ru
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:381065-0!canonical and timestamp 20250725174546 and revision id 1618296. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>