<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">WebTools BimServer/ru</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="ru" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-WebTools+BimServer&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/WebTools_BimServer.html" class="mw-pt-progress mw-pt-progress--complete" title="WebWerkzeuge BimServer (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../WebTools_BimServer.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="WebTools BimServer (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/WebTools_BimServer.html" class="mw-pt-progress mw-pt-progress--high" title="HerramientasWeb BimServer (88% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/WebTools_BimServer.html" class="mw-pt-progress mw-pt-progress--complete" title="WebTools BimServer (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/WebTools_BimServer.html" class="mw-pt-progress mw-pt-progress--med" title="Arch BimServer (50% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/WebTools_BimServer.html" class="mw-pt-progress mw-pt-progress--complete" title="Narz&#281;dzia Web BimServer (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../ro/WebTools_BimServer.html" class="mw-pt-progress mw-pt-progress--med" title="Arch: BimServer (50% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--high" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</span></li></ul></div>
<table class="fcinfobox wikitable ct" width="100%" style="float: right; width: 230px; margin-left: 1em">
<tbody><tr>
<td class="ctTitle" style="font-weight: bold; font-size: 125%;">
<p><span class="mw-default-size" typeof="mw:File"><span><img src="../File/WebTools_BimServer.svg" decoding="async" width="32" height="32" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span><span> </span>WebTools BimServer
</p>
</td></tr>
<tr>
<th class="ctOdd">&#1056;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074; &#1084;&#1077;&#1085;&#1102;
</th></tr>
<tr>
<td class="ctEven">Web Tools &rarr; BIM server
</td></tr>
<tr>
<th class="ctOdd">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1080;
</th></tr>
<tr>
<td class="ctEven"><a href="../ru/WebTools_Workbench.html" title="WebTools Workbench/ru">WebTools - &#1042;&#1077;&#1073;&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;</a>
</td></tr>
<tr>
<th class="ctOdd">&#1041;&#1099;&#1089;&#1090;&#1088;&#1099;&#1077; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080;
</th></tr>
<tr>
<td class="ctEven"><i>&#1053;&#1077;&#1090;</i>
</td></tr>
<tr>
<th class="ctOdd">&#1055;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1086; &#1074; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080;
</th></tr>
<tr>
<td class="ctEven">-
</td></tr>
<tr>
<th class="ctOdd">&#1057;&#1084;. &#1090;&#1072;&#1082;&#1078;&#1077;
</th></tr>
<tr>
<td class="ctEven"><i>&#1053;&#1077;&#1090;</i>
</td></tr>
<tr>
<td class="ctToc"><br><meta property="mw:PageProp/toc">
</td></tr></tbody></table>
<div id="itsfree" style="text-align:center;color:black;background:#FDE0A8;margin:1em 7em;padding:0.5em 2em;border:2px solid #FF5706;">&#1053;&#1072;&#1095;&#1080;&#1085;&#1072;&#1103; &#1089; FreeCAD v0.17, &#1101;&#1090;&#1086;&#1090; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1073;&#1099;&#1083; &#1091;&#1076;&#1072;&#1083;&#1105;&#1085; &#1080;&#1079; &#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; Arch &#1080; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100;&#1102; &#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1075;&#1086; <a href="../ru/WebTools_Workbench.html" title="WebTools Workbench/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; WebTools (&#1042;&#1077;&#1073;&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;)</a>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1095;&#1077;&#1088;&#1077;&#1079; &#1084;&#1077;&#1085;&#1102; &#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &rarr; <span typeof="mw:File"><a href="../index.php?title=AddonManager.svg&amp;filetimestamp=20250123011258&amp;.html" class="mw-file-description"><img src="../File/AddonManager.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../ru/Std_AddonMgr.html" title="Std AddonMgr/ru">&#1052;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1081;</a>.
</div>
<p><span id="Description"></span>
</p>
<h2><span id=".D0.9E.D0.BF.D0.B8.D1.81.D0.B0.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;">&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;</span></h2>
<p>&#1069;&#1090;&#1072; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1086;&#1084; <a rel="nofollow" class="external text" href="https://bimserver.org/">BIMServer</a>, &#1086;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1090;&#1100; &#1092;&#1072;&#1081;&#1083;&#1099;, &#1093;&#1088;&#1072;&#1085;&#1103;&#1097;&#1080;&#1077;&#1089;&#1103; &#1085;&#1072; BIM-&#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1077;, &#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1077; &#1088;&#1077;&#1076;&#1072;&#1082;&#1094;&#1080;&#1080; &#1101;&#1090;&#1080;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;. BIMServer - &#1101;&#1090;&#1086; &#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1072;&#1103; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1085;&#1072;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1089; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084; &#1082;&#1086;&#1076;&#1086;&#1084;, &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1085;&#1072;&#1103; &#1076;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; &#1092;&#1072;&#1081;&#1083;&#1072;&#1084;&#1080; IFC. &#1042; &#1089;&#1074;&#1086;&#1105;&#1084; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1084; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1080; &#1086;&#1085;&#1072; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;&#1084;&#1080; &#1089; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1084;&#1080; IFC-&#1092;&#1072;&#1081;&#1083;&#1072;&#1084;&#1080;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1088;&#1077;&#1074;&#1080;&#1079;&#1080;&#1103;&#1084;&#1080;. &#1056;&#1072;&#1089;&#1096;&#1080;&#1088;&#1103;&#1077;&#1084;&#1072;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1073;&#1072;&#1079; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1072; &#1087;&#1083;&#1072;&#1075;&#1080;&#1085;&#1086;&#1074; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1076;&#1074;&#1080;&#1085;&#1091;&#1090;&#1099;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1076;&#1083;&#1103; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074; &#1080; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1080;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1080;&#1085;&#1090;&#1077;&#1083;&#1083;&#1077;&#1082;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1088;&#1072;&#1073;&#1086;&#1095;&#1080;&#1077; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1099; &#1089;&#1083;&#1080;&#1103;&#1085;&#1080;&#1103;.
</p><p>&#1063;&#1090;&#1086;&#1073;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1101;&#1090;&#1091; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102;, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1103;:
</p>
<ul><li>&#1052;&#1086;&#1076;&#1091;&#1083;&#1080; Python  <b>json</b> &#1080; <b>requests</b>  &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1099; &#1074; &#1090;&#1074;&#1086;&#1077;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077;.</li>
<li>&#1058;&#1077;&#1073;&#1077; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1091; BIMServer (&#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1081; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1102; <a rel="nofollow" class="external text" href="https://github.com/opensourceBIM/BIMserver/wiki">BIMServer</a>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; BIMServer &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;) &#1080; &#1091;&#1095;&#1105;&#1090;&#1085;&#1099;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; (&#1083;&#1086;&#1075;&#1080;&#1085; &#1080; &#1087;&#1072;&#1088;&#1086;&#1083;&#1100;) &#1076;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1072;. &#1053;&#1072; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1089;&#1090;&#1072;&#1090;&#1100;&#1080; &#1089;&#1090;&#1072;&#1073;&#1080;&#1083;&#1100;&#1085;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1077;&#1081; BIMServer &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; 1.4, &#1085;&#1086; &#1084;&#1099; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1084; &#1074;&#1072;&#1084; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1086;&#1076;&#1085;&#1091; &#1080;&#1079; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1093; &#1073;&#1077;&#1090;&#1072;-&#1074;&#1077;&#1088;&#1089;&#1080;&#1081; 1.5.X, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1087;&#1083;&#1072;&#1075;&#1080;&#1085;&#1086;&#1074; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; (&#1074; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 1.4 &#1087;&#1083;&#1072;&#1075;&#1080;&#1085;&#1099; &#1085;&#1091;&#1078;&#1085;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1090;&#1100; &#1074;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102;).</li>
<li>&#1042;&#1089;&#1103; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1072; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1089; BIMServer &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; IFC. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1090;&#1077;&#1073;&#1077; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1079;&#1085;&#1072;&#1090;&#1100;, &#1082;&#1072;&#1082; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1089; &#1092;&#1072;&#1081;&#1083;&#1072;&#1084;&#1080; <a href="../ru/Arch_IFC.html" title="Arch IFC/ru">IFC</a>.</li></ul>
<p><span id="Usage"></span>
</p>
<h2><span id=".D0.9F.D1.80.D0.B8.D0.BC.D0.B5.D0.BD.D0.B5.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1055;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;">&#1055;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;</span></h2>
<ol><li>&#1059;&#1073;&#1077;&#1076;&#1080;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1074;&#1099;&#1096;&#1077;&#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1077; &#1090;&#1088;&#1077;&#1073;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1099;, &#1080; &#1091; &#1090;&#1077;&#1073;&#1103; &#1077;&#1089;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1079;&#1072;&#1087;&#1091;&#1097;&#1077;&#1085;&#1085;&#1086;&#1084;&#1091; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1091; BIMServer.</li>
<li>&#1042;&#1099;&#1073;&#1077;&#1088;&#1080; &#1084;&#1077;&#1085;&#1102; <b>Web Tools &rarr; <span typeof="mw:File"><a href="../index.php?title=WebTools_BimServer.svg&amp;filetimestamp=20201228195406&amp;.html" class="mw-file-description"><img src="../File/WebTools_BimServer.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="48" data-file-height="48"></a></span> <a class="mw-selflink selflink">BIM Server</a></b></li>
<li>&#1053;&#1072;&#1078;&#1084;&#1080; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <b>Connect - &#1055;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100;&#1089;&#1103;</b> &#1080; &#1074;&#1074;&#1077;&#1076;&#1080; &#1089;&#1074;&#1086;&#1080; &#1091;&#1095;&#1105;&#1090;&#1085;&#1099;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;.</li>
<li>&#1055;&#1086;&#1089;&#1083;&#1077; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103; &#1082; BIMServer &#1074;&#1099;&#1073;&#1077;&#1088;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1076;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1074; &#1088;&#1072;&#1089;&#1082;&#1088;&#1099;&#1074;&#1072;&#1102;&#1097;&#1077;&#1084;&#1089;&#1103; &#1086;&#1082;&#1085;&#1077; <b>Project - &#1055;&#1088;&#1086;&#1077;&#1082;&#1090;</b>.</li></ol>
<p><span id="Options"></span>
</p>
<h2><span id=".D0.9F.D0.B0.D1.80.D0.B0.D0.BC.D0.B5.D1.82.D1.80.D1.8B"></span><span class="mw-headline" id="&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;">&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;</span></h2>
<figure class="mw-default-size mw-halign-right" typeof="mw:File"><a href="../index.php?title=Arch_Bimserver_panel.jpg&amp;filetimestamp=20160706152454&amp;.html" class="mw-file-description"><img src="../File/Arch_Bimserver_panel.jpg" decoding="async" width="260" height="665" class="mw-file-element" data-file-width="260" data-file-height="665"></a><figcaption></figcaption></figure>
<ul><li>&#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1074;&#1087;&#1077;&#1088;&#1074;&#1099;&#1077; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1077;&#1089;&#1100; &#1082; BIMServer &#1080;&#1079; FreeCAD, &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <b>Connect</b> &#1080; &#1074;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; URL &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1072;, &#1074;&#1072;&#1096; &#1083;&#1086;&#1075;&#1080;&#1085; (&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1072;&#1076;&#1088;&#1077;&#1089;&#1086;&#1084; &#1101;&#1083;&#1077;&#1082;&#1090;&#1088;&#1086;&#1085;&#1085;&#1086;&#1081; &#1087;&#1086;&#1095;&#1090;&#1099;) &#1080; &#1087;&#1072;&#1088;&#1086;&#1083;&#1100; &#1074; &#1087;&#1086;&#1103;&#1074;&#1080;&#1074;&#1096;&#1077;&#1084;&#1089;&#1103; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1084; &#1086;&#1082;&#1085;&#1077;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1074;&#1093;&#1086;&#1076;&#1080;&#1090;&#1100; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091; &#1087;&#1088;&#1080; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; BimServer, &#1086;&#1090;&#1084;&#1077;&#1090;&#1100;&#1090;&#1077; &#1086;&#1087;&#1094;&#1080;&#1102; <b>save credentials - &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1091;&#1095;&#1105;&#1090;&#1085;&#1099;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;</b> (&#1074;&#1072;&#1096;&#1080; &#1083;&#1086;&#1075;&#1080;&#1085; &#1080; &#1087;&#1072;&#1088;&#1086;&#1083;&#1100; &#1085;&#1077; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; FreeCAD, &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089;&#1077;&#1089;&#1089;&#1080;&#1086;&#1085;&#1085;&#1099;&#1081; cookie).</li>
<li>Once FreeCAD has successfully connected to a BIMServer instance, the <b>Connect</b> button will turn to <b>Connected</b>. Click the button again to disconnect. This will also erase the stored session cookie, so you will need to enter your credentials again next time.</li>
<li>In order to delete the session cookie manually and reset everything, you can simply delete the BIMServer URL stored in <b>Edit &rarr; Preferences &rarr; Arch &rarr; BimServer</b>.</li>
<li>The <b>Open in browser</b> button will open the web interface of the BIMServer either in FreeCAD's internal web browser, or, if you marked that option in <b>Edit &rarr; Preferences &rarr; Arch &rarr; BimServer</b>, in an external web browser. This allows for example to create new projects, or analyze the contents stored on the BIMServer.</li></ul>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span class="mw-headline" id="Downloading_revisions">Downloading revisions</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<ul><li>The <b>Project</b> drop-down box will show the available projects stored on the BIMServer. Choose one to see the available revisions for that project.</li>
<li>Select one revision and click <b>Open</b> to download and open the IFC file corresponding to that revision in FreeCAD.</li>
<li>When pressing the <b>Open</b> button, a dialog box will open to allow you to save the downloaded IFC file at a location of your choice before opening it. If you press <b>Cancel</b>, the file will be saved under a temporary name in the system's temporary directory instead.</li></ul>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span class="mw-headline" id="Uploading_revisions">Uploading revisions</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<ul><li>If you wish to upload a new revision, make sure the right project has been selected in the <b>Project</b> drop-down box</li>
<li>Choose the <b>Root object</b> you wish to upload. It must be either an <a href="../Arch_Site.html" title="Arch Site">Arch Site</a> or an <a href="../Arch_Building.html" title="Arch Building">Arch Building</a>. Only objects belonging to that root object will be uploaded.</li>
<li>Write a <b>Comment</b>, that will be the description (name) of the revision.</li>
<li>Press the <b>Upload</b> button. A dialog box will open to allow you to save the produced IFC file at a location of your choice before uploading it. If you press <b>Cancel</b>, the file will be saved under a temporary name in the system's temporary directory instead.</li></ul>
</div>
<!-- 
NewPP limit report
Cached time: 20250725190925
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.027 seconds
Real time usage: 0.034 seconds
Preprocessor visited node count: 93/1000000
Post&#8208;expand include size: 1876/2097152 bytes
Template argument size: 790/2097152 bytes
Highest expansion depth: 6/100
Expensive parser function count: 1/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1686/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    3.839      1 -total
 48.03%    1.844      1 Template:GuiCommand/ru
 23.53%    0.903      3 Template:MenuCommand
 22.51%    0.864      1 Template:VeryImportantMessage
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:72047-0!canonical and timestamp 20250725190925 and revision id 1618573. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>