<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">WikiRobots/ru</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="ru" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-WikiRobots&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/WikiRobots.html" class="mw-pt-progress mw-pt-progress--complete" title="WikiRoboter (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../WikiRobots.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="WikiRobots (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../fr/WikiRobots.html" class="mw-pt-progress mw-pt-progress--complete" title="WikiRobots (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/WikiRobots.html" class="mw-pt-progress mw-pt-progress--high" title="WikiRobots (91% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/WikiRobots.html" class="mw-pt-progress mw-pt-progress--complete" title="Robot Wiki (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</span></li></ul></div>
<div id="itsfree" style="text-align:center;color:black;background:#FDE0A8;margin:1em 7em;padding:0.5em 2em;border:2px solid #FF5706;">&#1056;&#1086;&#1073;&#1086;&#1090;&#1099; &#1086;&#1087;&#1072;&#1089;&#1085;&#1099; &#1087;&#1086; &#1089;&#1074;&#1086;&#1077;&#1081; &#1089;&#1091;&#1090;&#1080;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1084;&#1086;&#1075;&#1091;&#1090; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1080;&#1090;&#1100; &#1084;&#1085;&#1086;&#1075;&#1086; &#1074;&#1088;&#1077;&#1076;&#1072;. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1080;&#1093; &#1089; &#1086;&#1089;&#1086;&#1073;&#1086;&#1081; &#1086;&#1089;&#1090;&#1086;&#1088;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;!</div>
<p><span id="Overview"></span>
</p>
<meta property="mw:PageProp/toc">
<h2><span id=".D0.9E.D0.B1.D0.B7.D0.BE.D1.80"></span><span class="mw-headline" id="&#1054;&#1073;&#1079;&#1086;&#1088;">&#1054;&#1073;&#1079;&#1086;&#1088;</span></h2>
<p>&#1055;&#1086;&#1074;&#1090;&#1086;&#1088;&#1103;&#1102;&#1097;&#1080;&#1077;&#1089;&#1103; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1088;&#1086;&#1073;&#1086;&#1090;&#1086;&#1074; &#1080;&#1083;&#1080; &#1073;&#1086;&#1090;&#1086;&#1074;, &#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;, &#1089;&#1072;&#1084;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1097;&#1080;&#1093; &#1074; &#1074;&#1080;&#1082;&#1080;.
</p><p>&#1045;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077; &#1080; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1095;&#1072;&#1089;&#1090;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1077; &#1088;&#1086;&#1073;&#1086;&#1090;&#1099; &#1076;&#1083;&#1103; &#1074;&#1080;&#1082;&#1080;-&#1089;&#1072;&#1081;&#1090;&#1086;&#1074; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; MediaWiki &#1087;&#1086;&#1076; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; Pywikibot. &#1055;&#1086;&#1083;&#1085;&#1091;&#1102; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1089;&#1084;&#1086;&#1090;&#1088;&#1080; &#1074; <a class="external text" href="https://www.mediawiki.org/wiki/Manual:Pywikibot">&#1056;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086;:Pywikibot</a>.
</p><p>&#1042; &#1076;&#1074;&#1091;&#1093; &#1089;&#1083;&#1086;&#1074;&#1072;&#1093;, Pywikibot - &#1101;&#1090;&#1086; &#1085;&#1072;&#1073;&#1086;&#1088; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1074; &#1085;&#1072; Python, &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1085;&#1099;&#1093; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1088;&#1086;&#1076;&#1085;&#1086;&#1081; API &#1074;&#1080;&#1082;&#1080; &#1076;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; &#1074;&#1080;&#1082;&#1080;-&#1089;&#1072;&#1081;&#1090;&#1072;&#1084;&#1080;. &#1057;&#1087;&#1080;&#1089;&#1086;&#1082; API &#1076;&#1083;&#1103; &#1074;&#1080;&#1082;&#1080; FreeCAD &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1085;&#1072; &#1089;&#1072;&#1081;&#1090;&#1077; <a rel="nofollow" class="external free" href="https://wiki.freecad.org/api.php">https://wiki.freecad.org/api.php</a>
</p><p>&#1044;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086; &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; Pywikibot, &#1074;&#1072;&#1084; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;:
</p>
<ol><li>&#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1087;&#1072;&#1082;&#1077;&#1090; Pywikibot</li>
<li>&#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1090;&#1077; Pywikibot &#1076;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; FreeCAD Wiki</li>
<li>&#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1077; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1099;, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1076;&#1083;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1086;&#1081; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080;</li></ol>
<p>&#1057;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1086; &#1090;&#1086;&#1084;, &#1082;&#1072;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1090;&#1100;, &#1085;&#1072;&#1089;&#1090;&#1088;&#1072;&#1080;&#1074;&#1072;&#1090;&#1100; &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; Pywikibot. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1087;&#1086;&#1084;&#1085;&#1080;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1072; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;, &#1093;&#1086;&#1090;&#1103; &#1080; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1072;&#1103;, &#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100; &#1074; &#1079;&#1072;&#1073;&#1083;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1074; &#1085;&#1077;&#1081; &#1089;&#1084;&#1077;&#1096;&#1072;&#1085;&#1099; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080;, &#1086;&#1090;&#1085;&#1086;&#1089;&#1103;&#1097;&#1080;&#1077;&#1089;&#1103; &#1082; &#1076;&#1074;&#1091;&#1084; &#1088;&#1072;&#1079;&#1085;&#1099;&#1084; &#1082;&#1086;&#1076;&#1086;&#1074;&#1099;&#1084; &#1073;&#1072;&#1079;&#1072;&#1084; Pywikibot &#1080; &#1088;&#1072;&#1079;&#1085;&#1099;&#1084; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103;&#1084; &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1080; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1074; Pywikibot.
</p><p>&#1053;&#1080;&#1078;&#1077; &#1074;&#1099; &#1085;&#1072;&#1081;&#1076;&#1105;&#1090;&#1077; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080; &#1087;&#1086; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1077; &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1102; Pywikibot &#1074; FreeCAD wiki. &#1069;&#1090;&#1086; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1080;&#1090; &#1074;&#1072;&#1084; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100; &#1089;&#1072;&#1084;&#1099;&#1077; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1105;&#1085;&#1085;&#1099;&#1077; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080;. &#1044;&#1083;&#1103; &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1088;&#1086;&#1076;&#1074;&#1080;&#1085;&#1091;&#1090;&#1086;&#1075;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077;&#1089;&#1100; &#1082; <a class="external text" href="https://www.mediawiki.org/wiki/Manual:Pywikibot">&#1056;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1091;:Pywikibot</a>, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1082; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1084;&#1091; &#1082;&#1086;&#1076;&#1091; &#1085;&#1072; Python.
</p><p><span id="Installation"></span>
</p>
<h2><span id=".D0.A3.D1.81.D1.82.D0.B0.D0.BD.D0.BE.D0.B2.D0.BA.D0.B0"></span><span class="mw-headline" id="&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072;">&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072;</span></h2>
<p>&#1047;&#1072;&#1081;&#1076;&#1080;&#1090;&#1077; &#1085;&#1072; <a rel="nofollow" class="external free" href="https://web.archive.org/web/20250616133422/https://pywikibot.toolforge.org/">https://web.archive.org/web/20250616133422/https://pywikibot.toolforge.org/</a> &#1080; &#1089;&#1082;&#1072;&#1095;&#1072;&#1081;&#1090;&#1077; <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">package/pywikipedia/core.zip</span> (&#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1090;&#1072;&#1082;&#1078;&#1077; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1085;&#1072; github, gerrit &#1080; &#1090;. &#1076;., &#1085;&#1086; &#1101;&#1090;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1072;&#1074;&#1090;&#1086;&#1085;&#1086;&#1084;&#1085;&#1099;&#1081; &#1087;&#1072;&#1082;&#1077;&#1090;).
</p><p>&#1056;&#1072;&#1089;&#1087;&#1072;&#1082;&#1091;&#1081;&#1090;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1074; &#1085;&#1091;&#1078;&#1085;&#1099;&#1081; &#1074;&#1072;&#1084; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;.
</p><p>&#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1085;&#1077; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1090;&#1100; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080; &#1074; &#1087;&#1072;&#1087;&#1082;&#1091; Python libs, &#1074;&#1099; &#1079;&#1072;&#1082;&#1086;&#1085;&#1095;&#1080;&#1083;&#1080; (&#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1074;&#1089;&#1105; &#1077;&#1097;&#1105; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1080;&#1093;, &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1100;&#1090;&#1077; &#1092;&#1072;&#1081;&#1083; <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">INSTALL</span> &#1074; &#1073;&#1072;&#1079;&#1086;&#1074;&#1086;&#1084; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1077;).
</p><p>Pywikibot &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1089; Python 2.6 &#1080; 2.7 &#1073;&#1077;&#1079; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;. Python 3 <s>&#1087;&#1086;&#1082;&#1072; &#1085;&#1077; &#1090;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1083;&#1089;&#1103; &#1089; FreeCAD wiki</s> &#1090;&#1086;&#1078;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090;.
</p><p><span id="Configuration"></span>
</p>
<h2><span id=".D0.9D.D0.B0.D1.81.D1.82.D1.80.D0.BE.D0.B9.D0.BA.D0.B0"></span><span class="mw-headline" id="&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072;">&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072;</span></h2>
<p>&#1042;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; Python-&#1082;&#1086;&#1076; &#1074; &#1074;&#1080;&#1076;&#1077; &#1092;&#1072;&#1081;&#1083;&#1072; &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">user-config.py</span> &#1074; &#1073;&#1072;&#1079;&#1086;&#1074;&#1086;&#1084; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1077;, &#1082;&#1091;&#1076;&#1072; &#1074;&#1099; &#1088;&#1072;&#1089;&#1087;&#1072;&#1082;&#1086;&#1074;&#1072;&#1083;&#1080; <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">package/pywikipedia/core.zip</span>. (&#1095;&#1090;&#1086;&#1073;&#1099; &#1073;&#1099;&#1083;&#1086; &#1087;&#1086;&#1085;&#1103;&#1090;&#1085;&#1086;, &#1074; &#1090;&#1086;&#1084; &#1078;&#1077; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1077;, &#1075;&#1076;&#1077; &#1091;&#1078;&#1077; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1092;&#1072;&#1081;&#1083; &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">user-config.py.sample</span>).
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="c1"># -*- coding: cp437  -*-</span>
<span class="n">family</span> <span class="o">=</span> <span class="s1">'freecadwiki'</span>
<span class="n">mylang</span> <span class="o">=</span> <span class="s1">'en'</span>
<span class="n">usernames</span><span class="p">[</span><span class="s1">'freecadwiki'</span><span class="p">][</span><span class="s1">'en'</span><span class="p">]</span> <span class="o">=</span> <span class="sa">u</span><span class="s1">'&lt;&lt;yourWikiUserName&gt;&gt;'</span>
<span class="c1">#usernames['freecadwiki']['freecadwiki'] = u'&lt;&lt;yourWikiUserName&gt;&gt;'</span>
<span class="n">console_encoding</span> <span class="o">=</span> <span class="s1">'cp437'</span>
</pre></div>
<p>&#1042; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1105;&#1085;&#1085;&#1086;&#1084; &#1074;&#1099;&#1096;&#1077; &#1082;&#1086;&#1076;&#1077;:
</p>
<ul><li>&#1079;&#1072;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; <i>&lt;&lt;yourWikiUserName&gt;&gt;</i> &#1085;&#1072; &#1074;&#1072;&#1096;&#1077; &#1080;&#1084;&#1103; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; Wiki</li>
<li>&#1079;&#1072;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; <i>cp437</i> &#1085;&#1072; <i>console_encoding</i>. &#1063;&#1090;&#1086;&#1073;&#1099; &#1091;&#1079;&#1085;&#1072;&#1090;&#1100; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1082;&#1091; &#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1080;, &#1074; Windows &#1080; Linux &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1077; &#1080;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1077;&#1090;&#1072;&#1090;&#1086;&#1088; Python, &#1074;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">import sys</span>, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">print sys.stdout.encoding</span>. Python &#1074;&#1099;&#1074;&#1077;&#1076;&#1077;&#1090; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085; <span style="font-weight:normal; font-family:monospace, Consolas, Courier New, Courier; border: 1px solid #d8d8d8; padding: 2px 5px 2px 5px;">console_encoding</span>.</li></ul>
<p><br>
&#1047;&#1072;&#1090;&#1077;&#1084; &#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; Python-&#1082;&#1086;&#1076; &#1074; &#1074;&#1080;&#1076;&#1077; &#1092;&#1072;&#1081;&#1083;&#1072; &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">freecadwiki_family.py</span> &#1074; &#1087;&#1086;&#1076;&#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1077; <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">/pywikibot/families</span>. (&#1074;&#1084;&#1077;&#1089;&#1090;&#1077; &#1089; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1092;&#1072;&#1081;&#1083;&#1072;&#1084;&#1080; <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">family_xxx.py</span>).
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="c1"># -*- coding: utf-8  -*-</span>

<span class="n">__version__</span> <span class="o">=</span> <span class="s1">'$Id: 7f3891c3bbbfbd69c0b005de953514803d783d92 $'</span>

<span class="kn">from</span> <span class="nn">pywikibot</span> <span class="kn">import</span> <span class="n">family</span>


<span class="c1"># The MediaWiki family</span>
<span class="c1"># user-config.py: usernames['mediawiki']['mediawiki'] = 'User name'</span>
<span class="k">class</span> <span class="nc">Family</span><span class="p">(</span><span class="n">family</span><span class="o">.</span><span class="n">WikimediaFamily</span><span class="p">):</span>
    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
        <span class="nb">super</span><span class="p">(</span><span class="n">Family</span><span class="p">,</span> <span class="bp">self</span><span class="p">)</span><span class="o">.</span><span class="fm">__init__</span><span class="p">()</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">name</span> <span class="o">=</span> <span class="s1">'freecadwiki'</span>

        <span class="bp">self</span><span class="o">.</span><span class="n">langs</span> <span class="o">=</span> <span class="p">{</span>
            <span class="s1">'en'</span><span class="p">:</span> <span class="s1">'www.freecadweb.org'</span><span class="p">,</span>
        <span class="p">}</span>

    <span class="k">def</span> <span class="nf">scriptpath</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">code</span><span class="p">):</span>
        <span class="k">return</span> <span class="s1">'wiki'</span>

    <span class="k">def</span> <span class="nf">path</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">code</span><span class="p">):</span>
        <span class="k">return</span> <span class="s1">'/index.php'</span> <span class="c1">#The path of index.php, look at your wiki address. </span>
	 
    <span class="k">def</span> <span class="nf">apipath</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">code</span><span class="p">):</span>
        <span class="k">return</span> <span class="s1">'/api.php'</span> <span class="c1">#The path of api.php</span>

    <span class="k">def</span> <span class="nf">version</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">code</span><span class="p">):</span>
        <span class="c1"># Replace with the actual version being run on your wiki</span>
        <span class="k">return</span> <span class="s1">'1.20.3'</span>

    <span class="k">def</span> <span class="nf">protocol</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">code</span><span class="p">):</span>
<span class="w">        </span><span class="sd">"""</span>
<span class="sd">        Can be overridden to return 'https'. Other protocols are not supported.</span>
<span class="sd">        """</span>
        <span class="k">return</span> <span class="s1">'http'</span>
        <span class="c1">#return 'https' # My server uses https</span>
</pre></div>
<p><span id="Usage"></span>
</p>
<h2><span id=".D0.9F.D1.80.D0.B8.D0.BC.D0.B5.D0.BD.D0.B5.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1055;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;">&#1055;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;</span></h2>
<p>&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1074;&#1099; &#1075;&#1086;&#1090;&#1086;&#1074;&#1099; &#1082; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1091; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1074; Pywikibot. &#1057;&#1072;&#1084;&#1080; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1099; &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1074; &#1087;&#1086;&#1076;&#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1077; <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">/scripts</span>, &#1080;&#1079; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1091;&#1079;&#1085;&#1072;&#1090;&#1100; &#1080;&#1093; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1103;.
</p><p>&#1063;&#1090;&#1086;&#1073;&#1099; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1099;, &#1086;&#1090;&#1082;&#1088;&#1086;&#1081;&#1090;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1091;&#1102; &#1086;&#1073;&#1086;&#1083;&#1086;&#1095;&#1082;&#1091;, &#1087;&#1077;&#1088;&#1077;&#1081;&#1076;&#1080;&#1090;&#1077; &#1074; &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1081; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075; (&#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1086;&#1095;&#1085;&#1099;&#1081;, &#1072; &#1085;&#1077; &#1074; &#1087;&#1086;&#1076;&#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075; <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">/scripts</span>) &#1080; &#1085;&#1072;&#1087;&#1080;&#1096;&#1080;&#1090;&#1077;
</p><p><span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">python pwb.py &lt;&lt;scriptname&gt;&gt;.py -&lt;&lt;parameter&gt;&gt;</span>
</p><p>&#1088;&#1072;&#1079;&#1091;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103;, &#1079;&#1072;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; <i>&lt;&lt;scriptname&gt;&gt;</i> &#1085;&#1072; &#1080;&#1084;&#1103; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1074;&#1072;&#1089; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1072;, &#1072; <i>&lt;&lt;parameter&gt;&gt;</i> &#1085;&#1072; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;(&#1099;), &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1076;&#1083;&#1103; &#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1072;.
</p><p>&#1063;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1083;&#1102;&#1073;&#1086;&#1075;&#1086; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1072;, &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <i>-help</i>. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1072; <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">replace.py</span> (&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1089;&#1072;&#1084;&#1099;&#1093; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1099;&#1093;), &#1074;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077;
</p><p><span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">python pwb.py replace.py -help</span>
</p><p>&#1045;&#1089;&#1090;&#1100; &#1077;&#1097;&#1105; &#1086;&#1076;&#1080;&#1085; &#1086;&#1095;&#1077;&#1085;&#1100; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;, &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1074;, &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1081; <i>-simulate</i>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1090;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1073;&#1077;&#1079; &#1074;&#1088;&#1077;&#1076;&#1072; &#1076;&#1083;&#1103; &#1042;&#1080;&#1082;&#1080;. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; <b>&#1087;&#1077;&#1088;&#1077;&#1076; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1086;&#1084;</b>.
</p><p><span id="Examples"></span>
</p>
<h2><span id=".D0.9F.D1.80.D0.B8.D0.BC.D0.B5.D1.80.D1.8B"></span><span class="mw-headline" id="&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099;">&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099;</span></h2>
<p>&#1069;&#1090;&#1072; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1080;&#1090; &#1074;&#1086;&#1081;&#1090;&#1080; &#1074; &#1074;&#1080;&#1082;&#1080;
</p><p><span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">pwb.py login.py</span>
</p><p><br>
&#1069;&#1090;&#1072; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1074;&#1099;&#1074;&#1077;&#1076;&#1077;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1074;&#1089;&#1077;&#1093; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1080;&#1093; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; SourceForge
</p><p><span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">pwb.py listpages.py -weblink:sourceforge.net</span>
</p><p><br>
&#1069;&#1090;&#1072; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1079;&#1072;&#1084;&#1077;&#1085;&#1080;&#1090; &#1074;&#1089;&#1077; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1085;&#1072; &#1089;&#1090;&#1072;&#1088;&#1099;&#1081; &#1092;&#1086;&#1088;&#1091;&#1084; SourceForge &#1089;&#1089;&#1099;&#1083;&#1082;&#1072;&#1084;&#1080; &#1085;&#1072; &#1085;&#1086;&#1074;&#1099;&#1081; &#1092;&#1086;&#1088;&#1091;&#1084; freecad.org.
</p><p><span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">pwb.py replace.py -weblink:sourceforge.net/apps/phpbb/free-cad "sourceforge.net/apps/phpbb/free-cad" "forum.freecad.org"</span>
</p><p><br>
&#1069;&#1090;&#1072; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1074;&#1099;&#1074;&#1077;&#1076;&#1077;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1074;&#1089;&#1077;&#1093; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1080;&#1093; &#1089;&#1083;&#1086;&#1074;&#1086; <b>PartDesign</b>, &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1103; &#1089;&#1086; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1089; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1086;&#1084; "2d Drafting Module" &#1080; &#1076;&#1072;&#1083;&#1077;&#1077; &#1074; &#1072;&#1083;&#1092;&#1072;&#1074;&#1080;&#1090;&#1085;&#1086;&#1084; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077;
</p><p><span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">pwb.py listpages.py -start:"2d Drafting Module" -grep:PartDesign</span>
</p><p><br>
&#1069;&#1090;&#1072; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1079;&#1072;&#1084;&#1077;&#1085;&#1080;&#1090; &#1074;&#1089;&#1077; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1099;&#1077; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1085;&#1072; &#1089;&#1090;&#1072;&#1088;&#1099;&#1081; &#1092;&#1086;&#1088;&#1091;&#1084; SourceForge &#1089;&#1089;&#1099;&#1083;&#1082;&#1086;&#1081; &#1085;&#1072; &#1085;&#1086;&#1074;&#1099;&#1081; &#1092;&#1086;&#1088;&#1091;&#1084; freecad.org &#1085;&#1072; &#1087;&#1077;&#1088;&#1077;&#1074;&#1077;&#1076;&#1105;&#1085;&#1085;&#1099;&#1093; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;&#1093;
</p><p><span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">pwb.py replace.py -start:Translations:! "<a rel="nofollow" class="external free" href="https://sourceforge.net/apps/phpbb/free-cad">https://sourceforge.net/apps/phpbb/free-cad</a>" "<a rel="nofollow" class="external free" href="https://forum.freecad.org">https://forum.freecad.org</a>"</span>
</p>
<h2><span id=".D0.9A.D0.BE.D0.BC.D0.B0.D0.BD.D0.B4.D1.8B.2C_.D1.81.D0.B2.D1.8F.D0.B7.D0.B0.D0.BD.D0.BD.D1.8B.D0.B5_.D1.81_FreeCAD_Wiki"></span><span class="mw-headline" id="&#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;,_&#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1077;_&#1089;_FreeCAD_Wiki">&#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;, &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089; FreeCAD Wiki</span></h2>
<p>&#1055;&#1086;&#1076;&#1089;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1074;&#1089;&#1077; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1099;&#1081; wiki &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;
</p><p><span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">python3 pwb.py templatecount -count GuiCommand</span> 
</p><p><br>
&#1057;&#1087;&#1080;&#1089;&#1086;&#1082; &#1074;&#1089;&#1077;&#1093; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1099;&#1081; &#1074;&#1080;&#1082;&#1080;-&#1096;&#1072;&#1073;&#1083;&#1086;&#1085;
</p><p><span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">python3 pwb.py templatecount -list GuiCommand</span> 
</p><p>&#1047;&#1072;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091; &#1085;&#1072; &#1074;&#1089;&#1077;&#1093; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;&#1093;, &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1074; &#1082;&#1072;&#1090;&#1077;&#1075;&#1086;&#1088;&#1080;&#1080; Arch
</p><p><span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">python3 pwb.py replace.py -cat:Arch</span>
</p>
<!-- 
NewPP limit report
Cached time: 20250725144848
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.032 seconds
Real time usage: 0.040 seconds
Preprocessor visited node count: 224/1000000
Post&#8208;expand include size: 3632/2097152 bytes
Template argument size: 2200/2097152 bytes
Highest expansion depth: 4/100
Expensive parser function count: 2/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 5800/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    8.418      1 -total
 21.42%    1.803      2 Template:Code
 18.54%    1.561      1 Template:VeryImportantMessage
 16.25%    1.368     12 Template:SystemInput
 15.71%    1.322     11 Template:FileName
 13.14%    1.106      1 Template:SystemOutput
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:294761-0!canonical and timestamp 20250725144848 and revision id 1618113. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>