<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">WikiPages/ru</span></h1><?xml encoding="UTF-8"><div class="mw-parser-output"><div class="mw-pt-languages noprint" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../de/WikiPages.html" class="mw-pt-progress mw-pt-progress--complete" title="WikiSeiten (96% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../WikiPages.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="WikiPages (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/WikiPages.html" class="mw-pt-progress mw-pt-progress--med" title="P&aacute;ginasWiki (42% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/WikiPages.html" class="mw-pt-progress mw-pt-progress--complete" title="&Eacute;crire une page Wiki (96% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/WikiPages.html" class="mw-pt-progress mw-pt-progress--complete" title="WikiPages (96% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/WikiPages.html" class="mw-pt-progress mw-pt-progress--complete" title="Strona Wiki FreeCAD (96% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt-br/WikiPages.html" class="mw-pt-progress mw-pt-progress--high" title="PaginasWiki (76% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</span></li>
<li><a href="../zh-cn/WikiPages.html" class="mw-pt-progress mw-pt-progress--stub" title="WikiPages/zh-cn (1% translated)" lang="zh-Hans-CN" dir="ltr">&#20013;&#25991;&#65288;&#20013;&#22269;&#22823;&#38470;&#65289;</a></li>
<li><a href="../ja/WikiPages.html" class="mw-pt-progress mw-pt-progress--stub" title="Wiki&#12506;&#12540;&#12472; (13% translated)" lang="ja" dir="ltr">&#26085;&#26412;&#35486;</a></li>
<li><a href="../ko/WikiPages.html" class="mw-pt-progress mw-pt-progress--stub" title="&#50948;&#53412; &#54168;&#51060;&#51648; (6% translated)" lang="ko" dir="ltr">&#54620;&#44397;&#50612;</a></li></ul></div>
<div style="clear:right; margin-bottom: .5em; float: right; padding: .5em 0 .8em 1.4em; background: none;"><meta property="mw:PageProp/toc"></div>
<p>&#1069;&#1090;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; <a href="../Help;Editing.html" title="Help:Editing">Help:Editing</a> &#1080; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1086;&#1073;&#1097;&#1080;&#1077; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1072;&#1094;&#1080;&#1080; &#1087;&#1086; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1102; &#1080; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1102; &#1074;&#1080;&#1082;&#1080;-&#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080; FreeCAD. &#1054;&#1085;&#1072; &#1087;&#1086;&#1076;&#1074;&#1086;&#1076;&#1080;&#1090; &#1080;&#1090;&#1086;&#1075; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1081; &#1080; &#1084;&#1086;&#1079;&#1075;&#1086;&#1074;&#1099;&#1093; &#1096;&#1090;&#1091;&#1088;&#1084;&#1086;&#1074;
</p><p><span id="Before_starting"></span>
</p>
<h2><span id=".D0.9F.D1.80.D0.B5.D0.B6.D0.B4.D0.B5_.D1.87.D0.B5.D0.BC_.D0.BD.D0.B0.D1.87.D0.B0.D1.82.D1.8C"></span><span class="mw-headline" id="&#1055;&#1088;&#1077;&#1078;&#1076;&#1077;_&#1095;&#1077;&#1084;_&#1085;&#1072;&#1095;&#1072;&#1090;&#1100;">&#1055;&#1088;&#1077;&#1078;&#1076;&#1077; &#1095;&#1077;&#1084; &#1085;&#1072;&#1095;&#1072;&#1090;&#1100;</span></h2>
<div class="mw-translate-fuzzy">
<ul><li>&#1069;&#1090;&#1072; &#1074;&#1080;&#1082;&#1080;-&#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1072; &#1085;&#1072; <a class="external text" href="https://www.mediawiki.org/wiki/MediaWiki">MediaWiki</a>, &#1090;&#1086;&#1084; &#1078;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1084; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1080;, &#1095;&#1090;&#1086; &#1080; <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Main_Page">Wikipedia (&#1072;&#1085;&#1075;&#1083;.)</a> <a rel="nofollow" class="external text" href="https://ru.wikipedia.org/wiki/%D0%97%D0%B0%D0%B3%D0%BB%D0%B0%D0%B2%D0%BD%D0%B0%D1%8F_%D1%81%D1%82%D1%80%D0%B0%D0%BD%D0%B8%D1%86%D0%B0">(&#1088;&#1091;&#1089;.)</a>. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1091;&#1078;&#1077; &#1074;&#1085;&#1086;&#1089;&#1080;&#1083;&#1080; &#1089;&#1074;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076; &#1074; &#1042;&#1080;&#1082;&#1080;&#1087;&#1077;&#1076;&#1080;&#1102;, &#1090;&#1086; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1074;&#1080;&#1082;&#1080;-&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094; FreeCAD &#1085;&#1077; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090; &#1090;&#1088;&#1091;&#1076;&#1072;.</li>
<li>&#1042; &#1086;&#1090;&#1083;&#1080;&#1095;&#1080;&#1077; &#1086;&#1090; &#1042;&#1080;&#1082;&#1080;&#1087;&#1077;&#1076;&#1080;&#1080;, &#1074;&#1080;&#1082;&#1080; FreeCAD &#1079;&#1072;&#1097;&#1080;&#1097;&#1077;&#1085;&#1072; &#1086;&#1090; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1079;&#1073;&#1077;&#1078;&#1072;&#1090;&#1100; &#1089;&#1087;&#1072;&#1084;&#1072;. &#1042;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1080;&#1090;&#1100; &#1091;&#1095;&#1105;&#1090;&#1085;&#1091;&#1102; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; <a rel="nofollow" class="external text" href="http://forum.freecadweb.org/viewtopic.php?f=21&amp;t=6830">&#1085;&#1072; &#1092;&#1086;&#1088;&#1091;&#1084;&#1077;</a>.</li>
<li>&#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1088;&#1072;&#1085;&#1100;&#1096;&#1077; &#1085;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1083;&#1080;&#1089;&#1100; &#1074;&#1080;&#1082;&#1080;-&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072;&#1084;&#1080;, &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1081;&#1090;&#1077; <a href="../Help;Editing.html" title="Help:Editing">Help:Editing</a>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1080;&#1090;&#1100;&#1089;&#1103; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1086;&#1081; &#1088;&#1072;&#1079;&#1084;&#1077;&#1090;&#1082;&#1086;&#1081;.</li>
<li>&#1054; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1085;&#1099;&#1093; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1103;&#1093; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074;&#1080;&#1082;&#1080;-&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084; &#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; <a class="external text" href="https://www.mediawiki.org/wiki/Help:Contents">MediaWiki Help:Contents</a>. &#1053;&#1077; &#1074;&#1089;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; MediaWiki &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099; &#1074; &#1101;&#1090;&#1086;&#1081; &#1074;&#1080;&#1082;&#1080; FreeCAD, &#1085;&#1086; &#1084;&#1085;&#1086;&#1075;&#1080;&#1077; &#1080;&#1079; &#1085;&#1080;&#1093; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;.</li>
<li>&#1053;&#1072;&#1084; &#1085;&#1088;&#1072;&#1074;&#1080;&#1090;&#1089;&#1103;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1083;&#1077;&#1075;&#1082;&#1086; &#1095;&#1080;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1080;&#1079;&#1073;&#1077;&#1075;&#1072;&#1081;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1093; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1081;. &#1041;&#1091;&#1076;&#1100;&#1090;&#1077; &#1087;&#1088;&#1086;&#1097;&#1077;.</li>
<li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1087;&#1077;&#1089;&#1086;&#1095;&#1085;&#1080;&#1094;&#1091; &#1076;&#1083;&#1103; &#1090;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1082;&#1086;&#1076;&#1072;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, <a href="../FreeCADDocu;Sandbox.html" title="FreeCADDocu:Sandbox">FreeCADDocu:Sandbox</a> &#1080;&#1083;&#1080; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1091;&#1102; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; &#1089; &#1074;&#1072;&#1096;&#1080;&#1084; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; <a href="../index.php?title=Sandbox;Yourname&amp;action=edit&amp;redlink=1.html" class="new" title="Sandbox:Yourname (page does not exist)">Sandbox:Yourname</a>. &#1057;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; Sandbox (&#1055;&#1077;&#1089;&#1086;&#1095;&#1085;&#1080;&#1094;&#1099;) &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1087;&#1086;&#1084;&#1077;&#1097;&#1077;&#1085;&#1099; &#1074; &#1082;&#1072;&#1090;&#1077;&#1075;&#1086;&#1088;&#1080;&#1102; Sandbox. &#1069;&#1090;&#1086; &#1076;&#1077;&#1083;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1091;&#1090;&#1105;&#1084; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; <code>[[Category:Sandbox]]</code> &#1074;&#1085;&#1080;&#1079;&#1091; &#1074;&#1080;&#1082;&#1080;-&#1082;&#1086;&#1076;&#1072;.</li></ul>
<ul><li>&#1055;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077; &#1085;&#1072; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1099;. &#1042;&#1080;&#1082;&#1080; FreeCAD &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1091; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1072; &#1076;&#1083;&#1103; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094; &#1085;&#1072; &#1084;&#1085;&#1086;&#1075;&#1080;&#1093; &#1103;&#1079;&#1099;&#1082;&#1072;&#1093;. &#1044;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1103;&#1079;&#1099;&#1082;&#1086;&#1074;&#1099;&#1093; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081;. &#1053;&#1072; &#1084;&#1085;&#1086;&#1075;&#1080;&#1093; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;&#1093; &#1074;&#1099; &#1091;&#1074;&#1080;&#1076;&#1080;&#1090;&#1077; &#1090;&#1077;&#1075;&#1080;, &#1090;&#1072;&#1082;&#1080;&#1077; &#1082;&#1072;&#1082; <code>&lt;translate&gt;...&lt;/translate&gt;</code> &#1080; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1090;&#1077;&#1075;&#1086;&#1074;, &#1090;&#1072;&#1082;&#1080;&#1093; &#1082;&#1072;&#1082; <code>&lt;!--T:8--&gt;</code>. &#1055;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1077; &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1102;&#1090; &#1090;&#1072;&#1082; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1077; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;&#1099; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1072; &#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1086;&#1081; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1072;, &#1074;&#1099; &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1080;&#1093; &#1074;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102;. &#1054;&#1085;&#1080; &#1089;&#1074;&#1103;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1080; &#1080; &#1072;&#1073;&#1079;&#1072;&#1094;&#1099; &#1089; &#1080;&#1093; &#1087;&#1077;&#1088;&#1077;&#1074;&#1077;&#1076;&#1105;&#1085;&#1085;&#1099;&#1084;&#1080; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103;&#1084;&#1080;. &#1048;&#1093; &#1085;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1084;&#1077;&#1085;&#1103;&#1090;&#1100;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1101;&#1090;&#1086; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1105;&#1090; &#1082; &#1088;&#1072;&#1079;&#1088;&#1091;&#1096;&#1077;&#1085;&#1080;&#1102; &#1089;&#1074;&#1103;&#1079;&#1077;&#1081;. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100; &#1072;&#1073;&#1079;&#1072;&#1094;&#1099; &#1080;&#1083;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1092;&#1086;&#1088;&#1084;&#1091;&#1083;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080;, &#1077;&#1089;&#1083;&#1080; &#1090;&#1077;&#1075;&#1080; &#1086;&#1089;&#1090;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089; &#1085;&#1080;&#1084;&#1080;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090;&#1077; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082; &#1080;&#1083;&#1080; &#1072;&#1073;&#1079;&#1072;&#1094;, &#1074;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1087;&#1088;&#1080;&#1085;&#1072;&#1076;&#1083;&#1077;&#1078;&#1072;&#1097;&#1080;&#1081; &#1077;&#1084;&#1091; &#1090;&#1077;&#1075;. &#1055;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1087;&#1086;&#1084;&#1085;&#1080;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1093; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1086;&#1074; &#1080; &#1087;&#1072;&#1088;&#1072;&#1075;&#1088;&#1072;&#1092;&#1086;&#1074; &#1074;&#1083;&#1080;&#1103;&#1102;&#1090; &#1085;&#1072; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1077; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1099;. &#1042;&#1072;&#1096;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1086;&#1073;&#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080;. &#1055;&#1088;&#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080; &#1085;&#1086;&#1074;&#1099;&#1093; &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083;&#1086;&#1074; &#1085;&#1077; &#1073;&#1077;&#1089;&#1087;&#1086;&#1082;&#1086;&#1081;&#1090;&#1077;&#1089;&#1100;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090; &#1085;&#1086;&#1074;&#1099;&#1077; &#1090;&#1077;&#1075;&#1080; &#1087;&#1086;&#1089;&#1083;&#1077; &#1074;&#1085;&#1077;&#1089;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1072;&#1074;&#1086;&#1082;. &#1044;&#1083;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1089;&#1084;&#1086;&#1090;&#1088;&#1080; <a href="../ru/Localisation.html" title="Localisation/ru">&#1051;&#1086;&#1082;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103;</a> &#1080; &#1086;&#1088;&#1080;&#1075;&#1080;&#1085;&#1072;&#1083; <a class="external text" href="https://www.mediawiki.org/wiki/Help:Extension:Translate/Page_translation_example/ru">&#1052;&#1077;&#1076;&#1080;&#1072;&#1074;&#1080;&#1082;&#1080;:&#1056;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077;:&#1055;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;/&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1076;&#1083;&#1103; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1072;</a>.</li></ul>
</div>
<p><span id="General_guidelines"></span>
</p>
<h2><span id=".D0.9E.D0.B1.D1.89.D0.B8.D0.B5_.D1.80.D0.B5.D0.BA.D0.BE.D0.BC.D0.B5.D0.BD.D0.B4.D0.B0.D1.86.D0.B8.D0.B8"></span><span class="mw-headline" id="&#1054;&#1073;&#1097;&#1080;&#1077;_&#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1072;&#1094;&#1080;&#1080;">&#1054;&#1073;&#1097;&#1080;&#1077; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1072;&#1094;&#1080;&#1080;</span></h2>
<p><span id="Concise_descriptions"></span>
</p>
<h3><span id=".D0.9A.D1.80.D0.B0.D1.82.D0.BA.D0.B8.D0.B5_.D0.BE.D0.BF.D0.B8.D1.81.D0.B0.D0.BD.D0.B8.D1.8F"></span><span class="mw-headline" id="&#1050;&#1088;&#1072;&#1090;&#1082;&#1080;&#1077;_&#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103;">&#1050;&#1088;&#1072;&#1090;&#1082;&#1080;&#1077; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103;</span></h3>
<p>&#1055;&#1088;&#1080; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1080; FreeCAD &#1089;&#1090;&#1072;&#1088;&#1072;&#1081;&#1090;&#1077;&#1089;&#1100; &#1073;&#1099;&#1090;&#1100; &#1082;&#1088;&#1072;&#1090;&#1082;&#1080;&#1084;&#1080;, &#1080;&#1079;&#1073;&#1077;&#1075;&#1072;&#1090;&#1100; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1077;&#1085;&#1080;&#1081; &#1080; &#1080;&#1079;&#1083;&#1072;&#1075;&#1072;&#1090;&#1100; &#1089;&#1074;&#1086;&#1080; &#1084;&#1099;&#1089;&#1083;&#1080; &#1087;&#1086; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;. &#1054;&#1087;&#1080;&#1096;&#1080;&#1090;&#1077;, &#1090;&#1086; &#1095;&#1090;&#1086; FreeCAD "&#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100;", &#1072; &#1085;&#1077; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1086;&#1085; "&#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;". &#1058;&#1072;&#1082;&#1078;&#1077; &#1080;&#1079;&#1073;&#1077;&#1075;&#1072;&#1081;&#1090;&#1077; &#1088;&#1072;&#1079;&#1075;&#1086;&#1074;&#1086;&#1088;&#1085;&#1099;&#1093; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1081;, &#1090;&#1072;&#1082;&#1080;&#1093; &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1072;&#1077;&#1088; &#1082;&#1072;&#1082; "&#1087;&#1072;&#1088;&#1072;","&#1086;&#1082;&#1086;&#1083;&#1086; &#1090;&#1086;&#1075;&#1086;","&#1074;&#1088;&#1086;&#1076;&#1077;". &#1050;&#1086;&#1075;&#1076;&#1072; &#1080;&#1084;&#1077;&#1077;&#1090;&#1077; &#1076;&#1077;&#1083;&#1086; &#1089; &#1085;&#1077;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084; &#1095;&#1080;&#1089;&#1083;&#1086;&#1084;, &#1087;&#1080;&#1096;&#1080;&#1090;&#1077; "&#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;" &#1080;&#1083;&#1080; &#1091;&#1082;&#1072;&#1078;&#1080;&#1090;&#1077; &#1082;&#1086;&#1088;&#1088;&#1077;&#1082;&#1090;&#1085;&#1086;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086;.
</p>
<dl><dt>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1087;&#1083;&#1086;&#1093;&#1086;&#1075;&#1086; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103;</dt>
<dd><a href="../ru/PartDesign_Workbench.html" title="PartDesign Workbench/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; PartDesign</a>: &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; PartDesign, &#1101;&#1090;&#1086; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1076;&#1077;&#1090;&#1072;&#1083;&#1077;&#1081; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1076;&#1083;&#1103; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1093; &#1090;&#1074;&#1077;&#1088;&#1076;&#1099;&#1093; &#1076;&#1077;&#1090;&#1072;&#1083;&#1077;&#1081;.</dd></dl>
<dl><dt>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1093;&#1086;&#1088;&#1086;&#1096;&#1077;&#1075;&#1086; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103;</dt>
<dd><a href="../ru/PartDesign_Workbench.html" title="PartDesign Workbench/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; PartDesign</a>: &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1093; &#1090;&#1074;&#1077;&#1088;&#1076;&#1099;&#1093; &#1090;&#1077;&#1083;.</dd></dl>
<p><span id="Centralized_information"></span>
</p>
<h3><span id=".D0.A6.D0.B5.D0.BD.D1.82.D1.80.D0.B0.D0.BB.D0.B8.D0.B7.D0.BE.D0.B2.D0.B0.D0.BD.D0.BD.D0.B0.D1.8F_.D0.B8.D0.BD.D1.84.D0.BE.D1.80.D0.BC.D0.B0.D1.86.D0.B8.D1.8F"></span><span class="mw-headline" id="&#1062;&#1077;&#1085;&#1090;&#1088;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085;&#1085;&#1072;&#1103;_&#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;">&#1062;&#1077;&#1085;&#1090;&#1088;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085;&#1085;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;</span></h3>
<p>&#1048;&#1079;&#1073;&#1077;&#1075;&#1072;&#1081;&#1090;&#1077; &#1076;&#1091;&#1073;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1086;&#1076;&#1085;&#1086;&#1081; &#1080; &#1090;&#1086;&#1081; &#1078;&#1077; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1074; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1084;&#1077;&#1089;&#1090;&#1072;&#1093;. &#1042;&#1089;&#1090;&#1072;&#1074;&#1100;&#1090;&#1077; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1085;&#1072; &#1085;&#1086;&#1074;&#1091;&#1102; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; &#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1100;&#1090;&#1077; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1101;&#1090;&#1091; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; &#1089; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1101;&#1090;&#1072; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;.
</p><p>&#1053;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1090;&#1088;&#1072;&#1085;&#1089;&#1082;&#1083;&#1102;&#1079;&#1080;&#1074;&#1085;&#1099;&#1077; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; (<a href="../Help;Editing.html#Templates_and_transcluding_pages" title="Help:Editing">Help:Editing#Templates and transcluding pages</a>), &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1101;&#1090;&#1086; &#1079;&#1072;&#1090;&#1088;&#1091;&#1076;&#1085;&#1103;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076; &#1074;&#1080;&#1082;&#1080;. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1099;, &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1077; &#1085;&#1080;&#1078;&#1077; &#1074; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077; <a href="#Templates">#&#1064;&#1072;&#1073;&#1083;&#1086;&#1085;&#1099;</a>.
</p><p><span id="Styling"></span>
</p>
<h3><span id=".D0.A1.D1.82.D0.B8.D0.BB.D0.B8.D0.B7.D0.B0.D1.86.D0.B8.D1.8F"></span><span class="mw-headline" id="&#1057;&#1090;&#1080;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103;">&#1057;&#1090;&#1080;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103;</span></h3>
<p>&#1064;&#1072;&#1073;&#1083;&#1086;&#1085;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1086;&#1092;&#1086;&#1088;&#1084;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094; &#1089;&#1087;&#1088;&#1072;&#1074;&#1082;&#1080;. &#1054;&#1085;&#1080; &#1087;&#1088;&#1080;&#1076;&#1072;&#1102;&#1090; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080; &#1077;&#1076;&#1080;&#1085;&#1099;&#1081; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1081; &#1074;&#1080;&#1076;. &#1057;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085; &#1076;&#1083;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1084;&#1077;&#1085;&#1102;, <b>&#1060;&#1072;&#1081;&#1083; &rarr; &#1057;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100;</b>, &#1096;&#1072;&#1073;&#1083;&#1086;&#1085; &#1076;&#1083;&#1103; &#1086;&#1092;&#1086;&#1088;&#1084;&#1083;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072;&#1078;&#1072;&#1090;&#1099;&#1093; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;, <span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px;">Shift</span>, &#1076;&#1083;&#1103; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;, <code>true</code> &#1080; &#1090;.&#1076;. &#1055;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1086;&#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1100;&#1090;&#1077;&#1089;&#1100; &#1089; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1086;&#1084; <a href="#Templates">#&#1064;&#1072;&#1073;&#1083;&#1086;&#1085;&#1099;</a>, &#1087;&#1088;&#1077;&#1078;&#1076;&#1077; &#1095;&#1077;&#1084; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1089;&#1087;&#1088;&#1072;&#1074;&#1082;&#1080;.
</p><p><span id="Temporary_flags"></span>
</p>
<h3><span id=".D0.92.D1.80.D0.B5.D0.BC.D0.B5.D0.BD.D0.BD.D1.8B.D0.B5_.D1.84.D0.BB.D0.B0.D0.B3.D0.B8"></span><span class="mw-headline" id="&#1042;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077;_&#1092;&#1083;&#1072;&#1075;&#1080;">&#1042;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077; &#1092;&#1083;&#1072;&#1075;&#1080;</span></h3>
<p>&#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090;&#1077; &#1085;&#1072;&#1076; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077;&#1081;, &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1084;&#1077;&#1090;&#1080;&#1090;&#1100; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; &#1083;&#1080;&#1073;&#1086; &#1082;&#1072;&#1082; &#1085;&#1077;&#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1105;&#1085;&#1085;&#1091;&#1102;, &#1083;&#1080;&#1073;&#1086; &#1082;&#1072;&#1082; &#1085;&#1077;&#1079;&#1072;&#1082;&#1086;&#1085;&#1095;&#1077;&#1085;&#1085;&#1091;&#1102;. &#1069;&#1090;&#1086; &#1075;&#1072;&#1088;&#1072;&#1085;&#1090;&#1080;&#1088;&#1091;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1072;&#1076;&#1084;&#1080;&#1085;&#1080;&#1089;&#1090;&#1088;&#1072;&#1090;&#1086;&#1088;&#1099; wiki &#1085;&#1077; &#1087;&#1086;&#1084;&#1077;&#1090;&#1103;&#1090; &#1074;&#1072;&#1096;&#1091; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; &#1082;&#1072;&#1082; &#1075;&#1086;&#1090;&#1086;&#1074;&#1091;&#1102; &#1082; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1091;, &#1087;&#1086;&#1082;&#1072; &#1074;&#1099; &#1074;&#1089;&#1105; &#1077;&#1097;&#1105; &#1074;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077; &#1074; &#1085;&#1077;&#1105; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;.
</p><p>&#1063;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1084;&#1077;&#1090;&#1080;&#1090;&#1100; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091;, &#1076;&#1086;&#1073;&#1072;&#1074;&#1100;&#1090;&#1077; &#1083;&#1080;&#1073;&#1086; <code>{{Page in progress}}</code>, &#1083;&#1080;&#1073;&#1086; <code>{{UnfinishedDocu}}</code> &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1077;&#1088;&#1074;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;. &#1057; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <code>{{UnfinishedDocu}}</code> &#1074;&#1099; &#1087;&#1088;&#1080;&#1075;&#1083;&#1072;&#1096;&#1072;&#1077;&#1090;&#1077; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1087;&#1088;&#1080;&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1080;&#1090;&#1100;&#1089;&#1103; &#1082; &#1074;&#1072;&#1084; &#1074; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1080; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;, &#1074; &#1090;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1082;&#1072;&#1082; <code>{{Page in progress}}</code> &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1089;&#1076;&#1077;&#1083;&#1072;&#1077;&#1090;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091; &#1089;&#1072;&#1084;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1091;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1074;&#1072;&#1084; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103;.
</p><p>&#1050;&#1072;&#1082; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1072;, &#1087;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1085;&#1077; &#1079;&#1072;&#1073;&#1091;&#1076;&#1100;&#1090;&#1077; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077; &#1092;&#1083;&#1072;&#1075;&#1080;!
</p><p><span id="Examples"></span>
</p>
<h2><span id=".D0.9F.D1.80.D0.B8.D0.BC.D0.B5.D1.80.D1.8B"></span><span class="mw-headline" id="&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099;">&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099;</span></h2>
<p>&#1063;&#1090;&#1086;&#1073;&#1099; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086; &#1086;&#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1080;&#1090;&#1100;&#1089;&#1103; &#1089;&#1086; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1086;&#1081; &#1080; &#1089;&#1090;&#1080;&#1083;&#1077;&#1084; &#1074;&#1080;&#1082;&#1080; FreeCAD, &#1079;&#1072;&#1075;&#1083;&#1103;&#1085;&#1080;&#1090;&#1077; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;: <a href="../ru/GuiCommand_model.html" title="GuiCommand model/ru">&#1084;&#1086;&#1076;&#1077;&#1083;&#1100; GuiCommand</a>.
</p>
<div class="mw-collapsible mw-collapsed toccolours">
<p><span id="Structure"></span>
</p>
<h2><span id=".D0.A1.D1.82.D1.80.D1.83.D0.BA.D1.82.D1.83.D1.80.D0.B0"></span><span class="mw-headline" id="&#1057;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072;">&#1057;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072;</span></h2>
<div class="mw-collapsible-content">
<p>&#1042; <a href="../ru/User_hub.html" title="User hub/ru">&#1062;&#1077;&#1085;&#1090;&#1088;t &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;</a> &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; <a href="../ru/Online_Help_Toc.html" title="Online Help Toc/ru">&#1054;&#1075;&#1083;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;</a>. &#1054;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1076;&#1083;&#1103; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1072;&#1074;&#1090;&#1086;&#1085;&#1086;&#1084;&#1085;&#1086;&#1081; &#1089;&#1087;&#1088;&#1072;&#1074;&#1082;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1080;&#1079; FreeCAD, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1072;&#1074;&#1090;&#1086;&#1085;&#1086;&#1084;&#1085;&#1086;&#1081; PDF-&#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080;.
</p><p>&#1064;&#1072;&#1073;&#1083;&#1086;&#1085; <a href="../Template;Docnav.html" title="Template:Docnav">Template:Docnav</a> &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1087;&#1077;&#1088;&#1077;&#1083;&#1080;&#1085;&#1082;&#1086;&#1074;&#1082;&#1080; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;, &#1089;&#1083;&#1077;&#1076;&#1091;&#1103; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1077; <a href="../ru/Online_Help_Toc.html" title="Online Help Toc/ru">&#1054;&#1075;&#1083;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;</a>. &#1057;&#1087;&#1080;&#1089;&#1086;&#1082; &#1074;&#1089;&#1077;&#1093; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1086;&#1074; &#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; &#1074; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077; <a href="#Templates">#&#1064;&#1072;&#1073;&#1083;&#1086;&#1085;&#1099;</a>.
</p><p><span id="Page_names"></span>
</p>
<h3><span id=".D0.9D.D0.B0.D0.B7.D0.B2.D0.B0.D0.BD.D0.B8.D1.8F_.D0.A1.D1.82.D1.80.D0.B0.D0.BD.D0.B8.D1.86"></span><span class="mw-headline" id="&#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1103;_&#1057;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;">&#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1103; &#1057;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;</span></h3>
<p>&#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1082;&#1086;&#1088;&#1086;&#1090;&#1082;&#1080;&#1084;&#1080; &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1072;: &#1082;&#1072;&#1078;&#1076;&#1086;&#1077; &#1089;&#1083;&#1086;&#1074;&#1086; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089; &#1079;&#1072;&#1075;&#1083;&#1072;&#1074;&#1085;&#1086;&#1081; &#1073;&#1091;&#1082;&#1074;&#1099;, &#1077;&#1089;&#1083;&#1080; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1101;&#1090;&#1086; &#1085;&#1077; &#1072;&#1088;&#1090;&#1080;&#1082;&#1083;&#1080;, &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1075;&#1080;, &#1089;&#1086;&#1102;&#1079;&#1099; &#1080;&#1083;&#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1075;&#1088;&#1072;&#1084;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1095;&#1072;&#1089;&#1090;&#1080;&#1094;&#1099; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &laquo;&nbsp;&#1080;&#1079;&raquo;, &laquo;&#1085;&#1072;&raquo;, &laquo;&#1074;&raquo;, &laquo;&#1072;&raquo;, &laquo;&#1072;&#1085;&raquo;, &laquo;&#1080;&raquo;).
</p>
<dl><dt>&#1055;&#1083;&#1086;&#1093;&#1086;&#1077; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1076;&#1083;&#1103; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;</dt>
<dd></dd>
<dd>&#1050;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1103; &#1072;&#1101;&#1088;&#1086;&#1087;&#1083;&#1072;&#1085;&#1086;&#1074; AeroCompany</dd></dl>
<dl><dt>&#1061;&#1086;&#1088;&#1086;&#1096;&#1077;&#1077; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;</dt>
<dd></dd>
<dd>&#1050;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1103; &#1040;&#1101;&#1088;&#1086;&#1087;&#1083;&#1072;&#1085;&#1086;&#1074; AeroCompany</dd></dl>
<p>&#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1086;&#1074; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1075;&#1086; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1080;&#1084;&#1077;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;: <code>XYZ Workbench</code>, &#1075;&#1076;&#1077; <code>XYZ</code> - &#1101;&#1090;&#1086; &#1080;&#1084;&#1103; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; <a href="../PartDesign_Workbench.html" title="PartDesign Workbench">PartDesign Workbench</a>. &#1040; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;, &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1093; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; (&#1080;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;), &#1087;&#1088;&#1080;&#1085;&#1072;&#1076;&#1083;&#1077;&#1078;&#1072;&#1097;&#1080;&#1077; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1091;, &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1080;&#1084;&#1077;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;: <code>XYZ Command</code>, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; <a href="../PartDesign_Pad.html" title="PartDesign Pad">PartDesign Pad</a>. &#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1090;&#1072;&#1082;, &#1082;&#1072;&#1082; &#1086;&#1085;&#1086; &#1074;&#1089;&#1090;&#1088;&#1077;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1084; &#1082;&#1086;&#1076;&#1077;.
</p><p><span id="Headings"></span>
</p>
<h3><span id=".D0.97.D0.B0.D0.B3.D0.BE.D0.BB.D0.BE.D0.B2.D0.BA.D0.B8"></span><span class="mw-headline" id="&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1080;">&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1080;</span></h3>
<p>&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1080; &#1072;&#1073;&#1079;&#1072;&#1094;&#1077;&#1074; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1082;&#1086;&#1088;&#1086;&#1090;&#1082;&#1080;&#1084;&#1080; &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;: &#1074;&#1089;&#1077; &#1089;&#1083;&#1086;&#1074;&#1072;, &#1082;&#1088;&#1086;&#1084;&#1077; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1080; &#1080;&#1084;&#1105;&#1085; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1093;, &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1099; &#1089;&#1090;&#1088;&#1086;&#1095;&#1085;&#1099;&#1084;&#1080; &#1073;&#1091;&#1082;&#1074;&#1072;&#1084;&#1080;. &#1042;&#1072;&#1084; &#1085;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1080; <code>H1</code> (<code>=&nbsp;Heading&nbsp;=</code>) &#1074; &#1074;&#1072;&#1096;&#1077;&#1081; &#1074;&#1080;&#1082;&#1080;-&#1088;&#1072;&#1079;&#1084;&#1077;&#1090;&#1082;&#1077;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1075;&#1086; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1072; <code>H1</code>.
</p><p><span id="Links"></span>
</p>
<h3><span id=".D0.A1.D1.81.D1.8B.D0.BB.D0.BA.D0.B8"></span><span class="mw-headline" id="&#1057;&#1089;&#1099;&#1083;&#1082;&#1080;">&#1057;&#1089;&#1099;&#1083;&#1082;&#1080;</span></h3>
<p>&#1055;&#1086; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1086;&#1088;&#1080;&#1075;&#1080;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080;. &#1069;&#1090;&#1086; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1091;&#1090;&#1086;&#1095;&#1085;&#1080;&#1090;&#1100; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1089;&#1089;&#1099;&#1083;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072;, &#1074; &#1087;&#1077;&#1095;&#1072;&#1090;&#1085;&#1086;&#1081; &#1080;&#1083;&#1080; &#1072;&#1074;&#1090;&#1086;&#1085;&#1086;&#1084;&#1085;&#1086;&#1081; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080;. &#1055;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1080;&#1079;&#1073;&#1077;&#1075;&#1072;&#1081;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1083;&#1086;&#1074;, &#1085;&#1077; &#1085;&#1077;&#1089;&#1091;&#1097;&#1080;&#1093; &#1089;&#1084;&#1099;&#1089;&#1083;&#1086;&#1074;&#1086;&#1081; &#1085;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080; &#1076;&#1083;&#1103; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080;
</p>
<dl><dt>&#1055;&#1083;&#1086;&#1093;&#1072;&#1103; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072;</dt>
<dd>&#1044;&#1083;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1087;&#1086; &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1102; 2D &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1082;&#1083;&#1080;&#1082;&#1085;&#1080;&#1090;&#1077; <a href="../ru/Draft_Workbench.html" title="Draft Workbench/ru">&#1079;&#1076;&#1077;&#1089;&#1100;</a>.</dd></dl>
<dl><dt>&#1061;&#1086;&#1088;&#1086;&#1096;&#1072;&#1103; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072;</dt>
<dd>&#1044;&#1083;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1086; &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; 2D &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077;&#1089;&#1100; &#1082; <a href="../ru/Draft_Workbench.html" title="Draft Workbench/ru">&#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1091; Draft</a>.</dd></dl>
<p>&#1055;&#1088;&#1077;&#1076;&#1087;&#1086;&#1095;&#1090;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1086;&#1084; &#1076;&#1083;&#1103; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;:
</p><p><code>[[Name_of_Page|Name of Page]]</code>
</p><p>&#1055;&#1086;&#1089;&#1083;&#1077; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1072;:
</p><p><code>[[Name_of_page/ru|&#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1057;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;]]</code>
</p><p>&#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1076;&#1083;&#1103; &#1095;&#1072;&#1089;&#1090;&#1080; &#1087;&#1077;&#1088;&#1077;&#1076; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1084; <code>|</code> &#1074;&#1072;&#1078;&#1085;&#1072; &#1092;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072;, &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1072;&#1096;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; <code>Name_of_page</code>, &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1072;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1074;&#1074;&#1077;&#1076;&#1077;&#1090;&#1077; <code>Name_of_Page</code> (&#1074;&#1077;&#1088;&#1093;&#1085;&#1080;&#1081; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; P). &#1055;&#1077;&#1088;&#1077;&#1076; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1084; <code>|</code> &#1074;&#1089;&#1077; &#1087;&#1088;&#1086;&#1073;&#1077;&#1083;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1079;&#1072;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072;&#1084;&#1080; &#1087;&#1086;&#1076;&#1095;&#1105;&#1088;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; (<code>_</code>). &#1069;&#1090;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1085;&#1086; &#1076;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1084;&#1086;&#1095;&#1100; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1095;&#1080;&#1082;&#1072;&#1084;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1097;&#1080;&#1084; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1076;&#1083;&#1103; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1072;, &#1073;&#1077;&#1079; &#1087;&#1086;&#1076;&#1095;&#1105;&#1088;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1073;&#1099;&#1083;&#1072; &#1073;&#1099; &#1087;&#1077;&#1088;&#1077;&#1074;&#1077;&#1076;&#1077;&#1085;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1099;&#1084; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084;, &#1095;&#1090;&#1086; &#1085;&#1077;&#1078;&#1077;&#1083;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;.
</p><p>&#1044;&#1083;&#1103; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1085;&#1072; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1075;&#1088;&#1072;&#1092; &#1076;&#1086;&#1073;&#1072;&#1074;&#1100;&#1090;&#1077; &#1082; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1102; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1079;&#1085;&#1072;&#1082; <code>#</code> &#1080; &#1077;&#1075;&#1086; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1080;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
</p><p><code>[[WikiPages#Links|WikiPages]]</code>
</p><p>&#1055;&#1086;&#1089;&#1083;&#1077; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1072;:
</p><p><code>[[WikiPages/ru#&#1057;&#1089;&#1099;&#1083;&#1082;&#1080;|WikiPages]]</code>
</p><p>&#1053;&#1072; &#1101;&#1090;&#1086;&#1081; &#1078;&#1077; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
</p><p><code>[[#Links|&#1057;&#1089;&#1099;&#1083;&#1082;&#1080;]]</code>
</p><p>&#1044;&#1083;&#1103; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1085;&#1072; &#1074;&#1077;&#1088;&#1093;&#1085;&#1102;&#1102; &#1095;&#1072;&#1089;&#1090;&#1100; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;:
</p><p><code>&lt;/translate&gt;{{Top}}&lt;translate&gt;</code>
</p><p>&#1069;&#1090;&#1086;&#1090; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090; &#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1103;&#1079;&#1099;&#1082;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;. &#1057;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1074;&#1077;&#1088;&#1093;&#1085;&#1102;&#1102; &#1095;&#1072;&#1089;&#1090;&#1100; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1072; &#1076;&#1083;&#1103; &#1076;&#1083;&#1080;&#1085;&#1085;&#1099;&#1093; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1102; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086; &#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100;&#1089;&#1103; &#1082; &#1086;&#1075;&#1083;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1102;. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1077;&#1105; &#1074; &#1082;&#1086;&#1085;&#1094;&#1077; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1072;&#1073;&#1079;&#1072;&#1094;&#1072;. &#1059;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1087;&#1077;&#1088;&#1077;&#1076; &#1080; &#1087;&#1086;&#1089;&#1083;&#1077; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1072; &#1077;&#1089;&#1090;&#1100; &#1087;&#1091;&#1089;&#1090;&#1072;&#1103; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072;.
</p>
<dl><dt>&#1057;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;</dt>
<dd><span typeof="mw:File"><a href="../Draft_Wire.html" title="&#1053;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1085;&#1072;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1080; &#1082;&#1091;&#1088;&#1089;&#1086;&#1088;&#1072; &#1084;&#1099;&#1096;&#1080; &#1085;&#1072; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;"><img alt="&#1053;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1085;&#1072;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1080; &#1082;&#1091;&#1088;&#1089;&#1086;&#1088;&#1072; &#1084;&#1099;&#1096;&#1080; &#1085;&#1072; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;" src="../File/Draft_Wire.svg" decoding="async" width="24" height="24"></a></span></dd></dl>
<p>&#1063;&#1090;&#1086;&#1073;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080;:
</p><p><code>[[Image:Draft_Wire.svg|24px|&#1053;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1085;&#1072;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1080; &#1082;&#1091;&#1088;&#1089;&#1086;&#1088;&#1072; &#1084;&#1099;&#1096;&#1080; &#1085;&#1072; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;|link=Draft_Wire]]</code>
</p>
<dl><dt>&#1057;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; + &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1072;&#1103; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072;</dt>
<dd><span typeof="mw:File"><a href="../Draft_Wire.html" title="Draft Wire"><img src="../File/Draft_Wire.svg" decoding="async" width="24" height="24"></a></span> <a href="../ru/Draft_Wire.html" title="Draft Wire/ru">Draft &#1050;&#1088;&#1080;&#1074;&#1072;&#1103;</a></dd></dl>
<p>&#1045;&#1089;&#1083;&#1080; &#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1085;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090;, &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1087;&#1088;&#1080; &#1085;&#1072;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1080; &#1085;&#1072; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1095;&#1090;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1077;&#1077;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1091;&#1102; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1087;&#1086;&#1089;&#1083;&#1077; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1085;&#1072; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;:
</p><p><code>[[Image:Draft_Wire.svg|24px|link=Draft_Wire]] [[Draft_Wire/ru|Draft &#1050;&#1088;&#1080;&#1074;&#1072;&#1103;]]</code>
</p><p><span id="Workbench_pages"></span>
</p>
<h3><span id=".D0.A1.D1.82.D1.80.D0.B0.D0.BD.D0.B8.D1.86.D1.8B_.D0.B2.D0.B5.D1.80.D1.81.D1.82.D0.B0.D0.BA.D0.BE.D0.B2"></span><span class="mw-headline" id="&#1057;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;_&#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1086;&#1074;">&#1057;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1086;&#1074;</span></h3>
<p>&#1057;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1075;&#1086; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089;:
</p>
<ul><li>&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1076;&#1083;&#1103; &#1095;&#1077;&#1075;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;.</li>
<li>&#1048;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;, &#1080;&#1083;&#1083;&#1102;&#1089;&#1090;&#1088;&#1080;&#1088;&#1091;&#1102;&#1097;&#1077;&#1077; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;.</li></ul>
<p>&#1057;&#1084;&#1086;&#1090;&#1088;&#1080; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083; <a href="#Screen_capture">#&#1057;&#1085;&#1080;&#1084;&#1086;&#1082; &#1101;&#1082;&#1088;&#1072;&#1085;&#1072;</a>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1079;&#1085;&#1072;&#1090;&#1100; &#1086; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1072;&#1093; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1081;.
</p><p><span id="Command_pages"></span>
</p>
<h3><span id=".D0.A1.D1.82.D1.80.D0.B0.D0.BD.D0.B8.D1.86.D1.8B_.D0.BA.D0.BE.D0.BC.D0.B0.D0.BD.D0.B4"></span><span class="mw-headline" id="&#1057;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;_&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;">&#1057;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;</span></h3>
<p>&#1057;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;, &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1086;&#1074;, &#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1089;&#1083;&#1080;&#1096;&#1082;&#1086;&#1084; &#1076;&#1083;&#1080;&#1085;&#1085;&#1099;&#1084;&#1080;, &#1086;&#1085;&#1080; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1073;&#1098;&#1103;&#1089;&#1085;&#1103;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100;, &#1072; &#1095;&#1077;&#1075;&#1086; &#1085;&#1077;&#1090;, &#1080; &#1082;&#1072;&#1082; &#1077;&#1105; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;. &#1042;&#1072;&#1084; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1089;&#1074;&#1077;&#1089;&#1090;&#1080; &#1082; &#1084;&#1080;&#1085;&#1080;&#1084;&#1091;&#1084;&#1091; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099;. &#1059;&#1095;&#1077;&#1073;&#1085;&#1099;&#1077; &#1087;&#1086;&#1089;&#1086;&#1073;&#1080;&#1103; &#1084;&#1086;&#1075;&#1091;&#1090; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086; &#1088;&#1072;&#1089;&#1089;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1086; &#1090;&#1086;&#1084;, &#1082;&#1072;&#1082; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086;&#1090; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;, &#1080; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1087;&#1086;&#1096;&#1072;&#1075;&#1086;&#1074;&#1099;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080;.
</p><p>&#1055;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077;&#1089;&#1100; &#1082; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; <a href="../ru/GuiCommand_model.html" title="GuiCommand model/ru"> &#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1084;&#1072;&#1085;&#1076;&#1099; Gui</a> &#1076;&#1083;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;.
</p><p><span id="Tutorials"></span>
</p>
<h3><span id=".D0.A0.D1.83.D0.BA.D0.BE.D0.B2.D0.BE.D0.B4.D1.81.D1.82.D0.B2.D0.B0"></span><span class="mw-headline" id="&#1056;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1072;">&#1056;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1072;</span></h3>
<p>&#1061;&#1086;&#1088;&#1086;&#1096;&#1086; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1081; &#1091;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1091;&#1095;&#1080;&#1090;&#1100;, &#1082;&#1072;&#1082; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086; &#1076;&#1086;&#1089;&#1090;&#1080;&#1095;&#1100; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1086;&#1074;. &#1054;&#1085; &#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1089;&#1083;&#1080;&#1096;&#1082;&#1086;&#1084; &#1076;&#1083;&#1080;&#1085;&#1085;&#1099;&#1084;, &#1085;&#1086; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086;&#1096;&#1072;&#1075;&#1086;&#1074;&#1099;&#1093; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1081; &#1080; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1081; &#1076;&#1083;&#1103; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1072; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084;. &#1055;&#1086; &#1084;&#1077;&#1088;&#1077; &#1088;&#1072;&#1079;&#1074;&#1080;&#1090;&#1080;&#1103; FreeCAD &#1091;&#1095;&#1077;&#1073;&#1085;&#1099;&#1077; &#1087;&#1086;&#1089;&#1086;&#1073;&#1080;&#1103; &#1084;&#1086;&#1075;&#1091;&#1090; &#1091;&#1089;&#1090;&#1072;&#1088;&#1077;&#1074;&#1072;&#1090;&#1100;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1074;&#1072;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1074;&#1077;&#1088;&#1089;&#1080;&#1102; FreeCAD, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1091;&#1102; &#1074; &#1091;&#1095;&#1077;&#1073;&#1085;&#1086;&#1084; &#1087;&#1086;&#1089;&#1086;&#1073;&#1080;&#1080; &#1080;&#1083;&#1080; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1091;&#1102; &#1076;&#1083;&#1103; &#1085;&#1077;&#1075;&#1086;.
</p><p>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1099; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; <a href="../ru/Tutorials.html" title="Tutorials/ru"> &#1056;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1072;</a>.
</p>
</div> 
</div> 
<div class="mw-collapsible mw-collapsed toccolours">
<p><span id="Templates"></span>
</p>
<h2><span id=".D0.A8.D0.B0.D0.B1.D0.BB.D0.BE.D0.BD.D1.8B"></span><span class="mw-headline" id="&#1064;&#1072;&#1073;&#1083;&#1086;&#1085;&#1099;">&#1064;&#1072;&#1073;&#1083;&#1086;&#1085;&#1099;</span></h2>
<div class="mw-collapsible-content">
<p>&#1057;&#1090;&#1080;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094; FreeCAD wiki &#1076;&#1086;&#1089;&#1090;&#1080;&#1075;&#1072;&#1077;&#1090;&#1089;&#1103; &#1079;&#1072; &#1089;&#1095;&#1105;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1086;&#1074; (<a href="../Help;Editing.html#Templates_and_transcluding_pages" title="Help:Editing">Help:Editing#Templates_and_transcluding_pages</a>). &#1054;&#1085;&#1080; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1074;&#1072;&#1102;&#1090; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1081; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1081; &#1074;&#1080;&#1076; &#1080; &#1074;&#1086;&#1089;&#1087;&#1088;&#1080;&#1103;&#1090;&#1080;&#1077; &#1074;&#1089;&#1077;&#1093; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1089;&#1090;&#1080;&#1083;&#1100; &#1074;&#1080;&#1082;&#1080;. &#1055;&#1086;&#1083;&#1085;&#1099;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1086;&#1074; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100;, &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1074;&#1096;&#1080;&#1089;&#1100; &#1082; <a href="../Special;PrefixIndex/Template;.html" title="Special:PrefixIndex/Template:">Special:PrefixIndex/Template:</a>. &#1053;&#1086;, &#1087;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1090;&#1077; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1099; &#1074; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072;&#1093; &#1085;&#1080;&#1078;&#1077;. &#1058;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1086;&#1095;&#1077;&#1085;&#1100; &#1086;&#1089;&#1086;&#1073;&#1099;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093; &#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; HTML-&#1090;&#1077;&#1075;&#1080; &#1085;&#1072;&#1087;&#1088;&#1103;&#1084;&#1091;&#1102;.
</p><p>&#1065;&#1105;&#1083;&#1082;&#1085;&#1080;&#1090;&#1077; &#1087;&#1086; &#1089;&#1089;&#1099;&#1083;&#1082;&#1077; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1072;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080; &#1087;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1102; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1072; &#1080; &#1077;&#1075;&#1086; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1102;. &#1064;&#1072;&#1073;&#1083;&#1086;&#1085;&#1099; - &#1101;&#1090;&#1086; &#1084;&#1086;&#1097;&#1085;&#1072;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; MediaWiki. &#1042;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1086;&#1087;&#1099;&#1090;&#1085;&#1099;&#1084; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084; &#1074;&#1080;&#1082;&#1080;, &#1077;&#1089;&#1083;&#1080; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1087;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1090;&#1100; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1082; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1084; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1072;&#1084;. &#1055;&#1088;&#1080; &#1085;&#1077;&#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1080; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1099; &#1079;&#1072;&#1090;&#1088;&#1091;&#1076;&#1085;&#1103;&#1102;&#1090; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094; &#1085;&#1072; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1103;&#1079;&#1099;&#1082;&#1080;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1080;&#1093; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1086; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;, &#1087;&#1077;&#1088;&#1077;&#1083;&#1080;&#1085;&#1082;&#1086;&#1074;&#1082;&#1091; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1080;&#1079;&#1073;&#1077;&#1075;&#1072;&#1090;&#1100;. &#1055;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1077;&#1077; &#1089;&#1084;&#1086;&#1090;&#1088;&#1080; <a class="external text" href="https://www.mediawiki.org/wiki/Help:Templates">MediaWiki Help:Templates</a>.
</p><p><span id="Simple_templates"></span>
</p>
<h3><span id=".D0.9F.D1.80.D0.BE.D1.81.D1.82.D0.B5.D0.B9.D1.88.D0.B8.D0.B5_.D1.88.D0.B0.D0.B1.D0.BB.D0.BE.D0.BD.D1.8B"></span><span class="mw-headline" id="&#1055;&#1088;&#1086;&#1089;&#1090;&#1077;&#1081;&#1096;&#1080;&#1077;_&#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1099;">&#1055;&#1088;&#1086;&#1089;&#1090;&#1077;&#1081;&#1096;&#1080;&#1077; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1099;</span></h3>
<p>&#1069;&#1090;&#1080; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1099; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1091;&#1102;&#1090; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1074; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1084; &#1089;&#1090;&#1080;&#1083;&#1077;.
</p>
<table border="2" cellspacing="0" cellpadding="4" rules="all" class="hintergrundfarbe1 rahmenfarbe1" style="margin:1em 1em 1em 0; border-style:solid; border-width:1px; border-collapse:collapse; empty-cells:show;">
<tbody><tr>
<th style="width:10%;">&#1064;&#1072;&#1073;&#1083;&#1086;&#1085;
</th>
<th style="width:20%;">&#1042;&#1085;&#1077;&#1096;&#1085;&#1080;&#1081; &#1074;&#1080;&#1076;
</th>
<th style="width:70%;">&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;
</th></tr>
<tr>
<td><a href="../Template;Top.html" title="Template:Top">Top</a>
</td>
<td>
<p><a href="#top">&#1085;&#1072;&#1074;&#1077;&#1088;&#1093;</a></p>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1074; &#1085;&#1072;&#1095;&#1072;&#1083;&#1086; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;.
</td></tr>
<tr>
<td><a href="../Template;Emphasis.html" title="Template:Emphasis">Emphasis</a>
</td>
<td><i>&#1072;&#1082;&#1094;&#1077;&#1085;&#1090;</i>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1076;&#1095;&#1077;&#1088;&#1082;&#1085;&#1091;&#1090;&#1100; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;.
</td></tr>
<tr>
<td><a href="../Template;KEY.html" title="Template:KEY">KEY</a>
</td>
<td><span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px;">Alt</span>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1091;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1091; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1085;&#1072;&#1078;&#1072;&#1090;&#1100;.
</td></tr>
<tr>
<td><a href="../Template;ASCII.html" title="Template:ASCII">ASCII</a>
</td>
<td><span typeof="mw:File"><a href="../index.php?title=Ascii_065.svg&amp;filetimestamp=20191120142208&amp;.html" class="mw-file-description"><img src="../File/Ascii_065.svg" decoding="async" width="24" height="24"></a></span>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086;, &#1076;&#1083;&#1103; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080; &#1074; &#1074;&#1080;&#1076;&#1077; (.svg) &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1085;&#1091;&#1078;&#1085;&#1086; &#1085;&#1072;&#1078;&#1072;&#1090;&#1100;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;, &#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1078;&#1077;&#1083;&#1072;&#1077;&#1084;&#1099;&#1081; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083; &#1080;&#1083;&#1080; &#1085;&#1086;&#1084;&#1077;&#1088; ascii-&#1082;&#1086;&#1076;&#1072; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072;.
</td></tr>
<tr>
<td><a href="../Template;Button.html" title="Template:Button">Button</a>
</td>
<td><span style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.4em; padding: 0px 10px 1px 10px; font-weight:normal;">&#1054;&#1090;&#1084;&#1077;&#1085;&#1072;</span>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1076;&#1083;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1103; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1074; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1084; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1077;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1085;&#1072;&#1078;&#1072;&#1090;&#1100;.
</td></tr>
<tr>
<td><a href="../Template;RadioButton.html" title="Template:RadioButton">RadioButton</a>
</td>
<td><span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #989898; border-radius: 0.2em; padding: 0px 10px 1px 10px; font-weight:normal;"><span typeof="mw:File"><a href="../index.php?title=RadioButtonFalse.svg&amp;filetimestamp=20200323161942&amp;.html" class="mw-file-description"><img src="../File/RadioButtonFalse.svg" decoding="async" width="16" height="16"></a></span> &#1054;&#1087;&#1094;&#1080;&#1103;<span></span></span>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1076;&#1083;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1103; &#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1077;&#1083;&#1103; &#1074; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; <span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #989898; border-radius: 0.2em; padding: 0px 10px 1px 10px; font-weight:normal;"><span typeof="mw:File"><a href="../index.php?title=RadioButtonTrue.svg&amp;filetimestamp=20200323161550&amp;.html" class="mw-file-description"><img src="../File/RadioButtonTrue.svg" decoding="async" width="16" height="16"></a></span> &#1042;&#1099;&#1073;&#1088;&#1072;&#1085;<span></span></span> &#1080;&#1083;&#1080; <span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #989898; border-radius: 0.2em; padding: 0px 10px 1px 10px; font-weight:normal;"><span typeof="mw:File"><a href="../index.php?title=RadioButtonFalse.svg&amp;filetimestamp=20200323161942&amp;.html" class="mw-file-description"><img src="../File/RadioButtonFalse.svg" decoding="async" width="16" height="16"></a></span> &#1053;&#1077;&#1090;<span></span></span>.
</td></tr>
<tr>
<td><a href="../Template;CheckBox.html" title="Template:CheckBox">CheckBox</a>
</td>
<td><span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #989898; border-radius: 0.2em; padding: 0px 10px 1px 10px; font-weight:normal;"><span typeof="mw:File"><a href="../index.php?title=CheckBoxFalse.svg&amp;filetimestamp=20200323161434&amp;.html" class="mw-file-description"><img src="../File/CheckBoxFalse.svg" decoding="async" width="16" height="16"></a></span> &#1054;&#1087;&#1094;&#1080;&#1103;<span></span></span>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1076;&#1083;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1103; &#1092;&#1083;&#1072;&#1078;&#1082;&#1072; &#1074; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085; &#1074; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #989898; border-radius: 0.2em; padding: 0px 10px 1px 10px; font-weight:normal;"><span typeof="mw:File"><a href="../index.php?title=CheckBoxTrue.svg&amp;filetimestamp=20200323161507&amp;.html" class="mw-file-description"><img src="../File/CheckBoxTrue.svg" decoding="async" width="16" height="16"></a></span> &#1042;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;<span></span></span> &#1080;&#1083;&#1080; <span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #989898; border-radius: 0.2em; padding: 0px 10px 1px 10px; font-weight:normal;"><span typeof="mw:File"><a href="../index.php?title=CheckBoxFalse.svg&amp;filetimestamp=20200323161434&amp;.html" class="mw-file-description"><img src="../File/CheckBoxFalse.svg" decoding="async" width="16" height="16"></a></span> &#1053;&#1077;&#1090;<span></span></span>.
</td></tr>
<tr>
<td><a href="../Template;SpinBox.html" title="Template:SpinBox">SpinBox</a>
</td>
<td><span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #989898; border-radius: 0.2em; padding: 2px 5px 3px 5px; font-weight:normal;">1.50  <span typeof="mw:File"><a href="../index.php?title=SpinBox.svg&amp;filetimestamp=20200327215243&amp;.html" class="mw-file-description"><img src="../File/SpinBox.svg" decoding="async" width="17" height="17"></a></span><span></span></span>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1085;&#1072; &#1089;&#1087;&#1080;&#1085;&#1073;&#1086;&#1082;&#1089; &#1074; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100;.
</td></tr>
<tr>
<td><a href="../Template;ComboBox.html" title="Template:ComboBox">ComboBox</a>
</td>
<td><span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #989898; border-radius: 0.2em; padding: 2px 5px 3px 5px; font-weight:normal;">&#1052;&#1077;&#1085;&#1102; 1  <span typeof="mw:File"><a href="../index.php?title=ComboBox.svg&amp;filetimestamp=20200329183052&amp;.html" class="mw-file-description"><img src="../File/ComboBox.svg" decoding="async" width="17" height="17"></a></span><span></span></span>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1087;&#1086;&#1083;&#1077; &#1089;&#1086; &#1089;&#1087;&#1080;&#1089;&#1082;&#1086;&#1084; &#1074; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100;.
</td></tr>
<tr>
<td><a href="../Template;LineEdit.html" title="Template:LineEdit">LineEdit</a>
</td>
<td><span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #989898; border-radius: 0.2em; padding: 2px 5px 3px 5px; font-weight:normal;">&#1052;&#1077;&#1090;&#1072;&#1083;&#1083; &#1053;&#1080;&#1082;&#1077;&#1083;&#1100; (Ni)</span>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1076;&#1083;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1103; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1074; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100;.
</td></tr>
<tr>
<td><a href="../Template;FALSE.html" title="Template:FALSE">FALSE</a>, <a href="../Template;False.html" title="Template:False">false</a>
</td>
<td><code>false</code>, <code>false</code>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1076;&#1083;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1103; &#1083;&#1086;&#1078;&#1085;&#1086;&#1075;&#1086; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1074; <a href="../ru/Property_editor.html" title="Property editor/ru">&#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;</a>. &#1069;&#1090;&#1086; &#1103;&#1088;&#1083;&#1099;&#1082;. &#1055;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1101;&#1090;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1095;&#1090;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1077;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1064;&#1072;&#1073;&#1083;&#1086;&#1085; <a href="../Template;Value.html" title="Template:Value">Value</a> <code>false</code>
</td></tr>
<tr>
<td><a href="../Template;TRUE.html" title="Template:TRUE">TRUE</a>, <a href="../Template;True.html" title="Template:True">true</a>
</td>
<td><code>true</code>, <code>true</code>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1076;&#1083;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1103; &#1080;&#1089;&#1090;&#1080;&#1085;&#1085;&#1086;&#1075;&#1086; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1074; <a href="../ru/Property_editor.html" title="Property editor/ru">&#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;</a>. &#1069;&#1090;&#1086; &#1103;&#1088;&#1083;&#1099;&#1082;. &#1055;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1101;&#1090;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1095;&#1090;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1077;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1064;&#1072;&#1073;&#1083;&#1086;&#1085; <a href="../Template;Value.html" title="Template:Value">Value</a> <code>true</code>
</td></tr>
<tr>
<td><a href="../Template;MenuCommand.html" title="Template:MenuCommand">MenuCommand</a>
</td>
<td><b>&#1060;&#1072;&#1081;&#1083; &rarr; &#1057;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100;</b>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1103; &#1084;&#1077;&#1089;&#1090;&#1086;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1074; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1084; &#1084;&#1077;&#1085;&#1102;.
</td></tr>
<tr>
<td><a href="../Template;FileName.html" title="Template:FileName">FileName</a>
</td>
<td><span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">&#1048;&#1084;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072;</span>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1076;&#1083;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1103; &#1080;&#1084;&#1077;&#1085;&#1080; &#1092;&#1072;&#1081;&#1083;&#1072; &#1080;&#1083;&#1080; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1072;.
</td></tr>
<tr>
<td><a href="../Template;SystemInput.html" title="Template:SystemInput">SystemInput</a>
</td>
<td><span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">&#1042;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; &#1101;&#1090;&#1086;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090;</span>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1076;&#1083;&#1103; &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074;&#1074;&#1086;&#1076;&#1080;&#1084;&#1086;&#1075;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;.
</td></tr>
<tr>
<td><a href="../Template;SystemOutput.html" title="Template:SystemOutput">SystemOutput</a>
</td>
<td><span style="font-weight:normal; font-family:monospace, Consolas, Courier New, Courier; border: 1px solid #d8d8d8; padding: 2px 5px 2px 5px;">&#1042;&#1099;&#1074;&#1086;&#1076;&#1080;&#1084;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090;</span>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1080;&#1079; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;.
</td></tr>
<tr>
<td><a href="../Template;Incode.html" title="Template:Incode">Incode</a>
</td>
<td><code>import FreeCAD</code>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1076;&#1083;&#1103; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1073;&#1083;&#1086;&#1082;&#1086;&#1074; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1084;&#1086;&#1085;&#1086;&#1096;&#1080;&#1088;&#1080;&#1085;&#1085;&#1099;&#1084; &#1096;&#1088;&#1080;&#1092;&#1090;&#1086;&#1084;. &#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1091;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1086;&#1076;&#1085;&#1091; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091;.
</td></tr>
<tr>
<td><a href="../Template;PropertyView.html" title="Template:PropertyView">PropertyView</a>
</td>
<td><span style="font-size:60%; padding-right:0.8em;">&#1042;&#1080;&#1076;</span><b>&#1062;&#1074;&#1077;&#1090;</b>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1076;&#1083;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1103; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1042;&#1080;&#1076; &#1074; <a href="../ru/Property_editor.html" title="Property editor/ru">&#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;</a>. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1102;&#1090; <i>&#1062;&#1074;&#1077;&#1090; &#1051;&#1080;&#1085;&#1080;&#1080;</i>, <i>&#1064;&#1080;&#1088;&#1080;&#1085;&#1072; &#1051;&#1080;&#1085;&#1080;&#1080;</i>, <i>&#1062;&#1074;&#1077;&#1090; &#1058;&#1086;&#1095;&#1082;&#1080;</i>, <i>&#1056;&#1072;&#1079;&#1084;&#1077;&#1088; &#1058;&#1086;&#1095;&#1082;&#1080;</i>, &#1080; &#1090;.&#1087;.
</td></tr>
<tr>
<td><a href="../Template;PropertyData.html" title="Template:PropertyData">PropertyData</a>
</td>
<td><span style="font-size:60%; padding-right:0.8em;">&#1044;&#1072;&#1085;&#1085;&#1099;&#1077;</span><b>&#1055;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;</b>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1076;&#1083;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1103; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; <a href="../ru/Property_editor.html" title="Property editor/ru">&#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;</a>. &#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1090;&#1080;&#1087;&#1086;&#1074; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;.
</td></tr>
<tr>
<td><a href="../Template;Properties_Title.html" title="Template:Properties Title">Properties Title</a> / <a href="../Template;TitleProperty.html" class="mw-redirect" title="Template:TitleProperty">TitleProperty</a>
</td>
<td><span style="color: #fdfdfd; background-color: #909090; font-size: 112%; font-weight: bold; margin-bottom: .3em; padding: 0px 10px 1px 10px; page-break-after: avoid;">&#1041;&#1072;&#1079;&#1086;&#1074;&#1099;&#1077;</span>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1076;&#1083;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1103; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1103; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; &#1074; <a href="../ru/Property_editor.html" title="Property editor/ru">&#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;</a>. &#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1086; &#1074; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1086;&#1075;&#1083;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;.
</td></tr>
<tr>
<td><a href="../Template;Obsolete.html" title="Template:Obsolete">Obsolete/ru</a>
</td>
<td><span style="font-size:small;"><a href="../ru/Release_notes_0.19.html" title="Release notes 0.19/ru">&#1091;&#1087;&#1088;&#1072;&#1079;&#1076;&#1085;&#1077;&#1085;&#1086; &#1074; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 0.19</a></span>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1091;&#1089;&#1090;&#1072;&#1088;&#1077;&#1083;&#1072; &#1074; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; FreeCAD.
</td></tr>
<tr>
<td><a href="../Template;Obsolete.html" title="Template:Obsolete">VersionNoteObsolete/ru</a>
</td>
<td><sup><a href="../ru/Release_notes_0.19.html" title="Release notes 0.19/ru">&#1091;&#1087;&#1088;&#1072;&#1079;&#1076;&#1085;&#1077;&#1085;&#1086; &#1074; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 0.19</a>
</sup></td>
<td>&#1058;&#1086;&#1078;&#1077; (&#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090; &#1085;&#1072;&#1076;&#1089;&#1090;&#1088;&#1086;&#1095;&#1085;&#1086;&#1075;&#1086; &#1079;&#1085;&#1072;&#1082;&#1072;).
</td></tr>
<tr>
<td><a href="../ru/Template;Version.html" title="Template:Version/ru">Version/ru</a>
</td>
<td><span style="font-size:small;"><a href="../ru/Release_notes_0.18.html" title="Release notes 0.18/ru">&#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1086; &#1074; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 0.18</a></span>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1073;&#1099;&#1083;&#1072; &#1074;&#1074;&#1077;&#1076;&#1077;&#1085;&#1072; &#1074; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; FreeCAD.
</td></tr>
<tr>
<td><a href="../Template;Version.html" title="Template:Version">VersionNote/ru</a>
</td>
<td><sup><a href="../ru/Release_notes_0.18.html" title="Release notes 0.18/ru">&#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1086; &#1074; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 0.18</a></sup>
</td>
<td>&#1058;&#1086;&#1078;&#1077; (&#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090; &#1085;&#1072;&#1076;&#1089;&#1090;&#1088;&#1086;&#1095;&#1085;&#1086;&#1075;&#1086; &#1079;&#1085;&#1072;&#1082;&#1072;).
</td></tr>
<tr>
<td><a href="../Template;VersionMinus.html" title="Template:VersionMinus">VersionMinus/ru</a>
</td>
<td><span style="font-size:small;color:blue;">0.16 &#1080; &#1085;&#1080;&#1078;&#1077;</span>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072; &#1074; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; FreeCAD &#1080; &#1073;&#1086;&#1083;&#1077;&#1077; &#1088;&#1072;&#1085;&#1085;&#1080;&#1093; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103;&#1093;.
</td></tr>
<tr>
<td><a href="../Template;VersionMinus.html" title="Template:VersionMinus">VersionNoteMinus/ru</a>
</td>
<td><sup style="color:blue;">0.16 &#1080; &#1085;&#1080;&#1078;&#1077;</sup>
</td>
<td>&#1058;&#1086;&#1078;&#1077; (&#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090; &#1085;&#1072;&#1076;&#1089;&#1090;&#1088;&#1086;&#1095;&#1085;&#1086;&#1075;&#1086; &#1079;&#1085;&#1072;&#1082;&#1072;).
</td></tr>
<tr>
<td><a href="../Template;VersionPlus.html" title="Template:VersionPlus">VersionPlus/ru</a>
</td>
<td><span style="font-size:small;color:green;">0.17 &#1080; &#1074;&#1099;&#1096;&#1077;</span>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072; &#1074; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; FreeCAD &#1080; &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1086;&#1079;&#1076;&#1085;&#1080;&#1093; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103;&#1093;.
</td></tr>
<tr>
<td><a href="../Template;VersionPlus.html" title="Template:VersionPlus">VersionNotePlus/ru</a>
</td>
<td><sup style="color:green;">0.17 &#1080; &#1074;&#1099;&#1096;&#1077; </sup>
</td>
<td>&#1058;&#1086;&#1078;&#1077; (&#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090; &#1085;&#1072;&#1076;&#1089;&#1090;&#1088;&#1086;&#1095;&#1085;&#1086;&#1075;&#1086; &#1079;&#1085;&#1072;&#1082;&#1072;).
</td></tr>
<tr>
<td><a href="../Template;ColoredText.html" title="Template:ColoredText">ColoredText</a>
</td>
<td><span style="background-color: #ffeeee">&#1062;&#1074;&#1077;&#1090;&#1085;&#1086;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090;</span>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1101;&#1090;&#1086;&#1090; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085; &#1076;&#1083;&#1103; &#1088;&#1072;&#1089;&#1082;&#1088;&#1072;&#1096;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1092;&#1086;&#1085;&#1072;, &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1080;&#1083;&#1080; &#1092;&#1086;&#1085;&#1072; &#1080; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;. (<a href="../Template;ColoredText.html" title="Template:ColoredText">ColoredText</a> &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072; &#1076;&#1083;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1086;&#1074;)
</td></tr>
<tr>
<td><a href="../Template;ColoredParagraph.html" title="Template:ColoredParagraph">ColoredParagraph</a>
</td>
<td><div style="background-color: #ffeeee">&#1062;&#1074;&#1077;&#1090;&#1085;&#1086;&#1081; &#1040;&#1073;&#1079;&#1072;&#1094;</div>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1101;&#1090;&#1086;&#1090; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085; &#1076;&#1083;&#1103; &#1088;&#1072;&#1089;&#1082;&#1088;&#1072;&#1096;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1092;&#1086;&#1085;&#1072;, &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1080;&#1083;&#1080; &#1092;&#1086;&#1085;&#1072; &#1080; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1074;&#1089;&#1077;&#1075;&#1086; &#1072;&#1073;&#1079;&#1072;&#1094;&#1072;. (<a href="../Template;ColoredParagraph.html" title="Template:ColoredParagraph">ColoredParagraph</a> &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072; &#1076;&#1083;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1086;&#1074;)
</td></tr></tbody></table>
<p><span id="Complex_templates"></span>
</p>
<h3><span id=".D0.A1.D0.BB.D0.BE.D0.B6.D0.BD.D1.8B.D0.B5_.D1.88.D0.B0.D0.B1.D0.BB.D0.BE.D0.BD.D1.8B"></span><span class="mw-headline" id="&#1057;&#1083;&#1086;&#1078;&#1085;&#1099;&#1077;_&#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1099;">&#1057;&#1083;&#1086;&#1078;&#1085;&#1099;&#1077; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1099;</span></h3>
<p>&#1069;&#1090;&#1080; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1099; &#1090;&#1088;&#1077;&#1073;&#1091;&#1102;&#1090; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1074;&#1093;&#1086;&#1076;&#1085;&#1099;&#1093; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1080;&#1083;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1102;&#1090; &#1073;&#1083;&#1086;&#1082; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072;.
</p>
<table border="2" cellspacing="0" cellpadding="4" rules="all" class="hintergrundfarbe1 rahmenfarbe1" style="margin:1em 1em 1em 0; border-style:solid; border-width:1px; border-collapse:collapse; empty-cells:show;">
<tbody><tr>
<th style="width:10%;">&#1064;&#1072;&#1073;&#1083;&#1086;&#1085;
</th>
<th style="width:45%;">&#1042;&#1085;&#1077;&#1096;&#1085;&#1080;&#1081; &#1074;&#1080;&#1076;
</th>
<th style="width:45%;">&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;
</th></tr>
<tr>
<td><a href="../Template;Prettytable.html" title="Template:Prettytable">Prettytable</a>
</td>
<td>&#1044;&#1072;&#1085;&#1085;&#1072;&#1103; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072;
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1076;&#1083;&#1103; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;, &#1087;&#1086;&#1076;&#1086;&#1073;&#1085;&#1099;&#1093; &#1101;&#1090;&#1086;&#1081;. &#1052;&#1086;&#1078;&#1085;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099;..
</td></tr>
<tr>
<td><a href="../Template;Caption.html" title="Template:Caption">Caption</a>
</td>
<td><div style="width:400px;"><p style="text-align:left; font-style:italic; width:800px; margin-left:1em; margin-right:1em;">&#1050;&#1072;&#1082;&#1072;&#1103;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100; &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1100; &#1082; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1102;</p></div>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1087;&#1086;&#1103;&#1089;&#1085;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1076; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084;. &#1054;&#1085;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074;&#1099;&#1088;&#1086;&#1074;&#1085;&#1077;&#1085;&#1086; &#1087;&#1086; &#1083;&#1077;&#1074;&#1086;&#1084;&#1091; &#1082;&#1088;&#1072;&#1102; &#1080;&#1083;&#1080; &#1087;&#1086; &#1094;&#1077;&#1085;&#1090;&#1088;&#1091;.
</td></tr>
<tr>
<td><a href="../Template;Clear.html" title="Template:Clear">Clear</a>
</td>
<td>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1076;&#1083;&#1103; &#1086;&#1095;&#1080;&#1089;&#1090;&#1082;&#1080; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1086;&#1074;. &#1044;&#1083;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1103;&#1089;&#1085;&#1077;&#1085;&#1080;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1081;&#1090;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1102; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1072;. &#1054;&#1085; &#1095;&#1072;&#1089;&#1090;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1090;&#1077;&#1082;&#1089;&#1090; &#1085;&#1077; &#1087;&#1077;&#1088;&#1077;&#1089;&#1077;&#1082;&#1072;&#1083;&#1089;&#1103; &#1089; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;, &#1085;&#1077; &#1080;&#1084;&#1077;&#1102;&#1097;&#1080;&#1084;&#1080; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1103; &#1082; &#1090;&#1077;&#1082;&#1089;&#1090;&#1091;.
</td></tr>
<tr>
<td><a href="../Template;Code.html" title="Template:Code">Code</a>
</td>
<td><div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="kn">import</span> <span class="nn">FreeCAD</span>
</pre></div>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1076;&#1083;&#1103; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103; &#1084;&#1085;&#1086;&#1075;&#1086;&#1089;&#1090;&#1088;&#1086;&#1095;&#1085;&#1099;&#1093; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1086;&#1074; &#1082;&#1086;&#1076;&#1072; &#1089; &#1084;&#1086;&#1085;&#1086;&#1096;&#1080;&#1088;&#1080;&#1085;&#1085;&#1099;&#1084; &#1096;&#1088;&#1080;&#1092;&#1090;&#1086;&#1084;. &#1071;&#1079;&#1099;&#1082; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; - Python, &#1085;&#1086; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1099; &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1103;&#1079;&#1099;&#1082;&#1080;.
<p><a href="../ru/Python.html" title="Python/ru">Python</a> &#1082;&#1086;&#1076; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1086;&#1073;&#1097;&#1080;&#1084; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1072;&#1094;&#1080;&#1103;&#1084;, &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084; <a rel="nofollow" class="external text" href="https://www.python.org/dev/peps/pep-0008">/ PEP8: &#1056;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086; &#1089;&#1090;&#1080;&#1083;&#1102; &#1076;&#1083;&#1103; &#1082;&#1086;&#1076;&#1072; &#1085;&#1072; python</a>. &#1042; &#1095;&#1072;&#1089;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1082;&#1088;&#1091;&#1075;&#1083;&#1099;&#1077; &#1089;&#1082;&#1086;&#1073;&#1082;&#1080; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1088;&#1072;&#1079;&#1091; &#1079;&#1072; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;, &#1072; &#1087;&#1086;&#1089;&#1083;&#1077; &#1079;&#1072;&#1087;&#1103;&#1090;&#1086;&#1081; - &#1087;&#1088;&#1086;&#1073;&#1077;&#1083;. &#1069;&#1090;&#1086; &#1076;&#1077;&#1083;&#1072;&#1077;&#1090; &#1082;&#1086;&#1076; &#1073;&#1086;&#1083;&#1077;&#1077; &#1095;&#1080;&#1090;&#1072;&#1073;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;.
</p>
</td></tr>
<tr>
<td><a href="../Template;CodeDownload.html" title="Template:CodeDownload">CodeDownload</a>
</td>
<td><div class="plainlinks" style="width:300px; text-align:center; margin:10px auto;">
<div style="border:1px outset #9eb4b5; background:#f0fdf8; margin:5px; padding:5px; white-space:nowrap; -webkit-border-radius: 5px; -moz-border-radius: 5px;">
<p><span typeof="mw:File"><a href="https://wiki.freecad.org/Main_Page" rel="nofollow"><img src="../File/Nuvola_apps_download_manager.png" decoding="async" width="35" height="35"></a></span>
</p><p><span class="CodeDownload" style="font-weight:bold"><a rel="nofollow" class="external text" href="https://wiki.freecad.org/Main_Page">&#1050;&#1072;&#1082;&#1086;&#1081;-&#1090;&#1086; &#1103;&#1088;&#1083;&#1099;&#1082;</a></span>
</p>
</div>
</div>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; <a href="../ru/Macros.html" title="Macros/ru">&#1052;&#1072;&#1082;&#1088;&#1086;&#1089;&#1099;</a>.
</td></tr>
<tr>
<td><a href="../Template;Codeextralink.html" title="Template:Codeextralink">Codeextralink</a>
</td>
<td><div class="toccolours mw-collapsible mw-collapsed" style="cursor:not-allowed">
<p>Temporary code for external macro link. Do not use this code. This code is used exclusively by <a href="../Std_AddonMgr.html" title="Std AddonMgr">Addon Manager</a>. <i>Link for optional manual installation: <a rel="nofollow" class="external text" href="https://wiki.freecad.org/Main_Page">Macro</a></i>
</p>
<div class="mw-collapsible-content">
<pre>

# This code is copied instead of the original macro code
# to guide the user to the online download page.
# Use it if the code of the macro is larger than 64 KB and cannot be included in the wiki
# or if the RAW code URL is somewhere else in the wiki.

from PySide import QtGui, QtCore

diag = QtGui.QMessageBox(QtGui.QMessageBox.Information,
    "Information",
    "This macro must be downloaded from this link\n"
    "\n"
    "https://wiki.freecad.org/Main_Page" + "\n"
    "\n"
    "Quit this window to access the download page")

diag.setWindowFlags(QtCore.Qt.WindowStaysOnTopHint)
diag.setWindowModality(QtCore.Qt.ApplicationModal)
diag.exec_()

import webbrowser 
webbrowser.open("https://wiki.freecad.org/Main_Page")
</pre>
</div>
</div>
<div style="display:none;">&lt;class="rawcodeurl"&gt;&lt;a href="<a rel="nofollow" class="external free" href="https://wiki.freecad.org/Main_Page">https://wiki.freecad.org/Main_Page</a>"&gt;raw code&lt;/a&gt;</div>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103;, &#1077;&#1089;&#1083;&#1080; &#1082;&#1086;&#1076; <a href="../ru/Macros.html" title="Macros/ru">&#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1072;</a> &#1089;&#1083;&#1080;&#1096;&#1082;&#1086;&#1084; &#1074;&#1077;&#1083;&#1080;&#1082; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072; &#1042;&#1080;&#1082;&#1080;. &#1058;&#1086;&#1075;&#1076;&#1072; &#1082;&#1086;&#1076; &#1084;&#1086;&#1078;&#1085;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1074; &#1076;&#1088;&#1091;&#1075;&#1086;&#1084; &#1084;&#1077;&#1089;&#1090;&#1077;, &#1072; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1085;&#1077;&#1075;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1101;&#1090;&#1086;&#1075;&#1086; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1072;. <a href="../ru/Std_AddonMgr.html" title="Std AddonMgr/ru">&#1052;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1081;</a> &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1101;&#1090;&#1091; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091;.
</td></tr>
<tr>
<td><a href="../Template;Fake_heading.html" title="Template:Fake heading">Fake heading</a>
</td>
<td><div style="background: none; color: #000; margin: 0; overflow: hidden; page-break-after: avoid; page-break-before: avoid; border-bottom: 1px solid #a2a9b1; font-family: 'Linux Libertine', 'Georgia', 'Times', serif; font-size: 1.8em; font-weight: normal; line-height: 1.3; margin-bottom: 0.25em; margin-top: 1em; padding: 0;">&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;</div>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1074;&#1082;&#1083;&#1102;&#1095;&#1105;&#1085; &#1074; &#1086;&#1075;&#1083;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;.
</td></tr>
<tr>
<td><a href="../Template;GuiCommand.html" title="Template:GuiCommand">GuiCommand/ru</a>
</td>
<td>&#1057;&#1084;&#1086;&#1090;&#1088;&#1080; <a href="../ru/GuiCommand_model.html" title="GuiCommand model/ru">&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1084;&#1072;&#1085;&#1076;&#1099; Gui</a>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1087;&#1086;&#1083;&#1103; &#1089; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081; &#1076;&#1083;&#1103; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1086;&#1074; (&#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;).
</td></tr>
<tr>
<td><a href="../Template;TutorialInfo.html" title="Template:TutorialInfo">TutorialInfo/ru</a>
</td>
<td>&#1057;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, <a href="../ru/Basic_modeling_tutorial.html" title="Basic modeling tutorial/ru">&#1056;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086; &#1073;&#1072;&#1079;&#1086;&#1074;&#1086;&#1084;&#1091; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1102;</a>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1087;&#1086;&#1083;&#1077; &#1089; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081; &#1076;&#1083;&#1103; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; <a href="../ru/Tutorials.html" title="Tutorials/ru"> &#1091;&#1095;&#1077;&#1073;&#1085;&#1099;&#1093; &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083;&#1086;&#1074;</a>.
</td></tr>
<tr>
<td><a href="../Template;Macro.html" title="Template:Macro">Macro/ru</a>
</td>
<td>&#1057;&#1084;&#1086;&#1090;&#1088;&#1080;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; <a href="../ru/Macro_FlattenWire.html" title="Macro FlattenWire/ru">Macro FlattenWire</a>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1087;&#1086;&#1083;&#1077; &#1089; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081; &#1076;&#1083;&#1103; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; <a href="../ru/Macros.html" title="Macros/ru">&#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1086;&#1074;</a>.
</td></tr>
<tr>
<td><a href="../Template;Docnav.html" title="Template:Docnav">Docnav/ru</a>
</td>
<td><div class="docnav" style="background-color: #ececef; border: 1px solid #a2a9b1; padding: 2px 10px; margin: 10px 0; line-height: 1; clear: both; overflow: hidden;">
    <div style="margin: 4px 0; float: left;"><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-left.svg" decoding="async" width="16" height="16"></span></span> &#1054;&#1085;&#1083;&#1072;&#1081;&#1085;-&#1089;&#1087;&#1088;&#1072;&#1074;&#1082;&#1072;</div>
    <div style="margin: 4px 0; float: right;">&#1057;&#1087;&#1080;&#1089;&#1086;&#1082; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1081; <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-right.svg" decoding="async" width="16" height="16"></span></span></div>
    <div style="text-align:center"><a href="../ru/Online_Help_Toc.html" title="Online Help Toc/ru">&#1054;&#1075;&#1083;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;</a> <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Online_Help_Toc.svg" decoding="async" width="24" height="24"></span></span></div>
</div>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1089;&#1086; &#1089;&#1090;&#1088;&#1077;&#1083;&#1082;&#1072;&#1084;&#1080; &#1080; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1084;&#1080; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072;&#1084;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1072; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094; &#1074; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1081; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080;.
</td></tr>
<tr>
<td><a href="../Template;VeryImportantMessage.html" title="Template:VeryImportantMessage">VeryImportantMessage</a>
</td>
<td><div id="itsfree" style="text-align:center;color:black;background:#FDE0A8;margin:1em 7em;padding:0.5em 2em;border:2px solid #FF5706;">&#1042;&#1072;&#1078;&#1085;&#1086;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;</div>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1086;&#1082;&#1085;&#1072; &#1089; &#1086;&#1095;&#1077;&#1085;&#1100; &#1074;&#1072;&#1078;&#1085;&#1099;&#1084; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;&#1084;. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1101;&#1082;&#1086;&#1085;&#1086;&#1084;&#1085;&#1086;, &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; &#1074; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1087;&#1088;&#1077;&#1082;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1080; &#1090;&#1086;&#1084;&#1091; &#1087;&#1086;&#1076;&#1086;&#1073;&#1085;&#1086;&#1075;&#1086;.
</td></tr>
<tr>
<td><a href="../Template;Page_in_progress.html" title="Template:Page in progress">Page in progress/ru</a>
</td>
<td><div id="itsfree" style="text-align:center; background:#FDE0A8;margin:1em 7em;padding:0.5em 2em;border:2px solid #FF5706;">
<figure class="mw-halign-left" typeof="mw:File"><span><img src="https://upload.wikimedia.org/wikipedia/commons/d/d5/Under_construction_icon-blue.svg" decoding="async" width="45" height="38"></span><figcaption></figcaption></figure> &#1069;&#1090;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1089;&#1090;&#1072;&#1076;&#1080;&#1080; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080;. &#1055;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1085;&#1077; &#1087;&#1086;&#1084;&#1077;&#1095;&#1072;&#1081;&#1090;&#1077; &#1077;&#1105; &#1082;&#1072;&#1082; &#1087;&#1086;&#1076;&#1083;&#1077;&#1078;&#1072;&#1097;&#1091;&#1102; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1091;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1086;&#1085;&#1072; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1089;&#1103; &#1074; &#1073;&#1083;&#1080;&#1078;&#1072;&#1081;&#1096;&#1080;&#1077; &#1095;&#1072;&#1089;&#1099; &#1080; &#1076;&#1085;&#1080;.
</div><div style="clear:both"></div>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1101;&#1090;&#1086; &#1076;&#1083;&#1103; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1089;&#1105; &#1077;&#1097;&#1105; &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1074; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1077; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1080;&#1083;&#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1087;&#1077;&#1088;&#1077;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103;. &#1053;&#1077; &#1079;&#1072;&#1073;&#1091;&#1076;&#1100;&#1090;&#1077; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1101;&#1090;&#1086;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1075;&#1086;&#1090;&#1086;&#1074;&#1072;.
</td></tr>
<tr>
<td><a href="../Template;UnfinishedDocu.html" title="Template:UnfinishedDocu">UnfinishedDocu/ru</a>
</td>
<td><div style="text-align:center; background:#FDE0A8;margin:1em 7em;padding:0.5em 2em;border:2px solid #FF5706;">
<p>&#1069;&#1090;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1085;&#1077; &#1079;&#1072;&#1082;&#1086;&#1085;&#1095;&#1077;&#1085;&#1072;. &#1055;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1087;&#1086;&#1084;&#1086;&#1075;&#1080;&#1090;&#1077; &#1080; &#1074;&#1085;&#1077;&#1089;&#1080;&#1090;&#1077; &#1089;&#1074;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076; &#1074; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1091; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080;.
</p><p><a href="../ru/GuiCommand_model.html" title="GuiCommand model/ru">&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; Gui</a> &#1086;&#1073;&#1098;&#1103;&#1089;&#1085;&#1103;&#1077;&#1090;, &#1082;&#1072;&#1082; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1079;&#1072;&#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1099; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;. &#1055;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; <a href="../ru/Category;UnfinishedDocu.html" title="Category:UnfinishedDocu/ru"> Category:UnfinishedDocu/ru</a>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1085;&#1077;&#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1105;&#1085;&#1085;&#1099;&#1093; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;, &#1087;&#1086;&#1076;&#1086;&#1073;&#1085;&#1099;&#1093; &#1101;&#1090;&#1086;&#1081;. &#1057;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; <a href="../ru/Category;Command_Reference.html" title="Category:Command Reference/ru"> Category:Command Reference/ru</a> &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;.
</p><p>&#1057;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; <a class="mw-selflink selflink">Wiki &#1057;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;</a>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1079;&#1085;&#1072;&#1090;&#1100; &#1086; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1074;&#1080;&#1082;&#1080;-&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;, &#1080; &#1079;&#1072;&#1081;&#1076;&#1080;&#1090;&#1077; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; <a href="../ru/Help_FreeCAD.html" title="Help FreeCAD/ru">&#1055;&#1086;&#1084;&#1086;&#1075;&#1080; FreeCAD</a>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1079;&#1085;&#1072;&#1090;&#1100; &#1086; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1072;&#1093;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084;&#1080; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1074;&#1085;&#1077;&#1089;&#1090;&#1080; &#1089;&#1074;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076;.
</p>
</div>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1087;&#1086;&#1083;&#1103;, &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1097;&#1077;&#1075;&#1086; &#1085;&#1072; &#1085;&#1077;&#1079;&#1072;&#1082;&#1086;&#1085;&#1095;&#1077;&#1085;&#1085;&#1091;&#1102; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080;.
</td></tr>
<tr>
<td><a href="../Template;Softredirect.html" title="Template:Softredirect">Softredirect</a>
</td>
<td>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086;&#1075;&#1086; &#1087;&#1077;&#1088;&#1077;&#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1074;&#1099; &#1087;&#1077;&#1088;&#1077;&#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1077;&#1089;&#1100; &#1085;&#1072; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, Media: &#1080;&#1083;&#1080; Category:), &#1074; &#1101;&#1090;&#1080;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086;&#1077; &#1087;&#1077;&#1088;&#1077;&#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1086;.
</td></tr>
<tr>
<td><a href="../Template;Quote.html" title="Template:Quote">Quote</a>
</td>
<td><blockquote class="templatequote"><p>&#1050;&#1088;&#1080;&#1082;&#1085;&#1080; "&#1061;&#1072;&#1086;&#1089;" &#1080; &#1089;&#1087;&#1091;&#1089;&#1090;&#1080; &#1087;&#1089;&#1086;&#1074; &#1074;&#1086;&#1081;&#1085;&#1099;.</p><div class="templatequotecite">&mdash;&#1059;&#1080;&#1083;&#1100;&#1103;&#1084; &#1064;&#1077;&#1082;&#1089;&#1087;&#1080;&#1088;,&nbsp;<cite><i>&#1070;&#1083;&#1080;&#1081; &#1062;&#1077;&#1079;&#1072;&#1088;&#1100;", &#1072;&#1082;&#1090; III, &#1089;&#1094;&#1077;&#1085;&#1072; I</i></cite></div>
</blockquote>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1075;&#1086; &#1087;&#1086;&#1083;&#1103; &#1089; &#1073;&#1091;&#1082;&#1074;&#1077;&#1085;&#1085;&#1086;&#1081; &#1094;&#1080;&#1090;&#1072;&#1090;&#1086;&#1081; &#1080; &#1089;&#1089;&#1099;&#1083;&#1082;&#1086;&#1081;.
</td></tr>
<tr>
<td><a href="../Template;Userdocnavi.html" title="Template:Userdocnavi">Userdocnavi/ru</a>, <a href="../Template;Powerdocnavi.html" title="Template:Powerdocnavi">Powerdocnavi/ru</a>
</td>
<td>
</td>
<td>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1080;&#1093; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1087;&#1086;&#1083;&#1077;&#1081; &#1085;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1080; &#1076;&#1083;&#1103; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;, &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080; &#1086;&#1087;&#1099;&#1090;&#1085;&#1086;&#1075;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1080; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072;. &#1069;&#1090;&#1086; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1080;&#1090;&#1100; &#1084;&#1077;&#1078;&#1076;&#1091; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1084;&#1080; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1072;&#1084;&#1080; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080;. &#1054;&#1085;&#1080; &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1102;&#1090; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1091;&#1102; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; &#1074; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1091;&#1102; &#1082;&#1072;&#1090;&#1077;&#1075;&#1086;&#1088;&#1080;&#1102;.
</td></tr></tbody></table>
</div> 
</div> 
<div class="mw-collapsible mw-collapsed toccolours">
<p><span id="Graphics"></span>
</p>
<h2><span id=".D0.93.D1.80.D0.B0.D1.84.D0.B8.D0.BA.D0.B0"></span><span class="mw-headline" id="&#1043;&#1088;&#1072;&#1092;&#1080;&#1082;&#1072;">&#1043;&#1088;&#1072;&#1092;&#1080;&#1082;&#1072;</span></h2>
<div class="mw-collapsible-content">
<p>&#1048;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080; &#1089;&#1082;&#1088;&#1080;&#1085;&#1096;&#1086;&#1090;&#1099; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1087;&#1086;&#1083;&#1085;&#1086;&#1081; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080; FreeCAD. &#1054;&#1085;&#1080; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1099; &#1076;&#1083;&#1103; &#1080;&#1083;&#1083;&#1102;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1080; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1086;&#1074; &#1080; &#1091;&#1095;&#1077;&#1073;&#1085;&#1099;&#1093; &#1087;&#1086;&#1089;&#1086;&#1073;&#1080;&#1081;. &#1048;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1099; &#1074; &#1080;&#1093; &#1086;&#1088;&#1080;&#1075;&#1080;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1077;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1085;&#1080; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1083;&#1080; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1091;&#1102; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1102; &#1080; &#1073;&#1099;&#1083;&#1080; &#1095;&#1080;&#1090;&#1072;&#1073;&#1077;&#1083;&#1100;&#1085;&#1099;, &#1077;&#1089;&#1083;&#1080; &#1086;&#1085;&#1080; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090; &#1074; &#1089;&#1077;&#1073;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;. &#1056;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; <a href="../ru/Bitmap.html" title="Bitmap/ru">&#1088;&#1072;&#1089;&#1090;&#1088;&#1086;&#1074;&#1099;&#1093; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1081;</a> &#1085;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1099;.
</p><p>&#1048;&#1079;&#1073;&#1077;&#1075;&#1072;&#1081;&#1090;&#1077; &#1072;&#1085;&#1080;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1082;&#1072;&#1088;&#1090;&#1080;&#1085;&#1086;&#1082; (GIF) &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;&#1093; &#1086;&#1073;&#1097;&#1077;&#1081; &#1089;&#1087;&#1088;&#1072;&#1074;&#1082;&#1080;. &#1040;&#1085;&#1080;&#1084;&#1072;&#1094;&#1080;&#1080; &#1080; &#1074;&#1080;&#1076;&#1077;&#1086; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1079;&#1072;&#1088;&#1077;&#1079;&#1077;&#1088;&#1074;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1083;&#1103; &#1091;&#1095;&#1077;&#1073;&#1085;&#1099;&#1093; &#1087;&#1086;&#1089;&#1086;&#1073;&#1080;&#1081;, &#1085;&#1077; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1085;&#1099;&#1093; &#1076;&#1083;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; offline &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080; &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077; PDF.
</p><p>&#1048;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1084;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1100; &#1095;&#1077;&#1088;&#1077;&#1079; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; <a href="../ru/Special;Upload.html" title="Special:Upload/ru">&#1047;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1100; &#1092;&#1072;&#1081;&#1083;</a>.
</p><p><span id="Name"></span>
</p>
<h3><span id=".D0.9D.D0.B0.D0.B7.D0.B2.D0.B0.D0.BD.D0.B8.D1.8F"></span><span class="mw-headline" id="&#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1103;">&#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1103;</span></h3>
<p>&#1044;&#1072;&#1074;&#1072;&#1081;&#1090;&#1077; &#1086;&#1089;&#1084;&#1099;&#1089;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084;. &#1045;&#1089;&#1083;&#1080; &#1091; &#1074;&#1072;&#1089; &#1077;&#1089;&#1090;&#1100; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;, &#1076;&#1077;&#1084;&#1086;&#1085;&#1089;&#1090;&#1088;&#1080;&#1088;&#1091;&#1102;&#1097;&#1077;&#1077; &#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1080;&#1089;&#1090;&#1080;&#1082;&#1080; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1081; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1101;&#1090;&#1086;&#1081; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1089; <code>_example</code> &#1074; &#1082;&#1086;&#1085;&#1094;&#1077;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1076;&#1083;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; <a href="../ru/Draft_Offset.html" title="Draft Offset/ru">Draft Offset</a> &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; <code>Draft_Offset_example.png</code>.
</p><p><span id="Screen_capture"></span>
</p>
<h3><span id=".D0.A1.D0.BD.D0.B8.D0.BC.D0.BA.D0.B8_.D1.8D.D0.BA.D1.80.D0.B0.D0.BD.D0.B0"></span><span class="mw-headline" id="&#1057;&#1085;&#1080;&#1084;&#1082;&#1080;_&#1101;&#1082;&#1088;&#1072;&#1085;&#1072;">&#1057;&#1085;&#1080;&#1084;&#1082;&#1080; &#1101;&#1082;&#1088;&#1072;&#1085;&#1072;</span></h3>
<p>&#1056;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1084;&#1099;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1076;&#1083;&#1103; &#1089;&#1085;&#1080;&#1084;&#1082;&#1086;&#1074; &#1101;&#1082;&#1088;&#1072;&#1085;&#1072;::
</p>
<ul><li>400x200 (&#1080;&#1083;&#1080; &#1096;&#1080;&#1088;&#1080;&#1085;&#1072;=400 &#1080; &#1074;&#1099;&#1089;&#1086;&#1090;&#1072;&lt;=200) &#1076;&#1083;&#1103; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094; <a href="../ru/GuiCommand_model.html" title="GuiCommand model/ru">&#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1093; &#1082;&#1086;&#1084;&#1072;&#1085;&#1085;&#1076;&#1099; Gui</a>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1083;&#1086;&#1089;&#1100; &#1074; &#1083;&#1077;&#1074;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1076;&#1083;&#1103; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1093; &#1089;&#1085;&#1080;&#1084;&#1082;&#1086;&#1074;.</li>
<li>600x400 (&#1080;&#1083;&#1080; &#1096;&#1080;&#1088;&#1080;&#1085;&#1072;=600 &#1080; &#1074;&#1099;&#1089;&#1086;&#1090;&#1072;&lt;=400), &#1076;&#1083;&#1103; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094; <a href="../ru/GuiCommand_model.html" title="GuiCommand model/ru">&#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1093; &#1082;&#1086;&#1084;&#1072;&#1085;&#1085;&#1076;&#1099; Gui</a>, &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1082;&#1086;&#1075;&#1076;&#1072; &#1074;&#1072;&#1084; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1085;&#1091;&#1078;&#1085;&#1086; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;&#1075;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072;, &#1080; &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1089;&#1090;&#1072;&#1088;&#1081;&#1090;&#1077;&#1089;&#1100; &#1091;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074; &#1083;&#1077;&#1074;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1076;&#1083;&#1103; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1093; &#1089;&#1085;&#1080;&#1084;&#1082;&#1086;&#1074;.</li>
<li>1024x768 (&#1080;&#1083;&#1080; &#1096;&#1080;&#1088;&#1080;&#1085;&#1072;=1024 &#1080; &#1074;&#1099;&#1089;&#1086;&#1090;&#1072;&lt;=768), &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1087;&#1086;&#1083;&#1085;&#1086;&#1101;&#1082;&#1088;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1081;.</li>
<li>&#1055;&#1088;&#1080; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1080; &#1076;&#1077;&#1090;&#1072;&#1083;&#1077;&#1081; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099; &#1084;&#1077;&#1085;&#1100;&#1096;&#1080;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099;.</li>
<li>&#1048;&#1079;&#1073;&#1077;&#1075;&#1072;&#1081;&#1090;&#1077; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1081; &#1089; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1084; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;&#1084;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1086;&#1085;&#1080; &#1085;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1086;&#1095;&#1077;&#1085;&#1100; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1080;&#1084;&#1099;&#1084;&#1080; &#1076;&#1083;&#1103; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1074;&#1080;&#1076;&#1086;&#1074; &#1076;&#1080;&#1089;&#1087;&#1083;&#1077;&#1077;&#1074; &#1080;&#1083;&#1080; &#1087;&#1077;&#1095;&#1072;&#1090;&#1085;&#1086;&#1081; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080; &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077; PDF.</li></ul>
<p>&#1042;&#1099; &#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1079;&#1072;&#1074;&#1080;&#1089;&#1077;&#1090;&#1100; &#1086;&#1090; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1081; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1075;&#1086; &#1089;&#1090;&#1086;&#1083;&#1072; &#1080;&#1083;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1087;&#1088;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1080; &#1089;&#1082;&#1088;&#1080;&#1085;&#1096;&#1086;&#1090;&#1086;&#1074;, &#1087;&#1086; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1090;&#1089;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1080;&#1079;&#1091;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072; FreeCAD &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;.
</p><p>&#1044;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1089;&#1082;&#1088;&#1080;&#1085;&#1096;&#1086;&#1090;&#1086;&#1074; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1086;&#1087;&#1094;&#1080;&#1080;, &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084;&#1099;&#1077; &#1074;&#1072;&#1096;&#1077;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1086;&#1081;, &#1080;&#1083;&#1080; &#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1101;&#1090;&#1080;&#1093; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1086;&#1074;: <span typeof="mw:File"><a href="../index.php?title=Snip.png&amp;filetimestamp=20190803232007&amp;.html" class="mw-file-description"><img src="../File/Snip.png" decoding="async" width="24" height="23"></a></span> <a href="../ru/Macro_Snip.html" title="Macro Snip/ru">&#1052;&#1072;&#1082;&#1088;&#1086;&#1089; Snip (&#1054;&#1073;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100;)</a> &#1080; <span typeof="mw:File"><a href="../index.php?title=Macro_Screen_Wiki.png&amp;filetimestamp=20200321195325&amp;.html" class="mw-file-description"><img src="../File/Macro_Screen_Wiki.png" decoding="async" width="24" height="24"></a></span> <a href="../ru/Macro_Screen_Wiki.html" title="Macro Screen Wiki/ru">&#1052;&#1072;&#1082;&#1088;&#1086;&#1089; Screen Wiki (&#1057;&#1085;&#1080;&#1084;&#1086;&#1082; &#1076;&#1083;&#1103; &#1042;&#1080;&#1082;&#1080;)</a>.
</p><p><span id="Text"></span>
</p>
<h4><span id=".D0.A2.D0.B5.D0.BA.D1.81.D1.82"></span><span class="mw-headline" id="&#1058;&#1077;&#1082;&#1089;&#1090;">&#1058;&#1077;&#1082;&#1089;&#1090;</span></h4>
<p>&#1063;&#1090;&#1086;&#1073;&#1099; &#1086;&#1073;&#1083;&#1077;&#1075;&#1095;&#1080;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080;, &#1089;&#1090;&#1072;&#1088;&#1072;&#1081;&#1090;&#1077;&#1089;&#1100; &#1080;&#1079;&#1073;&#1077;&#1075;&#1072;&#1090;&#1100; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1081; &#1101;&#1082;&#1088;&#1072;&#1085;&#1072;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1080;&#1093; &#1090;&#1077;&#1082;&#1089;&#1090;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1080;&#1079;&#1073;&#1077;&#1078;&#1072;&#1090;&#1100;, &#1089;&#1076;&#1077;&#1083;&#1072;&#1081;&#1090;&#1077; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1089;&#1085;&#1080;&#1084;&#1082;&#1080; &#1101;&#1082;&#1088;&#1072;&#1085;&#1072; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072; &#1080; <a href="../ru/3D_view.html" title="3D view/ru">3D &#1074;&#1080;&#1076;&#1072;</a>. &#1048;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; 3D-&#1074;&#1080;&#1076;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; &#1082;&#1072;&#1078;&#1076;&#1086;&#1084; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1077;, &#1072; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1095;&#1080;&#1082; &#1087;&#1088;&#1080; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1089;&#1085;&#1080;&#1084;&#1086;&#1082; &#1101;&#1082;&#1088;&#1072;&#1085;&#1072; &#1083;&#1086;&#1082;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072;.
</p><p><span id="Icons_and_graphics"></span>
</p>
<h3><span id=".D0.98.D0.BA.D0.BE.D0.BD.D0.BA.D0.B8_.D0.B8_.D0.B3.D1.80.D0.B0.D1.84.D0.B8.D0.BA.D0.B0"></span><span class="mw-headline" id="&#1048;&#1082;&#1086;&#1085;&#1082;&#1080;_&#1080;_&#1075;&#1088;&#1072;&#1092;&#1080;&#1082;&#1072;">&#1048;&#1082;&#1086;&#1085;&#1082;&#1080; &#1080; &#1075;&#1088;&#1072;&#1092;&#1080;&#1082;&#1072;</span></h3>
<p>&#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077;&#1089;&#1100; &#1082; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; <a href="../ru/Artwork.html" title="Artwork/ru">Artwork</a> &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; &#1080;&#1083;&#1083;&#1102;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1081; &#1080; &#1080;&#1082;&#1086;&#1085;&#1086;&#1082;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1099;&#1083;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1099; &#1076;&#1083;&#1103; FreeCAD &#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1099; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;&#1093; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1077;&#1089;&#1090;&#1080; &#1089;&#1074;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076; &#1074; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1080;&#1082;&#1086;&#1085;&#1086;&#1082;, &#1087;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1081;&#1090;&#1077; <a href="../ru/Artwork_Guidelines.html" title="Artwork Guidelines/ru">Artwork &#1056;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086; &#1093;&#1091;&#1076;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1084;&#1091; &#1086;&#1092;&#1086;&#1088;&#1084;&#1083;&#1077;&#1085;&#1080;&#1102;</a>.
</p>
</div> 
</div> 
<div class="mw-collapsible mw-collapsed toccolours">
<p><span id="Translations"></span>
</p>
<h2><span id=".D0.9F.D0.B5.D1.80.D0.B5.D0.B2.D0.BE.D0.B4.D1.8B"></span><span class="mw-headline" id="&#1055;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1099;">&#1055;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1099;</span></h2>
<div class="mw-collapsible-content">
<p>&#1055;&#1086; &#1086;&#1073;&#1097;&#1077;&#1084;&#1091; &#1084;&#1085;&#1077;&#1085;&#1080;&#1102;, &#1101;&#1090;&#1072;&#1083;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077;&#1081; &#1074; &#1074;&#1080;&#1082;&#1080; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1072;&#1085;&#1075;&#1083;&#1080;&#1081;&#1089;&#1082;&#1072;&#1103; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1072; &#1087;&#1077;&#1088;&#1074;&#1086;&#1081;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1080;&#1083;&#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091;, &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1101;&#1090;&#1086; &#1085;&#1091;&#1078;&#1085;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1085;&#1072; &#1072;&#1085;&#1075;&#1083;&#1080;&#1081;&#1089;&#1082;&#1086;&#1081; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077;, &#1080; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1087;&#1077;&#1088;&#1077;&#1085;&#1077;&#1089;&#1090;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072; &#1087;&#1077;&#1088;&#1077;&#1074;&#1077;&#1076;&#1105;&#1085;&#1085;&#1091;&#1102; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091;.
</p><p>FreeCAD wiki &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077; &#1076;&#1083;&#1103; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1087;&#1088;&#1086;&#1097;&#1077; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1072;&#1084;&#1080; &#1084;&#1077;&#1078;&#1076;&#1091; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;&#1084;&#1080;; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1077;&#1077; &#1089;&#1084;&#1086;&#1090;&#1088;&#1080; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083; <a href="../ru/Localisation.html#Translating_the_wiki" title="Localisation/ru">&#1051;&#1086;&#1082;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; &#1055;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076; FreeCAD wiki</a>.
</p><p>&#1044;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1099;&#1084;&#1080; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1072;&#1084;&#1080; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103;:
</p>
<ul><li><a rel="nofollow" class="external text" href="http://en.wikipedia.org/wiki/List_of_ISO_639-1_codes">&#1071;&#1079;&#1099;&#1082;&#1086;&#1074;&#1099;&#1077; &#1082;&#1086;&#1076;&#1099; ISO</a> &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1076;&#1074;&#1091;&#1093;&#1073;&#1091;&#1082;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076; &#1076;&#1083;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1086;&#1075;&#1086; &#1103;&#1079;&#1099;&#1082;&#1072;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1074;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1087;&#1077;&#1088;&#1077;&#1074;&#1077;&#1089;&#1090;&#1080;.</li>
<li><a rel="nofollow" class="external text" href="http://translate.google.com/">Google &#1055;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1095;&#1080;&#1082;</a> &#1076;&#1083;&#1103; &#1087;&#1086;&#1084;&#1086;&#1097;&#1080; &#1089; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1072;&#1084;&#1080;.</li>
<li><a rel="nofollow" class="external text" href="https://www.deepl.com/translator">Deepl &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1095;&#1080;&#1082;</a> &#1076;&#1083;&#1103; &#1087;&#1086;&#1084;&#1086;&#1097;&#1080; &#1089; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1072;&#1084;&#1080;.</li></ul>
<p><span id="Some_tips_for_translators"></span>
</p>
<h2><span id=".D0.9D.D0.B5.D1.81.D0.BA.D0.BE.D0.BB.D1.8C.D0.BA.D0.BE_.D1.81.D0.BE.D0.B2.D0.B5.D1.82.D0.BE.D0.B2_.D0.B4.D0.BB.D1.8F_.D0.BF.D0.B5.D1.80.D0.B5.D0.B2.D0.BE.D0.B4.D1.87.D0.B8.D0.BA.D0.BE.D0.B2"></span><span class="mw-headline" id="&#1053;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086;_&#1089;&#1086;&#1074;&#1077;&#1090;&#1086;&#1074;_&#1076;&#1083;&#1103;_&#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1095;&#1080;&#1082;&#1086;&#1074;">&#1053;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089;&#1086;&#1074;&#1077;&#1090;&#1086;&#1074; &#1076;&#1083;&#1103; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1095;&#1080;&#1082;&#1086;&#1074;</span></h2>
<p><span id="Translate_GuiCommand"></span>
</p>
<h3><span id=".D0.9F.D0.B5.D1.80.D0.B5.D0.B2.D0.BE.D0.B4_GuiCommand_.28.D0.9A.D0.BE.D0.BC.D0.B0.D0.BD.D0.B4.D0.B0.D0.98.D0.BD.D1.82.D0.B5.D1.80.D1.84.D0.B5.D0.B9.D1.81.D0.B0.29"></span><span class="mw-headline" id="&#1055;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;_GuiCommand_(&#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072;&#1048;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072;)">&#1055;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076; GuiCommand (&#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072;&#1048;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072;)</span></h3>
<pre>{{GuiCommand
|Name=FEM EquationFlux
|MenuLocation=Solve &rarr; Flux equation
|Workbenches=[[FEM_Workbench|FEM]]
|Shortcut={{KEY|F}} {{KEY|S}}
|Version=0.17
|SeeAlso=[[FEM_tutorial|FEM tutorial]]
}}
</pre>
<p>&#1055;&#1086;&#1089;&#1083;&#1077; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1072;:
</p>
<pre>{{GuiCommand/fr
|Name=FEM EquationFlux
|Name/fr=FEM &Eacute;quation d'&eacute;coulement
|MenuLocation=Solveur &rarr; &Eacute;quation de flux
|Workbenches=[[FEM_Workbench/fr|Atelier FEM]]
|Shortcut={{KEY|F}} {{KEY|S}}
|Version=0.17
|SeeAlso=[[FEM_tutorial/fr|FEM Tutoriel]]
}}
</pre>
<p><span id="Translate_navi"></span>
</p>
<h3><span id=".D0.9F.D0.B5.D1.80.D0.B5.D0.B2.D0.BE.D0.B4_navi_.28.D0.BD.D0.B0.D0.B2.D0.B8.D0.B3.D0.B0.D1.86.D0.B8.D0.B8.29"></span><span class="mw-headline" id="&#1055;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;_navi_(&#1085;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1080;)">&#1055;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076; navi (&#1085;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1080;)</span></h3>
<pre>{{FEM_Tools_navi}}
</pre>
<p>&#1055;&#1086;&#1089;&#1083;&#1077; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1072;:
</p>
<pre>{{FEM_Tools_navi/fr}}
</pre>
<p><span id="Translate_link"></span>
</p>
<h3><span id=".D0.9F.D0.B5.D1.80.D0.B5.D0.B2.D0.BE.D0.B4_.D1.81.D1.81.D1.8B.D0.BB.D0.BE.D0.BA"></span><span class="mw-headline" id="&#1055;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;_&#1089;&#1089;&#1099;&#1083;&#1086;&#1082;">&#1055;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076; &#1089;&#1089;&#1099;&#1083;&#1086;&#1082;</span></h3>
<pre>[[Part_Workbench|Part Workbench]]
</pre>
<p>&#1055;&#1086;&#1089;&#1083;&#1077; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1072;:
</p>
<pre>[[Part_Workbench/fr|Atelier Part]]
</pre>
<p><span id="Translate_Docnav"></span>
</p>
<h3><span id=".D0.9F.D0.B5.D1.80.D0.B5.D0.B2.D0.BE.D0.B4_Docnav"></span><span class="mw-headline" id="&#1055;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;_Docnav">&#1055;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076; Docnav</span></h3>
<pre>{{Docnav
|[[About_FreeCAD|About FreeCAD]]
|[[Installing_on_Windows|Installing on Windows]]
}}
</pre>
<p>&#1055;&#1086;&#1089;&#1083;&#1077; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1072;:
</p>
<pre>{{Docnav/fr
|[[About_FreeCAD/fr|&Agrave; propos de FreeCAD]]
|[[Installing_on_Windows/fr|Installation sous Windows]]
}}
</pre>
<p>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1089; &#1080;&#1082;&#1086;&#1085;&#1082;&#1072;&#1084;&#1080;:
</p>
<pre>{{Docnav
|[[Std_Save|Save]]
|[[Std_SaveCopy|SaveCopy]]
|[[Std_File_Menu|Std File Menu]]
|IconL=Std_Save.svg
|IconR=Std_SaveCopy.svg
|IconC=Freecad.svg
}}
</pre>
<p>&#1055;&#1086;&#1089;&#1083;&#1077; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1072;:
</p>
<pre>{{Docnav/fr
|[[Std_Save/fr|Enregistrer]]
|[[Std_SaveCopy/fr|Enregistrer une copie]]
|[[Std_File_Menu/fr|Menu fichier]]
|IconL=Std_Save.svg
|IconR=Std_SaveCopy.svg
|IconC=Freecad.svg
}}
</pre>
</div> 
</div> 
<p><span id="Create,_rename_and_delete_pages"></span>
</p>
<h2><span id=".D0.A1.D0.BE.D0.B7.D0.B4.D0.B0.D0.BD.D0.B8.D0.B5.2C_.D0.BF.D0.B5.D1.80.D0.B5.D0.B8.D0.BC.D0.B5.D0.BD.D0.BE.D0.B2.D1.8B.D0.B2.D0.B0.D0.BD.D0.B8.D0.B5_.D0.B8_.D1.83.D0.B4.D0.B0.D0.BB.D0.B5.D0.BD.D0.B8.D0.B5_.D1.81.D1.82.D1.80.D0.B0.D0.BD.D0.B8.D1.86"></span><span class="mw-headline" id="&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077;,_&#1087;&#1077;&#1088;&#1077;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1099;&#1074;&#1072;&#1085;&#1080;&#1077;_&#1080;_&#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1077;_&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;">&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077;, &#1087;&#1077;&#1088;&#1077;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1099;&#1074;&#1072;&#1085;&#1080;&#1077; &#1080; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1077; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;</span></h2>
<p><span id="Create_pages"></span>
</p>
<h3><span id=".D0.A1.D0.BE.D0.B7.D0.B4.D0.B0.D0.BD.D0.B8.D0.B5_.D1.81.D1.82.D1.80.D0.B0.D0.BD.D0.B8.D1.86"></span><span class="mw-headline" id="&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077;_&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;">&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;</span></h3>
<div class="mw-translate-fuzzy">
<p>&#1055;&#1088;&#1077;&#1078;&#1076;&#1077; &#1095;&#1077;&#1084; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1085;&#1086;&#1074;&#1091;&#1102; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091;, &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1100;&#1090;&#1077;, &#1085;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1083;&#1080; &#1091;&#1078;&#1077; &#1087;&#1086;&#1093;&#1086;&#1078;&#1072;&#1103; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;. &#1045;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086; &#1090;&#1072;&#1082;, &#1090;&#1086; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1083;&#1091;&#1095;&#1096;&#1077; &#1086;&#1090;&#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1091;&#1102; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091;. &#1042; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1089;&#1086;&#1084;&#1085;&#1077;&#1085;&#1080;&#1081; &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1086;&#1090;&#1082;&#1088;&#1086;&#1081;&#1090;&#1077; &#1090;&#1077;&#1084;&#1091; &#1085;&#1072; <a rel="nofollow" class="external text" href="https://forum.freecadweb.org/viewforum.php?f=21">Wiki &#1092;&#1086;&#1088;&#1091;&#1084;&#1077;</a>.
</p>
</div>
<div class="mw-translate-fuzzy">
<p>&#1063;&#1090;&#1086;&#1073;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1085;&#1086;&#1074;&#1091;&#1102; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091;, &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077; &#1086;&#1076;&#1085;&#1086; &#1080;&#1079; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1081;:
</p>
<ul><li>&#1055;&#1077;&#1088;&#1077;&#1081;&#1076;&#1080;&#1090;&#1077; &#1087;&#1086; URL-&#1072;&#1076;&#1088;&#1077;&#1089;&#1091; &#1089; &#1085;&#1091;&#1078;&#1085;&#1099;&#1084; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;: <code>https://wiki.freecadweb.org/My_New_Page</code>, &#1080; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1085;&#1072; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; '&#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1101;&#1090;&#1091; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091;'.</li>
<li>&#1042;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077; &#1074;&#1080;&#1082;&#1080;-&#1087;&#1086;&#1080;&#1089;&#1082; &#1087;&#1086; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1102; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1080; &#1097;&#1105;&#1083;&#1082;&#1085;&#1080;&#1090;&#1077; &#1087;&#1086; &#1082;&#1088;&#1072;&#1089;&#1085;&#1086;&#1084;&#1091; &#1090;&#1077;&#1082;&#1089;&#1090;&#1091; &#1074; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077; '&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; "&#1052;&#1086;&#1103; &#1085;&#1086;&#1074;&#1072;&#1103; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;" &#1074; &#1101;&#1090;&#1086;&#1081; &#1074;&#1080;&#1082;&#1080;!'.</li></ul>
</div>
<p><span id="Rename_pages"></span>
</p>
<h3><span id=".D0.9F.D0.B5.D1.80.D0.B5.D0.B8.D0.BC.D0.B5.D0.BD.D0.BE.D0.B2.D1.8B.D0.B2.D0.B0.D0.BD.D0.B8.D0.B5_.D1.81.D1.82.D1.80.D0.B0.D0.BD.D0.B8.D1.86"></span><span class="mw-headline" id="&#1055;&#1077;&#1088;&#1077;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1099;&#1074;&#1072;&#1085;&#1080;&#1077;_&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;">&#1055;&#1077;&#1088;&#1077;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1099;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;</span></h3>
<div class="mw-translate-fuzzy">
<p>&#1055;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; FreeCAD &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1084;, &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1097;&#1080;&#1084;&#1089;&#1103; &#1074; &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1086;&#1081; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1077;, &#1080;&#1085;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1087;&#1077;&#1088;&#1077;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1090;&#1100; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1074;&#1080;&#1082;&#1080;. &#1045;&#1089;&#1083;&#1080; &#1074; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1084; &#1082;&#1086;&#1076;&#1077; &#1084;&#1077;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;, &#1090;&#1086; &#1080; &#1074;&#1080;&#1082;&#1080;-&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;, &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1091;&#1102;&#1097;&#1080;&#1077; &#1080;&#1093;, &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1099;. &#1069;&#1090;&#1086; &#1084;&#1086;&#1075;&#1091;&#1090; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1072;&#1076;&#1084;&#1080;&#1085;&#1080;&#1089;&#1090;&#1088;&#1072;&#1090;&#1086;&#1088;&#1099; &#1074;&#1080;&#1082;&#1080;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1089;&#1086;&#1086;&#1073;&#1097;&#1080;&#1090;&#1100; &#1080;&#1084; &#1086;&#1073; &#1101;&#1090;&#1086;&#1084;, &#1086;&#1090;&#1082;&#1088;&#1086;&#1081;&#1090;&#1077; &#1090;&#1077;&#1084;&#1091; &#1085;&#1072; &#1092;&#1086;&#1088;&#1091;&#1084;&#1077; <a rel="nofollow" class="external text" href="https://forum.freecadweb.org/viewforum.php?f=21">Wiki</a> &#1080; &#1091;&#1082;&#1072;&#1078;&#1080;&#1090;&#1077; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1091;&#1102; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1102; &#1087;&#1077;&#1088;&#1077;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1081; &#1092;&#1086;&#1088;&#1084;&#1077;:
</p>
</div>
<pre>old name         new name
Old_page_name_1  New_page_name_1
Old_page_name_2  New_page_name_2
...
</pre>
<p><span id="Delete_files_and_pages"></span>
</p>
<h3><span id=".D0.A3.D0.B4.D0.B0.D0.BB.D0.B5.D0.BD.D0.B8.D0.B5_.D1.84.D0.B0.D0.B9.D0.BB.D0.BE.D0.B2_.D0.B8_.D1.81.D1.82.D1.80.D0.B0.D0.BD.D0.B8.D1.86"></span><span class="mw-headline" id="&#1059;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1077;_&#1092;&#1072;&#1081;&#1083;&#1086;&#1074;_&#1080;_&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;">&#1059;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1077; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1080; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;</span></h3>
<div class="mw-translate-fuzzy">
<p>&#1042; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1092;&#1072;&#1081;&#1083;, &#1087;&#1077;&#1088;&#1077;&#1081;&#1076;&#1080;&#1090;&#1077; &#1085;&#1072; &#1077;&#1075;&#1086; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; (<code>https://www.freecadweb.org/wiki/File:***.***</code>) &#1080; &#1086;&#1090;&#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086;. &#1053;&#1077;&#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086; &#1086;&#1090; &#1090;&#1086;&#1075;&#1086;, &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1083;&#1080; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072; &#1087;&#1091;&#1089;&#1090;&#1086;&#1081; &#1080;&#1083;&#1080; &#1085;&#1077;&#1090;, &#1076;&#1086;&#1073;&#1072;&#1074;&#1100;&#1090;&#1077; &#1101;&#1090;&#1086; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;: <code>{{Delete}}</code> &#1080; &#1087;&#1088;&#1103;&#1084;&#1086; &#1087;&#1086;&#1076; &#1085;&#1080;&#1084; &#1086;&#1087;&#1080;&#1096;&#1080;&#1090;&#1077;, &#1087;&#1086;&#1095;&#1077;&#1084;&#1091; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1072;. &#1055;&#1086;&#1084;&#1080;&#1084;&#1086; &#1101;&#1090;&#1086;&#1075;&#1086;, &#1086;&#1090;&#1082;&#1088;&#1086;&#1081;&#1090;&#1077; &#1090;&#1077;&#1084;&#1091; &#1085;&#1072; <a rel="nofollow" class="external text" href="https://forum.freecadweb.org/viewforum.php?f=21">&#1042;&#1080;&#1082;&#1080;-&#1092;&#1086;&#1088;&#1091;&#1084;&#1077;</a>.
</p>
</div>
<p>&#1044;&#1083;&#1103; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1072; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1095;&#1085;&#1072;&#1103;.
</p><p><span id="Discussion"></span>
</p>
<h2><span id=".D0.9E.D0.B1.D1.81.D1.83.D0.B6.D0.B4.D0.B5.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1054;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077;">&#1054;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077;</span></h2>
<div class="mw-translate-fuzzy">
<p>&#1055;&#1086;&#1076;&#1092;&#1086;&#1088;&#1091;&#1084; <a rel="nofollow" class="external text" href="http://forum.freecadweb.org/viewforum.php?f=21">Development/Wiki subforum</a> &#1074; &#1092;&#1086;&#1088;&#1091;&#1084;&#1077; <a rel="nofollow" class="external text" href="https://forum.freecadweb.org">FreeCAD</a> &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085; &#1076;&#1083;&#1103; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103; &#1090;&#1077;&#1084; &#1074;&#1080;&#1082;&#1080;, &#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1075;&#1086; &#1074;&#1080;&#1076;&#1072; &#1074;&#1080;&#1082;&#1080; &#1080; &#1074;&#1089;&#1077;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1086; &#1089; &#1074;&#1080;&#1082;&#1080;. &#1053;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1081;&#1090;&#1077; &#1090;&#1091;&#1076;&#1072; &#1089;&#1074;&#1086;&#1080; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099; &#1080; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;.
</p>
</div>
<p><span id="Terminology_-_naming_policy"></span>
</p>
<h2><span id=".D0.A2.D0.B5.D1.80.D0.BC.D0.B8.D0.BD.D0.BE.D0.BB.D0.BE.D0.B3.D0.B8.D1.8F_-_.D1.81.D1.82.D1.80.D0.B0.D1.82.D0.B5.D0.B3.D0.B8.D1.8F_.D0.B8.D0.BC.D0.B5.D0.BD.D0.BE.D0.B2.D0.B0.D0.BD.D0.B8.D1.8F"></span><span class="mw-headline" id="&#1058;&#1077;&#1088;&#1084;&#1080;&#1085;&#1086;&#1083;&#1086;&#1075;&#1080;&#1103;_-_&#1089;&#1090;&#1088;&#1072;&#1090;&#1077;&#1075;&#1080;&#1103;_&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;">&#1058;&#1077;&#1088;&#1084;&#1080;&#1085;&#1086;&#1083;&#1086;&#1075;&#1080;&#1103; - &#1089;&#1090;&#1088;&#1072;&#1090;&#1077;&#1075;&#1080;&#1103; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</span></h2>
<p><span id="English"></span>
</p>
<h3><span id=".D0.9D.D0.B0_.D1.80.D1.83.D1.81.D1.81.D0.BA.D0.BE.D0.BC"></span><span class="mw-headline" id="&#1053;&#1072;_&#1088;&#1091;&#1089;&#1089;&#1082;&#1086;&#1084;">&#1053;&#1072; &#1088;&#1091;&#1089;&#1089;&#1082;&#1086;&#1084;</span></h3>
<p>&#1057;&#1084;&#1086;&#1090;&#1088;&#1080; <a href="../ru/Glossary.html" title="Glossary/ru">&#1043;&#1083;&#1086;&#1089;&#1089;&#1072;&#1088;&#1080;&#1081;</a>.
</p><p><span id="Other_languages"></span>
</p>
<h3><span id=".D0.94.D1.80.D1.83.D0.B3.D0.B8.D0.B5_.D1.8F.D0.B7.D1.8B.D0.BA.D0.B8"></span><span class="mw-headline" id="&#1044;&#1088;&#1091;&#1075;&#1080;&#1077;_&#1103;&#1079;&#1099;&#1082;&#1080;">&#1044;&#1088;&#1091;&#1075;&#1080;&#1077; &#1103;&#1079;&#1099;&#1082;&#1080;</span></h3>
<ul><li><a href="../Italian_Translation.html" title="Italian Translation">Italiano</a></li>
<li><a href="../French_Translation.html" title="French Translation">Fran&ccedil;ais</a></li>
<li><a href="../German_Translation.html" title="German Translation">Deutsch</a></li>
<li><a href="../Polish_Translation.html" title="Polish Translation">Polish</a></li>
<li><a href="../Spanish_Translation.html" title="Spanish Translation">Spanish</a></li>
<li><a href="../Japanese_Translation.html" title="Japanese Translation">Japanese</a></li>
<li><a href="../Russian_Translation.html" title="Russian Translation">Russian</a></li></ul>
<!-- 
NewPP limit report
Cached time: 20250705121310
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc, no&#8208;toc&#8208;conversion]
CPU time usage: 0.308 seconds
Real time usage: 0.867 seconds
Preprocessor visited node count: 1176/1000000
Post&#8208;expand include size: 13354/2097152 bytes
Template argument size: 1421/2097152 bytes
Highest expansion depth: 7/100
Expensive parser function count: 1/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 4892/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%  150.687      1 -total
  7.78%   11.720      2 Template:KEY
  4.82%    7.266      1 Template:ASCII
  4.23%    6.372      1 Template:Page_in_progress/ru
  4.07%    6.132      1 Template:VersionNoteMinus/ru
  3.66%    5.517      1 Template:Obsolete/ru
  3.64%    5.482      1 Template:VersionNotePlus/ru
  3.60%    5.424      1 Template:VersionNote/ru
  3.01%    4.542      1 Template:UnfinishedDocu/ru
  3.00%    4.526      2 Template:Value
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:250934-0!canonical and timestamp 20250705121309 and revision id 1601987. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>