<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Wikihouse porting tutorial/ru</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="ru" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Wikihouse+porting+tutorial&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/Wikihouse_porting_tutorial.html" class="mw-pt-progress mw-pt-progress--med" title="Wikihouse Migration Tutorium (26% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Wikihouse_porting_tutorial.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Wikihouse porting tutorial (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/Wikihouse_porting_tutorial.html" class="mw-pt-progress mw-pt-progress--low" title="Wikihouse porting tutorial/es (5% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/Wikihouse_porting_tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Tutoriel d'importation d'une Wikihouse de SketchUp (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/Wikihouse_porting_tutorial.html" class="mw-pt-progress mw-pt-progress--med" title="Tutorial Wikihouse portabile (50% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Wikihouse_porting_tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Poradnik przenoszenia Wikihouse (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../ro/Wikihouse_porting_tutorial.html" class="mw-pt-progress mw-pt-progress--med" title="Wikihouse porting tutorial (50% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</span></li></ul></div>
<table class="fcinfobox wikitable ct" style="width: 230px; float: right; margin-left: 1em">
<tbody><tr>
<td class="ctTitle" style="font-weight: bold; font-size: 125%;"><span typeof="mw:File"><span><img src="../File/Freecad.svg" decoding="async" width="32" height="32" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span> &#1056;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086;
</td></tr>
<tr>
<th class="ctOdd">&#1058;&#1077;&#1084;&#1072;
</th></tr>
<tr>
<td class="ctEven">&#1056;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086; &#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1102; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; Wikihouse &#1074; FreeCAD
</td></tr>
<tr>
<th class="ctOdd">&#1059;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100;
</th></tr>
<tr>
<td class="ctEven">Intermediate/Advanced
</td></tr>
<tr>
<th class="ctOdd">&#1042;&#1088;&#1077;&#1084;&#1103; &#1076;&#1083;&#1103; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1103;
</th></tr>
<tr>
<td class="ctEven">60 &#1084;&#1080;&#1085;&#1091;&#1090;
</td></tr>
<tr>
<th class="ctOdd">&#1040;&#1074;&#1090;&#1086;&#1088;&#1099;
</th></tr>
<tr>
<td class="ctEven">
</td></tr>
<tr>
<th class="ctOdd">FreeCAD &#1074;&#1077;&#1088;&#1089;&#1080;&#1103;
</th></tr>
<tr>
<td class="ctEven">
</td></tr>
<tr>
<th class="ctOdd">&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;
</th></tr>
<tr>
<td class="ctEven">
</td></tr>
<tr>
<th class="ctOdd">&#1057;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; &#1090;&#1072;&#1082;&#1078;&#1077;
</th></tr>
<tr>
<td class="ctEven"><i>None</i>
</td></tr>
<tr>
<td class="ctToc"><br><meta property="mw:PageProp/toc">
</td></tr></tbody></table>
<p><span id="Introduction"></span>
</p>
<h2><span id=".D0.92.D1.81.D1.82.D1.83.D0.BF.D0.BB.D0.B5.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1042;&#1089;&#1090;&#1091;&#1087;&#1083;&#1077;&#1085;&#1080;&#1077;">&#1042;&#1089;&#1090;&#1091;&#1087;&#1083;&#1077;&#1085;&#1080;&#1077;</span></h2>
<p>&#1042; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1077; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086;, &#1082;&#1072;&#1082; &#1082;&#1086;&#1085;&#1074;&#1077;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; <a rel="nofollow" class="external text" href="https://sketchup.com">SketchUp</a> &#1092;&#1072;&#1081;&#1083;&#1099;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1077; &#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077; <a rel="nofollow" class="external text" href="https://wikihouse.cc">Wikihouse</a> &#1074; FreeCAD, &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; <a href="../ru/Arch_Panel.html" title="Arch Panel/ru">&#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1085;&#1099;&#1093; &#1087;&#1072;&#1085;&#1077;&#1083;&#1077;&#1081;</a>. &#1042; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1089;&#1103; &#1087;&#1086;&#1083;&#1085;&#1072;&#1103; &#1082;&#1086;&#1087;&#1080;&#1103; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; SketchUp, &#1079;&#1072; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1086;&#1085; &#1089;&#1090;&#1072;&#1085;&#1077;&#1090; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;. &#1059;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1090; &#1086;&#1090; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1072; &#1079;&#1072;&#1090;&#1088;&#1072;&#1095;&#1077;&#1085;&#1085;&#1086;&#1081; &#1085;&#1072; &#1085;&#1077;&#1075;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;, &#1082;&#1072;&#1082; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1086; &#1085;&#1080;&#1078;&#1077;. &#1053;&#1086; &#1074;&#1087;&#1086;&#1083;&#1085;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1074;&#1089;&#1105; &#1096;&#1072;&#1075; &#1079;&#1072; &#1096;&#1072;&#1075;&#1086;&#1084; &#1080; &#1076;&#1086;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086; &#1087;&#1077;&#1088;&#1077;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1092;&#1072;&#1081;&#1083; Wikihouse, &#1072; &#1073;&#1086;&#1083;&#1077;&#1077; &#1076;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1077; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1093; &#1087;&#1088;&#1086;&#1092;&#1080;&#1083;&#1077;&#1081; &#1074; &#1101;&#1089;&#1082;&#1080;&#1079;&#1099; &#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1085;&#1072; &#1087;&#1086;&#1090;&#1086;&#1084;.
</p><p>&#1069;&#1090;&#1086;&#1090; &#1091;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090; &#1087;&#1088;&#1086;&#1084;&#1077;&#1078;&#1091;&#1090;&#1086;&#1095;&#1085;&#1099;&#1093; &#1079;&#1085;&#1072;&#1085;&#1080;&#1081; FreeCAD, &#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1074;&#1099; &#1091;&#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072;&#1093; &#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1093;, &#1091;&#1084;&#1077;&#1077;&#1090;&#1077; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1089;&#1090;&#1099;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1080;, &#1087;&#1088;&#1077;&#1078;&#1076;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086;, &#1093;&#1086;&#1088;&#1086;&#1096;&#1086; &#1074;&#1083;&#1072;&#1076;&#1077;&#1077;&#1090;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080; <a href="../ru/Draft_Move.html" title="Draft Move/ru">&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; &#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100;</a> &#1080; <a href="../ru/Draft_Rotate.html" title="Draft Rotate/ru">&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; &#1055;&#1086;&#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100;</a>. &#1042; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1084; &#1073;&#1091;&#1076;&#1091;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1086;&#1074; <a href="../ru/Draft_Workbench.html" title="Draft Workbench/ru">&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; (Draft)</a> &#1080; <a href="../ru/Arch_Workbench.html" title="Arch Workbench/ru">&#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1072; (Arch)</a>, &#1085;&#1086; &#1079;&#1085;&#1072;&#1085;&#1080;&#1077; <a href="../ru/Sketcher_Workbench.html" title="Sketcher Workbench/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; &#1057;&#1082;&#1077;&#1090;&#1095;&#1077;&#1088; (Sketcher)</a> &#1089;&#1090;&#1072;&#1085;&#1077;&#1090; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1084; &#1087;&#1088;&#1080; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1093; &#1087;&#1088;&#1086;&#1092;&#1080;&#1083;&#1077;&#1081; &#1074; &#1101;&#1089;&#1082;&#1080;&#1079;&#1099;.
</p><p>&#1055;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; Wikihouse &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1087;&#1086; &#1089;&#1074;&#1086;&#1077;&#1081; &#1087;&#1088;&#1080;&#1088;&#1086;&#1076;&#1077;, &#1092;&#1072;&#1081;&#1083;&#1099; &#1083;&#1077;&#1075;&#1082;&#1086; &#1085;&#1072;&#1081;&#1090;&#1080; &#1085;&#1072; &#1089;&#1072;&#1081;&#1090;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1085;&#1072; <a rel="nofollow" class="external text" href="https://3dwarehouse.sketchup.com/search.html?q=wikihouse&amp;backendClass=both">SketchUp 3D Warehouse</a> &#1080;&#1083;&#1080; &#1074; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1103;&#1093; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; <a rel="nofollow" class="external text" href="https://github.com/wikihouseproject">github</a>. &#1055;&#1088;&#1077;&#1076;&#1087;&#1086;&#1095;&#1090;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1086;&#1084;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1084; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1084;, &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; Sketchup, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1099; &#1085;&#1072;&#1081;&#1076;&#1105;&#1090;&#1077;, &#1073;&#1091;&#1076;&#1091;&#1090; &#1074; &#1101;&#1090;&#1086;&#1084; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077;.
</p><p>&#1042; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1077; &#1084;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1083;&#1080; &#1092;&#1072;&#1081;&#1083; <a rel="nofollow" class="external text" href="https://github.com/wikihouseproject/Microhouse/blob/master/microhouse_0.5_chassis.skp">Chassis</a> &#1080;&#1079; &#1087;&#1086;&#1076;&#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; Wikihouse's Microhouse (&#1042;&#1080;&#1082;&#1080;-&#1076;&#1086;&#1084;&#1080;&#1082; &#1052;&#1080;&#1082;&#1088;&#1086;-&#1076;&#1086;&#1084;).
</p><p><span id="Preparing_the_Sketchup_file"></span>
</p>
<h2><span id=".D0.9F.D0.BE.D0.B4.D0.B3.D0.BE.D1.82.D0.BE.D0.B2.D0.BA.D0.B0_.D1.84.D0.B0.D0.B9.D0.BB.D0.B0_Sketchup"></span><span class="mw-headline" id="&#1055;&#1086;&#1076;&#1075;&#1086;&#1090;&#1086;&#1074;&#1082;&#1072;_&#1092;&#1072;&#1081;&#1083;&#1072;_Sketchup">&#1055;&#1086;&#1076;&#1075;&#1086;&#1090;&#1086;&#1074;&#1082;&#1072; &#1092;&#1072;&#1081;&#1083;&#1072; Sketchup</span></h2>
<p>&#1055;&#1077;&#1088;&#1074;&#1086;&#1077;, &#1095;&#1090;&#1086; &#1085;&#1091;&#1078;&#1085;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100;, &#1101;&#1090;&#1086; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1100; &#1092;&#1072;&#1081;&#1083; &#1074; SketchUp &#1080; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1074;&#1089;&#1077;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1085;&#1077; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1101;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;. &#1052;&#1099; &#1073;&#1091;&#1076;&#1077;&#1084; &#1101;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1076;&#1085;&#1091; &#1095;&#1072;&#1089;&#1090;&#1100; &#1052;&#1080;&#1082;&#1088;&#1086;-&#1076;&#1086;&#1084;&#1072;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1074;&#1089;&#1077; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1086;.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_05.jpg&amp;filetimestamp=20161217190528&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_05.jpg" decoding="async" width="1380" height="920" class="mw-file-element" data-file-width="1380" data-file-height="920"></a></span>
</p><p>&#1069;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1042;&#1080;&#1082;&#1080;-&#1076;&#1086;&#1084;&#1080;&#1082;&#1080; &#1074; SketchUp &#1089;&#1086;&#1079;&#1076;&#1072;&#1102;&#1090;&#1089;&#1103; &#1086;&#1089;&#1086;&#1073;&#1099;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;: &#1057;&#1082;&#1083;&#1072;&#1076;&#1099;&#1074;&#1072;&#1103; &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1077; "&#1082;&#1091;&#1089;&#1086;&#1095;&#1082;&#1080;" &#1074;&#1084;&#1077;&#1089;&#1090;&#1077;, &#1074;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1105;&#1090;&#1077; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099;:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_06.jpg&amp;filetimestamp=20161217190817&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_06.jpg" decoding="async" width="1418" height="907" class="mw-file-element" data-file-width="1418" data-file-height="907"></a></span>
</p><p>&#1042;&#1086; FreeCAD &#1084;&#1099; &#1073;&#1091;&#1076;&#1077;&#1084; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1085;&#1072;&#1095;&#1077;. &#1055;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1086;&#1076;&#1085;&#1086;&#1081; &#1080;&#1079; &#1089;&#1072;&#1084;&#1099;&#1093; &#1084;&#1086;&#1097;&#1085;&#1099;&#1093; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081; FreeCAD &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; <a href="../ru/Sketcher_Workbench.html" title="Sketcher Workbench/ru">&#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1085;&#1099;&#1077; &#1069;&#1089;&#1082;&#1080;&#1079;&#1099;</a>, &#1085;&#1072;&#1084; &#1083;&#1091;&#1095;&#1096;&#1077; &#1074;&#1086;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1101;&#1090;&#1080;&#1084; &#1087;&#1088;&#1077;&#1080;&#1084;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1084; &#1080; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1074;&#1089;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1085;&#1072;&#1096;&#1077;&#1075;&#1086; &#1042;&#1080;&#1082;&#1080;-&#1076;&#1086;&#1084;&#1080;&#1082;&#1072; &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077; &#1069;&#1089;&#1082;&#1080;&#1079;&#1086;&#1074;. &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1083;&#1102;&#1073;&#1086;&#1081; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100; &#1074; <a href="../ru/Sketcher_Workbench.html" title="Sketcher Workbench/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1077; &#1057;&#1082;&#1077;&#1090;&#1095;&#1077;&#1088;</a>, &#1095;&#1090;&#1086; &#1075;&#1086;&#1088;&#1072;&#1079;&#1076;&#1086; &#1091;&#1076;&#1086;&#1073;&#1085;&#1077;&#1077;.
</p><p>&#1063;&#1090;&#1086;&#1073;&#1099; &#1087;&#1088;&#1077;&#1074;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100; &#1085;&#1072;&#1096;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; SketchUp &#1074; &#1101;&#1089;&#1082;&#1080;&#1079;&#1099; FreeCAD, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1079;&#1072;&#1090;&#1077;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; <a href="../ru/Arch_Panel.html" title="Arch Panel/ru">&#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1085;&#1099;&#1093; &#1055;&#1072;&#1085;&#1077;&#1083;&#1077;&#1081;</a>, &#1085;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1100; &#1086;&#1076;&#1085;&#1091; &#1087;&#1083;&#1086;&#1089;&#1082;&#1091;&#1102; &#1075;&#1088;&#1072;&#1085;&#1100; &#1080;&#1079; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080; &#1042;&#1080;&#1082;&#1080;-&#1076;&#1086;&#1084;&#1080;&#1082;&#1072;. &#1058;&#1086;&#1083;&#1097;&#1080;&#1085;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1072; &#1087;&#1086;&#1079;&#1078;&#1077;, &#1074; FreeCAD, &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1074; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;&#1093; &#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1085;&#1086;&#1081; &#1055;&#1072;&#1085;&#1077;&#1083;&#1080;. &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1084;&#1099; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1087;&#1088;&#1077;&#1074;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1042;&#1080;&#1082;&#1080;-&#1076;&#1086;&#1084;&#1080;&#1082;&#1072; &#1074; &#1086;&#1076;&#1085;&#1091; &#1087;&#1083;&#1086;&#1089;&#1082;&#1091;&#1102; &#1075;&#1088;&#1072;&#1085;&#1100;, &#1074;&#1086;&#1081;&#1076;&#1080;&#1090;&#1077; &#1074; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;, &#1076;&#1074;&#1072;&#1078;&#1076;&#1099; &#1097;&#1105;&#1083;&#1082;&#1085;&#1091;&#1074; &#1087;&#1086; &#1085;&#1077;&#1084;&#1091;, &#1079;&#1072;&#1090;&#1077;&#1084; &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1087;&#1086;&#1076;&#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1080; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1087;&#1088;&#1072;&#1074;&#1091;&#1102; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1084;&#1099;&#1096;&#1080; &rarr; &#1056;&#1072;&#1079;&#1088;&#1091;&#1096;&#1080;&#1090;&#1100; (Explode), &#1087;&#1086;&#1082;&#1072; &#1074;&#1089;&#1077; &#1087;&#1086;&#1076;&#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099; &#1085;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1088;&#1072;&#1079;&#1088;&#1091;&#1096;&#1077;&#1085;&#1099;, &#1080; &#1074;&#1072;&#1096; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1080;&#1079; &#1075;&#1088;&#1072;&#1085;&#1077;&#1081; &#1080; &#1088;&#1105;&#1073;&#1077;&#1088;:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_08.jpg&amp;filetimestamp=20161217192027&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_08.jpg" decoding="async" width="1398" height="927" class="mw-file-element" data-file-width="1398" data-file-height="927"></a></span>
</p><p>&#1055;&#1086;&#1089;&#1083;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077; &#1074;&#1089;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072; &#1080; &#1089;&#1085;&#1080;&#1084;&#1080;&#1090;&#1077; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077;, &#1076;&#1074;&#1072;&#1078;&#1076;&#1099; &#1097;&#1105;&#1083;&#1082;&#1085;&#1091;&#1074; Shift + &#1076;&#1074;&#1086;&#1081;&#1085;&#1086;&#1081; &#1097;&#1077;&#1083;&#1095;&#1086;&#1082;, &#1089; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1092;&#1088;&#1086;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1075;&#1088;&#1072;&#1085;&#1080; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;. &#1054;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1076;&#1074;&#1072;&#1078;&#1076;&#1099;, &#1072; &#1085;&#1077; &#1086;&#1076;&#1080;&#1085; &#1088;&#1072;&#1079;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1074;&#1099; &#1089;&#1085;&#1080;&#1084;&#1080;&#1090;&#1077; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089; &#1083;&#1080;&#1094;&#1077;&#1074;&#1086;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099;, &#1085;&#1086; &#1085;&#1077; &#1089; &#1077;&#1105; &#1075;&#1088;&#1072;&#1085;&#1077;&#1081; (&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1072;&#1084; &#1090;&#1086;&#1078;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100;). &#1055;&#1086;&#1089;&#1083;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1084;&#1099; &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1084; &#1074;&#1089;&#1105;, &#1095;&#1090;&#1086; &#1093;&#1086;&#1090;&#1080;&#1084; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1085;&#1072;&#1084; &#1086;&#1089;&#1090;&#1072;&#1085;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1072;&#1078;&#1072;&#1090;&#1100; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1091; delete. &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1085;&#1072;&#1096; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; - &#1101;&#1090;&#1086; &#1074;&#1089;&#1077;&#1075;&#1086; &#1083;&#1080;&#1096;&#1100; &#1086;&#1076;&#1085;&#1072; &#1073;&#1086;&#1083;&#1100;&#1096;&#1072;&#1103; &#1087;&#1083;&#1086;&#1089;&#1082;&#1072;&#1103; &#1075;&#1088;&#1072;&#1085;&#1100;.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_07.jpg&amp;filetimestamp=20161217192011&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_07.jpg" decoding="async" width="1410" height="899" class="mw-file-element" data-file-width="1410" data-file-height="899"></a></span>
</p><p>&#1055;&#1086;&#1074;&#1090;&#1086;&#1088;&#1080;&#1090;&#1077; &#1101;&#1090;&#1086; &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;. &#1055;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1084;&#1085;&#1086;&#1075;&#1080;&#1077; &#1080;&#1079; &#1085;&#1080;&#1093; &#1076;&#1091;&#1073;&#1083;&#1080;&#1088;&#1091;&#1102;&#1090;&#1089;&#1103;, &#1101;&#1090;&#1086; &#1085;&#1077; &#1090;&#1072;&#1082;&#1072;&#1103; &#1073;&#1086;&#1083;&#1100;&#1096;&#1072;&#1103; &#1079;&#1072;&#1076;&#1072;&#1095;&#1072;, &#1082;&#1072;&#1082; &#1082;&#1072;&#1078;&#1077;&#1090;&#1089;&#1103;. &#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1085;&#1077; &#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1099; &#1089; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1086;&#1081; &#1042;&#1080;&#1082;&#1080;-&#1076;&#1086;&#1084;&#1080;&#1082;, &#1101;&#1090;&#1086;&#1090; &#1096;&#1072;&#1075; &#1076;&#1072;&#1089;&#1090; &#1074;&#1072;&#1084; &#1076;&#1086;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086; &#1093;&#1086;&#1088;&#1086;&#1096;&#1077;&#1077; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082; &#1086;&#1085;&#1072; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090;.
</p><p>&#1050;&#1086;&#1075;&#1076;&#1072; &#1085;&#1072;&#1096; &#1076;&#1086;&#1084; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1089;&#1086;&#1089;&#1090;&#1086;&#1080;&#1090; &#1080;&#1079; &#1087;&#1083;&#1086;&#1089;&#1082;&#1080;&#1093; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1074;&#1089;&#1077; &#1080; &#1101;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; &#1092;&#1072;&#1081;&#1083; .dae, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1080;&#1084;&#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086;&#1090; &#1092;&#1072;&#1081;&#1083; &#1074; FreeCAD. &#1053;&#1077; &#1079;&#1072;&#1073;&#1091;&#1076;&#1100;&#1090;&#1077; &#1086;&#1090;&#1084;&#1077;&#1090;&#1080;&#1090;&#1100; &#1086;&#1087;&#1094;&#1080;&#1102; "triangulate all - &#1090;&#1088;&#1080;&#1072;&#1085;&#1075;&#1091;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1089;&#1105;".
</p><p><span id="Solving_the_double_faces_bug"></span>
</p>
<h2><span id=".D0.A0.D0.B5.D1.88.D0.B5.D0.BD.D0.B8.D0.B5_.D0.BF.D1.80.D0.BE.D0.B1.D0.BB.D0.B5.D0.BC.D1.8B_.D0.B4.D1.83.D0.B1.D0.BB.D0.B8.D1.80.D0.BE.D0.B2.D0.B0.D0.BD.D0.B8.D1.8F_.D0.B3.D1.80.D0.B0.D0.BD.D0.B5.D0.B9"></span><span class="mw-headline" id="&#1056;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;_&#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;_&#1076;&#1091;&#1073;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;_&#1075;&#1088;&#1072;&#1085;&#1077;&#1081;">&#1056;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; &#1076;&#1091;&#1073;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1075;&#1088;&#1072;&#1085;&#1077;&#1081;</span></h2>
<p>&#1045;&#1089;&#1090;&#1100; &#1086;&#1076;&#1085;&#1072; &#1085;&#1077;&#1087;&#1088;&#1080;&#1103;&#1090;&#1085;&#1072;&#1103; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072;, &#1076;&#1083;&#1103; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1103; &#1085;&#1077; &#1085;&#1072;&#1096;&#1105;&#1083; &#1083;&#1091;&#1095;&#1096;&#1077;&#1075;&#1086; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;: &#1059; &#1089;&#1077;&#1090;&#1082;&#1080;, &#1101;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1081; &#1080;&#1079; SketchUp &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; .dae, &#1076;&#1091;&#1073;&#1083;&#1080;&#1088;&#1091;&#1102;&#1090;&#1089;&#1103; &#1075;&#1088;&#1072;&#1085;&#1080;. &#1050;&#1072;&#1078;&#1076;&#1072;&#1103; &#1075;&#1088;&#1072;&#1085;&#1100; &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1089;&#1103; &#1092;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1076;&#1074;&#1091;&#1084;&#1103; &#1075;&#1088;&#1072;&#1085;&#1103;&#1084;&#1080;. &#1057;&#1072;&#1084;&#1099;&#1081; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1103; &#1085;&#1072;&#1096;&#1105;&#1083; &#1085;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;, - &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1100; &#1101;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; &#1074; <a rel="nofollow" class="external text" href="https://blender.org">Blender</a> &#1076;&#1083;&#1103; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;:
</p>
<ol><li>&#1054;&#1090;&#1082;&#1088;&#1086;&#1081;&#1090;&#1077; &#1092;&#1072;&#1081;&#1083; dae &#1074; Blender (<b>&#1060;&#1072;&#1081;&#1083; &rarr; &#1048;&#1084;&#1087;&#1086;&#1088;&#1090; &rarr; Collada (&#1050;&#1086;&#1083;&#1083;&#1072;&#1076;&#1072;)</b>)</li>
<li>&#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1080; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; <span style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.4em; padding: 0px 10px 1px 10px; font-weight:normal;">TAB</span>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1086;&#1081;&#1090;&#1080; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;.</li>
<li>&#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; <span style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.4em; padding: 0px 10px 1px 10px; font-weight:normal;">A</span>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1090;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086;, &#1079;&#1072;&#1090;&#1077;&#1084; <span style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.4em; padding: 0px 10px 1px 10px; font-weight:normal;">A</span> &#1089;&#1085;&#1086;&#1074;&#1072;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1074;&#1089;&#1105;.</li>
<li>&#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; <span style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.4em; padding: 0px 10px 1px 10px; font-weight:normal;">W</span> &rarr; &#1059;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1076;&#1091;&#1073;&#1083;&#1080;&#1082;&#1072;&#1090;&#1099;</li>
<li>&#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; <span style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.4em; padding: 0px 10px 1px 10px; font-weight:normal;">TAB</span>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1099;&#1081;&#1090;&#1080; &#1080;&#1079; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;.</li>
<li>&#1055;&#1086;&#1074;&#1090;&#1086;&#1088;&#1080;&#1090;&#1077; &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074;</li>
<li>&#1057;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1077; &#1085;&#1086;&#1074;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; <a href="../ru/Arch_DAE.html" title="Arch DAE/ru">DAE</a> (<b>&#1060;&#1072;&#1081;&#1083; &rarr; &#1069;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090; &rarr; Collada/&#1050;&#1086;&#1083;&#1083;&#1072;&#1076;&#1072;</b>)</li></ol>
<p>&#1054;&#1073;&#1099;&#1095;&#1085;&#1086; &#1074;&#1099;&#1096;&#1077;&#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1072;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1085;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;, &#1085;&#1086; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1089;&#1090;&#1086;&#1080;&#1090; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1080;&#1079;&#1084;&#1077;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;, &#1095;&#1090;&#1086; &#1080;&#1084;&#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1072;&#1103; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1103; &#1080;&#1084;&#1077;&#1077;&#1090; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1099;&#1081; &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;, &#1087;&#1088;&#1077;&#1078;&#1076;&#1077; &#1095;&#1077;&#1084; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1072;&#1090;&#1100;. &#1055;&#1088;&#1080; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1074;&#1072;&#1084; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1101;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1072; Collada/&#1050;&#1086;&#1083;&#1083;&#1072;&#1076;&#1072; &#1074; Blender.
</p><p><span id="Importing_and_converting_to_wires"></span>
</p>
<h2><span id=".D0.98.D0.BC.D0.BF.D0.BE.D1.80.D1.82_.D0.B8_.D0.BF.D1.80.D0.B5.D0.BE.D0.B1.D1.80.D0.B0.D0.B7.D0.BE.D0.B2.D0.B0.D0.BD.D0.B8.D0.B5_.D0.B2_.D0.BB.D0.BE.D0.BC.D0.B0.D0.BD.D0.BD.D1.8B.D0.B5_.D0.BA.D1.80.D0.B8.D0.B2.D1.8B.D0.B5"></span><span class="mw-headline" id="&#1048;&#1084;&#1087;&#1086;&#1088;&#1090;_&#1080;_&#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;_&#1074;_&#1083;&#1086;&#1084;&#1072;&#1085;&#1085;&#1099;&#1077;_&#1082;&#1088;&#1080;&#1074;&#1099;&#1077;">&#1048;&#1084;&#1087;&#1086;&#1088;&#1090; &#1080; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1074; &#1083;&#1086;&#1084;&#1072;&#1085;&#1085;&#1099;&#1077; &#1082;&#1088;&#1080;&#1074;&#1099;&#1077;</span></h2>
<p>&#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1088;&#1086;&#1097;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1087;&#1086; &#1095;&#1072;&#1089;&#1090;&#1103;&#1084; &#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1090;&#1100; + &#1101;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1087;&#1086; &#1075;&#1088;&#1091;&#1087;&#1087;&#1072;&#1084;, &#1082;&#1072;&#1082; &#1084;&#1099; &#1089;&#1076;&#1077;&#1083;&#1072;&#1083;&#1080; &#1085;&#1080;&#1078;&#1077;, &#1084;&#1099; &#1101;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1083;&#1080; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1089;&#1083;&#1086;&#1081;, &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1097;&#1080;&#1081; &#1080;&#1079; &#1078;&#1105;&#1083;&#1090;&#1099;&#1093; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074; SketchUp. &#1069;&#1090;&#1080; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1087;&#1086;&#1087;&#1072;&#1076;&#1091;&#1090; &#1074; FreeCAD &#1082;&#1072;&#1082; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; <a href="../ru/Mesh_Workbench.html" title="Mesh Workbench/ru">&#1057;&#1077;&#1090;&#1082;&#1080; (Mesh)</a>:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_09.jpg&amp;filetimestamp=20161217193633&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_09.jpg" decoding="async" width="1569" height="893" class="mw-file-element" data-file-width="1569" data-file-height="893"></a></span>
</p><p>&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1084; &#1096;&#1072;&#1075;&#1086;&#1084; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1083;&#1086;&#1084;&#1072;&#1085;&#1085;&#1099;&#1093; &#1082;&#1088;&#1080;&#1074;&#1099;&#1093; &#1080;&#1079; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1085;&#1072;&#1096;&#1077;&#1081; &#1089;&#1077;&#1090;&#1082;&#1080;. &#1057;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1091;&#1076;&#1086;&#1073;&#1085;&#1099;&#1081; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089; <a href="../ru/Macro_Extract_Wires_from_Mesh.html" title="Macro Extract Wires from Mesh/ru">&#1052;&#1072;&#1082;&#1088;&#1086;&#1089; &#1048;&#1079;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1051;&#1086;&#1084;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080;&#1079; &#1089;&#1077;&#1090;&#1082;&#1080; (Extract Wires from Mesh)</a>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1076;&#1077;&#1083;&#1072;&#1077;&#1090; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1101;&#1090;&#1086;. &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1077;&#1075;&#1086; (&#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080; &#1089;&#1084;. &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; <a href="../ru/Macros.html" title="Macros/ru">&#1052;&#1072;&#1082;&#1088;&#1086;&#1089;&#1099;</a>), &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1087;&#1086; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1080; (&#1084;&#1086;&#1078;&#1085;&#1086; &#1080; &#1074;&#1089;&#1077; &#1089;&#1088;&#1072;&#1079;&#1091;, &#1085;&#1086; &#1101;&#1090;&#1086;&#1090; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;) &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1091;&#1081;&#1090;&#1077; &#1074;&#1089;&#1077; &#1085;&#1072;&#1096;&#1080; &#1089;&#1077;&#1090;&#1082;&#1080; &#1074; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1083;&#1086;&#1084;&#1072;&#1085;&#1085;&#1099;&#1093; &#1082;&#1088;&#1080;&#1074;&#1099;&#1093;:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_10.jpg&amp;filetimestamp=20161217202027&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_10.jpg" decoding="async" width="1348" height="875" class="mw-file-element" data-file-width="1348" data-file-height="875"></a></span>
</p><p>&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1084;&#1099; &#1091;&#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1084; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; <a href="../ru/Arch_Panel.html" title="Arch Panel/ru">&#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1085;&#1086;&#1081; &#1055;&#1072;&#1085;&#1077;&#1083;&#1080; (Arch Panel)</a> &#1080;&#1079; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1080;&#1079; &#1101;&#1090;&#1080;&#1093; &#1082;&#1088;&#1080;&#1074;&#1086;&#1083;&#1080;&#1085;&#1077;&#1081;&#1085;&#1099;&#1093; &#1083;&#1086;&#1084;&#1072;&#1085;&#1085;&#1099;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1074;&#1099;&#1076;&#1077;&#1083;&#1103;&#1103; &#1080;&#1093; &#1080; &#1085;&#1072;&#1078;&#1080;&#1084;&#1072;&#1103; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <a href="../ru/Arch_Panel.html" title="Arch Panel/ru">&#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1085;&#1086;&#1081; &#1055;&#1072;&#1085;&#1077;&#1083;&#1080; (Arch Panel)</a>. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1080;&#1093; &#1073;&#1072;&#1079;&#1086;&#1074;&#1072;&#1103; &#1092;&#1086;&#1088;&#1084;&#1072; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081;. &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1091; &#1085;&#1072;&#1089; &#1077;&#1089;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1086;&#1074;: &#1052;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1087;&#1088;&#1077;&#1074;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1074; &#1101;&#1089;&#1082;&#1080;&#1079;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; <a href="../ru/Draft_Draft2Sketch.html" title="Draft Draft2Sketch/ru">&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; &#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082;&#1042;&#1069;&#1089;&#1082;&#1080;&#1079; (Draft Draft2Sketch)</a>, &#1085;&#1086; &#1101;&#1090;&#1086; &#1073;&#1091;&#1076;&#1091;&#1090; &#1076;&#1086;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086; &#1090;&#1103;&#1078;&#1105;&#1083;&#1099;&#1077; &#1101;&#1089;&#1082;&#1080;&#1079;&#1099;, &#1080; &#1086;&#1085;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1085;&#1077; &#1086;&#1095;&#1077;&#1085;&#1100; &#1091;&#1076;&#1086;&#1073;&#1085;&#1099; &#1076;&#1083;&#1103; &#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072;, &#1080;&#1083;&#1080; &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1087;&#1088;&#1077;&#1074;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100; &#1082;&#1072;&#1078;&#1076;&#1091;&#1102; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1091;&#1102; &#1083;&#1086;&#1084;&#1072;&#1085;&#1085;&#1091;&#1102; (&#1082;&#1086;&#1085;&#1090;&#1091;&#1088; &#1080; &#1082;&#1072;&#1078;&#1076;&#1086;&#1077; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1077;) &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; &#1074; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1101;&#1089;&#1082;&#1080;&#1079;. &#1069;&#1090;&#1086; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1080;&#1090; &#1085;&#1072;&#1084;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1090;&#1080;&#1087;&#1086;&#1074;&#1086;&#1077; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1077;, &#1089;&#1076;&#1077;&#1083;&#1072;&#1074; &#1077;&#1075;&#1086; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1076;&#1080;&#1085; &#1088;&#1072;&#1079;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1087;&#1088;&#1086;&#1076;&#1091;&#1073;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <a href="../ru/Draft_Clone.html" title="Draft Clone/ru">&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; &#1050;&#1083;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; (Draft Clone)</a>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1103;. &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1076;&#1083;&#1103; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074;&#1089;&#1077;&#1093; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1081; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1086;&#1090;&#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1086;&#1076;&#1085;&#1086;.
</p><p><a href="../ru/Macro_Extract_Wires_from_Mesh.html" title="Macro Extract Wires from Mesh/ru">&#1052;&#1072;&#1082;&#1088;&#1086;&#1089; &#1048;&#1079;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1051;&#1086;&#1084;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080;&#1079; &#1089;&#1077;&#1090;&#1082;&#1080;</a> &#1090;&#1072;&#1082;&#1078;&#1077; &#1080;&#1085;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1085;&#1072;&#1081;&#1090;&#1080; &#1079;&#1072;&#1084;&#1082;&#1085;&#1091;&#1090;&#1099;&#1077; &#1082;&#1086;&#1085;&#1090;&#1091;&#1088;&#1099; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1089;&#1077;&#1090;&#1082;&#1080;, &#1095;&#1090;&#1086; &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1080;&#1090; &#1082; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1102; &#1085;&#1077;&#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1099;&#1093; &#1055;&#1072;&#1085;&#1077;&#1083;&#1077;&#1081;. &#1055;&#1088;&#1086;&#1089;&#1090;&#1072;&#1103; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1072; &#1087;&#1077;&#1088;&#1077;&#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1086;&#1074;&#1082;&#1080; &#1083;&#1086;&#1084;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1072;&#1103;:
</p>
<ol><li>&#1042;&#1099;&#1073;&#1077;&#1088;&#1080; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;, &#1087;&#1086; &#1078;&#1077;&#1083;&#1072;&#1085;&#1080;&#1102; &#1089;&#1082;&#1088;&#1086;&#1081; &#1074;&#1089;&#1105; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1083;&#1091;&#1095;&#1096;&#1077; &#1077;&#1075;&#1086; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100;</li>
<li>&#1057;&#1076;&#1077;&#1083;&#1072;&#1081; <a href="../ru/Draft_Downgrade.html" title="Draft Downgrade/ru">&#1044;&#1088;&#1072;&#1092;&#1090; &#1044;&#1072;&#1091;&#1085;&#1075;&#1088;&#1077;&#1081;&#1076; (Draft Downgrade)</a> &#1077;&#1075;&#1086;. &#1054;&#1085; &#1073;&#1091;&#1076;&#1077;&#1090; &#1088;&#1072;&#1079;&#1088;&#1091;&#1096;&#1077;&#1085; &#1085;&#1072; &#1088;&#1103;&#1076; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1088;&#1105;&#1073;&#1077;&#1088;</li>
<li>&#1053;&#1072;&#1095;&#1085;&#1080; &#1074;&#1099;&#1076;&#1077;&#1083;&#1103;&#1090;&#1100; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; Ctrl &#1080;&#1083;&#1080; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; Shift + B &#1076;&#1083;&#1103; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1088;&#1072;&#1084;&#1082;&#1086;&#1081;</li>
<li>&#1053;&#1072;&#1078;&#1084;&#1080; <a href="../ru/Draft_Upgrade.html" title="Draft Upgrade/ru">&#1044;&#1088;&#1072;&#1092;&#1090; &#1040;&#1087;&#1075;&#1088;&#1077;&#1081;&#1076; (Draft Upgrade)</a>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1088;&#1077;&#1074;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100; &#1082;&#1072;&#1078;&#1076;&#1086;&#1077; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1077; &#1074; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1091;&#1102; &#1083;&#1086;&#1084;&#1072;&#1085;&#1085;&#1091;&#1102;</li>
<li>&#1053;&#1072;&#1082;&#1086;&#1085;&#1077;&#1094;, &#1074;&#1099;&#1076;&#1077;&#1083;&#1080; &#1074;&#1089;&#1077; &#1086;&#1089;&#1090;&#1072;&#1074;&#1096;&#1080;&#1077;&#1089;&#1103; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1088;&#1105;&#1073;&#1088;&#1072; &#1074; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1086;&#1073;&#1088;&#1072;&#1079;&#1091;&#1102;&#1090; &#1082;&#1086;&#1085;&#1090;&#1091;&#1088;, &#1080; &#1089;&#1076;&#1077;&#1083;&#1072;&#1081; &#1080;&#1093; <a href="../ru/Draft_Upgrade.html" title="Draft Upgrade/ru">&#1044;&#1088;&#1072;&#1092;&#1090; &#1040;&#1087;&#1075;&#1088;&#1077;&#1081;&#1076; (Draft Upgrade)</a></li>
<li>&#1042;&#1099;&#1073;&#1077;&#1088;&#1080; <b> &#1044;&#1077;&#1090;&#1072;&#1083;&#1100; (Part) &rarr; &#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; (Make Compound)</b>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1080;&#1090;&#1100; &#1074;&#1089;&#1077; &#1101;&#1090;&#1080; &#1082;&#1088;&#1080;&#1074;&#1099;&#1077; &#1074; &#1086;&#1076;&#1080;&#1085; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;</li>
<li>&#1042;&#1099;&#1073;&#1077;&#1088;&#1080; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1086;&#1077; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; &#1080; &#1085;&#1072;&#1078;&#1084;&#1080; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <a href="../ru/Arch_Panel.html" title="Arch Panel/ru">&#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1085;&#1072;&#1103; &#1055;&#1072;&#1085;&#1077;&#1083;&#1100; (Arch Panel)</a></li></ol>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_11.jpg&amp;filetimestamp=20161217205016&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_11.jpg" decoding="async" width="1882" height="983" class="mw-file-element" data-file-width="1882" data-file-height="983"></a></span>
</p><p>&#1047;&#1076;&#1077;&#1089;&#1100; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1093; &#1089;&#1090;&#1088;&#1072;&#1090;&#1077;&#1075;&#1080;&#1081;, &#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1090;&#1086;&#1075;&#1086;, &#1085;&#1072;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1091;&#1077;&#1084;&#1099;&#1084; &#1080; &#1090;&#1086;&#1095;&#1085;&#1099;&#1084; &#1074;&#1072;&#1084; &#1085;&#1091;&#1078;&#1077;&#1085; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;. &#1054;&#1073;&#1098;&#1077;&#1082;&#1090; <a href="../ru/Arch_Panel.html" title="Arch Panel/ru">&#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1072; &#1055;&#1072;&#1085;&#1077;&#1083;&#1100; (Arch Panel)</a> &#1085;&#1091;&#1078;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1073;&#1072;&#1079;&#1086;&#1074;&#1086;&#1084; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1077; &#1080;&#1079; &#1083;&#1086;&#1084;&#1072;&#1085;&#1085;&#1099;&#1093; &#1082;&#1088;&#1080;&#1074;&#1099;&#1093;. &#1053;&#1077;&#1074;&#1072;&#1078;&#1085;&#1086;, &#1082;&#1072;&#1082; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085; &#1101;&#1090;&#1086;&#1090; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;, &#1073;&#1091;&#1076;&#1077;&#1090; &#1083;&#1080; &#1101;&#1090;&#1086; &#1086;&#1076;&#1080;&#1085; &#1069;&#1089;&#1082;&#1080;&#1079; (Sketch), &#1080;&#1083;&#1080;, &#1082;&#1072;&#1082; &#1074; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; &#1074;&#1099;&#1096;&#1077;, &#1057;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; (Compound) &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1101;&#1089;&#1082;&#1080;&#1079;&#1086;&#1074; &#1080;&#1083;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1082;&#1072; (Draft).
</p><p><span id="Converting_to_Sketches"></span>
</p>
<h2><span id=".D0.9F.D1.80.D0.B5.D0.BE.D0.B1.D1.80.D0.B0.D0.B7.D0.BE.D0.B2.D0.B0.D0.BD.D0.B8.D0.B5_.D0.B2_.D0.AD.D1.81.D0.BA.D0.B8.D0.B7.D1.8B"></span><span class="mw-headline" id="&#1055;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;_&#1074;_&#1069;&#1089;&#1082;&#1080;&#1079;&#1099;">&#1055;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1074; &#1069;&#1089;&#1082;&#1080;&#1079;&#1099;</span></h2>
<p>&#1069;&#1090;&#1091; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1102; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1080; &#1087;&#1086;&#1079;&#1078;&#1077;, &#1074;&#1077;&#1076;&#1100; &#1091;&#1078;&#1077; &#1089;&#1077;&#1081;&#1095;&#1072;&#1089; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1079; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;, &#1085;&#1086; &#1076;&#1072;&#1074;&#1072;&#1081;&#1090;&#1077; &#1087;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084;, &#1082;&#1072;&#1082; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1088;&#1080;&#1074;&#1086;&#1083;&#1080;&#1085;&#1077;&#1081;&#1085;&#1099;&#1081; &#1083;&#1086;&#1084;&#1072;&#1085;&#1085;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1074; &#1101;&#1089;&#1082;&#1080;&#1079;:
</p>
<ol><li>&#1057;&#1086;&#1079;&#1076;&#1072;&#1081; &#1082;&#1086;&#1087;&#1080;&#1102; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;, &#1087;&#1086;&#1093;&#1086;&#1078;&#1077;&#1075;&#1086; &#1085;&#1072; &#1083;&#1086;&#1084;&#1072;&#1085;&#1085;&#1091;&#1102; &#1082;&#1088;&#1080;&#1074;&#1091;&#1102;, &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <span style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.4em; padding: 0px 10px 1px 10px; font-weight:normal;">Ctrl</span>+<span style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.4em; padding: 0px 10px 1px 10px; font-weight:normal;">C</span>, <span style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.4em; padding: 0px 10px 1px 10px; font-weight:normal;">Ctrl</span>+<span style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.4em; padding: 0px 10px 1px 10px; font-weight:normal;">V</span>. &#1069;&#1090;&#1086; &#1085;&#1091;&#1078;&#1085;&#1086; &#1076;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1084;&#1099; &#1084;&#1086;&#1075;&#1083;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1077;&#1075;&#1086;, &#1085;&#1086; &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1074; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;&#1084; &#1084;&#1077;&#1089;&#1090;&#1077;</li>
<li>&#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1089;&#1090;&#1080; &#1080; &#1087;&#1086;&#1074;&#1077;&#1088;&#1085;&#1080; &#1077;&#1075;&#1086; &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1085; &#1083;&#1077;&#1078;&#1072;&#1083; &#1074; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080; XY, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; <a href="../ru/Draft_Move.html" title="Draft Move/ru">&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; &#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; (Draft Move)</a> &#1080; <a href="../ru/Draft_Rotate.html" title="Draft Rotate/ru">&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; &#1055;&#1086;&#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100; (Draft Rotate)</a>. &#1069;&#1090;&#1086; &#1085;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;, &#1085;&#1086; &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1080;&#1085;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1091;&#1076;&#1072;&#1105;&#1090;&#1089;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1087;&#1091;&#1085;&#1082;&#1090;</li>
<li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081; <a href="../ru/Draft_Draft2Sketch.html" title="Draft Draft2Sketch/ru">&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; &#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082;&#1042;&#1069;&#1089;&#1082;&#1080;&#1079; (Draft Draft2Sketch)</a>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1088;&#1077;&#1074;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100; &#1083;&#1086;&#1084;&#1072;&#1085;&#1085;&#1091;&#1102; &#1074; &#1101;&#1089;&#1082;&#1080;&#1079;. &#1041;&#1091;&#1076;&#1100; &#1074;&#1085;&#1080;&#1084;&#1072;&#1090;&#1077;&#1083;&#1077;&#1085;, &#1101;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1085;&#1077; &#1089;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1080;&#1083;&#1080; &#1079;&#1072;&#1085;&#1103;&#1090;&#1100; &#1086;&#1095;&#1077;&#1085;&#1100; &#1084;&#1085;&#1086;&#1075;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1076;&#1083;&#1103; &#1086;&#1075;&#1088;&#1086;&#1084;&#1085;&#1099;&#1093; &#1083;&#1086;&#1084;&#1072;&#1085;&#1085;&#1099;&#1093; &#1082;&#1088;&#1080;&#1074;&#1099;&#1093;. &#1051;&#1091;&#1095;&#1096;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086; &#1088;&#1072;&#1079;&#1073;&#1080;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1085;&#1072; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1083;&#1086;&#1084;&#1072;&#1085;&#1085;&#1099;&#1077;, &#1082;&#1072;&#1082; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1074;&#1099;&#1096;&#1077;</li>
<li>&#1045;&#1089;&#1083;&#1080; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1074;&#1099;&#1096;&#1077; &#1085;&#1077; &#1089;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1083;&#1072;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081; <a href="../ru/Draft_Upgrade.html" title="Draft Upgrade/ru">&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; &#1040;&#1087;&#1075;&#1088;&#1077;&#1081;&#1076; (Draft Upgrade)</a> &#1076;&#1074;&#1072;&#1078;&#1076;&#1099; &#1085;&#1072; &#1082;&#1088;&#1080;&#1074;&#1086;&#1083;&#1080;&#1085;&#1077;&#1081;&#1085;&#1086;&#1084; &#1083;&#1086;&#1084;&#1072;&#1085;&#1085;&#1086;&#1084; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1077;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1074; &#1043;&#1088;&#1072;&#1085;&#1100; (Face), &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1074; <a href="../ru/Draft_Wire.html" title="Draft Wire/ru">&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; &#1051;&#1086;&#1084;&#1072;&#1085;&#1085;&#1091;&#1102; (Draft Wire)</a>, &#1087;&#1088;&#1077;&#1078;&#1076;&#1077; &#1095;&#1077;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; <a href="../Draft_Draft2Sketch.html" title="Draft Draft2Sketch">&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; &#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082;&#1042;&#1069;&#1089;&#1082;&#1080;&#1079; (Draft Draft2Sketch)</a>, &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1101;&#1090;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1083;&#1091;&#1095;&#1096;&#1077;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; &#1051;&#1086;&#1084;&#1072;&#1085;&#1085;&#1072;&#1103; (Draft Wire) &#1083;&#1091;&#1095;&#1096;&#1077; &#1086;&#1090;&#1089;&#1083;&#1077;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1082; &#1074;&#1077;&#1088;&#1096;&#1080;&#1085; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1082;&#1088;&#1080;&#1074;&#1086;&#1081; &#1083;&#1086;&#1084;&#1072;&#1085;&#1085;&#1086;&#1081;</li>
<li>&#1050;&#1088;&#1080;&#1074;&#1099;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090; &#1080;&#1079; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1093; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1048;&#1093; &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1082;&#1072;&#1082; &#1077;&#1089;&#1090;&#1100;, &#1085;&#1086; &#1086;&#1085;&#1080; &#1074;&#1074;&#1086;&#1076;&#1103;&#1090; &#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1081; &#1085;&#1072; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1099;&#1077; &#1090;&#1086;&#1095;&#1082;&#1080;. &#1051;&#1091;&#1095;&#1096;&#1077; &#1079;&#1072;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1080;&#1093; &#1076;&#1091;&#1075;&#1072;&#1084;&#1080;. &#1069;&#1090;&#1086; &#1076;&#1086;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086; &#1083;&#1077;&#1075;&#1082;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100;: &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1091;&#1076;&#1072;&#1083;&#1080;&#1074; &#1084;&#1072;&#1083;&#1077;&#1085;&#1100;&#1082;&#1080;&#1077; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1099; &#1080; &#1079;&#1072;&#1084;&#1077;&#1085;&#1080;&#1074; &#1080;&#1093; &#1076;&#1091;&#1075;&#1086;&#1081;. &#1047;&#1072;&#1090;&#1077;&#1084; &#1076;&#1091;&#1075;&#1091; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1082;&#1072;&#1089;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1082; &#1089;&#1086;&#1089;&#1077;&#1076;&#1085;&#1080;&#1084; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084;, &#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1076; &#1101;&#1090;&#1080;&#1084; &#1091;&#1073;&#1077;&#1076;&#1080;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1101;&#1090;&#1080;&#1093; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1079;&#1072;&#1092;&#1080;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1086;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1101;&#1090;&#1072; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1079;&#1072;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090; &#1080;&#1093; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100;&#1089;&#1103;</li>
<li>&#1045;&#1089;&#1083;&#1080; &#1090;&#1099; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1083; &#1089; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1084;&#1080; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072;&#1084;&#1080;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1081; &#1080;&#1079; &#1085;&#1080;&#1093; <a href="../ru/Part_Compound.html" title="Part Compound/ru">&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1057;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; (Part Compound)</a>.</li>
<li>&#1057;&#1086;&#1079;&#1076;&#1072;&#1081; &#1080;&#1079; &#1085;&#1080;&#1093; <a href="../ru/Arch_Panel.html" title="Arch Panel/ru">&#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1085;&#1091;&#1102; &#1055;&#1072;&#1085;&#1077;&#1083;&#1100; (Arch Panel)</a>.</li>
<li>&#1055;&#1086;&#1074;&#1077;&#1088;&#1085;&#1080;/&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1089;&#1090;&#1080; &#1077;&#1105; &#1074; &#1085;&#1091;&#1078;&#1085;&#1086;&#1077; &#1084;&#1077;&#1089;&#1090;&#1086; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <a href="../ru/Draft_Move.html" title="Draft Move/ru">&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; &#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; (Draft Move)</a> &#1080; <a href="../ru/Draft_Rotate.html" title="Draft Rotate/ru">&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; &#1055;&#1086;&#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100; (Draft Rotate)</a>.</li></ol>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_12.jpg&amp;filetimestamp=20161218215657&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_12.jpg" decoding="async" width="1183" height="705" class="mw-file-element" data-file-width="1183" data-file-height="705"></a></span>
</p><p><span id="Rebuilding_the_Wikihouse_and_exporting_cut_sheets"></span>
</p>
<h2><span id=".D0.9F.D0.B5.D1.80.D0.B5.D1.81.D1.82.D1.80.D0.BE.D0.B9.D0.BA.D0.B0_.D0.92.D0.B8.D0.BA.D0.B8-.D0.B4.D0.BE.D0.BC.D0.B8.D0.BA.D0.B0_.D0.B8_.D1.8D.D0.BA.D1.81.D0.BF.D0.BE.D1.80.D1.82_.D0.BB.D0.B8.D1.81.D1.82.D0.BE.D0.B2_.D0.B4.D0.BB.D1.8F_.D1.80.D0.B0.D1.81.D0.BA.D1.80.D0.BE.D1.8F_.28.D1.80.D0.B5.D0.B7.D0.BA.D0.B8.29"></span><span class="mw-headline" id="&#1055;&#1077;&#1088;&#1077;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072;_&#1042;&#1080;&#1082;&#1080;-&#1076;&#1086;&#1084;&#1080;&#1082;&#1072;_&#1080;_&#1101;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;_&#1083;&#1080;&#1089;&#1090;&#1086;&#1074;_&#1076;&#1083;&#1103;_&#1088;&#1072;&#1089;&#1082;&#1088;&#1086;&#1103;_(&#1088;&#1077;&#1079;&#1082;&#1080;)">&#1055;&#1077;&#1088;&#1077;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072; &#1042;&#1080;&#1082;&#1080;-&#1076;&#1086;&#1084;&#1080;&#1082;&#1072; &#1080; &#1101;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090; &#1083;&#1080;&#1089;&#1090;&#1086;&#1074; &#1076;&#1083;&#1103; &#1088;&#1072;&#1089;&#1082;&#1088;&#1086;&#1103; (&#1088;&#1077;&#1079;&#1082;&#1080;)</span></h2>
<p>&#1058;&#1072;&#1082;&#1078;&#1077; &#1091;&#1073;&#1077;&#1076;&#1080;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1090;&#1099; &#1085;&#1077; &#1087;&#1077;&#1088;&#1077;&#1076;&#1077;&#1083;&#1099;&#1074;&#1072;&#1077;&#1096;&#1100; &#1076;&#1091;&#1073;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1091;&#1102; &#1095;&#1072;&#1089;&#1090;&#1100;. &#1042;&#1084;&#1077;&#1089;&#1090;&#1086; &#1101;&#1090;&#1086;&#1075;&#1086; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; <a href="../ru/Draft_Clone.html" title="Draft Clone/ru">&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; &#1050;&#1083;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; (Draft Clone)</a>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1088;&#1086;&#1076;&#1091;&#1073;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080; &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080; &#1090;&#1086;&#1075;&#1086; &#1078;&#1077; &#1087;&#1088;&#1086;&#1092;&#1080;&#1083;&#1103;, &#1090;&#1072;&#1082; &#1095;&#1090;&#1086; &#1074;&#1089;&#1077; &#1086;&#1085;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; &#1086;&#1076;&#1080;&#1085; &#1080; &#1090;&#1086;&#1090; &#1078;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1087;&#1088;&#1086;&#1092;&#1080;&#1083;&#1103;. &#1047;&#1072;&#1090;&#1077;&#1084;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1091; &#1085;&#1072;&#1089; &#1077;&#1089;&#1090;&#1100; &#1082;&#1086;&#1085;&#1090;&#1091;&#1088; &#1074; &#1085;&#1091;&#1078;&#1085;&#1086;&#1084; &#1084;&#1077;&#1089;&#1090;&#1077;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1077;&#1081;, &#1076;&#1086;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086; &#1083;&#1077;&#1075;&#1082;&#1086; &#1087;&#1086;&#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100; &#1080; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1082;&#1083;&#1086;&#1085; &#1074; &#1085;&#1091;&#1078;&#1085;&#1086;&#1077; &#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <a href="../ru/Draft_Rotate.html" title="Draft Rotate/ru">&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; &#1055;&#1086;&#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100; (Draft Rotate)</a> &#1080; <a href="../ru/Draft_Move.html" title="Draft Move/ru">&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; &#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; (Draft Move)</a>.
</p><p>&#1063;&#1077;&#1088;&#1077;&#1079; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1074;&#1089;&#1103; &#1085;&#1072;&#1096;&#1072; &#1089;&#1077;&#1082;&#1094;&#1080;&#1103; &#1052;&#1080;&#1082;&#1088;&#1086;&#1076;&#1086;&#1084;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1079;&#1072;&#1082;&#1086;&#1085;&#1095;&#1077;&#1085;&#1072;.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_01.jpg&amp;filetimestamp=20161217165244&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_01.jpg" decoding="async" width="932" height="801" class="mw-file-element" data-file-width="932" data-file-height="801"></a></span>
</p><p>&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1083;&#1077;&#1075;&#1082;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1083;&#1080;&#1089;&#1090;&#1099; &#1088;&#1072;&#1089;&#1082;&#1088;&#1086;&#1103; - DXF-&#1092;&#1072;&#1081;&#1083;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1099; &#1074; &#1084;&#1072;&#1089;&#1090;&#1077;&#1088;&#1089;&#1082;&#1091;&#1102; &#1076;&#1083;&#1103; &#1088;&#1072;&#1089;&#1082;&#1088;&#1086;&#1103; &#1087;&#1072;&#1085;&#1077;&#1083;&#1077;&#1081;. &#1057;&#1072;&#1084;&#1099;&#1081; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086; - &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1074;&#1089;&#1105; &#1074; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1077; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <span style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.4em; padding: 0px 10px 1px 10px; font-weight:normal;">Ctrl</span>+<span style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.4em; padding: 0px 10px 1px 10px; font-weight:normal;">A</span>, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; <a href="../ru/Arch_Panel_Cut.html" title="Arch Panel Cut/ru">&#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1072; &#1042;&#1099;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100; &#1055;&#1072;&#1085;&#1077;&#1083;&#1100; (Arch Panel Cut)</a>. &#1042; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085; &#1086;&#1076;&#1080;&#1085; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1042;&#1099;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100; &#1055;&#1072;&#1085;&#1077;&#1083;&#1100; (Panel Cut) &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1055;&#1072;&#1085;&#1077;&#1083;&#1100; (Panel), &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1097;&#1077;&#1075;&#1086;&#1089;&#1103; &#1074; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1080;. &#1056;&#1072;&#1079;&#1076;&#1074;&#1080;&#1085;&#1091;&#1074; &#1080;&#1093;, &#1084;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1084; &#1095;&#1105;&#1090;&#1082;&#1086;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1073;&#1086; &#1074;&#1089;&#1077;&#1093; &#1085;&#1072;&#1096;&#1080;&#1093; &#1076;&#1077;&#1090;&#1072;&#1083;&#1103;&#1093;:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_02.jpg&amp;filetimestamp=20161217165259&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_02.jpg" decoding="async" width="1565" height="873" class="mw-file-element" data-file-width="1565" data-file-height="873"></a></span>
</p><p>&#1047;&#1072;&#1090;&#1077;&#1084; &#1084;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; "&#1088;&#1072;&#1079;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100;" &#1085;&#1072;&#1096;&#1080; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1099;, &#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1080; &#1087;&#1086;&#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100; &#1080;&#1093; &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1085;&#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1072;&#1083;&#1080;&#1089;&#1100; &#1082;&#1072;&#1082; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1083;&#1086;&#1090;&#1085;&#1077;&#1077; &#1085;&#1072; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1081; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1090;&#1077;&#1088;&#1080; &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083;&#1072; &#1073;&#1099;&#1083;&#1080; &#1082;&#1072;&#1082; &#1084;&#1086;&#1078;&#1085;&#1086; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077;. &#1069;&#1090;&#1091; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1102;, &#1082; &#1089;&#1086;&#1078;&#1072;&#1083;&#1077;&#1085;&#1080;&#1102;, &#1087;&#1088;&#1080;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100; &#1074;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102;, &#1085;&#1086; &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; Wikihouse, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1091;&#1078;&#1077; &#1077;&#1089;&#1090;&#1100; &#1075;&#1086;&#1090;&#1086;&#1074;&#1099;&#1077; &#1088;&#1072;&#1089;&#1082;&#1088;&#1086;&#1077;&#1085;&#1085;&#1099;&#1077; &#1083;&#1080;&#1089;&#1090;&#1099;, &#1080;&#1093; &#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1076;&#1086;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;:
</p>
<ol><li>&#1063;&#1090;&#1086;&#1073;&#1099; &#1091;&#1073;&#1077;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103;, &#1095;&#1090;&#1086; &#1074;&#1089;&#1105; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1089;&#1090;&#1072;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080; XY, &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1090;&#1089;&#1103; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; <a href="../ru/Draft_SelectPlane.html" title="Draft SelectPlane/ru">&#1056;&#1072;&#1073;&#1086;&#1095;&#1091;&#1102; &#1055;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1100;</a> &#1085;&#1072; XY (&#1074;&#1077;&#1088;&#1093;).</li>
<li>&#1057;&#1086;&#1079;&#1076;&#1072;&#1081; <a href="../ru/Arch_Panel_Sheet.html" title="Arch Panel Sheet/ru">&#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1072; &#1051;&#1080;&#1089;&#1090; &#1055;&#1072;&#1085;&#1077;&#1083;&#1080; (Arch Panel Sheet)</a></li>
<li>&#1047;&#1072;&#1076;&#1072;&#1081; &#1077;&#1084;&#1091; &#1078;&#1077;&#1083;&#1072;&#1077;&#1084;&#1099;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1096;&#1080;&#1088;&#1080;&#1085;&#1099; &#1080; &#1074;&#1099;&#1089;&#1086;&#1090;&#1099; (&#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1042;&#1080;&#1082;&#1080;-&#1076;&#1086;&#1084;&#1080;&#1082; &#1087;&#1077;&#1095;&#1072;&#1090;&#1072;&#1102;&#1090; &#1085;&#1072; &#1083;&#1080;&#1089;&#1090;&#1072;&#1093; &#1092;&#1072;&#1085;&#1077;&#1088;&#1099; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1084; 122x244 &#1089;&#1084;)</li>
<li>&#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1089;&#1090;&#1080; &#1077;&#1105; &#1074; &#1091;&#1076;&#1086;&#1073;&#1085;&#1086;&#1077; &#1084;&#1077;&#1089;&#1090;&#1086; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <a href="../ru/Draft_Move.html" title="Draft Move/ru">&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; &#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; (Draft Move)</a>.</li>
<li>&#1055;&#1086; &#1078;&#1077;&#1083;&#1072;&#1085;&#1080;&#1102; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1083;&#1077;&#1081;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1084;&#1086;&#1095;&#1100; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1090;&#1100; &#1074;&#1099;&#1088;&#1077;&#1079;&#1072;&#1085;&#1085;&#1099;&#1077; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1099;.</li>
<li>&#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1089;&#1090;&#1080; &#1080; &#1087;&#1086;&#1074;&#1077;&#1088;&#1085;&#1080; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; <a href="../ru/Arch_Panel_Cut.html" title="Arch Panel Cut/ru">&#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1072; &#1042;&#1099;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100; &#1055;&#1072;&#1085;&#1077;&#1083;&#1100; (Arch Panel Cut)</a> &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1085;&#1080; &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1083;&#1080;&#1089;&#1100; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1051;&#1080;&#1089;&#1090;&#1072; &#1055;&#1072;&#1085;&#1077;&#1083;&#1080; (Panel Sheet)</li>
<li>&#1050;&#1086;&#1075;&#1076;&#1072; &#1074;&#1089;&#1105; &#1073;&#1091;&#1076;&#1077;&#1090; &#1073;&#1086;&#1083;&#1077;&#1077;-&#1084;&#1077;&#1085;&#1077;&#1077; &#1075;&#1086;&#1090;&#1086;&#1074;&#1086;, &#1074;&#1099;&#1073;&#1077;&#1088;&#1080; &#1051;&#1080;&#1089;&#1090; &#1055;&#1072;&#1085;&#1077;&#1083;&#1080; (Panel Sheet) &#1080; &#1076;&#1074;&#1072;&#1078;&#1076;&#1099; &#1097;&#1105;&#1083;&#1082;&#1085;&#1080; &#1087;&#1086; &#1085;&#1077;&#1084;&#1091; &#1074; <a href="../ru/Tree_view.html" title="Tree view/ru">&#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;</a>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1077;&#1088;&#1077;&#1081;&#1090;&#1080; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;.</li>
<li>&#1042;&#1099;&#1073;&#1077;&#1088;&#1080; &#1074;&#1089;&#1077; &#1042;&#1099;&#1088;&#1077;&#1079;&#1099; &#1055;&#1072;&#1085;&#1077;&#1083;&#1080; (Panel Cuts), &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1090;&#1099; &#1093;&#1086;&#1095;&#1077;&#1096;&#1100; &#1074;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1074; &#1101;&#1090;&#1086;&#1090; &#1051;&#1080;&#1089;&#1090; (&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1090;&#1077;&#1073;&#1077; &#1087;&#1086;&#1085;&#1072;&#1076;&#1086;&#1073;&#1080;&#1090;&#1089;&#1103; &#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1076;&#1077;&#1088;&#1077;&#1074;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1085;&#1072; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1091; "&#1087;&#1088;&#1086;&#1077;&#1082;&#1090; - project", &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1099;&#1073;&#1080;&#1088;&#1072;&#1090;&#1100; &#1080;&#1079; &#1076;&#1077;&#1088;&#1077;&#1074;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;)</li>
<li>&#1042;&#1099;&#1073;&#1077;&#1088;&#1080; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083; "&#1075;&#1088;&#1091;&#1087;&#1087;&#1072; - group" &#1085;&#1072; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; &#1055;&#1072;&#1085;&#1077;&#1083;&#1100; &#1079;&#1072;&#1076;&#1072;&#1095; &#1091; &#1085;&#1072;&#1096;&#1077;&#1075;&#1086; &#1051;&#1080;&#1089;&#1090;&#1072; &#1055;&#1072;&#1085;&#1077;&#1083;&#1080; (Panel Sheet).</li>
<li>&#1053;&#1072;&#1078;&#1084;&#1080; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <span style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.4em; padding: 0px 10px 1px 10px; font-weight:normal;">Add - &#1044;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100;</span></li>
<li>&#1053;&#1072;&#1078;&#1084;&#1080; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <span style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.4em; padding: 0px 10px 1px 10px; font-weight:normal;">OK</span></li></ol>
<p>&#1042; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1079;&#1072;&#1076;&#1072;&#1095; &#1051;&#1080;&#1089;&#1090;&#1072; (Panel Sheet's) &#1090;&#1072;&#1082;&#1078;&#1077; &#1077;&#1089;&#1090;&#1100; &#1082;&#1085;&#1086;&#1087;&#1082;&#1072;, &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1097;&#1072;&#1103; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1042;&#1099;&#1088;&#1077;&#1079;&#1099; &#1055;&#1072;&#1085;&#1077;&#1083;&#1080; (Panel Cuts) &#1087;&#1086;&#1089;&#1083;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082; &#1086;&#1085;&#1080; &#1073;&#1099;&#1083;&#1080; &#1074;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1099; &#1074; &#1083;&#1080;&#1089;&#1090;. &#1063;&#1077;&#1088;&#1077;&#1079; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1085;&#1072;&#1096;&#1080; &#1083;&#1080;&#1089;&#1090;&#1099; &#1075;&#1086;&#1090;&#1086;&#1074;&#1099;:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_03.jpg&amp;filetimestamp=20161217165326&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_03.jpg" decoding="async" width="1496" height="719" class="mw-file-element" data-file-width="1496" data-file-height="719"></a></span>
</p><p>&#1055;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1081; &#1096;&#1072;&#1075; - &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1074;&#1099;&#1076;&#1077;&#1083;&#1080; &#1074;&#1089;&#1077; &#1083;&#1080;&#1089;&#1090;&#1099;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1101;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1091;&#1081; &#1080;&#1093; &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; DXF &#1080;&#1079; &#1084;&#1077;&#1085;&#1102; &#1060;&#1072;&#1081;&#1083; &rarr; &#1069;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;. &#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1083;&#1080;&#1089;&#1090;&#1086;&#1074; &#1073;&#1091;&#1076;&#1077;&#1090; &#1101;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1086; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1099;&#1084; &#1085;&#1072; &#1088;&#1072;&#1079;&#1085;&#1099;&#1077; &#1089;&#1083;&#1086;&#1080;, &#1089; &#1090;&#1086;&#1081; &#1078;&#1077; &#1094;&#1074;&#1077;&#1090;&#1086;&#1074;&#1086;&#1081; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1082;&#1086;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077; &#1042;&#1080;&#1082;&#1080;-&#1076;&#1086;&#1084;&#1080;&#1082;&#1072;:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_04.jpg&amp;filetimestamp=20161217165748&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_04.jpg" decoding="async" width="1437" height="872" class="mw-file-element" data-file-width="1437" data-file-height="872"></a></span>
</p><p>&#1069;&#1090;&#1080; &#1092;&#1072;&#1081;&#1083;&#1099; &#1075;&#1086;&#1090;&#1086;&#1074;&#1099; &#1082; &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1082;&#1077; &#1074; &#1084;&#1072;&#1089;&#1090;&#1077;&#1088;&#1089;&#1082;&#1080;&#1077;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100; &#1092;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1091;&#1102; &#1088;&#1077;&#1079;&#1082;&#1091;. &#1052;&#1086;&#1078;&#1085;&#1086; &#1090;&#1072;&#1082;&#1078;&#1077; &#1089;&#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; G-&#1082;&#1086;&#1076; &#1076;&#1083;&#1103; &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1082;&#1080; &#1085;&#1072; &#1089;&#1090;&#1072;&#1085;&#1086;&#1082; &#1089; &#1063;&#1055;&#1059; &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1080;&#1079; FreeCAD, &#1085;&#1086; &#1101;&#1090;&#1086; &#1091;&#1078;&#1077; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089; &#1076;&#1083;&#1103; &#1076;&#1088;&#1091;&#1075;&#1086;&#1075;&#1086; &#1091;&#1095;&#1077;&#1073;&#1085;&#1086;&#1075;&#1086; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1072;.
</p>
<!-- 
NewPP limit report
Cached time: 20250725133427
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.043 seconds
Real time usage: 0.052 seconds
Preprocessor visited node count: 188/1000000
Post&#8208;expand include size: 4896/2097152 bytes
Template argument size: 291/2097152 bytes
Highest expansion depth: 3/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1838/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    4.977      1 -total
 46.51%    2.315      1 Template:TutorialInfo/ru
 20.52%    1.021     13 Template:Button
 20.35%    1.013      2 Template:MenuCommand
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:193761-0!canonical and timestamp 20250725133427 and revision id 1618078. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>