<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Workarounds/ru</span></h1><?xml encoding="UTF-8"><div class="mw-parser-output"><div class="mw-pt-languages noprint" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../de/Workarounds.html" class="mw-pt-progress mw-pt-progress--stub" title="Fehlerumgehung (17% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Workarounds.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Workarounds (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../fr/Workarounds.html" class="mw-pt-progress mw-pt-progress--complete" title="Solutions de contournement (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../pl/Workarounds.html" class="mw-pt-progress mw-pt-progress--complete" title="Obej&#347;cia ogranicze&#324; (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt-br/Workarounds.html" class="mw-pt-progress mw-pt-progress--stub" title="Solu&ccedil;&otilde;es alternativas (8% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--low" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</span></li>
<li><a href="../ja/Workarounds.html" class="mw-pt-progress mw-pt-progress--stub" title="&#22238;&#36991;&#31574; (1% translated)" lang="ja" dir="ltr">&#26085;&#26412;&#35486;</a></li>
<li><a href="../ko/Workarounds.html" class="mw-pt-progress mw-pt-progress--low" title="&#54644;&#44208; &#48169;&#48277; &#47784;&#51020; (26% translated)" lang="ko" dir="ltr">&#54620;&#44397;&#50612;</a></li></ul></div>
<p><span id="Introduction"></span>
</p>
<meta property="mw:PageProp/toc">
<h2><span id=".D0.92.D0.B2.D0.B5.D0.B4.D0.B5.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;">&#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;</span></h2>
<p>&#1062;&#1077;&#1083;&#1100; &#1076;&#1072;&#1085;&#1085;&#1086;&#1081; &#1089;&#1090;&#1072;&#1090;&#1100;&#1080; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1080;&#1090;&#1100; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1074; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1077;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1074; FreeCAD &#1080; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1086;&#1073;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077; &#1087;&#1091;&#1090;&#1080; &#1076;&#1083;&#1103; &#1080;&#1093; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;. &#1069;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086; &#1076;&#1083;&#1103; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1102;&#1097;&#1080;&#1093; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1085;&#1072;&#1081;&#1090;&#1080; &#1090;&#1088;&#1077;&#1073;&#1091;&#1102;&#1097;&#1080;&#1077;&#1089;&#1103; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;, &#1089;&#1088;&#1077;&#1076;&#1080; &#1090;&#1077;&#1093; &#1095;&#1090;&#1086; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1074; FreeCAD.
</p><p><span id="Workarounds_for_the_Sketcher_Workbench"></span>
</p>
<h2><span id=".D0.9E.D0.B1.D1.85.D0.BE.D0.B4.D0.BD.D1.8B.D0.B5_.D1.80.D0.B5.D1.88.D0.B5.D0.BD.D0.B8.D1.8F_.D0.B4.D0.BB.D1.8F_.D0.B2.D0.B5.D1.80.D1.81.D1.82.D0.B0.D0.BA.D0.B0_Sketcher"></span><span class="mw-headline" id="&#1054;&#1073;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077;_&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;_&#1076;&#1083;&#1103;_&#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072;_Sketcher">&#1054;&#1073;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; Sketcher</span></h2>
<table class="wikitable">

<tbody><tr>
<th width="2%">&#8470;</th>
<th width="28%">&#1053;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1102;&#1097;&#1072;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;</th>
<th width="70%">&#1055;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1077;&#1084;&#1086;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;
</th></tr>
<tr>
<td>1
</td>
<td>&#1040;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1072; &#1082; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084; (&#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084; &#1094;&#1077;&#1085;&#1090;&#1088;&#1072;&#1084;, &#1082;&#1074;&#1072;&#1076;&#1088;&#1072;&#1085;&#1090;&#1072;&#1084;, &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084;, &#1087;&#1077;&#1088;&#1077;&#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084;)
</td>
<td>
<ul><li>&#1056;&#1091;&#1095;&#1085;&#1086;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; <a href="../ru/Sketcher_Workbench.html#Sketcher_constraints" title="Sketcher Workbench/ru">&#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1081;</a> &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; <a href="../ru/Sketcher_ToggleConstruction.html" title="Sketcher ToggleConstruction/ru">&#1074;&#1089;&#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1083;&#1080;&#1085;&#1080;&#1081;</a></li>
<li>&#1063;&#1077;&#1088;&#1090;&#1080;&#1090;&#1077; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1102; &#1074; <a href="../ru/Draft_Workbench.html" title="Draft Workbench/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1077; &#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; (Draft)</a>, &#1075;&#1076;&#1077; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1072; &#1082; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084;, &#1079;&#1072;&#1090;&#1077;&#1084; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1091;&#1081;&#1090;&#1077; &#1074; &#1101;&#1089;&#1082;&#1080;&#1079; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; <a href="../ru/Draft_Draft2Sketch.html" title="Draft Draft2Sketch/ru">&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; &#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082;&#1042;&#1069;&#1089;&#1082;&#1080;&#1079; (Draft2Sketch)</a>.</li></ul>
</td></tr>
<tr>
<td>2
</td>
<td>&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1072; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1080; &#1084;&#1072;&#1089;&#1089;&#1086;&#1074;&#1099;&#1093; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; (&#1087;&#1083;&#1086;&#1097;&#1072;&#1076;&#1100;, &#1094;&#1077;&#1085;&#1090;&#1088; &#1084;&#1072;&#1089;&#1089;, &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1085;&#1099;&#1077; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;&#1072; &#1087;&#1083;&#1086;&#1097;&#1072;&#1076;&#1080; &#1080; &#1090;.&#1076;.)
</td>
<td>
<ul><li>&#1057;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1075;&#1088;&#1072;&#1085;&#1100; &#1080;&#1079; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <a href="../ru/Part_MakeFace.html" title="Part MakeFace/ru">&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100;&#1043;&#1088;&#1072;&#1085;&#1100; (MakeFace)</a>, &#1079;&#1072;&#1090;&#1077;&#1084; &#1087;&#1088;&#1086;&#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; &#1101;&#1090;&#1091; &#1075;&#1088;&#1072;&#1085;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <a href="../ru/Part_CheckGeometry.html" title="Part CheckGeometry/ru">&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100;&#1043;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1102; (CheckGeometry)</a>.</li></ul>
</td></tr>
<tr>
<td>3
</td>
<td>&#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1099; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; <a href="../ru/Sketcher_External.html" title="Sketcher External/ru">&#1042;&#1085;&#1077;&#1096;&#1085;&#1103;&#1103; &#1043;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1103;</a> &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1076;&#1083;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081; &#1085;&#1072;&#1076; &#1101;&#1089;&#1082;&#1080;&#1079;&#1086;&#1084;
</td>
<td>
<ul><li>&#1042;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102; &#1086;&#1073;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1102;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1091;&#1102; &#1101;&#1090;&#1080;&#1084; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084;.</li>
<li><a rel="nofollow" class="external text" href="https://github.com/realthunder/FreeCAD/releases">&#1057;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1042;&#1077;&#1090;&#1082;&#1091;</a> - &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1047;&#1072;&#1076;&#1072;&#1085;&#1080;&#1077; &#1043;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080;</li></ul>
</td></tr>
<tr>
<td>4
</td>
<td>&#1055;&#1088;&#1086;&#1077;&#1094;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1088;&#1105;&#1073;&#1077;&#1088; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; <a href="../ru/Sketcher_External.html" title="Sketcher External/ru">&#1042;&#1085;&#1077;&#1096;&#1085;&#1103;&#1103; &#1043;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1103;</a>, &#1082;&#1086;&#1075;&#1076;&#1072; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1072; &#1075;&#1088;&#1072;&#1085;&#1100;
</td>
<td>
<ul><li>&#1055;&#1088;&#1086;&#1077;&#1094;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1088;&#1077;&#1073;&#1088;&#1072; &#1080;&#1085;&#1076;&#1080;&#1074;&#1080;&#1076;&#1091;&#1072;&#1083;&#1100;&#1085;&#1086;</li></ul>
</td></tr>
<tr>
<td>5
</td>
<td>3D &#1069;&#1089;&#1082;&#1080;&#1079;&#1099;
</td>
<td>
<ul><li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; <a href="../ru/Draft_Workbench.html" title="Draft Workbench/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; &#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; (Draft)</a>, &#1085;&#1086; 3D-&#1095;&#1077;&#1088;&#1090;&#1077;&#1078;&#1080; &#1085;&#1077;&#1083;&#1100;&#1079;&#1103; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; &#1101;&#1089;&#1082;&#1080;&#1079;&#1099; (&#1086;&#1076;&#1085;&#1072;&#1082;&#1086; &#1080;&#1093; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1085;&#1086;&#1075;&#1086; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1072;, &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1086;&#1075;&#1086; <a href="../ru/FEM_Workbench.html" title="FEM Workbench/ru">&#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1084; &#1052;&#1050;&#1069;</a> &#1080;&#1083;&#1080; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1084;, &#1072; &#1090;&#1072;&#1082; &#1078;&#1077; &#1076;&#1083;&#1103; &#1090;&#1088;&#1072;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; <a href="../ru/PartDesign_AdditivePipe.html" title="PartDesign AdditivePipe/ru">&#1055;&#1088;&#1086;&#1077;&#1082;&#1090;&#1085;&#1086;&#1081;&#1044;&#1077;&#1090;&#1072;&#1083;&#1080; &#1058;&#1088;&#1091;&#1073;&#1072;&#1042;&#1099;&#1076;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; (PartDesign AdditivePipe)</a> &#1080;&#1083;&#1080; <a href="../ru/Part_Sweep.html" title="Part Sweep/ru">&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1087;&#1086; &#1058;&#1088;&#1072;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1080; (Part Sweep)</a>).</li></ul>
</td></tr>
<tr>
<td>6
</td>
<td>&#1055;&#1088;&#1086;&#1077;&#1082;&#1094;&#1080;&#1103; &#1089;&#1077;&#1082;&#1091;&#1097;&#1080;&#1093; &#1082;&#1088;&#1086;&#1084;&#1086;&#1082; &#1087;&#1088;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1080; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; &#1085;&#1072; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1100;, &#1087;&#1088;&#1086;&#1093;&#1086;&#1076;&#1103;&#1097;&#1091;&#1102; &#1095;&#1077;&#1088;&#1077;&#1079; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;
</td>
<td>
<ul><li>&#1057;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; <a href="../ru/Std_LinkMake.html" title="Std LinkMake/ru">&#1057;&#1089;&#1099;&#1083;&#1082;&#1091; (Link)</a> &#1080;&#1079; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1080; <a href="../ru/Part_SliceApart.html" title="Part SliceApart/ru">&#1088;&#1072;&#1079;&#1089;&#1077;&#1082;&#1080;&#1090;&#1077;</a> &#1101;&#1090;&#1086;&#1090; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1092;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1088;&#1077;&#1078;&#1091;&#1097;&#1080;&#1077; &#1082;&#1088;&#1086;&#1084;&#1082;&#1080;.</li></ul>
</td></tr>
<tr>
<td>7
</td>
<td>&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; <a href="../ru/Sketcher_ViewSection.html" title="Sketcher ViewSection/ru">&#1055;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;</a>, &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081; &#1079;&#1072;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1085;&#1099;&#1077; &#1089;&#1088;&#1077;&#1079;&#1099;
</td>
<td>
<ul><li>&#1045;&#1089;&#1083;&#1080; &#1101;&#1089;&#1082;&#1080;&#1079; &#1087;&#1072;&#1088;&#1072;&#1083;&#1083;&#1077;&#1083;&#1077;&#1085; &#1086;&#1076;&#1085;&#1086;&#1081; &#1080;&#1079; &#1075;&#1083;&#1072;&#1074;&#1085;&#1099;&#1093; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1077;&#1081; &#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;: &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; <a href="../ru/Part_SectionCut.html" title="Part SectionCut/ru">&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1057;&#1077;&#1082;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1081; &#1088;&#1072;&#1079;&#1088;&#1077;&#1079;</a>.</li></ul>
</td></tr>
<tr>
<td>8
</td>
<td>&#1056;&#1072;&#1079;&#1084;&#1077;&#1088; &#1076;&#1080;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1086;&#1089;&#1080; &#1089;&#1080;&#1084;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080; &#1076;&#1083;&#1103; &#1076;&#1077;&#1090;&#1072;&#1083;&#1077;&#1081; &#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103;
</td>
<td>
<ul><li>&#1042;&#1084;&#1077;&#1089;&#1090;&#1086; &#1101;&#1090;&#1086;&#1075;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1088;&#1072;&#1076;&#1080;&#1091;&#1089;&#1072; (&#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1074;&#1077;&#1089;&#1090;&#1080; &#1076;&#1080;&#1072;&#1084;&#1077;&#1090;&#1088;, &#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1099;&#1081; &#1085;&#1072; 2 - &#1088;&#1072;&#1089;&#1095;&#1105;&#1090; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1105;&#1085; FreeCAD &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;).</li></ul>
</td></tr>
<tr>
<td>9
</td>
<td>&#1056;&#1072;&#1079;&#1084;&#1077;&#1088;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1082;&#1080;, &#1072;&#1076;&#1072;&#1087;&#1090;&#1080;&#1088;&#1091;&#1102;&#1097;&#1080;&#1077;&#1089;&#1103; &#1082; &#1087;&#1086;&#1074;&#1086;&#1088;&#1086;&#1090;&#1091; &#1074;&#1080;&#1076;&#1072;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1093; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086; &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100;
</td>
<td>
<ul><li>&#1055;&#1086;&#1074;&#1086;&#1088;&#1072;&#1095;&#1080;&#1074;&#1072;&#1081;&#1090;&#1077; &#1074;&#1080;&#1076; &#1087;&#1088;&#1080; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080;</li></ul>
</td></tr>
<tr>
<td>10
</td>
<td>&#1055;&#1077;&#1088;&#1074;&#1099;&#1081; <a href="../ru/Sketcher_Workbench.html#Dimensional_constraints" title="Sketcher Workbench/ru">&#1088;&#1072;&#1079;&#1084;&#1077;&#1088;</a> &#1074; &#1101;&#1089;&#1082;&#1080;&#1079;&#1077;, &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1091;&#1077;&#1090; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1102; &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1077;&#1105; &#1087;&#1077;&#1088;&#1074;&#1086;&#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086; &#1085;&#1072;&#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1085;&#1072;&#1103; &#1092;&#1086;&#1088;&#1084;&#1072; &#1085;&#1077; &#1073;&#1099;&#1083;&#1072; &#1085;&#1072;&#1088;&#1091;&#1096;&#1077;&#1085;&#1072;
</td>
<td>
<ul><li>&#1055;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; <a href="../ru/Sketcher_Workbench.html#Dimensional_constraints" title="Sketcher Workbench/ru">&#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1085;&#1099;&#1093; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1081;</a> &#1087;&#1077;&#1088;&#1077;&#1076; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1077;&#1084; &#1074;&#1089;&#1077;&#1081; &#1092;&#1080;&#1075;&#1091;&#1088;&#1099;.</li></ul>
</td></tr>
<tr>
<td>11
</td>
<td>&#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1082;&#1088;&#1099;&#1090;&#1100; &#1074;&#1089;&#1102; <a href="../ru/Sketcher_ToggleConstruction.html" title="Sketcher ToggleConstruction/ru"> &#1074;&#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1091;&#1102; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1102;</a> &#1074; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1101;&#1089;&#1082;&#1080;&#1079;&#1077;
</td>
<td>
<ul><li>&#1042; &#1086;&#1082;&#1085;&#1077; "&#1069;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099;" &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088; "&#1042;&#1089;&#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103;", &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1074; &#1085;&#1105;&#1084; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; <a href="../ru/Sketcher_ToggleConstruction.html" title="Sketcher ToggleConstruction/ru">&#1074;&#1089;&#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080;</a> &#1080; &#1089;&#1085;&#1080;&#1084;&#1080;&#1090;&#1077; &#1089; &#1085;&#1080;&#1093; &#1092;&#1083;&#1072;&#1078;&#1082;&#1080;.</li></ul>
</td></tr></tbody></table>
<p><span id="Workarounds_for_the_Part_Workbench_and_Part_Design_Workbench"></span>
</p>
<h2><span id=".D0.9E.D0.B1.D1.85.D0.BE.D0.B4.D0.BD.D1.8B.D0.B5_.D1.80.D0.B5.D1.88.D0.B5.D0.BD.D0.B8.D1.8F_.D0.B4.D0.BB.D1.8F_.D0.B2.D0.B5.D1.80.D1.81.D1.82.D0.B0.D0.BA.D0.BE.D0.B2_.D0.94.D0.B5.D1.82.D0.B0.D0.BB.D1.8C_.28Part.29_.D0.B8_.D0.9F.D1.80.D0.BE.D0.B5.D0.BA.D1.82.D0.BD.D0.B0.D1.8F_.D0.94.D0.B5.D1.82.D0.B0.D0.BB.D1.8C_.28Part_Design.29"></span><span class="mw-headline" id="&#1054;&#1073;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077;_&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;_&#1076;&#1083;&#1103;_&#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1086;&#1074;_&#1044;&#1077;&#1090;&#1072;&#1083;&#1100;_(Part)_&#1080;_&#1055;&#1088;&#1086;&#1077;&#1082;&#1090;&#1085;&#1072;&#1103;_&#1044;&#1077;&#1090;&#1072;&#1083;&#1100;_(Part_Design)">&#1054;&#1073;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1086;&#1074; &#1044;&#1077;&#1090;&#1072;&#1083;&#1100; (Part) &#1080; &#1055;&#1088;&#1086;&#1077;&#1082;&#1090;&#1085;&#1072;&#1103; &#1044;&#1077;&#1090;&#1072;&#1083;&#1100; (Part Design)</span></h2>
<table class="wikitable">

<tbody><tr>
<th width="2%">&#8470;</th>
<th width="28%">&#1053;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1102;&#1097;&#1072;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;</th>
<th width="70%">&#1055;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1077;&#1084;&#1086;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;
</th></tr>
<tr>
<td>1
</td>
<td>&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1080; &#1084;&#1072;&#1089;&#1089;&#1086;&#1075;&#1072;&#1073;&#1072;&#1088;&#1080;&#1090;&#1085;&#1099;&#1077; &#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1080;&#1089;&#1090;&#1080;&#1082;&#1080; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;
</td>
<td>
<ul><li><a href="../ru/Macro_FCInfo.html" title="Macro FCInfo/ru">FCInfo &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;</a></li>
<li><a href="../ru/Part_CheckGeometry.html" title="Part CheckGeometry/ru">Part CheckGeometry</a> &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1080; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080; - &#1087;&#1083;&#1086;&#1097;&#1072;&#1076;&#1100;, &#1086;&#1073;&#1098;&#1105;&#1084;, &#1084;&#1072;&#1089;&#1089;&#1072;, &#1076;&#1083;&#1080;&#1085;&#1072;, &#1094;&#1077;&#1085;&#1090;&#1088; &#1084;&#1072;&#1089;&#1089;, &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;&#1099; &#1080;&#1085;&#1077;&#1088;&#1094;&#1080;&#1080;, &#1088;&#1072;&#1076;&#1080;&#1091;&#1089; &#1075;&#1080;&#1088;&#1072;&#1094;&#1080;&#1080;</li></ul>
</td></tr>
<tr>
<td>2
</td>
<td>&#1054;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1094;&#1077;&#1085;&#1090;&#1088;&#1072; &#1084;&#1072;&#1089;&#1089; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; (&#1076;&#1077;&#1090;&#1072;&#1083;&#1080; &#1080;&#1083;&#1080; &#1089;&#1073;&#1086;&#1088;&#1086;&#1095;&#1085;&#1099;&#1093; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;)
</td>
<td>
<ul><li><a href="../ru/Macro_CenterOfMass.html" title="Macro CenterOfMass/ru">&#1052;&#1072;&#1082;&#1088;&#1086;&#1089; CenterOfMass</a></li></ul>
</td></tr>
<tr>
<td>3
</td>
<td><a href="../ru/Std_ToggleClipPlane.html" title="Std ToggleClipPlane/ru">&#1055;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1100; &#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;</a> &#1085;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1105;&#1090; &#1074;&#1087;&#1077;&#1095;&#1072;&#1090;&#1083;&#1077;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100; &#1087;&#1086;&#1083;&#1072;&#1103;
</td>
<td>
<ul><li>&#1048;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; &#1054;&#1089;&#1074;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; (Lighting) &#1074; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072;&#1093; &#1074;&#1080;&#1076;&#1072; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080; &#1085;&#1072; "One side - &#1054;&#1076;&#1085;&#1072; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1072;" (&#1086;&#1095;&#1077;&#1085;&#1100; &#1075;&#1088;&#1091;&#1073;&#1099;&#1081; &#1101;&#1082;&#1074;&#1080;&#1074;&#1072;&#1083;&#1077;&#1085;&#1090;, &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1089; &#1084;&#1085;&#1086;&#1075;&#1086;&#1094;&#1074;&#1077;&#1090;&#1085;&#1099;&#1084;&#1080; &#1076;&#1077;&#1090;&#1072;&#1083;&#1103;&#1084;&#1080;)</li>
<li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; <a href="../ru/Part_SectionCut.html" title="Part SectionCut/ru">&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1057;&#1077;&#1082;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1081; &#1088;&#1072;&#1079;&#1088;&#1077;&#1079;</a> - &#1086;&#1090;&#1084;&#1077;&#1085;&#1080;&#1074; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074;&#1089;&#1077;&#1093; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1077;&#1081; &#1087;&#1077;&#1088;&#1077;&#1076; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077;&#1084; &#1047;&#1072;&#1082;&#1088;&#1099;&#1090;&#1100; (Close)</li>
<li><a rel="nofollow" class="external text" href="https://github.com/realthunder/FreeCAD/releases">&#1057;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1074;&#1077;&#1090;&#1082;&#1091;</a> - &#1101;&#1082;&#1089;&#1087;&#1077;&#1088;&#1080;&#1084;&#1077;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1088;&#1077;&#1085;&#1076;&#1077;&#1088;</li></ul>
</td></tr>
<tr>
<td>4
</td>
<td>&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1086;&#1089;&#1080; &#1085;&#1072; &#1087;&#1077;&#1088;&#1077;&#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1080; 2-&#1093; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1077;&#1081; &#1080; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080; &#1087;&#1086;&#1089;&#1077;&#1088;&#1077;&#1076;&#1080;&#1085;&#1077; &#1084;&#1077;&#1078;&#1076;&#1091; &#1076;&#1074;&#1091;&#1084;&#1103; &#1075;&#1088;&#1072;&#1085;&#1103;&#1084;&#1080;/&#1090;&#1086;&#1095;&#1082;&#1072;&#1084;&#1080;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1086;&#1074; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; <a href="../ru/Datum.html" title="Datum/ru">&#1086;&#1087;&#1086;&#1088;&#1085;&#1099;&#1093; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;</a>.
</td>
<td>
<ul><li><a href="../ru/Macro_Intersection.html" title="Macro Intersection/ru">&#1052;&#1072;&#1082;&#1088;&#1086;&#1089; &#1055;&#1077;&#1088;&#1077;&#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;</a></li>
<li>&#1056;&#1091;&#1095;&#1085;&#1072;&#1103; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1080; <a href="../ru/Datum.html" title="Datum/ru">&#1086;&#1087;&#1086;&#1088;&#1085;&#1099;&#1093; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;</a>.</li></ul>
</td></tr>
<tr>
<td>5
</td>
<td>&#1040;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089;&#1088;&#1077;&#1076;&#1085;&#1077;&#1081; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080; (&#1076;&#1083;&#1103; &#1090;&#1086;&#1085;&#1082;&#1086;&#1089;&#1090;&#1077;&#1085;&#1085;&#1099;&#1093; &#1076;&#1077;&#1090;&#1072;&#1083;&#1077;&#1081;)
</td>
<td>
<ul><li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; <a href="../ru/Draft_Facebinder.html" title="Draft Facebinder/ru">&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; &#1057;&#1096;&#1080;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; &#1043;&#1088;&#1072;&#1085;&#1077;&#1081; (Facebinder)</a>, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; <a href="../ru/Draft_Scale.html" title="Draft Scale/ru">&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; &#1052;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073; (Scale)</a> &#1080;&#1083;&#1080; <a href="../ru/Part_Offset.html" title="Part Offset/ru">&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1057;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; 3D (Offset)</a> (&#1087;&#1088;&#1086;&#1097;&#1077;), &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1089;&#1088;&#1077;&#1076;&#1085;&#1102;&#1102; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1100;, &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1086;&#1073;&#1093;&#1086;&#1076;&#1085;&#1086;&#1081; &#1087;&#1091;&#1090;&#1100; &#1076;&#1083;&#1103; &#1088;&#1072;&#1089;&#1090;&#1103;&#1075;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1075;&#1088;&#1072;&#1085;&#1077;&#1081;, &#1077;&#1089;&#1083;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089;&#1088;&#1077;&#1076;&#1085;&#1080;&#1077; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1080; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1099;, &#1080; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1080;&#1090;&#1077; &#1080;&#1093; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1073;&#1091;&#1083;&#1077;&#1074;&#1099;&#1093; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;</li></ul>
</td></tr>
<tr>
<td>6
</td>
<td>&#1055;&#1088;&#1086;&#1077;&#1094;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; (&#1082;&#1072;&#1088;&#1090;&#1099;/&#1086;&#1073;&#1105;&#1088;&#1090;&#1082;&#1080;) &#1101;&#1089;&#1082;&#1080;&#1079;&#1086;&#1074; &#1085;&#1072; &#1085;&#1077;&#1087;&#1083;&#1072;&#1085;&#1072;&#1088;&#1085;&#1099;&#1077; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077;) &#1075;&#1088;&#1072;&#1085;&#1080;
</td>
<td>
<ul><li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; <a href="../ru/Curves_SketchOnSurface.html" title="Curves SketchOnSurface/ru">&#1050;&#1088;&#1080;&#1074;&#1099;&#1077; &#1069;&#1089;&#1082;&#1080;&#1079;&#1053;&#1072;&#1055;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1080; (Curves SketchOnSurface)</a> &#1074; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1084; <a href="../ru/Curves_Workbench.html" title="Curves Workbench/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1077; &#1050;&#1088;&#1080;&#1074;&#1099;&#1077; (Curves)</a>.</li>
<li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; <a href="../ru/Part_ProjectionOnSurface.html" title="Part ProjectionOnSurface/ru">&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1055;&#1088;&#1086;&#1077;&#1082;&#1094;&#1080;&#1103;&#1053;&#1072;&#1055;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1100; (Part ProjectionOnSurface)</a></li></ul>
</td></tr>
<tr>
<td>7
</td>
<td>&#1042;&#1099;&#1073;&#1086;&#1088; &#1095;&#1072;&#1089;&#1090;&#1080; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; &#1076;&#1083;&#1103; <a href="../ru/PartDesign_Pad.html" title="PartDesign Pad/ru">&#1074;&#1099;&#1076;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103;</a>.
</td>
<td>
<ul><li>&#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1086;&#1076;&#1085;&#1091; &#1079;&#1072; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1074;&#1089;&#1077; &#1088;&#1105;&#1073;&#1088;&#1072;, &#1086;&#1073;&#1088;&#1072;&#1079;&#1091;&#1102;&#1097;&#1080;&#1077; &#1079;&#1072;&#1084;&#1082;&#1085;&#1091;&#1090;&#1099;&#1081; &#1082;&#1086;&#1085;&#1090;&#1091;&#1088;, &#1076;&#1083;&#1103; &#1074;&#1099;&#1076;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103;.</li>
<li>&#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1088;&#1105;&#1073;&#1088;&#1072; &#1080;&#1079; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; &#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; <a href="../ru/Std_LinkMakeRelative.html" title="Std LinkMakeRelative/ru">&#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1091;&#1102; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091;</a> &#1080;&#1083;&#1080; <a href="../ru/PartDesign_SubShapeBinder.html" title="PartDesign SubShapeBinder/ru">&#1087;&#1086;&#1076;-&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1085;&#1091;&#1102; &#1089;&#1074;&#1103;&#1079;&#1091;&#1102;&#1097;&#1091;&#1102; &#1092;&#1086;&#1088;&#1084;&#1091;</a> &#1080; &#1074;&#1099;&#1076;&#1072;&#1074;&#1080;&#1090;&#1077; &#1101;&#1090;&#1086;&#1090; &#1085;&#1086;&#1074;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;.</li>
<li><a href="../ru/PartDesign_Pad.html" title="PartDesign Pad/ru">&#1042;&#1099;&#1076;&#1072;&#1074;&#1080;&#1090;&#1077;</a> &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1101;&#1089;&#1082;&#1080;&#1079;, &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1081; &#1085;&#1072; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1081; &#1075;&#1088;&#1072;&#1085;&#1080; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1086;&#1087;&#1086;&#1083;&#1086;&#1078;&#1085;&#1086;&#1084; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080; (&#1082; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1081; &#1092;&#1086;&#1088;&#1084;&#1077;), &#1090;&#1072;&#1082; &#1095;&#1090;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1102;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1086;&#1074;&#1099;&#1077; &#1075;&#1088;&#1072;&#1085;&#1080;. &#1047;&#1072;&#1090;&#1077;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; &#1101;&#1090;&#1080; &#1075;&#1088;&#1072;&#1085;&#1080; &#1087;&#1086; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1080; &#1074;&#1099;&#1076;&#1072;&#1074;&#1080;&#1090;&#1100; &#1080;&#1093;. &#1069;&#1090;&#1086;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089; &#1086;&#1089;&#1090;&#1086;&#1088;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1083;&#1080;&#1096;&#1085;&#1080;&#1077; 3D-&#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1087;&#1088;&#1080;&#1074;&#1077;&#1089;&#1090;&#1080; &#1082; &#1085;&#1077;&#1087;&#1088;&#1077;&#1076;&#1074;&#1080;&#1076;&#1077;&#1085;&#1085;&#1099;&#1084; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1084;. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1090;&#1089;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1099;&#1096;&#1077;&#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1077; &#1086;&#1073;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077; &#1087;&#1091;&#1090;&#1080;.</li>
<li><a rel="nofollow" class="external text" href="https://github.com/realthunder/FreeCAD/releases">&#1057;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1074;&#1077;&#1090;&#1082;&#1091;</a> - &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1069;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1072; &#1054;&#1076;&#1080;&#1085;&#1086;&#1095;&#1085;&#1086;&#1081; &#1043;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080; &#1080; &#1069;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1072; &#1053;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1043;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1081; &#1080;&#1083;&#1080; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1091;&#1102; <a href="../ru/PartDesign_SubShapeBinder.html" title="PartDesign SubShapeBinder/ru">&#1055;&#1086;&#1076;&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1085;&#1091;&#1102; &#1060;&#1086;&#1088;&#1084;&#1091;</a>, &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1087;&#1088;&#1080; &#1074;&#1099;&#1073;&#1086;&#1088;&#1077; &#1080;&#1079; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; &#1088;&#1105;&#1073;&#1077;&#1088;, &#1086;&#1073;&#1088;&#1072;&#1079;&#1091;&#1102;&#1097;&#1080;&#1093; &#1079;&#1072;&#1084;&#1082;&#1085;&#1091;&#1090;&#1099;&#1081; &#1082;&#1086;&#1085;&#1090;&#1091;&#1088;, &#1087;&#1077;&#1088;&#1077;&#1076; <a href="../ru/PartDesign_Pad.html" title="PartDesign Pad/ru">&#1074;&#1099;&#1076;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084;</a>.</li></ul>
</td></tr>
<tr>
<td>8
</td>
<td><a href="../ru/PartDesign_Fillet.html" title="PartDesign Fillet/ru">&#1057;&#1082;&#1088;&#1091;&#1075;&#1083;&#1077;&#1085;&#1080;&#1103;</a> &#1080; <a href="../ru/PartDesign_Chamfer.html" title="PartDesign Chamfer/ru">&#1092;&#1072;&#1089;&#1082;&#1080;</a>, &#1079;&#1072;&#1093;&#1074;&#1072;&#1090;&#1099;&#1074;&#1072;&#1102;&#1090; &#1089;&#1084;&#1077;&#1078;&#1085;&#1099;&#1077; &#1075;&#1088;&#1072;&#1085;&#1080;/&#1088;&#1105;&#1073;&#1088;&#1072;.
</td>
<td>
<ul><li>&#1057;&#1076;&#1077;&#1083;&#1072;&#1081;&#1090;&#1077; <a href="../ru/PartDesign_Fillet.html" title="PartDesign Fillet/ru">&#1089;&#1082;&#1088;&#1091;&#1075;&#1083;&#1077;&#1085;&#1080;&#1077;</a> &#1089; &#1095;&#1091;&#1090;&#1100; &#1084;&#1077;&#1085;&#1100;&#1096;&#1080;&#1084; &#1088;&#1072;&#1076;&#1080;&#1091;&#1089;&#1086;&#1084; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, 6,4999 &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; 6,5 &#1084;&#1084;).</li>
<li>&#1052;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; &#1101;&#1090;&#1080; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; <a href="../ru/PartDesign_Pocket.html" title="PartDesign Pocket/ru">&#1055;&#1088;&#1086;&#1077;&#1082;&#1090;&#1085;&#1072;&#1103;&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1042;&#1099;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100;</a>, &#1080;&#1083;&#1080; &#1089;&#1088;&#1072;&#1079;&#1091; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1081;&#1090;&#1077; &#1080;&#1093; &#1074; &#1101;&#1089;&#1082;&#1080;&#1079;&#1099;.</li></ul>
</td></tr>
<tr>
<td>9
</td>
<td>&#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1081; &#1088;&#1072;&#1076;&#1080;&#1091;&#1089; &#1076;&#1083;&#1103; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; <a href="../ru/PartDesign_Fillet.html" title="PartDesign Fillet/ru">&#1055;&#1088;&#1086;&#1077;&#1082;&#1090;&#1085;&#1072;&#1103;&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1057;&#1082;&#1088;&#1091;&#1075;&#1083;&#1077;&#1085;&#1080;&#1077; (PartDesign Fillet)</a>.
</td>
<td>
<ul><li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; <a href="../ru/Part_Fillet.html" title="Part Fillet/ru">&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1057;&#1082;&#1088;&#1091;&#1075;&#1083;&#1077;&#1085;&#1080;&#1077; (Part Fillet)</a>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1081; &#1088;&#1072;&#1076;&#1080;&#1091;&#1089;.</li></ul>
</td></tr>
<tr>
<td>10
</td>
<td>&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1082;&#1088;&#1080;&#1074;&#1099;&#1077;
</td>
<td>
<ul><li><a href="../ru/Macro_3D_Parametric_Curve.html" title="Macro 3D Parametric Curve/ru">&#1052;&#1072;&#1082;&#1088;&#1086;&#1089; 3D &#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1050;&#1088;&#1080;&#1074;&#1072;&#1103;</a></li></ul>
</td></tr>
<tr>
<td>11
</td>
<td>&#1050;&#1086;&#1089;&#1084;&#1077;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1088;&#1077;&#1079;&#1100;&#1073;&#1099;
</td>
<td>
<ul><li>&#1044;&#1086;&#1073;&#1072;&#1074;&#1100;&#1090;&#1077; &#1082;&#1086;&#1089;&#1084;&#1077;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1088;&#1077;&#1079;&#1100;&#1073;&#1099; &#1085;&#1072; &#1083;&#1080;&#1089;&#1090;&#1077; <a href="../ru/TechDraw_Workbench.html#Centerlines_and_threading" title="TechDraw Workbench/ru">&#1058;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1063;&#1077;&#1088;&#1090;&#1077;&#1078;&#1072; (TechDraw)</a></li>
<li>&#1052;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1080;&#1077; &#1088;&#1077;&#1079;&#1100;&#1073;&#1099;, &#1076;&#1083;&#1103; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1099; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; <a href="../ru/PartDesign_Hole.html" title="PartDesign Hole/ru">&#1054;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1077;</a>.</li></ul>
</td></tr>
<tr>
<td>12
</td>
<td>Partitions (splitting surfaces and volumes with sketches and datum planes while keeping the number of parts unchanged)
</td>
<td>
<ul><li><a href="../Part_BooleanFragments.html" title="Part BooleanFragments">Boolean Fragments</a> tool &ndash; only splitting surfaces with sketches</li></ul>
</td></tr>
<tr>
<td>13
</td>
<td>Guide rails for <a href="../PartDesign_AdditivePipe.html" title="PartDesign AdditivePipe">Additive Pipe</a> and <a href="../PartDesign_AdditiveLoft.html" title="PartDesign AdditiveLoft">Additive Loft</a> or their equivalents in the <a href="../Part_Workbench.html" title="Part Workbench">Part Workbench</a>
</td>
<td>
<ul><li>Add-on <a href="../CurvedShapes_Workbench.html" title="CurvedShapes Workbench">CurvedShapes Workbench</a> - <a href="../CurvedShapes_CurvedArray.html" title="CurvedShapes CurvedArray">CurvedArray</a> or <a href="../index.php?title=CurvedShapes_CurvedPathArray&amp;action=edit&amp;redlink=1.html" class="new" title="CurvedShapes CurvedPathArray (page does not exist)">CurvedPathArray</a></li>
<li>Add-on <a href="../Curves_Workbench.html" title="Curves Workbench">Curves Workbench</a> - <a href="../Curves_GordonSurface.html" title="Curves GordonSurface">GordonSurface</a> or <a href="../Curves_Pipeshell.html" title="Curves Pipeshell">Pipeshell</a></li>
<li><a href="../Surface_Workbench.html" title="Surface Workbench">Surface Workbench</a> - <a href="../Surface_Filling.html" title="Surface Filling">Filling</a></li></ul>
</td></tr>
<tr>
<td>14
</td>
<td>Twist for <a href="../PartDesign_AdditivePipe.html" title="PartDesign AdditivePipe">PartDesign AdditivePipe</a> or <a href="../Part_Sweep.html" title="Part Sweep">Part Sweep</a>
</td>
<td>
<ul><li><a href="../PartDesign_AdditiveHelix.html" title="PartDesign AdditiveHelix">PartDesign AdditiveHelix</a> (<code>pitch = height * 360 / twist angle</code>)</li>
<li>Add-on <a href="../CurvedShapes_Workbench.html" title="CurvedShapes Workbench">CurvedShapes Workbench</a> - <a href="../CurvedShapes_CurvedArray.html" title="CurvedShapes CurvedArray">CurvedArray</a></li>
<li>Multisection mode in <a href="../PartDesign_AdditivePipe.html" title="PartDesign AdditivePipe">Additive Pipe</a></li></ul>
</td></tr>
<tr>
<td>15
</td>
<td>Bending existing parts
</td>
<td>
<ul><li>For sheet metal objects: add-on <a href="../SheetMetal_Workbench.html" title="SheetMetal Workbench">SheetMetal Workbench</a> - <a href="../SheetMetal_AddFoldWall.html" title="SheetMetal AddFoldWall">SheetMetal AddFoldWall</a></li></ul>
</td></tr>
<tr>
<td>16
</td>
<td>Pattern along a curve
</td>
<td>
<ul><li><a href="../Draft_PathArray.html" title="Draft PathArray">Draft PathArray</a> tool</li></ul>
</td></tr>
<tr>
<td>17
</td>
<td>Cut scope - cut tools affecting only selected part of the model
</td>
<td>
<ul><li>Different order of operations and use <a href="../Part_Cut.html" title="Part Cut">boolean cut</a> on <a href="../PartDesign_Pad.html" title="PartDesign Pad">padded</a> bodies</li></ul>
</td></tr>
<tr>
<td>18
</td>
<td>Merging adjacent faces
</td>
<td>
<ul><li>For faces of a <a href="../PartDesign_Body.html" title="PartDesign Body">PartDesign Body</a>: change the Refine property of the last Feature to <code>true</code>, may not remove all the redundant faces</li>
<li>For co-planar faces: use <a href="../Draft_Upgrade.html" title="Draft Upgrade">Draft Upgrade</a> twice to get a <a href="../Draft_Wire.html" title="Draft Wire">Draft Wire</a>, <a href="../Draft_Downgrade.html" title="Draft Downgrade">Draft Downgrade</a> the wire to get a face</li></ul>
</td></tr>
<tr>
<td>19
</td>
<td><a href="../PartDesign_Hole.html" title="PartDesign Hole">Hole</a> tool using points from sketches
</td>
<td>
<ul><li>Draw circles for the <a href="../PartDesign_Hole.html" title="PartDesign Hole">Hole</a> tool</li></ul>
</td></tr>
<tr>
<td>20
</td>
<td><a href="../PartDesign_Point.html" title="PartDesign Point">Datum points</a> from coordinates
</td>
<td>
<ul><li>Base <a href="../PartDesign_Point.html" title="PartDesign Point">datum points</a> on existing geometry</li>
<li>Create <a href="../PartDesign_Point.html" title="PartDesign Point">datum points</a> at the origin and change their <a href="../Placement.html" title="Placement">Position</a> afterwards</li></ul>
</td></tr>
<tr>
<td>21
</td>
<td>A tool for automatic creation of ribs (structural reinforcements)
</td>
<td>
<ul><li>Create ribs manually, wedges (<a href="../Part_Wedge.html" title="Part Wedge">Part Wedge</a> or <a href="../PartDesign_AdditiveWedge.html" title="PartDesign AdditiveWedge">PartDesign AdditiveWedge</a>) can be used for simple triangular ribs</li></ul>
</td></tr>
<tr>
<td>22
</td>
<td>A tool for automatic creation of domes
</td>
<td>
<ul><li>Create domes manually, spheres (<a href="../Part_Sphere.html" title="Part Sphere">Part Sphere</a> or <a href="../PartDesign_AdditiveSphere.html" title="PartDesign AdditiveSphere">PartDesign AdditiveSphere</a>) with properly adjusted parameters can be used for simple spherical domes</li></ul>
</td></tr>
<tr>
<td>23
</td>
<td>Extending faces up to other faces (useful e.g. when extracting midsurfaces, as mentioned above)
</td>
<td>
<ul><li>Use the <a href="../Draft_Upgrade.html" title="Draft Upgrade">Draft Upgrade</a> tool on the faces to be extended, extend proper edges with <a href="../Draft_Stretch.html" title="Draft Stretch">Draft Stretch</a> and recreate the faces using <a href="../Part_MakeFace.html" title="Part MakeFace">Part MakeFace</a></li></ul>
</td></tr>
<tr>
<td>24
</td>
<td>Fuzzy versions of <a href="../Part_Workbench.html#Boolean_toolbar" title="Part Workbench">Part Boolean operations</a> (possibility to specify a tolerance for boolean union and other operations)
</td>
<td>
<ul><li>Add-on <a href="../Defeaturing_Workbench.html" title="Defeaturing Workbench">Defeaturing Workbench</a></li></ul>
</td></tr>
<tr>
<td>25
</td>
<td><a href="../PartDesign_AdditiveLoft.html" title="PartDesign AdditiveLoft">PartDesign AdditiveLoft</a> and <a href="../PartDesign_AdditivePipe.html" title="PartDesign AdditivePipe">PartDesign AdditivePipe</a> with a possibility to use an open profile as the first or last section
</td>
<td>
<ul><li>Different modeling approaches, e.g. involving <a href="../PartDesign_Pad.html" title="PartDesign Pad">PartDesign Pad</a></li></ul>
</td></tr>
<tr>
<td>26
</td>
<td>A tool to <a href="../Part_Sweep.html" title="Part Sweep">sweep</a> a circular profile of a given diameter along a selected path
</td>
<td>
<ul><li>Draw the circular profile manually</li></ul>
</td></tr>
<tr>
<td>27
</td>
<td>Optional local coordinate system display for <a href="../PartDesign_Plane.html" title="PartDesign Plane">datum planes</a>
</td>
<td>
<ul><li>Attach a <a href="../PartDesign_CoordinateSystem.html" title="PartDesign CoordinateSystem">datum coordinate system</a> to datum plane to see its local orientation</li></ul>
</td></tr></tbody></table>
<h2><span class="mw-headline" id="Workarounds_for_the_Draft_Workbench">Workarounds for the Draft Workbench</span></h2>
<table class="wikitable">

<tbody><tr>
<th width="2%">No.</th>
<th width="28%">Missing feature</th>
<th width="70%">Workarounds
</th></tr>
<tr>
<td>1
</td>
<td>Snap to apparent intersections of curved edges, perpendicular extensions, arc extensions, geometric centers and tangent points
</td>
<td>
<ul><li>Use the other available <a href="../Draft_Workbench.html#Draft_Snap_toolbar" title="Draft Workbench">Draft Snap tools</a> and a more manual approach with construction geometry</li>
<li>When working on the XY plane: create a (temporary) projection of the geometry with <a href="../Draft_Shape2DView.html" title="Draft Shape2DView">Draft Shape2DView</a></li></ul>
</td></tr>
<tr>
<td>2
</td>
<td>Keyboard shortcuts for <a href="../Draft_Workbench.html#Draft_Snap_toolbar" title="Draft Workbench">Draft Snap tools</a>
</td>
<td>
<ul><li>Snaps can be activated and deactivated using keyboard shortcuts but only when none of the input boxes in the task panel has the focus (so the user should click in an empty space of the task panel to be able to use shortcuts for snaps)</li></ul>
</td></tr>
<tr>
<td>3
</td>
<td>Automatically change the colors of objects back to 'normal' when removing them from the <a href="../Draft_ToggleConstructionMode.html" title="Draft ToggleConstructionMode">construction geometry group</a>
</td>
<td>
<ul><li>Move the objects to a <a href="../Draft_Layer.html" title="Draft Layer">layer</a> with the correct color settings</li>
<li>Change the colors manually</li></ul>
</td></tr>
<tr>
<td>4
</td>
<td>An option to quickly switch between the three main working planes and their projections at the selected point (for 3D drafting)
</td>
<td>
<ul><li>Set the <a href="../Draft_SelectPlane.html" title="Draft SelectPlane">Draft working plane</a> to Automatic, and then select any of the standard views: <a href="../Std_ViewFront.html" title="Std ViewFront">front view</a>, <a href="../Std_ViewTop.html" title="Std ViewTop">top view</a>, etc.</li>
<li>Use the <a href="../Draft_Constrain.html" title="Draft Constrain">Draft Constrain</a> feature - snaps to axes, not to planes</li>
<li>Use <a href="../Draft_WorkingPlaneProxy.html" title="Draft WorkingPlaneProxy">working plane proxies</a></li></ul>
</td></tr>
<tr>
<td>5
</td>
<td>AutoCAD-like command line input
</td>
<td>
<ul><li>Use FreeCAD's widgets or <a href="../Scripting_and_macros.html" title="Scripting and macros">Python scripting</a> for input</li></ul>
</td></tr>
<tr>
<td>6
</td>
<td><a href="../Draft_Hatch.html" title="Draft Hatch">Hatch</a> a region enclosed by wires
</td>
<td>
<ul><li>Create a face (a hatch can only be applied to objects with planar faces):
<ul><li>In case of a single closed wire: set its Make Face property to "true", and its Display Mode to "Wireframe"</li>
<li><a href="../Draft_Upgrade.html" title="Draft Upgrade">Upgrade</a> multiple wires two or three times until you have a face, or a single closed wire (see above)</li>
<li>If the wires must stay separate, but are connected end-to-end, create a <a href="../PartDesign_SubShapeBinder.html" title="PartDesign SubShapeBinder">SubShapeBinder</a> from them</li>
<li>Trace over the region with a closed wire (not parametric)</li></ul></li></ul>
</td></tr></tbody></table>
<p><span id="Workarounds_for_the_TechDraw_Workbench"></span>
</p>
<h2><span id=".D0.9E.D0.B1.D1.85.D0.BE.D0.B4.D0.BD.D1.8B.D0.B5_.D1.80.D0.B5.D1.88.D0.B5.D0.BD.D0.B8.D1.8F_.D0.B4.D0.BB.D1.8F_.D0.B2.D0.B5.D1.80.D1.81.D1.82.D0.B0.D0.BA.D0.B0_TechDraw"></span><span class="mw-headline" id="&#1054;&#1073;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077;_&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;_&#1076;&#1083;&#1103;_&#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072;_TechDraw">&#1054;&#1073;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; TechDraw</span></h2>
<table class="wikitable">

<tbody><tr>
<th width="2%">&#8470;</th>
<th width="28%">&#1053;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1102;&#1097;&#1072;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;</th>
<th width="70%">&#1055;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1077;&#1084;&#1086;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;
</th></tr>
<tr>
<td>1
</td>
<td>Broken out and rotated/removed section views
</td>
<td>
<ul><li>Use the <a href="../Part_SliceApart.html" title="Part SliceApart">Slice apart</a> tool to physically cut the model and then create its view</li></ul>
</td></tr>
<tr>
<td>2
</td>
<td>Auto diameter dimension on side views
</td>
<td>
<ul><li>Manually add the diameter symbol</li></ul>
</td></tr>
<tr>
<td>3
</td>
<td>Manually add geometry to generated views
</td>
<td>
<ul><li>Cosmetic line tools in <a href="../TechDraw_Workbench.html#Annotations" title="TechDraw Workbench">Annotations</a> and <a href="../TechDraw_Workbench.html#Extensions" title="TechDraw Workbench">Extensions</a>, limited</li>
<li>Create <a href="../TechDraw_View.html" title="TechDraw View">regular views</a> and <a href="../TechDraw_DraftView.html" title="TechDraw DraftView">Draft views</a> of sketches and <a href="../Draft_Workbench.html" title="Draft Workbench">Draft</a> objects</li></ul>
</td></tr>
<tr>
<td>4
</td>
<td>Shaded views in drawings
</td>
<td>
<ul><li>Place screenshots of the model on a white background on the TechDraw page</li></ul>
</td></tr>
<tr>
<td>5
</td>
<td>Ordinate dimensions
</td>
<td>
<ul><li>No known workaround</li></ul>
</td></tr>
<tr>
<td>6
</td>
<td>Exclude ribs from hatching
</td>
<td>
<ul><li>In some cases it might be sufficient to use the first workaround mentioned here and manually create a section with a custom cutting line</li></ul>
</td></tr>
<tr>
<td>7
</td>
<td>Export of TechDraw pages as PDF without making the text from the template (path text) unmarkable/unsearchable.
</td>
<td>
<ul><li>Export the page as SVG. Then convert the SVG to PDF by using e.g. <a rel="nofollow" class="external text" href="http://www.inkscape.org">Inkscape</a> or open the SVG in a web browser and then save or print as PDF.</li></ul>
<div class="mw-translate-fuzzy">
</div></td></tr></tbody></table>

<p>|-
| 9
| Modify regular and section views using sketching tools
|
</p>
<ul><li>Manually create and modify the views:
<ol><li>If a section view has to be modified, use the <a href="../Part_SectionCut.html" title="Part SectionCut">Part SectionCut</a> tool or boolean operations to cut the part in the same way as it would be done by the <a href="../TechDraw_SectionView.html" title="TechDraw SectionView">section view</a> tool</li>
<li>Use the <a href="../Draft_Shape2DView.html" title="Draft Shape2DView">Draft Shape2DView</a> tool to create a 2D line representation of the view or section view</li>
<li>Use the <a href="../Draft_Workbench.html#Drafting" title="Draft Workbench">Drafting</a> tools with proper <a href="../Draft_Workbench.html#Draft_Snap_toolbar" title="Draft Workbench">snaps</a> to modify the view</li>
<li>Use the <a href="../Draft_Draft2Sketch.html" title="Draft Draft2Sketch">Draft Draft2Sketch</a> tool to create a sketch out of the Draft objects</li>
<li>Use the <a href="../Sketcher_ValidateSketch.html" title="Sketcher ValidateSketch">Sketcher ValidateSketch</a> tool to make sure that the sketch has no missing coincidences, doubled lines and so on (those issues may impact the face selection in TechDraw)</li>
<li>Use the <a href="../TechDraw_View.html" title="TechDraw View">TechDraw View</a> tool to create a view of the sketch in TechDraw.</li></ol></li></ul>
<p>|-
| 10
| Auxiliary views
|
</p>
<ul><li>Create a <a href="../TechDraw_View.html" title="TechDraw View">standard view</a> from the correct direction. Workarounds for "View normal to a face" may help. Rotate and position the view as needed.</li></ul>
<p>|}
</p><p><span id="Workarounds_for_the_FEM_Workbench"></span>
</p>
<h2><span id=".D0.9E.D0.B1.D1.85.D0.BE.D0.B4.D0.BD.D1.8B.D0.B5_.D1.80.D0.B5.D1.88.D0.B5.D0.BD.D0.B8.D1.8F_.D0.B4.D0.BB.D1.8F_.D0.B2.D0.B5.D1.80.D1.81.D1.82.D0.B0.D0.BA.D0.B0_FEM_.28.D0.9C.D0.9A.D0.AD.29"></span><span class="mw-headline" id="&#1054;&#1073;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077;_&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;_&#1076;&#1083;&#1103;_&#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072;_FEM_(&#1052;&#1050;&#1069;)">&#1054;&#1073;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; FEM (&#1052;&#1050;&#1069;)</span></h2>
<table class="wikitable">

<tbody><tr>
<th width="2%">&#8470;</th>
<th width="28%">&#1053;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1102;&#1097;&#1072;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;</th>
<th width="70%">&#1055;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1077;&#1084;&#1086;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;
</th></tr>
<tr>
<td>1
</td>
<td>Beams with arbitrary <a href="../FEM_ElementGeometry1D.html" title="FEM ElementGeometry1D">cross-section</a>
</td>
<td>
<ul><li>Manually edit the input file and modify the beam section definition</li></ul>
</td></tr>
<tr>
<td>2
</td>
<td>Distributed load on beams
</td>
<td>
<ul><li><a href="../FEM_ConstraintForce.html" title="FEM ConstraintForce">Force load</a></li></ul>
</td></tr>
<tr>
<td>3
</td>
<td>Support for multiple meshes and thus possibility to define <a href="../FEM_ConstraintContact.html" title="FEM ConstraintContact">contact</a> between touching (not separated) faces
</td>
<td>
<ul><li>Apply <a href="../Part_Fuse.html" title="Part Fuse">Part Fuse</a> or <a href="../Part_BooleanFragments.html" title="Part BooleanFragments">Part BooleanFragments</a> to assemblies and include small gaps if you want to use <a href="../FEM_ConstraintContact.html" title="FEM ConstraintContact">contact</a> or <a href="../FEM_ConstraintTie.html" title="FEM ConstraintTie">tie constraints</a></li></ul>
</td></tr>
<tr>
<td>4
</td>
<td>Advanced material models (hyperelasticity, creep and so on)
</td>
<td>
<ul><li>Manually edit the input file and add proper keywords for material definition</li></ul>
</td></tr>
<tr>
<td>5
</td>
<td>Composite shells
</td>
<td>
<ul><li>Manually edit the input file and modify the shell section definition</li></ul>
</td></tr>
<tr>
<td>6
</td>
<td>Simple creation of node and element sets as well as surfaces
</td>
<td>
<ul><li>Use node and element sets and surfaces created by other features (material assignments, boundary conditions and so on)</li></ul>
</td></tr>
<tr>
<td>7
</td>
<td>CalculiX keyword editor that can fold data lines and allow changes not only right before running the analysis
</td>
<td>
<ul><li>Simple editor that can open the .inp file before running the analysis, color the syntax and save changes (accessed using the <span style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.4em; padding: 0px 10px 1px 10px; font-weight:normal;">Edit .inp file</span> button in <a href="../FEM_SolverControl.html" title="FEM SolverControl">FEM SolverControl</a> window)</li></ul>
</td></tr>
<tr>
<td>8
</td>
<td>Meshing with hexahedral elements
</td>
<td>
<ul><li>Create the geometry in FreeCAD, export it for meshing in external software (e.g. <a rel="nofollow" class="external text" href="https://gmsh.info/">Gmsh</a> or <a rel="nofollow" class="external text" href="https://www.code-aster.org/V2/spip.php?article303">Salome_Meca</a>), import the mesh (e.g. in .inp or .unv format), drag it to the Analysis container and apply constraints to the geometry</li></ul>
</td></tr>
<tr>
<td>9
</td>
<td>Multistep analyses (e.g. preload for frequency/buckling analysis)
</td>
<td>
<ul><li>Prepare the analysis with the first step, write the .inp file, edit it to add definitions of subsequent steps and run the analysis</li></ul>
</td></tr>
<tr>
<td>10
</td>
<td><a href="../Std_BoxSelection.html" title="Std BoxSelection">Box selection</a> of geometric entities for constraints
</td>
<td>
<ul><li>Select geometric entities manually, one by one</li></ul>
</td></tr></tbody></table>
<p><span id="General_workarounds"></span>
</p>
<h2><span id=".D0.9E.D0.B1.D1.85.D0.BE.D0.B4.D0.BD.D1.8B.D0.B5_.D1.80.D0.B5.D1.88.D0.B5.D0.BD.D0.B8.D1.8F_.D0.B4.D0.BB.D1.8F_FreeCAD_.D0.B2_.D1.86.D0.B5.D0.BB.D0.BE.D0.BC"></span><span class="mw-headline" id="&#1054;&#1073;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077;_&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;_&#1076;&#1083;&#1103;_FreeCAD_&#1074;_&#1094;&#1077;&#1083;&#1086;&#1084;">&#1054;&#1073;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; FreeCAD &#1074; &#1094;&#1077;&#1083;&#1086;&#1084;</span></h2>
<table class="wikitable">

<tbody><tr>
<th width="2%">&#8470;</th>
<th width="28%">&#1053;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1102;&#1097;&#1072;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;</th>
<th width="70%">&#1055;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1077;&#1084;&#1086;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;
<div class="mw-translate-fuzzy">
</div></th></tr>
<tr>
<td>2
</td>
<td>&#1059;&#1083;&#1091;&#1095;&#1096;&#1077;&#1085;&#1085;&#1099;&#1081; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1081; &#1074;&#1080;&#1076;/&#1088;&#1077;&#1085;&#1076;&#1077;&#1088;&#1080;&#1085;&#1075; 3D-&#1084;&#1086;&#1076;&#1077;&#1083;&#1077;&#1081;
</td>
<td>
<ul><li><a rel="nofollow" class="external text" href="https://github.com/realthunder/FreeCAD_assembly3/releases">&#1074;&#1077;&#1090;&#1082;&#1072; &#1087;&#1086; &#1076;&#1072;&#1085;&#1085;&#1086;&#1081; &#1090;&#1077;&#1084;&#1077;</a></li></ul>

</td></tr>
<tr>
<td>2
</td>
<td><a href="../Status_bar.html" title="Status bar">Status bar</a> instructions (&ldquo;Now pick this &hellip;&rdquo;) for many tools that would benefit from them (e.g. <a href="../Sketcher_Workbench.html#Sketcher_constraints" title="Sketcher Workbench">Sketcher constraints</a>), more informative tooltips
</td>
<td>
<ul><li><a href="../Main_Page.html" title="Main Page">Wiki documentation</a></li></ul>
</td></tr>
<tr>
<td>3
</td>
<td>Consistent selection order - some tools require the user to pick the geometric entity first while others allow selection after enabling the tool
</td>
<td>
<ul><li>No known workaround</li></ul>
</td></tr>
<tr>
<td>4
</td>
<td>More GUI customization options - pie menus, different icon styles and themes and so on
</td>
<td>
<ul><li>Various customization packages created by the community</li>
<li><a rel="nofollow" class="external text" href="https://github.com/realthunder/FreeCAD/releases">Link Branch</a></li></ul>
</td></tr>
<tr>
<td>5
</td>
<td>Advanced selection tools: selection by angle, inverting selection, selecting inside faces and so on
</td>
<td>
<ul><li>Manual selection</li></ul>
</td></tr>
<tr>
<td>6
</td>
<td><a href="../Assembly.html" title="Assembly">Assembly</a> workbench with an option to constrain parts to the origin and to <a href="../Datum.html" title="Datum">datums</a>
</td>
<td>
<ul><li>No known workaround</li></ul>
</td></tr>
<tr>
<td>7
</td>
<td><a href="../Std_TransformManip.html" title="Std TransformManip">Transform</a> tool with an option to move and rotate with respect to edges and global coordinates
</td>
<td>
<ul><li>Add-on <a href="../Manipulator_Workbench.html" title="Manipulator Workbench">Manipulator Workbench</a></li></ul>
<div class="mw-translate-fuzzy">
</div></td></tr>
<tr>
<td>9
</td>
<td>&#1041;&#1086;&#1083;&#1100;&#1096;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081; &#1076;&#1083;&#1103; &#1090;&#1077;&#1082;&#1089;&#1090;&#1091;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;
</td>
<td>
<ul><li>&#1056;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;&#1086;</li></ul>

</td></tr>
<tr>
<td>9
</td>
<td>Highlight only the individual PartDesign feature in the <a href="../3D_view.html" title="3D view">3D view</a> when the corresponding operation is selected in the <a href="../Tree_view.html" title="Tree view">Tree view</a>
</td>
<td>
<ul><li>No known workaround</li></ul>
</td></tr>
<tr>
<td>10
</td>
<td>Select only the individual PartDesign feature in the <a href="../Tree_view.html" title="Tree view">Tree view</a> when a corresponding element is selected in the <a href="../3D_view.html" title="3D view">3D view</a>.
</td>
<td>
<ul><li>No known workaround</li></ul>
</td></tr>
<tr>
<td>11
</td>
<td>Freeform modeling
</td>
<td>
<ul><li>Model complex shapes in a "traditional" way - e.g. using add-on <a href="../Curves_Workbench.html" title="Curves Workbench">Curves</a> and <a href="../CurvedShapes_Workbench.html" title="CurvedShapes Workbench">CurvedShapes</a> workbenches</li>
<li>Sculpt meshes, for example in <a rel="nofollow" class="external text" href="https://www.blender.org/">Blender</a>, and import them into FreeCAD</li></ul>
</td></tr>
<tr>
<td>12
</td>
<td>Assembly component generators and calculators for: bolted and riveted connections, shafts, splines, keys, cams, gears (spur, bevel, worm), bearings, springs, belts and chains, pins, o-rings
</td>
<td>
<ul><li><a href="../Fasteners_Workbench.html" title="Fasteners Workbench">Fasteners Workbench</a> and <a href="../FCGear_Workbench.html" title="FCGear Workbench">FCGear Workbench</a> but no design calculations available</li>
<li><a href="../PartDesign_WizardShaft.html" title="PartDesign WizardShaft">PartDesign WizardShaft</a> - basic calculations for shafts</li></ul>
</td></tr>
<tr>
<td>13
</td>
<td>A tool for kinematic analysis on properly constrained sketches
</td>
<td>
<ul><li><a href="../Scripting_and_macros.html" title="Scripting and macros">Python scripting</a> - <a rel="nofollow" class="external text" href="https://forum.freecadweb.org/viewtopic.php?f=8&amp;t=68826&amp;start=10#p596531">example</a></li></ul>
</td></tr>
<tr>
<td>14
</td>
<td><a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Geometric_dimensioning_and_tolerancing">GD&amp;T</a> directly on 3D models - <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Model-based_definition">MBD</a> approach
</td>
<td>
<ul><li><a href="../Draft_Workbench.html#Annotation" title="Draft Workbench">Draft Annotation</a> tools</li></ul>
</td></tr></tbody></table>
<!-- 
NewPP limit report
Cached time: 20250620085310
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc, no&#8208;toc&#8208;conversion]
CPU time usage: 0.098 seconds
Real time usage: 0.176 seconds
Preprocessor visited node count: 189/1000000
Post&#8208;expand include size: 404/2097152 bytes
Template argument size: 81/2097152 bytes
Highest expansion depth: 4/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1418/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   13.907      1 -total
 36.65%    5.097      1 Template:Incode
 35.71%    4.966      1 Template:Button
 24.52%    3.410      1 Template:True
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:294801-0!canonical and timestamp 20250620085309 and revision id 1594154. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>