<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Workarounds/ru</span></h1><?xml encoding="UTF-8"><div class="mw-parser-output"><div class="mw-pt-languages noprint" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../de/Workarounds.html" class="mw-pt-progress mw-pt-progress--stub" title="Fehlerumgehung (17% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Workarounds.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Workarounds (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../fr/Workarounds.html" class="mw-pt-progress mw-pt-progress--complete" title="Solutions de contournement (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../pl/Workarounds.html" class="mw-pt-progress mw-pt-progress--complete" title="Obej&#347;cia ogranicze&#324; (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt-br/Workarounds.html" class="mw-pt-progress mw-pt-progress--stub" title="Solu&ccedil;&otilde;es alternativas (8% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</span></li>
<li><a href="../ja/Workarounds.html" class="mw-pt-progress mw-pt-progress--stub" title="&#22238;&#36991;&#31574; (1% translated)" lang="ja" dir="ltr">&#26085;&#26412;&#35486;</a></li>
<li><a href="../ko/Workarounds.html" class="mw-pt-progress mw-pt-progress--low" title="&#54644;&#44208; &#48169;&#48277; &#47784;&#51020; (26% translated)" lang="ko" dir="ltr">&#54620;&#44397;&#50612;</a></li></ul></div>
<p><span id="Introduction"></span>
</p>
<meta property="mw:PageProp/toc">
<h2><span id=".D0.92.D0.B2.D0.B5.D0.B4.D0.B5.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;">&#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;</span></h2>
<p>&#1062;&#1077;&#1083;&#1100; &#1076;&#1072;&#1085;&#1085;&#1086;&#1081; &#1089;&#1090;&#1072;&#1090;&#1100;&#1080; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1080;&#1090;&#1100; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1074; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1077;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1074; FreeCAD &#1080; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1086;&#1073;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077; &#1087;&#1091;&#1090;&#1080; &#1076;&#1083;&#1103; &#1080;&#1093; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;. &#1069;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086; &#1076;&#1083;&#1103; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1102;&#1097;&#1080;&#1093; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1085;&#1072;&#1081;&#1090;&#1080; &#1090;&#1088;&#1077;&#1073;&#1091;&#1102;&#1097;&#1080;&#1077;&#1089;&#1103; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;, &#1089;&#1088;&#1077;&#1076;&#1080; &#1090;&#1077;&#1093; &#1095;&#1090;&#1086; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1074; FreeCAD.
</p><p><span id="Workarounds_for_the_Sketcher_Workbench"></span>
</p>
<h2><span id=".D0.9E.D0.B1.D1.85.D0.BE.D0.B4.D0.BD.D1.8B.D0.B5_.D1.80.D0.B5.D1.88.D0.B5.D0.BD.D0.B8.D1.8F_.D0.B4.D0.BB.D1.8F_.D0.B2.D0.B5.D1.80.D1.81.D1.82.D0.B0.D0.BA.D0.B0_Sketcher"></span><span class="mw-headline" id="&#1054;&#1073;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077;_&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;_&#1076;&#1083;&#1103;_&#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072;_Sketcher">&#1054;&#1073;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; Sketcher</span></h2>
<table class="wikitable">

<tbody><tr>
<th width="2%">&#8470;</th>
<th width="28%">&#1053;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1102;&#1097;&#1072;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;</th>
<th width="70%">&#1055;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1077;&#1084;&#1086;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;
</th></tr>
<tr>
<td>1
</td>
<td>&#1040;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1072; &#1082; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084; (&#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084; &#1094;&#1077;&#1085;&#1090;&#1088;&#1072;&#1084;, &#1082;&#1074;&#1072;&#1076;&#1088;&#1072;&#1085;&#1090;&#1072;&#1084;, &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084;, &#1087;&#1077;&#1088;&#1077;&#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084;)
</td>
<td>
<ul><li>&#1056;&#1091;&#1095;&#1085;&#1086;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; <a href="../ru/Sketcher_Workbench.html#Sketcher_constraints" title="Sketcher Workbench/ru">&#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1081;</a> &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; <a href="../ru/Sketcher_ToggleConstruction.html" title="Sketcher ToggleConstruction/ru">&#1074;&#1089;&#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1083;&#1080;&#1085;&#1080;&#1081;</a></li>
<li>&#1063;&#1077;&#1088;&#1090;&#1080;&#1090;&#1077; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1102; &#1074; <a href="../ru/Draft_Workbench.html" title="Draft Workbench/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1077; &#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; (Draft)</a>, &#1075;&#1076;&#1077; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1072; &#1082; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084;, &#1079;&#1072;&#1090;&#1077;&#1084; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1091;&#1081;&#1090;&#1077; &#1074; &#1101;&#1089;&#1082;&#1080;&#1079; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; <a href="../ru/Draft_Draft2Sketch.html" title="Draft Draft2Sketch/ru">&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; &#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082;&#1042;&#1069;&#1089;&#1082;&#1080;&#1079; (Draft2Sketch)</a>.</li></ul>
</td></tr>
<tr>
<td>2
</td>
<td>&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1072; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1080; &#1084;&#1072;&#1089;&#1089;&#1086;&#1074;&#1099;&#1093; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; (&#1087;&#1083;&#1086;&#1097;&#1072;&#1076;&#1100;, &#1094;&#1077;&#1085;&#1090;&#1088; &#1084;&#1072;&#1089;&#1089;, &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1085;&#1099;&#1077; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;&#1072; &#1087;&#1083;&#1086;&#1097;&#1072;&#1076;&#1080; &#1080; &#1090;.&#1076;.)
</td>
<td>
<ul><li>&#1057;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1075;&#1088;&#1072;&#1085;&#1100; &#1080;&#1079; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <a href="../ru/Part_MakeFace.html" title="Part MakeFace/ru">&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100;&#1043;&#1088;&#1072;&#1085;&#1100; (MakeFace)</a>, &#1079;&#1072;&#1090;&#1077;&#1084; &#1087;&#1088;&#1086;&#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; &#1101;&#1090;&#1091; &#1075;&#1088;&#1072;&#1085;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <a href="../ru/Part_CheckGeometry.html" title="Part CheckGeometry/ru">&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100;&#1043;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1102; (CheckGeometry)</a>.</li></ul>
</td></tr>
<tr>
<td>3
</td>
<td>&#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1099; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; <a href="../ru/Sketcher_External.html" title="Sketcher External/ru">&#1042;&#1085;&#1077;&#1096;&#1085;&#1103;&#1103; &#1043;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1103;</a> &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1076;&#1083;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081; &#1085;&#1072;&#1076; &#1101;&#1089;&#1082;&#1080;&#1079;&#1086;&#1084;
</td>
<td>
<ul><li>&#1042;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102; &#1086;&#1073;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1102;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1091;&#1102; &#1101;&#1090;&#1080;&#1084; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084;.</li>
<li><a rel="nofollow" class="external text" href="https://github.com/realthunder/FreeCAD/releases">&#1057;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1042;&#1077;&#1090;&#1082;&#1091;</a> - &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1047;&#1072;&#1076;&#1072;&#1085;&#1080;&#1077; &#1043;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080;</li></ul>
</td></tr>
<tr>
<td>4
</td>
<td>&#1055;&#1088;&#1086;&#1077;&#1094;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1088;&#1105;&#1073;&#1077;&#1088; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; <a href="../ru/Sketcher_External.html" title="Sketcher External/ru">&#1042;&#1085;&#1077;&#1096;&#1085;&#1103;&#1103; &#1043;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1103;</a>, &#1082;&#1086;&#1075;&#1076;&#1072; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1072; &#1075;&#1088;&#1072;&#1085;&#1100;
</td>
<td>
<ul><li>&#1055;&#1088;&#1086;&#1077;&#1094;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1088;&#1077;&#1073;&#1088;&#1072; &#1080;&#1085;&#1076;&#1080;&#1074;&#1080;&#1076;&#1091;&#1072;&#1083;&#1100;&#1085;&#1086;</li></ul>
</td></tr>
<tr>
<td>5
</td>
<td>3D &#1069;&#1089;&#1082;&#1080;&#1079;&#1099;
</td>
<td>
<ul><li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; <a href="../ru/Draft_Workbench.html" title="Draft Workbench/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; &#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; (Draft)</a>, &#1085;&#1086; 3D-&#1095;&#1077;&#1088;&#1090;&#1077;&#1078;&#1080; &#1085;&#1077;&#1083;&#1100;&#1079;&#1103; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; &#1101;&#1089;&#1082;&#1080;&#1079;&#1099; (&#1086;&#1076;&#1085;&#1072;&#1082;&#1086; &#1080;&#1093; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1085;&#1086;&#1075;&#1086; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1072;, &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1086;&#1075;&#1086; <a href="../ru/FEM_Workbench.html" title="FEM Workbench/ru">&#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1084; &#1052;&#1050;&#1069;</a> &#1080;&#1083;&#1080; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1084;, &#1072; &#1090;&#1072;&#1082; &#1078;&#1077; &#1076;&#1083;&#1103; &#1090;&#1088;&#1072;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; <a href="../ru/PartDesign_AdditivePipe.html" title="PartDesign AdditivePipe/ru">&#1055;&#1088;&#1086;&#1077;&#1082;&#1090;&#1085;&#1086;&#1081;&#1044;&#1077;&#1090;&#1072;&#1083;&#1080; &#1058;&#1088;&#1091;&#1073;&#1072;&#1042;&#1099;&#1076;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; (PartDesign AdditivePipe)</a> &#1080;&#1083;&#1080; <a href="../ru/Part_Sweep.html" title="Part Sweep/ru">&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1087;&#1086; &#1058;&#1088;&#1072;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1080; (Part Sweep)</a>).</li></ul>
</td></tr>
<tr>
<td>6
</td>
<td>&#1055;&#1088;&#1086;&#1077;&#1082;&#1094;&#1080;&#1103; &#1089;&#1077;&#1082;&#1091;&#1097;&#1080;&#1093; &#1082;&#1088;&#1086;&#1084;&#1086;&#1082; &#1087;&#1088;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1080; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; &#1085;&#1072; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1100;, &#1087;&#1088;&#1086;&#1093;&#1086;&#1076;&#1103;&#1097;&#1091;&#1102; &#1095;&#1077;&#1088;&#1077;&#1079; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;
</td>
<td>
<ul><li>&#1057;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; <a href="../ru/Std_LinkMake.html" title="Std LinkMake/ru">&#1057;&#1089;&#1099;&#1083;&#1082;&#1091; (Link)</a> &#1080;&#1079; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1080; <a href="../ru/Part_SliceApart.html" title="Part SliceApart/ru">&#1088;&#1072;&#1079;&#1089;&#1077;&#1082;&#1080;&#1090;&#1077;</a> &#1101;&#1090;&#1086;&#1090; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1092;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1088;&#1077;&#1078;&#1091;&#1097;&#1080;&#1077; &#1082;&#1088;&#1086;&#1084;&#1082;&#1080;.</li></ul>
</td></tr>
<tr>
<td>7
</td>
<td>&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; <a href="../ru/Sketcher_ViewSection.html" title="Sketcher ViewSection/ru">&#1055;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;</a>, &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081; &#1079;&#1072;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1085;&#1099;&#1077; &#1089;&#1088;&#1077;&#1079;&#1099;
</td>
<td>
<ul><li>&#1045;&#1089;&#1083;&#1080; &#1101;&#1089;&#1082;&#1080;&#1079; &#1087;&#1072;&#1088;&#1072;&#1083;&#1083;&#1077;&#1083;&#1077;&#1085; &#1086;&#1076;&#1085;&#1086;&#1081; &#1080;&#1079; &#1075;&#1083;&#1072;&#1074;&#1085;&#1099;&#1093; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1077;&#1081; &#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;: &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; <a href="../ru/Part_SectionCut.html" title="Part SectionCut/ru">&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1057;&#1077;&#1082;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1081; &#1088;&#1072;&#1079;&#1088;&#1077;&#1079;</a>.</li></ul>
</td></tr>
<tr>
<td>8
</td>
<td>&#1056;&#1072;&#1079;&#1084;&#1077;&#1088; &#1076;&#1080;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1086;&#1089;&#1080; &#1089;&#1080;&#1084;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080; &#1076;&#1083;&#1103; &#1076;&#1077;&#1090;&#1072;&#1083;&#1077;&#1081; &#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103;
</td>
<td>
<ul><li>&#1042;&#1084;&#1077;&#1089;&#1090;&#1086; &#1101;&#1090;&#1086;&#1075;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1088;&#1072;&#1076;&#1080;&#1091;&#1089;&#1072; (&#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1074;&#1077;&#1089;&#1090;&#1080; &#1076;&#1080;&#1072;&#1084;&#1077;&#1090;&#1088;, &#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1099;&#1081; &#1085;&#1072; 2 - &#1088;&#1072;&#1089;&#1095;&#1105;&#1090; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1105;&#1085; FreeCAD &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;).</li></ul>
</td></tr>
<tr>
<td>9
</td>
<td>&#1056;&#1072;&#1079;&#1084;&#1077;&#1088;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1082;&#1080;, &#1072;&#1076;&#1072;&#1087;&#1090;&#1080;&#1088;&#1091;&#1102;&#1097;&#1080;&#1077;&#1089;&#1103; &#1082; &#1087;&#1086;&#1074;&#1086;&#1088;&#1086;&#1090;&#1091; &#1074;&#1080;&#1076;&#1072;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1093; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086; &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100;
</td>
<td>
<ul><li>&#1055;&#1086;&#1074;&#1086;&#1088;&#1072;&#1095;&#1080;&#1074;&#1072;&#1081;&#1090;&#1077; &#1074;&#1080;&#1076; &#1087;&#1088;&#1080; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080;</li></ul>
</td></tr>
<tr>
<td>10
</td>
<td>&#1055;&#1077;&#1088;&#1074;&#1099;&#1081; <a href="../ru/Sketcher_Workbench.html#Dimensional_constraints" title="Sketcher Workbench/ru">&#1088;&#1072;&#1079;&#1084;&#1077;&#1088;</a> &#1074; &#1101;&#1089;&#1082;&#1080;&#1079;&#1077;, &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1091;&#1077;&#1090; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1102; &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1077;&#1105; &#1087;&#1077;&#1088;&#1074;&#1086;&#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086; &#1085;&#1072;&#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1085;&#1072;&#1103; &#1092;&#1086;&#1088;&#1084;&#1072; &#1085;&#1077; &#1073;&#1099;&#1083;&#1072; &#1085;&#1072;&#1088;&#1091;&#1096;&#1077;&#1085;&#1072;
</td>
<td>
<ul><li>&#1055;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; <a href="../ru/Sketcher_Workbench.html#Dimensional_constraints" title="Sketcher Workbench/ru">&#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1085;&#1099;&#1093; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1081;</a> &#1087;&#1077;&#1088;&#1077;&#1076; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1077;&#1084; &#1074;&#1089;&#1077;&#1081; &#1092;&#1080;&#1075;&#1091;&#1088;&#1099;.</li></ul>
</td></tr>
<tr>
<td>11
</td>
<td>&#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1082;&#1088;&#1099;&#1090;&#1100; &#1074;&#1089;&#1102; <a href="../ru/Sketcher_ToggleConstruction.html" title="Sketcher ToggleConstruction/ru"> &#1074;&#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1091;&#1102; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1102;</a> &#1074; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1101;&#1089;&#1082;&#1080;&#1079;&#1077;
</td>
<td>
<ul><li>&#1042; &#1086;&#1082;&#1085;&#1077; "&#1069;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099;" &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088; "&#1042;&#1089;&#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103;", &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1074; &#1085;&#1105;&#1084; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; <a href="../ru/Sketcher_ToggleConstruction.html" title="Sketcher ToggleConstruction/ru">&#1074;&#1089;&#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080;</a> &#1080; &#1089;&#1085;&#1080;&#1084;&#1080;&#1090;&#1077; &#1089; &#1085;&#1080;&#1093; &#1092;&#1083;&#1072;&#1078;&#1082;&#1080;.</li></ul>
</td></tr></tbody></table>
<p><span id="Workarounds_for_the_Part_Workbench_and_Part_Design_Workbench"></span>
</p>
<h2><span id=".D0.9E.D0.B1.D1.85.D0.BE.D0.B4.D0.BD.D1.8B.D0.B5_.D1.80.D0.B5.D1.88.D0.B5.D0.BD.D0.B8.D1.8F_.D0.B4.D0.BB.D1.8F_.D0.B2.D0.B5.D1.80.D1.81.D1.82.D0.B0.D0.BA.D0.BE.D0.B2_.D0.94.D0.B5.D1.82.D0.B0.D0.BB.D1.8C_.28Part.29_.D0.B8_.D0.9F.D1.80.D0.BE.D0.B5.D0.BA.D1.82.D0.BD.D0.B0.D1.8F_.D0.94.D0.B5.D1.82.D0.B0.D0.BB.D1.8C_.28Part_Design.29"></span><span class="mw-headline" id="&#1054;&#1073;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077;_&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;_&#1076;&#1083;&#1103;_&#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1086;&#1074;_&#1044;&#1077;&#1090;&#1072;&#1083;&#1100;_(Part)_&#1080;_&#1055;&#1088;&#1086;&#1077;&#1082;&#1090;&#1085;&#1072;&#1103;_&#1044;&#1077;&#1090;&#1072;&#1083;&#1100;_(Part_Design)">&#1054;&#1073;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1086;&#1074; &#1044;&#1077;&#1090;&#1072;&#1083;&#1100; (Part) &#1080; &#1055;&#1088;&#1086;&#1077;&#1082;&#1090;&#1085;&#1072;&#1103; &#1044;&#1077;&#1090;&#1072;&#1083;&#1100; (Part Design)</span></h2>
<table class="wikitable">

<tbody><tr>
<th width="2%">&#8470;</th>
<th width="28%">&#1053;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1102;&#1097;&#1072;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;</th>
<th width="70%">&#1055;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1077;&#1084;&#1086;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;
</th></tr>
<tr>
<td>1
</td>
<td>&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1080; &#1084;&#1072;&#1089;&#1089;&#1086;&#1075;&#1072;&#1073;&#1072;&#1088;&#1080;&#1090;&#1085;&#1099;&#1077; &#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1080;&#1089;&#1090;&#1080;&#1082;&#1080; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;
</td>
<td>
<ul><li><a href="../ru/Macro_FCInfo.html" title="Macro FCInfo/ru">FCInfo &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;</a></li>
<li><a href="../ru/Part_CheckGeometry.html" title="Part CheckGeometry/ru">Part CheckGeometry</a> &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1080; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080; - &#1087;&#1083;&#1086;&#1097;&#1072;&#1076;&#1100;, &#1086;&#1073;&#1098;&#1105;&#1084;, &#1084;&#1072;&#1089;&#1089;&#1072;, &#1076;&#1083;&#1080;&#1085;&#1072;, &#1094;&#1077;&#1085;&#1090;&#1088; &#1084;&#1072;&#1089;&#1089;, &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;&#1099; &#1080;&#1085;&#1077;&#1088;&#1094;&#1080;&#1080;, &#1088;&#1072;&#1076;&#1080;&#1091;&#1089; &#1075;&#1080;&#1088;&#1072;&#1094;&#1080;&#1080;</li></ul>
</td></tr>
<tr>
<td>2
</td>
<td>&#1054;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1094;&#1077;&#1085;&#1090;&#1088;&#1072; &#1084;&#1072;&#1089;&#1089; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; (&#1076;&#1077;&#1090;&#1072;&#1083;&#1080; &#1080;&#1083;&#1080; &#1089;&#1073;&#1086;&#1088;&#1086;&#1095;&#1085;&#1099;&#1093; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;)
</td>
<td>
<ul><li><a href="../ru/Macro_CenterOfMass.html" title="Macro CenterOfMass/ru">&#1052;&#1072;&#1082;&#1088;&#1086;&#1089; CenterOfMass</a></li></ul>
</td></tr>
<tr>
<td>3
</td>
<td><a href="../ru/Std_ToggleClipPlane.html" title="Std ToggleClipPlane/ru">&#1055;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1100; &#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;</a> &#1085;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1105;&#1090; &#1074;&#1087;&#1077;&#1095;&#1072;&#1090;&#1083;&#1077;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100; &#1087;&#1086;&#1083;&#1072;&#1103;
</td>
<td>
<ul><li>&#1048;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; &#1054;&#1089;&#1074;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; (Lighting) &#1074; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072;&#1093; &#1074;&#1080;&#1076;&#1072; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080; &#1085;&#1072; "One side - &#1054;&#1076;&#1085;&#1072; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1072;" (&#1086;&#1095;&#1077;&#1085;&#1100; &#1075;&#1088;&#1091;&#1073;&#1099;&#1081; &#1101;&#1082;&#1074;&#1080;&#1074;&#1072;&#1083;&#1077;&#1085;&#1090;, &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1089; &#1084;&#1085;&#1086;&#1075;&#1086;&#1094;&#1074;&#1077;&#1090;&#1085;&#1099;&#1084;&#1080; &#1076;&#1077;&#1090;&#1072;&#1083;&#1103;&#1084;&#1080;)</li>
<li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; <a href="../ru/Part_SectionCut.html" title="Part SectionCut/ru">&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1057;&#1077;&#1082;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1081; &#1088;&#1072;&#1079;&#1088;&#1077;&#1079;</a> - &#1086;&#1090;&#1084;&#1077;&#1085;&#1080;&#1074; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074;&#1089;&#1077;&#1093; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1077;&#1081; &#1087;&#1077;&#1088;&#1077;&#1076; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077;&#1084; &#1047;&#1072;&#1082;&#1088;&#1099;&#1090;&#1100; (Close)</li>
<li><a rel="nofollow" class="external text" href="https://github.com/realthunder/FreeCAD/releases">&#1057;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1074;&#1077;&#1090;&#1082;&#1091;</a> - &#1101;&#1082;&#1089;&#1087;&#1077;&#1088;&#1080;&#1084;&#1077;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1088;&#1077;&#1085;&#1076;&#1077;&#1088;</li></ul>
</td></tr>
<tr>
<td>4
</td>
<td>&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1086;&#1089;&#1080; &#1085;&#1072; &#1087;&#1077;&#1088;&#1077;&#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1080; 2-&#1093; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1077;&#1081; &#1080; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080; &#1087;&#1086;&#1089;&#1077;&#1088;&#1077;&#1076;&#1080;&#1085;&#1077; &#1084;&#1077;&#1078;&#1076;&#1091; &#1076;&#1074;&#1091;&#1084;&#1103; &#1075;&#1088;&#1072;&#1085;&#1103;&#1084;&#1080;/&#1090;&#1086;&#1095;&#1082;&#1072;&#1084;&#1080;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1086;&#1074; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; <a href="../ru/Datum.html" title="Datum/ru">&#1086;&#1087;&#1086;&#1088;&#1085;&#1099;&#1093; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;</a>.
</td>
<td>
<ul><li><a href="../ru/Macro_Intersection.html" title="Macro Intersection/ru">&#1052;&#1072;&#1082;&#1088;&#1086;&#1089; &#1055;&#1077;&#1088;&#1077;&#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;</a></li>
<li>&#1056;&#1091;&#1095;&#1085;&#1072;&#1103; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1080; <a href="../ru/Datum.html" title="Datum/ru">&#1086;&#1087;&#1086;&#1088;&#1085;&#1099;&#1093; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;</a>.</li></ul>
</td></tr>
<tr>
<td>5
</td>
<td>&#1040;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089;&#1088;&#1077;&#1076;&#1085;&#1077;&#1081; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080; (&#1076;&#1083;&#1103; &#1090;&#1086;&#1085;&#1082;&#1086;&#1089;&#1090;&#1077;&#1085;&#1085;&#1099;&#1093; &#1076;&#1077;&#1090;&#1072;&#1083;&#1077;&#1081;)
</td>
<td>
<ul><li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; <a href="../ru/Draft_Facebinder.html" title="Draft Facebinder/ru">&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; &#1057;&#1096;&#1080;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; &#1043;&#1088;&#1072;&#1085;&#1077;&#1081; (Facebinder)</a>, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; <a href="../ru/Draft_Scale.html" title="Draft Scale/ru">&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; &#1052;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073; (Scale)</a> &#1080;&#1083;&#1080; <a href="../ru/Part_Offset.html" title="Part Offset/ru">&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1057;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; 3D (Offset)</a> (&#1087;&#1088;&#1086;&#1097;&#1077;), &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1089;&#1088;&#1077;&#1076;&#1085;&#1102;&#1102; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1100;, &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1086;&#1073;&#1093;&#1086;&#1076;&#1085;&#1086;&#1081; &#1087;&#1091;&#1090;&#1100; &#1076;&#1083;&#1103; &#1088;&#1072;&#1089;&#1090;&#1103;&#1075;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1075;&#1088;&#1072;&#1085;&#1077;&#1081;, &#1077;&#1089;&#1083;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089;&#1088;&#1077;&#1076;&#1085;&#1080;&#1077; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1080; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1099;, &#1080; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1080;&#1090;&#1077; &#1080;&#1093; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1073;&#1091;&#1083;&#1077;&#1074;&#1099;&#1093; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;</li></ul>
</td></tr>
<tr>
<td>6
</td>
<td>&#1055;&#1088;&#1086;&#1077;&#1094;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; (&#1082;&#1072;&#1088;&#1090;&#1099;/&#1086;&#1073;&#1105;&#1088;&#1090;&#1082;&#1080;) &#1101;&#1089;&#1082;&#1080;&#1079;&#1086;&#1074; &#1085;&#1072; &#1085;&#1077;&#1087;&#1083;&#1072;&#1085;&#1072;&#1088;&#1085;&#1099;&#1077; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1094;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077;) &#1075;&#1088;&#1072;&#1085;&#1080;
</td>
<td>
<ul><li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; <a href="../ru/Curves_SketchOnSurface.html" title="Curves SketchOnSurface/ru">&#1050;&#1088;&#1080;&#1074;&#1099;&#1077; &#1069;&#1089;&#1082;&#1080;&#1079;&#1053;&#1072;&#1055;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1080; (Curves SketchOnSurface)</a> &#1074; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1084; <a href="../ru/Curves_Workbench.html" title="Curves Workbench/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1077; &#1050;&#1088;&#1080;&#1074;&#1099;&#1077; (Curves)</a>.</li>
<li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; <a href="../ru/Part_ProjectionOnSurface.html" title="Part ProjectionOnSurface/ru">&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1055;&#1088;&#1086;&#1077;&#1082;&#1094;&#1080;&#1103;&#1053;&#1072;&#1055;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1100; (Part ProjectionOnSurface)</a></li></ul>
</td></tr>
<tr>
<td>7
</td>
<td>&#1042;&#1099;&#1073;&#1086;&#1088; &#1095;&#1072;&#1089;&#1090;&#1080; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; &#1076;&#1083;&#1103; <a href="../ru/PartDesign_Pad.html" title="PartDesign Pad/ru">&#1074;&#1099;&#1076;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103;</a>.
</td>
<td>
<ul><li>&#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1086;&#1076;&#1085;&#1091; &#1079;&#1072; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1074;&#1089;&#1077; &#1088;&#1105;&#1073;&#1088;&#1072;, &#1086;&#1073;&#1088;&#1072;&#1079;&#1091;&#1102;&#1097;&#1080;&#1077; &#1079;&#1072;&#1084;&#1082;&#1085;&#1091;&#1090;&#1099;&#1081; &#1082;&#1086;&#1085;&#1090;&#1091;&#1088;, &#1076;&#1083;&#1103; &#1074;&#1099;&#1076;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103;.</li>
<li>&#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1088;&#1105;&#1073;&#1088;&#1072; &#1080;&#1079; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; &#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; <a href="../ru/Std_LinkMakeRelative.html" title="Std LinkMakeRelative/ru">&#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1091;&#1102; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091;</a> &#1080;&#1083;&#1080; <a href="../ru/PartDesign_SubShapeBinder.html" title="PartDesign SubShapeBinder/ru">&#1087;&#1086;&#1076;-&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1085;&#1091;&#1102; &#1089;&#1074;&#1103;&#1079;&#1091;&#1102;&#1097;&#1091;&#1102; &#1092;&#1086;&#1088;&#1084;&#1091;</a> &#1080; &#1074;&#1099;&#1076;&#1072;&#1074;&#1080;&#1090;&#1077; &#1101;&#1090;&#1086;&#1090; &#1085;&#1086;&#1074;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;.</li>
<li><a href="../ru/PartDesign_Pad.html" title="PartDesign Pad/ru">&#1042;&#1099;&#1076;&#1072;&#1074;&#1080;&#1090;&#1077;</a> &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1101;&#1089;&#1082;&#1080;&#1079;, &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1081; &#1085;&#1072; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1081; &#1075;&#1088;&#1072;&#1085;&#1080; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1086;&#1087;&#1086;&#1083;&#1086;&#1078;&#1085;&#1086;&#1084; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080; (&#1082; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1081; &#1092;&#1086;&#1088;&#1084;&#1077;), &#1090;&#1072;&#1082; &#1095;&#1090;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1102;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1086;&#1074;&#1099;&#1077; &#1075;&#1088;&#1072;&#1085;&#1080;. &#1047;&#1072;&#1090;&#1077;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; &#1101;&#1090;&#1080; &#1075;&#1088;&#1072;&#1085;&#1080; &#1087;&#1086; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1080; &#1074;&#1099;&#1076;&#1072;&#1074;&#1080;&#1090;&#1100; &#1080;&#1093;. &#1069;&#1090;&#1086;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089; &#1086;&#1089;&#1090;&#1086;&#1088;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1083;&#1080;&#1096;&#1085;&#1080;&#1077; 3D-&#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1087;&#1088;&#1080;&#1074;&#1077;&#1089;&#1090;&#1080; &#1082; &#1085;&#1077;&#1087;&#1088;&#1077;&#1076;&#1074;&#1080;&#1076;&#1077;&#1085;&#1085;&#1099;&#1084; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1084;. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1090;&#1089;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1099;&#1096;&#1077;&#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1077; &#1086;&#1073;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077; &#1087;&#1091;&#1090;&#1080;.</li>
<li><a rel="nofollow" class="external text" href="https://github.com/realthunder/FreeCAD/releases">&#1057;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1074;&#1077;&#1090;&#1082;&#1091;</a> - &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1069;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1072; &#1054;&#1076;&#1080;&#1085;&#1086;&#1095;&#1085;&#1086;&#1081; &#1043;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080; &#1080; &#1069;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1072; &#1053;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1043;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1081; &#1080;&#1083;&#1080; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1091;&#1102; <a href="../ru/PartDesign_SubShapeBinder.html" title="PartDesign SubShapeBinder/ru">&#1055;&#1086;&#1076;&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1085;&#1091;&#1102; &#1060;&#1086;&#1088;&#1084;&#1091;</a>, &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1087;&#1088;&#1080; &#1074;&#1099;&#1073;&#1086;&#1088;&#1077; &#1080;&#1079; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; &#1088;&#1105;&#1073;&#1077;&#1088;, &#1086;&#1073;&#1088;&#1072;&#1079;&#1091;&#1102;&#1097;&#1080;&#1093; &#1079;&#1072;&#1084;&#1082;&#1085;&#1091;&#1090;&#1099;&#1081; &#1082;&#1086;&#1085;&#1090;&#1091;&#1088;, &#1087;&#1077;&#1088;&#1077;&#1076; <a href="../ru/PartDesign_Pad.html" title="PartDesign Pad/ru">&#1074;&#1099;&#1076;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084;</a>.</li></ul>
</td></tr>
<tr>
<td>8
</td>
<td><a href="../ru/PartDesign_Fillet.html" title="PartDesign Fillet/ru">&#1057;&#1082;&#1088;&#1091;&#1075;&#1083;&#1077;&#1085;&#1080;&#1103;</a> &#1080; <a href="../ru/PartDesign_Chamfer.html" title="PartDesign Chamfer/ru">&#1092;&#1072;&#1089;&#1082;&#1080;</a>, &#1079;&#1072;&#1093;&#1074;&#1072;&#1090;&#1099;&#1074;&#1072;&#1102;&#1090; &#1089;&#1084;&#1077;&#1078;&#1085;&#1099;&#1077; &#1075;&#1088;&#1072;&#1085;&#1080;/&#1088;&#1105;&#1073;&#1088;&#1072;.
</td>
<td>
<ul><li>&#1057;&#1076;&#1077;&#1083;&#1072;&#1081;&#1090;&#1077; <a href="../ru/PartDesign_Fillet.html" title="PartDesign Fillet/ru">&#1089;&#1082;&#1088;&#1091;&#1075;&#1083;&#1077;&#1085;&#1080;&#1077;</a> &#1089; &#1095;&#1091;&#1090;&#1100; &#1084;&#1077;&#1085;&#1100;&#1096;&#1080;&#1084; &#1088;&#1072;&#1076;&#1080;&#1091;&#1089;&#1086;&#1084; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, 6,4999 &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; 6,5 &#1084;&#1084;).</li>
<li>&#1052;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; &#1101;&#1090;&#1080; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; <a href="../ru/PartDesign_Pocket.html" title="PartDesign Pocket/ru">&#1055;&#1088;&#1086;&#1077;&#1082;&#1090;&#1085;&#1072;&#1103;&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1042;&#1099;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100;</a>, &#1080;&#1083;&#1080; &#1089;&#1088;&#1072;&#1079;&#1091; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1081;&#1090;&#1077; &#1080;&#1093; &#1074; &#1101;&#1089;&#1082;&#1080;&#1079;&#1099;.</li></ul>
</td></tr>
<tr>
<td>9
</td>
<td>&#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1081; &#1088;&#1072;&#1076;&#1080;&#1091;&#1089; &#1076;&#1083;&#1103; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; <a href="../ru/PartDesign_Fillet.html" title="PartDesign Fillet/ru">&#1055;&#1088;&#1086;&#1077;&#1082;&#1090;&#1085;&#1072;&#1103;&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1057;&#1082;&#1088;&#1091;&#1075;&#1083;&#1077;&#1085;&#1080;&#1077; (PartDesign Fillet)</a>.
</td>
<td>
<ul><li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; <a href="../ru/Part_Fillet.html" title="Part Fillet/ru">&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1057;&#1082;&#1088;&#1091;&#1075;&#1083;&#1077;&#1085;&#1080;&#1077; (Part Fillet)</a>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1081; &#1088;&#1072;&#1076;&#1080;&#1091;&#1089;.</li></ul>
</td></tr>
<tr>
<td>10
</td>
<td>&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1082;&#1088;&#1080;&#1074;&#1099;&#1077;
</td>
<td>
<ul><li><a href="../ru/Macro_3D_Parametric_Curve.html" title="Macro 3D Parametric Curve/ru">&#1052;&#1072;&#1082;&#1088;&#1086;&#1089; 3D &#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1050;&#1088;&#1080;&#1074;&#1072;&#1103;</a></li></ul>
</td></tr>
<tr>
<td>11
</td>
<td>&#1050;&#1086;&#1089;&#1084;&#1077;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1088;&#1077;&#1079;&#1100;&#1073;&#1099;
</td>
<td>
<ul><li>&#1044;&#1086;&#1073;&#1072;&#1074;&#1100;&#1090;&#1077; &#1082;&#1086;&#1089;&#1084;&#1077;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1088;&#1077;&#1079;&#1100;&#1073;&#1099; &#1085;&#1072; &#1083;&#1080;&#1089;&#1090;&#1077; <a href="../ru/TechDraw_Workbench.html#Centerlines_and_threading" title="TechDraw Workbench/ru">&#1058;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1063;&#1077;&#1088;&#1090;&#1077;&#1078;&#1072; (TechDraw)</a></li>
<li>&#1052;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1080;&#1077; &#1088;&#1077;&#1079;&#1100;&#1073;&#1099;, &#1076;&#1083;&#1103; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1099; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; <a href="../ru/PartDesign_Hole.html" title="PartDesign Hole/ru">&#1054;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1077;</a>.</li></ul>
</td></tr>
<tr>
<td>12
</td>
<td>&#1056;&#1072;&#1079;&#1073;&#1080;&#1074;&#1082;&#1072; (&#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081; &#1080; &#1086;&#1073;&#1098;&#1077;&#1084;&#1085;&#1099;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1101;&#1089;&#1082;&#1080;&#1079;&#1086;&#1074; &#1080; &#1086;&#1087;&#1086;&#1088;&#1085;&#1099;&#1093; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1077;&#1081; &#1087;&#1088;&#1080; &#1085;&#1077;&#1080;&#1079;&#1084;&#1077;&#1085;&#1085;&#1086;&#1084; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1095;&#1072;&#1089;&#1090;&#1077;&#1081;)
</td>
<td>
<ul><li>&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; <a href="../ru/Part_BooleanFragments.html" title="Part BooleanFragments/ru">&#1041;&#1091;&#1083;&#1077;&#1074;&#1086; &#1056;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077;</a> - &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1080; &#1089; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072;&#1084;&#1080;</li></ul>
</td></tr>
<tr>
<td>13
</td>
<td>&#1053;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1077; &#1076;&#1083;&#1103; <a href="../ru/PartDesign_AdditivePipe.html" title="PartDesign AdditivePipe/ru">&#1042;&#1099;&#1076;&#1072;&#1074;&#1080;&#1090;&#1100; &#1074;&#1076;&#1086;&#1083;&#1100; &#1090;&#1088;&#1072;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1080;</a> &#1080; <a href="../ru/PartDesign_AdditiveLoft.html" title="PartDesign AdditiveLoft/ru">&#1042;&#1099;&#1076;&#1072;&#1074;&#1080;&#1090;&#1100; &#1087;&#1086; &#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084;</a> &#1080;&#1083;&#1080; &#1080;&#1093; &#1101;&#1082;&#1074;&#1080;&#1074;&#1072;&#1083;&#1077;&#1085;&#1090;&#1099; &#1074; <a href="../ru/Part_Workbench.html" title="Part Workbench/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1077; &#1044;&#1077;&#1090;&#1072;&#1083;&#1100;</a>.
</td>
<td>
<ul><li>&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; <a href="../ru/CurvedShapes_Workbench.html" title="CurvedShapes Workbench/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; CurvedShapes</a> - <a href="../ru/CurvedShapes_CurvedArray.html" title="CurvedShapes CurvedArray/ru">CurvedArray</a> &#1080;&#1083;&#1080; <a href="../index.php?title=CurvedShapes_CurvedPathArray/ru&amp;action=edit&amp;redlink=1.html" class="new" title="CurvedShapes CurvedPathArray/ru (page does not exist)">CurvedPathArray</a></li>
<li>&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; <a href="../ru/Curves_Workbench.html" title="Curves Workbench/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; &#1050;&#1088;&#1080;&#1074;&#1099;&#1077; (Curves)</a> - <a href="../ru/Curves_GordonSurface.html" title="Curves GordonSurface/ru">GordonSurface</a> &#1080;&#1083;&#1080; <a href="../ru/Curves_Pipeshell.html" title="Curves Pipeshell/ru">Pipeshell</a></li>
<li><a href="../ru/Surface_Workbench.html" title="Surface Workbench/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; &#1055;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1100; (Surface)</a> - <a href="../ru/Surface_Filling.html" title="Surface Filling/ru">Filling</a></li></ul>
</td></tr>
<tr>
<td>14
</td>
<td>&#1047;&#1072;&#1082;&#1088;&#1091;&#1095;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; &#1076;&#1083;&#1103; <a href="../ru/PartDesign_AdditivePipe.html" title="PartDesign AdditivePipe/ru">&#1055;&#1088;&#1086;&#1077;&#1082;&#1090;&#1085;&#1072;&#1103;&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1055;&#1088;&#1086;&#1092;&#1080;&#1083;&#1100;&#1055;&#1086;&#1058;&#1088;&#1072;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1080; (PartDesign AdditivePipe)</a> &#1080;&#1083;&#1080; &#1076;&#1083;&#1103; <a href="../ru/Part_Sweep.html" title="Part Sweep/ru">&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1055;&#1088;&#1086;&#1092;&#1080;&#1083;&#1100;&#1055;&#1086;&#1058;&#1088;&#1072;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1080; (Part Sweep)</a>.
</td>
<td>
<ul><li><a href="../ru/PartDesign_AdditiveHelix.html" title="PartDesign AdditiveHelix/ru">&#1055;&#1088;&#1086;&#1077;&#1082;&#1090;&#1085;&#1072;&#1103;&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1057;&#1087;&#1080;&#1088;&#1072;&#1083;&#1100;&#1042;&#1099;&#1076;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; (PartDesign AdditiveHelix)</a> (<code>pitch = &#1074;&#1099;&#1089;&#1086;&#1090;&#1072; * 360 / &#1091;&#1075;&#1086;&#1083; &#1087;&#1086;&#1074;&#1086;&#1088;&#1086;&#1090;&#1072;</code>)</li>
<li>&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; <a href="../ru/CurvedShapes_Workbench.html" title="CurvedShapes Workbench/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; &#1050;&#1088;&#1080;&#1074;&#1099;&#1077;&#1055;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1080; (CurvedShapes)</a> - <a href="../ru/CurvedShapes_CurvedArray.html" title="CurvedShapes CurvedArray/ru">CurvedArray</a></li>
<li>&#1052;&#1085;&#1086;&#1075;&#1086;&#1089;&#1077;&#1082;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1081; &#1088;&#1077;&#1078;&#1080;&#1084; &#1074; <a href="../ru/PartDesign_AdditivePipe.html" title="PartDesign AdditivePipe/ru">&#1042;&#1099;&#1076;&#1072;&#1074;&#1080;&#1090;&#1100; &#1074;&#1076;&#1086;&#1083;&#1100; &#1090;&#1088;&#1072;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1080; (Additive Pipe)</a></li></ul>
</td></tr>
<tr>
<td>15
</td>
<td>&#1043;&#1080;&#1073;&#1082;&#1072; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1093; &#1076;&#1077;&#1090;&#1072;&#1083;&#1077;&#1081;
</td>
<td>
<ul><li>&#1044;&#1083;&#1103; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1080;&#1079; &#1083;&#1080;&#1089;&#1090;&#1086;&#1074;&#1086;&#1075;&#1086; &#1084;&#1077;&#1090;&#1072;&#1083;&#1083;&#1072;: &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; <a href="../ru/SheetMetal_Workbench.html" title="SheetMetal Workbench/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; &#1051;&#1080;&#1089;&#1090;&#1086;&#1074;&#1086;&#1081; &#1052;&#1077;&#1090;&#1072;&#1083;&#1083; (SheetMetal)</a> - <a href="../ru/SheetMetal_AddFoldWall.html" title="SheetMetal AddFoldWall/ru">&#1051;&#1080;&#1089;&#1090;&#1086;&#1074;&#1086;&#1081;&#1052;&#1077;&#1090;&#1072;&#1083;&#1083; &#1044;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1043;&#1085;&#1091;&#1090;&#1091;&#1102; &#1057;&#1090;&#1077;&#1085;&#1082;&#1091; (Add Fold Wall)</a></li></ul>
</td></tr>
<tr>
<td>16
</td>
<td>&#1064;&#1072;&#1073;&#1083;&#1086;&#1085; &#1074;&#1076;&#1086;&#1083;&#1100; &#1082;&#1088;&#1080;&#1074;&#1086;&#1081;
</td>
<td>
<ul><li>&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; <a href="../ru/Draft_PathArray.html" title="Draft PathArray/ru">&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; &#1052;&#1072;&#1089;&#1089;&#1080;&#1074;&#1055;&#1086;&#1058;&#1088;&#1072;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1080; (PathArray)</a></li></ul>
</td></tr>
<tr>
<td>17
</td>
<td>&#1054;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1074;&#1099;&#1088;&#1077;&#1079;&#1072;&#1085;&#1080;&#1103; - &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1074;&#1099;&#1088;&#1077;&#1079;&#1072;&#1085;&#1080;&#1103;, &#1079;&#1072;&#1090;&#1088;&#1072;&#1075;&#1080;&#1074;&#1072;&#1102;&#1097;&#1080;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1091;&#1102; &#1095;&#1072;&#1089;&#1090;&#1100; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;
</td>
<td>
<ul><li>&#1048;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1082; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081; &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; <a href="../ru/Part_Cut.html" title="Part Cut/ru">&#1073;&#1091;&#1083;&#1077;&#1074;&#1086; &#1074;&#1099;&#1088;&#1077;&#1079;&#1072;&#1085;&#1080;&#1077;</a> &#1076;&#1083;&#1103; &#1090;&#1077;&#1083; <a href="../ru/PartDesign_Pad.html" title="PartDesign Pad/ru">&#1074;&#1099;&#1076;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103;</a>.</li></ul>
</td></tr>
<tr>
<td>18
</td>
<td>&#1054;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; &#1089;&#1084;&#1077;&#1078;&#1085;&#1099;&#1093; &#1075;&#1088;&#1072;&#1085;&#1077;&#1081;
</td>
<td>
<ul><li>&#1044;&#1083;&#1103; &#1075;&#1088;&#1072;&#1085;&#1077;&#1081; <a href="../ru/PartDesign_Body.html" title="PartDesign Body/ru">&#1058;&#1077;&#1083;&#1072; &#1055;&#1088;&#1086;&#1077;&#1082;&#1090;&#1085;&#1086;&#1081;&#1044;&#1077;&#1090;&#1072;&#1083;&#1080;</a>: &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; &#1059;&#1083;&#1091;&#1095;&#1096;&#1080;&#1090;&#1100; (Refine) &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1081; &#1054;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; (Feature) &#1085;&#1072; <code>true</code>, &#1085;&#1086;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1101;&#1090;&#1086; &#1085;&#1077; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090; &#1074;&#1089;&#1077; &#1083;&#1080;&#1096;&#1085;&#1080;&#1077; &#1075;&#1088;&#1072;&#1085;&#1080;.</li>
<li>&#1044;&#1083;&#1103; &#1082;&#1086;&#1087;&#1083;&#1072;&#1085;&#1072;&#1088;&#1085;&#1099;&#1093; &#1075;&#1088;&#1072;&#1085;&#1077;&#1081;: &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; <a href="../ru/Draft_Upgrade.html" title="Draft Upgrade/ru">&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; &#1040;&#1087;&#1075;&#1088;&#1077;&#1081;&#1076;</a> &#1076;&#1074;&#1072;&#1078;&#1076;&#1099;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; <a href="../ru/Draft_Wire.html" title="Draft Wire/ru">&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; &#1051;&#1086;&#1084;&#1072;&#1085;&#1091;&#1102;</a>, &#1079;&#1072;&#1090;&#1077;&#1084; <a href="../ru/Draft_Downgrade.html" title="Draft Downgrade/ru">&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; &#1044;&#1072;&#1091;&#1085;&#1075;&#1088;&#1077;&#1081;&#1076;</a> &#1083;&#1086;&#1084;&#1072;&#1085;&#1085;&#1086;&#1081;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1075;&#1088;&#1072;&#1085;&#1100;</li></ul>
</td></tr>
<tr>
<td>19
</td>
<td>&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; <a href="../ru/PartDesign_Hole.html" title="PartDesign Hole/ru">&#1054;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1077;</a> &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1090;&#1086;&#1095;&#1077;&#1082; &#1080;&#1079; &#1101;&#1089;&#1082;&#1080;&#1079;&#1086;&#1074;
</td>
<td>
<ul><li>&#1053;&#1072;&#1088;&#1080;&#1089;&#1091;&#1081;&#1090;&#1077; &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1091;&#1102; &#1086;&#1082;&#1088;&#1091;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1076;&#1083;&#1103; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; <a href="../ru/PartDesign_Hole.html" title="PartDesign Hole/ru">&#1054;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1077;</a></li></ul>
</td></tr>
<tr>
<td>20
</td>
<td><a href="../ru/PartDesign_Point.html" title="PartDesign Point/ru">&#1054;&#1087;&#1086;&#1088;&#1085;&#1099;&#1077; &#1090;&#1086;&#1095;&#1082;&#1080;</a> &#1087;&#1086; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1072;&#1084;
</td>
<td>
<ul><li>&#1041;&#1072;&#1079;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; <a href="../PartDesign_Point.html" title="PartDesign Point">&#1086;&#1087;&#1086;&#1088;&#1085;&#1099;&#1077; &#1090;&#1086;&#1095;&#1082;&#1080;</a> &#1085;&#1072; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1081; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080;.</li>
<li>&#1057;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1081;&#1090;&#1077; <a href="../ru/PartDesign_Point.html" title="PartDesign Point/ru">&#1086;&#1087;&#1086;&#1088;&#1085;&#1099;&#1077; &#1090;&#1086;&#1095;&#1082;&#1080;</a> &#1074; &#1085;&#1072;&#1095;&#1072;&#1083;&#1077; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090; &#1080; &#1079;&#1072;&#1090;&#1077;&#1084; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1081;&#1090;&#1077; &#1080;&#1093; <a href="../ru/Placement.html" title="Placement/ru">&#1055;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;</a>.</li></ul>
</td></tr>
<tr>
<td>21
</td>
<td>&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1076;&#1083;&#1103; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1088;&#1105;&#1073;&#1077;&#1088; (&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1085;&#1099;&#1093; &#1091;&#1089;&#1080;&#1083;&#1077;&#1085;&#1080;&#1081;)
</td>
<td>
<ul><li>&#1057;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1088;&#1105;&#1073;&#1088;&#1072; &#1074;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102;, &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1089;&#1090;&#1099;&#1093; &#1090;&#1088;&#1077;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1099;&#1093; &#1088;&#1105;&#1073;&#1077;&#1088; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1083;&#1080;&#1085;&#1100;&#1103; (<a href="../ru/Part_Wedge.html" title="Part Wedge/ru">&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1050;&#1083;&#1080;&#1085;</a> &#1080;&#1083;&#1080; <a href="../ru/PartDesign_AdditiveWedge.html" title="PartDesign AdditiveWedge/ru">&#1055;&#1088;&#1086;&#1077;&#1082;&#1090;&#1085;&#1072;&#1103;&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1042;&#1099;&#1076;&#1072;&#1074;&#1080;&#1090;&#1100;&#1050;&#1083;&#1080;&#1085;</a>).</li></ul>
</td></tr>
<tr>
<td>22
</td>
<td>&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1076;&#1083;&#1103; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1089;&#1074;&#1086;&#1076;&#1086;&#1074;/&#1082;&#1091;&#1087;&#1086;&#1083;&#1086;&#1074;
</td>
<td>
<ul><li>&#1057;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1081;&#1090;&#1077; &#1082;&#1091;&#1087;&#1086;&#1083;&#1072; &#1074;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102;, &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1089;&#1090;&#1099;&#1093; &#1089;&#1092;&#1077;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1082;&#1091;&#1087;&#1086;&#1083;&#1086;&#1074; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1092;&#1077;&#1088;&#1099; (<a href="../ru/Part_Sphere.html" title="Part Sphere/ru">&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1057;&#1092;&#1077;&#1088;&#1072;</a> &#1080;&#1083;&#1080; <a href="../ru/PartDesign_AdditiveSphere.html" title="PartDesign AdditiveSphere/ru">&#1055;&#1088;&#1086;&#1077;&#1082;&#1090;&#1085;&#1072;&#1103;&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1042;&#1099;&#1076;&#1072;&#1074;&#1080;&#1090;&#1100;&#1057;&#1092;&#1077;&#1088;&#1091;</a>) &#1089; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;&#1084;&#1080;.</li></ul>
</td></tr>
<tr>
<td>23
</td>
<td>&#1056;&#1072;&#1089;&#1090;&#1103;&#1075;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; &#1075;&#1088;&#1072;&#1085;&#1077;&#1081; &#1076;&#1086; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1075;&#1088;&#1072;&#1085;&#1077;&#1081; (&#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1087;&#1088;&#1080; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1080; &#1089;&#1088;&#1077;&#1076;&#1085;&#1080;&#1093; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081;, &#1082;&#1072;&#1082; &#1091;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1083;&#1086;&#1089;&#1100; &#1074;&#1099;&#1096;&#1077;)
</td>
<td>
<ul><li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; <a href="../ru/Draft_Upgrade.html" title="Draft Upgrade/ru">&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; &#1040;&#1087;&#1075;&#1088;&#1077;&#1081;&#1076;</a> &#1085;&#1072; &#1075;&#1088;&#1072;&#1085;&#1103;&#1093;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1087;&#1088;&#1086;&#1076;&#1083;&#1080;&#1090;&#1100;, &#1088;&#1072;&#1089;&#1090;&#1103;&#1085;&#1080;&#1090;&#1077; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1075;&#1088;&#1072;&#1085;&#1080; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <a href="../ru/Draft_Stretch.html" title="Draft Stretch/ru">&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; &#1056;&#1072;&#1089;&#1090;&#1103;&#1085;&#1091;&#1090;&#1100;</a> &#1080; &#1074;&#1086;&#1089;&#1089;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1075;&#1088;&#1072;&#1085;&#1080; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <a href="../ru/Part_MakeFace.html" title="Part MakeFace/ru">&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1043;&#1088;&#1072;&#1085;&#1100;</a>.</li></ul>
</td></tr>
<tr>
<td>24
</td>
<td>&#1053;&#1077;&#1086;&#1076;&#1085;&#1086;&#1079;&#1085;&#1072;&#1095;&#1085;&#1099;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; <a href="../ru/Part_Workbench.html#Boolean_toolbar" title="Part Workbench/ru">&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1041;&#1091;&#1083;&#1077;&#1074;&#1099; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080;</a> (&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1076;&#1086;&#1087;&#1091;&#1089;&#1082; &#1076;&#1083;&#1103; &#1073;&#1091;&#1083;&#1077;&#1074;&#1099;&#1093; &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1081; &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081;)
</td>
<td>
<ul><li>&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; <a href="../ru/Defeaturing_Workbench.html" title="Defeaturing Workbench/ru">&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082; &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; &#1069;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;</a></li></ul>
</td></tr>
<tr>
<td>25
</td>
<td><a href="../ru/PartDesign_AdditiveLoft.html" title="PartDesign AdditiveLoft/ru"> &#1055;&#1088;&#1086;&#1077;&#1082;&#1090;&#1085;&#1072;&#1103;&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1055;&#1088;&#1086;&#1092;&#1080;&#1083;&#1100; &#1087;&#1086; &#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084;</a> &#1080; <a href="../ru/PartDesign_AdditivePipe.html" title="PartDesign AdditivePipe/ru">&#1055;&#1088;&#1086;&#1077;&#1082;&#1090;&#1085;&#1072;&#1103;&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1055;&#1088;&#1086;&#1092;&#1080;&#1083;&#1100; &#1087;&#1086; &#1090;&#1088;&#1072;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1080;</a> &#1089; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1092;&#1080;&#1083;&#1103; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1080;&#1083;&#1080; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1075;&#1086; &#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;.
</td>
<td>
<ul><li>&#1056;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1099; &#1082; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1102;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; <a href="../ru/PartDesign_Pad.html" title="PartDesign Pad/ru">&#1055;&#1088;&#1086;&#1077;&#1082;&#1090;&#1085;&#1072;&#1103;&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1042;&#1099;&#1076;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077;</a>.</li></ul>
</td></tr>
<tr>
<td>26
</td>
<td>&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1076;&#1083;&#1103; &#1082;&#1088;&#1091;&#1075;&#1086;&#1074;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1092;&#1080;&#1083;&#1103; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1076;&#1080;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1087;&#1086; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1081; <a href="../ru/Part_Sweep.html" title="Part Sweep/ru">&#1090;&#1088;&#1072;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1080;</a>.
</td>
<td>
<ul><li>&#1053;&#1072;&#1088;&#1080;&#1089;&#1091;&#1081;&#1090;&#1077; &#1082;&#1088;&#1091;&#1075;&#1083;&#1099;&#1081; &#1087;&#1088;&#1086;&#1092;&#1080;&#1083;&#1100; &#1074;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102;</li></ul>
</td></tr>
<tr>
<td>27
</td>
<td>&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1077; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090; &#1076;&#1083;&#1103; <a href="../ru/PartDesign_Plane.html" title="PartDesign Plane/ru">&#1086;&#1087;&#1086;&#1088;&#1085;&#1099;&#1093; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1077;&#1081;</a>.
</td>
<td>
<ul><li>&#1055;&#1088;&#1080;&#1082;&#1088;&#1077;&#1087;&#1080;&#1090;&#1077; <a href="../ru/PartDesign_CoordinateSystem.html" title="PartDesign CoordinateSystem/ru">&#1086;&#1087;&#1086;&#1088;&#1085;&#1091;&#1102; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;</a> &#1082; &#1073;&#1072;&#1079;&#1086;&#1074;&#1086;&#1081; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1077;&#1105; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1102;</li></ul>
</td></tr></tbody></table>
<p><span id="Workarounds_for_the_Draft_Workbench"></span>
</p>
<h2><span id=".D0.9E.D0.B1.D1.85.D0.BE.D0.B4.D0.BD.D1.8B.D0.B5_.D1.80.D0.B5.D1.88.D0.B5.D0.BD.D0.B8.D1.8F_.D0.B4.D0.BB.D1.8F_.D0.B2.D0.B5.D1.80.D1.81.D1.82.D0.B0.D0.BA.D0.B0_.D0.9D.D0.B0.D0.B1.D1.80.D0.BE.D1.81.D0.BE.D0.BA_.28Draft.29"></span><span class="mw-headline" id="&#1054;&#1073;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077;_&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;_&#1076;&#1083;&#1103;_&#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072;_&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082;_(Draft)">&#1054;&#1073;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; &#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; (Draft)</span></h2>
<table class="wikitable">

<tbody><tr>
<th width="2%">&#8470;</th>
<th width="28%">&#1053;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1102;&#1097;&#1072;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;</th>
<th width="70%">&#1055;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1077;&#1084;&#1086;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;
</th></tr>
<tr>
<td>1
</td>
<td>&#1055;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1072; &#1082; &#1086;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1099;&#1084; &#1087;&#1077;&#1088;&#1077;&#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084; &#1082;&#1088;&#1080;&#1074;&#1099;&#1093; &#1088;&#1105;&#1073;&#1077;&#1088;, &#1087;&#1077;&#1088;&#1087;&#1077;&#1085;&#1076;&#1080;&#1082;&#1091;&#1083;&#1103;&#1088;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1077;&#1085;&#1080;&#1081;, &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1077;&#1085;&#1080;&#1081; &#1076;&#1091;&#1075;, &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1094;&#1077;&#1085;&#1090;&#1088;&#1086;&#1074; &#1080; &#1090;&#1086;&#1095;&#1077;&#1082; &#1082;&#1072;&#1089;&#1072;&#1085;&#1080;&#1103;
</td>
<td>
<ul><li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1077; <a href="../ru/Draft_Workbench.html#Draft_Snap_toolbar" title="Draft Workbench/ru">&#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1055;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1080; &#1074; &#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1082;&#1077;</a> &#1080; &#1073;&#1086;&#1083;&#1077;&#1077; &#1088;&#1091;&#1095;&#1085;&#1086;&#1081; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076; &#1082; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1102; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080;</li>
<li>&#1055;&#1088;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077; &#1085;&#1072; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080; XY: &#1089;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; (&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1091;&#1102;) &#1087;&#1088;&#1086;&#1077;&#1082;&#1094;&#1080;&#1102; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <a href="../ru/Draft_Shape2DView.html" title="Draft Shape2DView/ru">&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; Shape2DView (2D &#1042;&#1080;&#1076; &#1060;&#1086;&#1088;&#1084;&#1099;)</a>.</li></ul>
</td></tr>
<tr>
<td>2
</td>
<td>&#1057;&#1086;&#1095;&#1077;&#1090;&#1072;&#1085;&#1080;&#1103; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096; &#1076;&#1083;&#1103; <a href="../Draft_Workbench.html#Draft_Snap_toolbar/ru" title="Draft Workbench">&#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1055;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1080; &#1074; &#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1082;&#1077;</a>
</td>
<td>
<ul><li>&#1055;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1072;&#1082;&#1090;&#1080;&#1074;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080; &#1076;&#1077;&#1072;&#1082;&#1090;&#1080;&#1074;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1089;&#1086;&#1095;&#1077;&#1090;&#1072;&#1085;&#1080;&#1081; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;, &#1085;&#1086; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1080; &#1086;&#1076;&#1085;&#1086; &#1080;&#1079; &#1087;&#1086;&#1083;&#1077;&#1081; &#1074;&#1074;&#1086;&#1076;&#1072; &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1079;&#1072;&#1076;&#1072;&#1095; &#1085;&#1077; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1092;&#1086;&#1082;&#1091;&#1089;&#1077; (&#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1097;&#1105;&#1083;&#1082;&#1085;&#1091;&#1090;&#1100; &#1074; &#1087;&#1091;&#1089;&#1090;&#1086;&#1084; &#1084;&#1077;&#1089;&#1090;&#1077; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1079;&#1072;&#1076;&#1072;&#1095;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1084;&#1077;&#1090;&#1100; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1086;&#1095;&#1077;&#1090;&#1072;&#1085;&#1080;&#1103; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096; &#1076;&#1083;&#1103; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1086;&#1082;)</li></ul>
</td></tr>
<tr>
<td>3
</td>
<td>&#1040;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1094;&#1074;&#1077;&#1090;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1085;&#1072; '&#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081;' &#1087;&#1088;&#1080; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1080; &#1080;&#1093; &#1080;&#1079; <a href="../ru/Draft_ToggleConstructionMode.html" title="Draft ToggleConstructionMode/ru">&#1075;&#1088;&#1091;&#1087;&#1087;&#1099; &#1074;&#1089;&#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080;</a>.
</td>
<td>
<ul><li>&#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1085;&#1072; <a href="../ru/Draft_Layer.html" title="Draft Layer/ru">&#1089;&#1083;&#1086;&#1081;</a> &#1089; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072;&#1084;&#1080; &#1094;&#1074;&#1077;&#1090;&#1072;.</li>
<li>&#1048;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1094;&#1074;&#1077;&#1090; &#1074;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102;</li></ul>
</td></tr>
<tr>
<td>4
</td>
<td>&#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;&#1075;&#1086; &#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103; &#1084;&#1077;&#1078;&#1076;&#1091; &#1090;&#1088;&#1077;&#1084;&#1103; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1084;&#1080; &#1088;&#1072;&#1073;&#1086;&#1095;&#1080;&#1084;&#1080; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1103;&#1084;&#1080; &#1080; &#1080;&#1093; &#1087;&#1088;&#1086;&#1077;&#1082;&#1094;&#1080;&#1103;&#1084;&#1080; &#1085;&#1072; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1091;&#1102; &#1090;&#1086;&#1095;&#1082;&#1091; (&#1076;&#1083;&#1103; 3D-&#1095;&#1077;&#1088;&#1095;&#1077;&#1085;&#1080;&#1103;)
</td>
<td>
<ul><li>&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1076;&#1083;&#1103; <a href="../ru/Draft_SelectPlane.html" title="Draft SelectPlane/ru">&#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1075;&#1086; &#1074;&#1080;&#1076;&#1072; &#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1082;&#1072;</a> &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; Automatic - &#1040;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1083;&#1102;&#1073;&#1086;&#1081; &#1080;&#1079; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1093; &#1074;&#1080;&#1076;&#1086;&#1074;: <a href="../ru/Std_ViewFront.html" title="Std ViewFront/ru">&#1074;&#1080;&#1076; &#1089;&#1087;&#1077;&#1088;&#1077;&#1076;&#1080;</a>, <a href="../ru/Std_ViewTop.html" title="Std ViewTop/ru">&#1074;&#1080;&#1076; &#1089;&#1074;&#1077;&#1088;&#1093;&#1091;</a> &#1080; &#1090;. &#1076;.</li>
<li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102; <a href="../ru/Draft_Constrain.html" title="Draft Constrain/ru">&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; &#1055;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1080;</a> - &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1072; &#1082; &#1086;&#1089;&#1103;&#1084;, &#1072; &#1085;&#1077; &#1082; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1103;&#1084;.</li>
<li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; <a href="../ru/Draft_WorkingPlaneProxy.html" title="Draft WorkingPlaneProxy/ru">&#1087;&#1088;&#1086;&#1082;&#1089;&#1080; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1081; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080;</a>.</li></ul>
</td></tr>
<tr>
<td>5
</td>
<td>&#1042;&#1074;&#1086;&#1076; &#1074; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1091;&#1102; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091;, &#1087;&#1086;&#1076;&#1086;&#1073;&#1085;&#1099;&#1081; AutoCAD
</td>
<td>
<ul><li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1074;&#1080;&#1076;&#1078;&#1077;&#1090;&#1099; FreeCAD &#1080;&#1083;&#1080; <a href="../ru/Scripting_and_macros.html" title="Scripting and macros/ru">Python &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1099;</a> &#1076;&#1083;&#1103; &#1074;&#1074;&#1086;&#1076;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;.</li></ul>
</td></tr>
<tr>
<td>6
</td>
<td><a href="../ru/Draft_Hatch.html" title="Draft Hatch/ru">&#1064;&#1090;&#1088;&#1080;&#1093;&#1086;&#1074;&#1082;&#1072;</a> &#1088;&#1077;&#1075;&#1080;&#1086;&#1085;&#1072;, &#1086;&#1082;&#1088;&#1091;&#1078;&#1105;&#1085;&#1085;&#1086;&#1075;&#1086; &#1082;&#1088;&#1080;&#1074;&#1086;&#1081;/&#1083;&#1086;&#1084;&#1072;&#1085;&#1086;&#1081;
</td>
<td>
<ul><li>&#1057;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1075;&#1088;&#1072;&#1085;&#1100; (&#1096;&#1090;&#1088;&#1080;&#1093;&#1086;&#1074;&#1082;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1072; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1082; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084; &#1089; &#1087;&#1083;&#1086;&#1089;&#1082;&#1080;&#1084;&#1080; &#1075;&#1088;&#1072;&#1085;&#1103;&#1084;&#1080;):
<ul><li>&#1042; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1086;&#1076;&#1080;&#1085;&#1086;&#1095;&#1085;&#1086;&#1075;&#1086; &#1079;&#1072;&#1084;&#1082;&#1085;&#1091;&#1090;&#1086;&#1075;&#1086; &#1082;&#1086;&#1085;&#1090;&#1091;&#1088;&#1072;: &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1076;&#1083;&#1103; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; Make Face (&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1043;&#1088;&#1072;&#1085;&#1100;) &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; "true", &#1072; &#1076;&#1083;&#1103; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; - "Wireframe - &#1050;&#1072;&#1088;&#1082;&#1072;&#1089;"</li>
<li><a href="../ru/Draft_Upgrade.html" title="Draft Upgrade/ru">&#1059;&#1083;&#1091;&#1095;&#1096;&#1080;&#1090;&#1077;</a> &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1085;&#1099;&#1077; &#1082;&#1088;&#1080;&#1074;&#1099;&#1077; &#1076;&#1074;&#1072; &#1080;&#1083;&#1080; &#1090;&#1088;&#1080; &#1088;&#1072;&#1079;&#1072;, &#1087;&#1086;&#1082;&#1072; &#1085;&#1077; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1077; &#1075;&#1088;&#1072;&#1085;&#1100; &#1080;&#1083;&#1080; &#1086;&#1076;&#1080;&#1085; &#1079;&#1072;&#1084;&#1082;&#1085;&#1091;&#1090;&#1099;&#1081; &#1082;&#1086;&#1085;&#1090;&#1091;&#1088; (&#1089;&#1084;. &#1074;&#1099;&#1096;&#1077;)</li>
<li>&#1045;&#1089;&#1083;&#1080; &#1082;&#1088;&#1080;&#1074;&#1099;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1086;&#1089;&#1090;&#1072;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080;, &#1085;&#1086; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1099; &#1084;&#1077;&#1078;&#1076;&#1091; &#1089;&#1086;&#1073;&#1086;&#1081;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1080;&#1079; &#1085;&#1080;&#1093; <a href="../ru/PartDesign_SubShapeBinder.html" title="PartDesign SubShapeBinder/ru">&#1055;&#1086;&#1076;&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1085;&#1091;&#1102; &#1057;&#1074;&#1103;&#1079;&#1091;&#1102;&#1097;&#1091;&#1102; &#1060;&#1086;&#1088;&#1084;&#1091;</a>.</li>
<li>&#1054;&#1073;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1089; &#1079;&#1072;&#1084;&#1082;&#1085;&#1091;&#1090;&#1086;&#1081; &#1082;&#1088;&#1080;&#1074;&#1086;&#1081; (&#1085;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103;)</li></ul></li></ul>
</td></tr></tbody></table>
<p><span id="Workarounds_for_the_TechDraw_Workbench"></span>
</p>
<h2><span id=".D0.9E.D0.B1.D1.85.D0.BE.D0.B4.D0.BD.D1.8B.D0.B5_.D1.80.D0.B5.D1.88.D0.B5.D0.BD.D0.B8.D1.8F_.D0.B4.D0.BB.D1.8F_.D0.B2.D0.B5.D1.80.D1.81.D1.82.D0.B0.D0.BA.D0.B0_.D0.A7.D0.B5.D1.80.D1.82.D1.91.D0.B6_.28TechDraw.29"></span><span class="mw-headline" id="&#1054;&#1073;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077;_&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;_&#1076;&#1083;&#1103;_&#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072;_&#1063;&#1077;&#1088;&#1090;&#1105;&#1078;_(TechDraw)">&#1054;&#1073;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; &#1063;&#1077;&#1088;&#1090;&#1105;&#1078; (TechDraw)</span></h2>
<table class="wikitable">

<tbody><tr>
<th width="2%">&#8470;</th>
<th width="28%">&#1053;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1102;&#1097;&#1072;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;</th>
<th width="70%">&#1055;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1077;&#1084;&#1086;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;
</th></tr>
<tr>
<td>1
</td>
<td>&#1057;&#1083;&#1086;&#1084;&#1072;&#1085;&#1085;&#1099;&#1077; &#1080; &#1087;&#1086;&#1074;&#1105;&#1088;&#1085;&#1091;&#1090;&#1099;&#1077;/&#1091;&#1076;&#1072;&#1083;&#1105;&#1085;&#1085;&#1099;&#1077; &#1074;&#1080;&#1076;&#1099; &#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1081;
</td>
<td>
<ul><li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; <a href="../ru/Part_SliceApart.html" title="Part SliceApart/ru">&#1056;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100; &#1085;&#1072; &#1095;&#1072;&#1089;&#1090;&#1080;</a>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1092;&#1080;&#1079;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1088;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1077;&#1105; &#1074;&#1080;&#1076;</li></ul>
</td></tr>
<tr>
<td>2
</td>
<td>&#1040;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1076;&#1080;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1085;&#1072; &#1074;&#1080;&#1076;&#1077; &#1089;&#1073;&#1086;&#1082;&#1091;
</td>
<td>
<ul><li>&#1044;&#1086;&#1073;&#1072;&#1074;&#1100;&#1090;&#1077; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083; &#1076;&#1080;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1074;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102;</li></ul>
</td></tr>
<tr>
<td>3
</td>
<td>&#1056;&#1091;&#1095;&#1085;&#1086;&#1077; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080; &#1074; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1074;&#1080;&#1076;&#1099;
</td>
<td>
<ul><li>&#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1086;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1082;&#1086;&#1089;&#1084;&#1077;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1076;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; &#1083;&#1080;&#1085;&#1080;&#1103;&#1084;&#1080; &#1074; <a href="../ru/TechDraw_Workbench.html#Annotations" title="TechDraw Workbench/ru">&#1040;&#1085;&#1085;&#1086;&#1090;&#1072;&#1094;&#1080;&#1103;&#1093;</a> &#1080; <a href="../ru/TechDraw_Workbench.html#Extensions" title="TechDraw Workbench/ru">&#1042;&#1099;&#1085;&#1086;&#1089;&#1082;&#1072;&#1093;</a>.</li>
<li>&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; <a href="../ru/TechDraw_View.html" title="TechDraw View/ru">&#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1093; &#1074;&#1080;&#1076;&#1086;&#1074;</a> &#1080; <a href="../ru/TechDraw_DraftView.html" title="TechDraw DraftView/ru">&#1074;&#1080;&#1076;&#1086;&#1074; &#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1082;&#1072;</a> &#1089; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072;&#1084;&#1080; &#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084;&#1080; <a href="../ru/Draft_Workbench.html" title="Draft Workbench/ru">&#1080;&#1079; &#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1082;&#1072;</a>.</li></ul>
</td></tr>
<tr>
<td>4
</td>
<td>&#1047;&#1072;&#1090;&#1077;&#1085;&#1105;&#1085;&#1085;&#1099;&#1077; (&#1079;&#1072;&#1082;&#1088;&#1072;&#1096;&#1077;&#1085;&#1085;&#1099;&#1077;) &#1074;&#1080;&#1076;&#1099; &#1085;&#1072; &#1095;&#1077;&#1088;&#1090;&#1077;&#1078;&#1072;&#1093;
</td>
<td>
<ul><li>&#1056;&#1072;&#1079;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1077; &#1089;&#1082;&#1088;&#1080;&#1085;&#1096;&#1086;&#1090;&#1099; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; &#1085;&#1072; &#1073;&#1077;&#1083;&#1086;&#1084; &#1092;&#1086;&#1085;&#1077; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; &#1063;&#1077;&#1088;&#1090;&#1077;&#1078;&#1072;</li></ul>
</td></tr>
<tr>
<td>5
</td>
<td>&#1056;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1087;&#1086; &#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1077;
</td>
<td>
<ul><li>&#1053;&#1077;&#1090; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1086;&#1075;&#1086; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;</li></ul>
</td></tr>
<tr>
<td>6
</td>
<td>&#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1088;&#1105;&#1073;&#1088;&#1072; &#1080;&#1079; &#1096;&#1090;&#1088;&#1080;&#1093;&#1086;&#1074;&#1082;&#1080;
</td>
<td>
<ul><li>&#1042; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1077;&#1088;&#1074;&#1086;&#1077; &#1080;&#1079; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1093; &#1079;&#1076;&#1077;&#1089;&#1100; &#1086;&#1073;&#1093;&#1086;&#1076;&#1085;&#1099;&#1093; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1081; &#1080; &#1074;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1081; &#1083;&#1080;&#1085;&#1080;&#1077;&#1081; &#1088;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;.</li></ul>
</td></tr>
<tr>
<td>7
</td>
<td>&#1069;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094; &#1063;&#1077;&#1088;&#1090;&#1077;&#1078;&#1072; &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; PDF &#1073;&#1077;&#1079; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1080;&#1079; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1072; (&#1082;&#1086;&#1085;&#1090;&#1091;&#1088;&#1085;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090;) &#1074; &#1085;&#1077;&#1084;&#1072;&#1088;&#1082;&#1080;&#1088;&#1091;&#1077;&#1084;&#1099;&#1081;/&#1085;&#1077;&#1087;&#1086;&#1080;&#1089;&#1082;&#1086;&#1074;&#1099;&#1081;.
</td>
<td>
<ul><li>&#1069;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077; SVG. &#1047;&#1072;&#1090;&#1077;&#1084; &#1082;&#1086;&#1085;&#1074;&#1077;&#1088;&#1090;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; SVG &#1074; PDF &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, <a rel="nofollow" class="external text" href="http://www.inkscape.org">Inkscape</a> &#1080;&#1083;&#1080; &#1086;&#1090;&#1082;&#1088;&#1086;&#1081;&#1090;&#1077; SVG &#1074; &#1074;&#1077;&#1073;-&#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1077;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1077; &#1080;&#1083;&#1080; &#1088;&#1072;&#1089;&#1087;&#1077;&#1095;&#1072;&#1090;&#1072;&#1081;&#1090;&#1077; &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077; PDF.</li></ul>
</td></tr>
<tr>
<td>8
</td>
<td><a href="../ru/Std_BoxSelection.html" title="Std BoxSelection/ru">&#1042;&#1099;&#1073;&#1086;&#1088; &#1088;&#1072;&#1084;&#1082;&#1086;&#1081;</a> &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1063;&#1077;&#1088;&#1090;&#1077;&#1078;&#1072;
</td>
<td>
<ul><li>&#1042;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1074;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102;, &#1086;&#1076;&#1080;&#1085; &#1079;&#1072; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084; (&#1091;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1103; Ctrl)</li></ul>
</td></tr>
<tr>
<td>9
</td>
<td>&#1048;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1093; &#1074;&#1080;&#1076;&#1086;&#1074; &#1080; &#1074;&#1080;&#1076;&#1086;&#1074; &#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1081; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072;
</td>
<td>
<ul><li>&#1056;&#1091;&#1095;&#1085;&#1086;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1074;&#1080;&#1076;&#1086;&#1074;:
<ol><li>&#1045;&#1089;&#1083;&#1080; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1074;&#1080;&#1076; &#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; <a href="../ru/Part_SectionCut.html" title="Part SectionCut/ru">&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1057;&#1077;&#1082;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1081; &#1088;&#1072;&#1079;&#1088;&#1077;&#1079;</a> &#1080;&#1083;&#1080; &#1073;&#1091;&#1083;&#1077;&#1074;&#1099; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1088;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100; &#1076;&#1077;&#1090;&#1072;&#1083;&#1100; &#1090;&#1072;&#1082; &#1078;&#1077;, &#1082;&#1072;&#1082; &#1101;&#1090;&#1086; &#1073;&#1099;&#1083;&#1086; &#1073;&#1099; &#1089;&#1076;&#1077;&#1083;&#1072;&#1085;&#1086; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084; <a href="../ru/TechDraw_SectionView.html" title="TechDraw SectionView/ru">&#1074;&#1080;&#1076; &#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;</a>.</li>
<li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; <a href="../ru/Draft_Shape2DView.html" title="Draft Shape2DView/ru">&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; Shape2DView (2D &#1042;&#1080;&#1076; &#1060;&#1086;&#1088;&#1084;&#1099;)</a> &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; 2D &#1083;&#1080;&#1085;&#1077;&#1081;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1074;&#1080;&#1076;&#1072; &#1080;&#1083;&#1080; &#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;.</li>
<li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; <a href="../ru/Draft_Workbench.html#Drafting" title="Draft Workbench/ru">&#1063;&#1077;&#1088;&#1095;&#1077;&#1085;&#1080;&#1103;</a> &#1089; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1084;&#1080; <a href="../ru/Draft_Workbench.html#Draft_Snap_toolbar" title="Draft Workbench/ru">&#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1072;&#1084;&#1080;</a> &#1076;&#1083;&#1103; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1074;&#1080;&#1076;&#1072;</li>
<li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; <a href="../ru/Draft_Draft2Sketch.html" title="Draft Draft2Sketch/ru">&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; Draft2Sketch (&#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1086;&#1082; &#1074; &#1069;&#1089;&#1082;&#1080;&#1080;&#1079;)</a>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1101;&#1089;&#1082;&#1080;&#1079; &#1080;&#1079; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1053;&#1072;&#1073;&#1088;&#1086;&#1089;&#1082;&#1072;.</li>
<li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; <a href="../ru/Sketcher_ValidateSketch.html" title="Sketcher ValidateSketch/ru">&#1057;&#1082;&#1077;&#1090;&#1095;&#1077;&#1088; &#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100; &#1101;&#1089;&#1082;&#1080;&#1079;</a>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1073;&#1077;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103;, &#1095;&#1090;&#1086; &#1074; &#1101;&#1089;&#1082;&#1080;&#1079;&#1077; &#1085;&#1077;&#1090; &#1087;&#1088;&#1086;&#1087;&#1091;&#1097;&#1077;&#1085;&#1085;&#1099;&#1093; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1077;&#1085;&#1080;&#1081; &#1090;&#1086;&#1095;&#1077;&#1082;, &#1076;&#1074;&#1086;&#1081;&#1085;&#1099;&#1093; &#1083;&#1080;&#1085;&#1080;&#1081; &#1080; &#1090;&#1072;&#1082; &#1076;&#1072;&#1083;&#1077;&#1077; (&#1101;&#1090;&#1080; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; &#1084;&#1086;&#1075;&#1091;&#1090; &#1087;&#1086;&#1074;&#1083;&#1080;&#1103;&#1090;&#1100; &#1085;&#1072; &#1074;&#1099;&#1073;&#1086;&#1088; &#1075;&#1088;&#1072;&#1085;&#1080; &#1074; &#1058;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084;&#1063;&#1077;&#1088;&#1090;&#1077;&#1078;&#1077;)</li>
<li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; <a href="../ru/TechDraw_View.html" title="TechDraw View/ru">&#1058;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081;&#1063;&#1077;&#1088;&#1090;&#1105;&#1078; &#1042;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1042;&#1080;&#1076;</a>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1074;&#1080;&#1076; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; &#1074; &#1058;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084;&#1063;&#1077;&#1088;&#1090;&#1077;&#1078;&#1077;.</li></ol></li></ul>
</td></tr>
<tr>
<td>10
</td>
<td>&#1042;&#1089;&#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1074;&#1080;&#1076;&#1099;
</td>
<td>
<ul><li>&#1057;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; <a href="../ru/TechDraw_View.html" title="TechDraw View/ru">&#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1081; &#1074;&#1080;&#1076;</a> &#1089; &#1085;&#1091;&#1078;&#1085;&#1086;&#1075;&#1086; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1074;&#1079;&#1075;&#1083;&#1103;&#1076;&#1072;. &#1042; &#1101;&#1090;&#1086;&#1084; &#1084;&#1086;&#1075;&#1091;&#1090; &#1087;&#1086;&#1084;&#1086;&#1095;&#1100; &#1086;&#1073;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077; &#1087;&#1091;&#1090;&#1080; &#1076;&#1083;&#1103; "&#1042;&#1080;&#1076;, &#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1082; &#1075;&#1088;&#1072;&#1085;&#1080;". &#1055;&#1086;&#1074;&#1077;&#1088;&#1085;&#1080;&#1090;&#1077; &#1080; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1090;&#1077; &#1074;&#1080;&#1076; &#1090;&#1072;&#1082;, &#1082;&#1072;&#1082; &#1085;&#1091;&#1078;&#1085;&#1086;.</li></ul>
</td></tr></tbody></table>
<p><span id="Workarounds_for_the_FEM_Workbench"></span>
</p>
<h2><span id=".D0.9E.D0.B1.D1.85.D0.BE.D0.B4.D0.BD.D1.8B.D0.B5_.D1.80.D0.B5.D1.88.D0.B5.D0.BD.D0.B8.D1.8F_.D0.B4.D0.BB.D1.8F_.D0.B2.D0.B5.D1.80.D1.81.D1.82.D0.B0.D0.BA.D0.B0_FEM_.28.D0.9C.D0.9A.D0.AD.29"></span><span class="mw-headline" id="&#1054;&#1073;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077;_&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;_&#1076;&#1083;&#1103;_&#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072;_FEM_(&#1052;&#1050;&#1069;)">&#1054;&#1073;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1074;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;&#1072; FEM (&#1052;&#1050;&#1069;)</span></h2>
<table class="wikitable">

<tbody><tr>
<th width="2%">&#8470;</th>
<th width="28%">&#1053;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1102;&#1097;&#1072;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;</th>
<th width="70%">&#1055;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1077;&#1084;&#1086;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;
</th></tr>
<tr>
<td>1
</td>
<td>&#1041;&#1072;&#1083;&#1082;&#1080; &#1089; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1083;&#1100;&#1085;&#1099;&#1084; <a href="../ru/FEM_ElementGeometry1D.html" title="FEM ElementGeometry1D/ru">&#1087;&#1086;&#1087;&#1077;&#1088;&#1077;&#1095;&#1085;&#1099;&#1084; &#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084;</a>.
</td>
<td>
<ul><li>&#1042;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102; &#1086;&#1090;&#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; &#1074;&#1093;&#1086;&#1076;&#1085;&#1086;&#1081; &#1092;&#1072;&#1081;&#1083; &#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1073;&#1072;&#1083;&#1082;&#1080;.</li></ul>
</td></tr>
<tr>
<td>2
</td>
<td>&#1056;&#1072;&#1089;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1072;&#1103; &#1085;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072; &#1085;&#1072; &#1073;&#1072;&#1083;&#1082;&#1080;
</td>
<td>
<ul><li><a href="../ru/FEM_ConstraintForce.html" title="FEM ConstraintForce/ru">Force load (&#1057;&#1080;&#1083;&#1086;&#1074;&#1072;&#1103; &#1085;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072;)</a></li></ul>
</td></tr>
<tr>
<td>3
</td>
<td>&#1055;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1072; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1093; &#1089;&#1077;&#1090;&#1086;&#1082; &#1080;, &#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; <a href="../ru/FEM_ConstraintContact.html" title="FEM ConstraintContact/ru">&#1082;&#1086;&#1085;&#1090;&#1072;&#1082;&#1090;&#1072;</a> &#1084;&#1077;&#1078;&#1076;&#1091; &#1089;&#1086;&#1087;&#1088;&#1080;&#1082;&#1072;&#1089;&#1072;&#1102;&#1097;&#1080;&#1084;&#1080;&#1089;&#1103; (&#1085;&#1077; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1099;&#1084;&#1080;) &#1075;&#1088;&#1072;&#1085;&#1103;&#1084;&#1080;
</td>
<td>
<ul><li>&#1055;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; <a href="../ru/Part_Fuse.html" title="Part Fuse/ru">&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1054;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1080;&#1090;&#1100;</a> &#1080;&#1083;&#1080; <a href="../ru/Part_BooleanFragments.html" title="Part BooleanFragments/ru">&#1044;&#1077;&#1090;&#1072;&#1083;&#1100; &#1041;&#1091;&#1083;&#1077;&#1074;&#1086; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077;</a> &#1082; &#1089;&#1073;&#1086;&#1088;&#1082;&#1072;&#1084; &#1080; &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077; &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1077; &#1079;&#1072;&#1079;&#1086;&#1088;&#1099;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; <a href="../ru/FEM_ConstraintContact.html" title="FEM ConstraintContact/ru">&#1082;&#1086;&#1085;&#1090;&#1072;&#1082;&#1090;</a> &#1080;&#1083;&#1080; <a href="../ru/FEM_ConstraintTie.html" title="FEM ConstraintTie/ru">&#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103; &#1089;&#1074;&#1103;&#1079;&#1080;</a>.</li></ul>
</td></tr>
<tr>
<td>4
</td>
<td>&#1059;&#1089;&#1086;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083;&#1086;&#1074; (&#1075;&#1080;&#1087;&#1077;&#1088;&#1101;&#1083;&#1072;&#1089;&#1090;&#1080;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;, &#1087;&#1086;&#1083;&#1079;&#1091;&#1095;&#1077;&#1089;&#1090;&#1100; &#1080; &#1090;.&#1076;.)
</td>
<td>
<ul><li>&#1042;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102; &#1086;&#1090;&#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; &#1074;&#1093;&#1086;&#1076;&#1085;&#1086;&#1081; &#1092;&#1072;&#1081;&#1083; &#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1100;&#1090;&#1077; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1082;&#1083;&#1102;&#1095;&#1077;&#1074;&#1099;&#1077; &#1089;&#1083;&#1086;&#1074;&#1072; &#1076;&#1083;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083;&#1072;</li></ul>
</td></tr>
<tr>
<td>5
</td>
<td>&#1050;&#1086;&#1084;&#1087;&#1086;&#1079;&#1080;&#1090;&#1085;&#1099;&#1077; &#1086;&#1073;&#1086;&#1083;&#1086;&#1095;&#1082;&#1080;
</td>
<td>
<ul><li>&#1042;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102; &#1086;&#1090;&#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; &#1074;&#1093;&#1086;&#1076;&#1085;&#1086;&#1081; &#1092;&#1072;&#1081;&#1083; &#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073;&#1086;&#1083;&#1086;&#1095;&#1082;&#1080;</li></ul>
</td></tr>
<tr>
<td>6
</td>
<td>&#1055;&#1088;&#1086;&#1089;&#1090;&#1086;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1085;&#1072;&#1073;&#1086;&#1088;&#1086;&#1074; &#1091;&#1079;&#1083;&#1086;&#1074; &#1080; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081;
</td>
<td>
<ul><li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1085;&#1072;&#1073;&#1086;&#1088;&#1099; &#1091;&#1079;&#1083;&#1086;&#1074; &#1080; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103;&#1084;&#1080; (&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083;&#1086;&#1074;, &#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1085;&#1099;&#1077; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1103; &#1080; &#1090;. &#1076;.)</li></ul>
</td></tr>
<tr>
<td>7
</td>
<td>&#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088; &#1082;&#1083;&#1102;&#1095;&#1077;&#1074;&#1099;&#1093; &#1089;&#1083;&#1086;&#1074; CalculiX, &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081; &#1089;&#1074;&#1086;&#1088;&#1072;&#1095;&#1080;&#1074;&#1072;&#1090;&#1100; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080; &#1074;&#1085;&#1086;&#1089;&#1080;&#1090;&#1100; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1076; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1072;
</td>
<td>
<ul><li>&#1055;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1084;&#1086;&#1078;&#1077;&#1090; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1100; .inp-&#1092;&#1072;&#1081;&#1083; &#1087;&#1077;&#1088;&#1077;&#1076; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1086;&#1084; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1072;, &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1089;&#1080;&#1085;&#1090;&#1072;&#1082;&#1089;&#1080;&#1089; &#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; (&#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; <span style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.4em; padding: 0px 10px 1px 10px; font-weight:normal;">Edit .inp file</span> &#1074; &#1086;&#1082;&#1085;&#1077; <a href="../ru/FEM_SolverControl.html" title="FEM SolverControl/ru">&#1052;&#1050;&#1069; SolverControl (&#1050;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100;&#1056;&#1077;&#1096;&#1072;&#1090;&#1077;&#1083;&#1103;)</a>).</li></ul>
</td></tr>
<tr>
<td>8
</td>
<td>&#1057;&#1077;&#1090;&#1082;&#1072; &#1089; &#1096;&#1077;&#1089;&#1090;&#1080;&#1075;&#1088;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080;
</td>
<td>
<ul><li>&#1057;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1102; &#1074;&#1086; FreeCAD, &#1101;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; &#1077;&#1105; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1089;&#1077;&#1090;&#1082;&#1080; &#1074;&#1086; &#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, <a rel="nofollow" class="external text" href="https://gmsh.info/">Gmsh</a> &#1080;&#1083;&#1080; <a rel="nofollow" class="external text" href="https://www.code-aster.org/V2/spip.php?article303">Salome_Meca</a>), &#1080;&#1084;&#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; &#1089;&#1077;&#1090;&#1082;&#1091; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077; .inp &#1080;&#1083;&#1080; .unv), &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1097;&#1080;&#1090;&#1077; &#1077;&#1105; &#1074; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088; Analysis (&#1040;&#1085;&#1072;&#1083;&#1080;&#1079;) &#1080; &#1085;&#1072;&#1083;&#1086;&#1078;&#1080;&#1090;&#1077; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1102;.</li></ul>
</td></tr>
<tr>
<td>9
</td>
<td>Multistep analyses (e.g. preload for frequency/buckling analysis)
</td>
<td>
<ul><li>Prepare the analysis with the first step, write the .inp file, edit it to add definitions of subsequent steps and run the analysis</li></ul>
</td></tr>
<tr>
<td>10
</td>
<td><a href="../Std_BoxSelection.html" title="Std BoxSelection">Box selection</a> of geometric entities for constraints
</td>
<td>
<ul><li>Select geometric entities manually, one by one</li></ul>
</td></tr></tbody></table>
<p><span id="General_workarounds"></span>
</p>
<h2><span id=".D0.9E.D0.B1.D1.85.D0.BE.D0.B4.D0.BD.D1.8B.D0.B5_.D1.80.D0.B5.D1.88.D0.B5.D0.BD.D0.B8.D1.8F_.D0.B4.D0.BB.D1.8F_FreeCAD_.D0.B2_.D1.86.D0.B5.D0.BB.D0.BE.D0.BC"></span><span class="mw-headline" id="&#1054;&#1073;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077;_&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;_&#1076;&#1083;&#1103;_FreeCAD_&#1074;_&#1094;&#1077;&#1083;&#1086;&#1084;">&#1054;&#1073;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; FreeCAD &#1074; &#1094;&#1077;&#1083;&#1086;&#1084;</span></h2>
<table class="wikitable">

<tbody><tr>
<th width="2%">&#8470;</th>
<th width="28%">&#1053;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1102;&#1097;&#1072;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;</th>
<th width="70%">&#1055;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1077;&#1084;&#1086;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;
</th></tr>
<tr>
<td>2
</td>
<td>&#1059;&#1083;&#1091;&#1095;&#1096;&#1077;&#1085;&#1085;&#1099;&#1081; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1081; &#1074;&#1080;&#1076;/&#1088;&#1077;&#1085;&#1076;&#1077;&#1088;&#1080;&#1085;&#1075; 3D-&#1084;&#1086;&#1076;&#1077;&#1083;&#1077;&#1081;
</td>
<td>
<ul><li><a rel="nofollow" class="external text" href="https://github.com/realthunder/FreeCAD/releases">&#1057;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1042;&#1077;&#1090;&#1082;&#1091;</a></li>
<li>&#1056;&#1077;&#1085;&#1076;&#1077;&#1088;&#1080;&#1085;&#1075; &#1074;&#1086; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1093; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072;&#1093;, &#1090;&#1072;&#1082;&#1080;&#1093; &#1082;&#1072;&#1082; <a rel="nofollow" class="external text" href="https://www.blender.org/">Blender</a></li></ul>
</td></tr>
<tr>
<td>2
</td>
<td>&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080; &#1074; <a href="../ru/Status_bar.html" title="Status bar/ru">&#1057;&#1090;&#1088;&#1086;&#1082;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103;</a> ("&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1101;&#1090;&#1086;...") &#1076;&#1083;&#1103; &#1084;&#1085;&#1086;&#1075;&#1080;&#1093; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1076;&#1083;&#1103; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1086;&#1085;&#1080; &#1073;&#1099;&#1083;&#1080; &#1073;&#1099; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1099; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, <a href="../ru/Sketcher_Workbench.html#Sketcher_constraints" title="Sketcher Workbench/ru">&#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074; &#1057;&#1082;&#1077;&#1090;&#1095;&#1077;&#1088;&#1077;</a>), &#1073;&#1086;&#1083;&#1077;&#1077; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1074;&#1085;&#1099;&#1077; &#1074;&#1089;&#1087;&#1083;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1077; &#1087;&#1086;&#1076;&#1089;&#1082;&#1072;&#1079;&#1082;&#1080;
</td>
<td>
<ul><li><a href="../ru/Main_Page.html" title="Main Page/ru">Wiki &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103;</a></li></ul>
</td></tr>
<tr>
<td>3
</td>
<td>Consistent selection order - some tools require the user to pick the geometric entity first while others allow selection after enabling the tool
</td>
<td>
<ul><li>No known workaround</li></ul>
</td></tr>
<tr>
<td>4
</td>
<td>More GUI customization options - pie menus, different icon styles and themes and so on
</td>
<td>
<ul><li>Various customization packages created by the community</li>
<li><a rel="nofollow" class="external text" href="https://github.com/realthunder/FreeCAD/releases">Link Branch</a></li></ul>
</td></tr>
<tr>
<td>5
</td>
<td>Advanced selection tools: selection by angle, inverting selection, selecting inside faces and so on
</td>
<td>
<ul><li>Manual selection</li></ul>
</td></tr>
<tr>
<td>6
</td>
<td><a href="../Assembly.html" title="Assembly">Assembly</a> workbench with an option to constrain parts to the origin and to <a href="../Datum.html" title="Datum">datums</a>
</td>
<td>
<ul><li>No known workaround</li></ul>
</td></tr>
<tr>
<td>7
</td>
<td><a href="../Std_TransformManip.html" title="Std TransformManip">Transform</a> tool with an option to move and rotate with respect to edges and global coordinates
</td>
<td>
<ul><li>Add-on <a href="../Manipulator_Workbench.html" title="Manipulator Workbench">Manipulator Workbench</a></li></ul>
<div class="mw-translate-fuzzy">
</div></td></tr>
<tr>
<td>9
</td>
<td>&#1041;&#1086;&#1083;&#1100;&#1096;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081; &#1076;&#1083;&#1103; &#1090;&#1077;&#1082;&#1089;&#1090;&#1091;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;
</td>
<td>
<ul><li>&#1056;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;&#1086;</li></ul>

</td></tr>
<tr>
<td>9
</td>
<td>Highlight only the individual PartDesign feature in the <a href="../3D_view.html" title="3D view">3D view</a> when the corresponding operation is selected in the <a href="../Tree_view.html" title="Tree view">Tree view</a>
</td>
<td>
<ul><li>No known workaround</li></ul>
</td></tr>
<tr>
<td>10
</td>
<td>Select only the individual PartDesign feature in the <a href="../Tree_view.html" title="Tree view">Tree view</a> when a corresponding element is selected in the <a href="../3D_view.html" title="3D view">3D view</a>.
</td>
<td>
<ul><li>No known workaround</li></ul>
</td></tr>
<tr>
<td>11
</td>
<td>Freeform modeling
</td>
<td>
<ul><li>Model complex shapes in a "traditional" way - e.g. using add-on <a href="../Curves_Workbench.html" title="Curves Workbench">Curves</a> and <a href="../CurvedShapes_Workbench.html" title="CurvedShapes Workbench">CurvedShapes</a> workbenches</li>
<li>Sculpt meshes, for example in <a rel="nofollow" class="external text" href="https://www.blender.org/">Blender</a>, and import them into FreeCAD</li></ul>
</td></tr>
<tr>
<td>12
</td>
<td>Assembly component generators and calculators for: bolted and riveted connections, shafts, splines, keys, cams, gears (spur, bevel, worm), bearings, springs, belts and chains, pins, o-rings
</td>
<td>
<ul><li><a href="../Fasteners_Workbench.html" title="Fasteners Workbench">Fasteners Workbench</a> and <a href="../FCGear_Workbench.html" title="FCGear Workbench">FCGear Workbench</a> but no design calculations available</li>
<li><a href="../PartDesign_WizardShaft.html" title="PartDesign WizardShaft">PartDesign WizardShaft</a> - basic calculations for shafts</li></ul>
</td></tr>
<tr>
<td>13
</td>
<td>A tool for kinematic analysis on properly constrained sketches
</td>
<td>
<ul><li><a href="../Scripting_and_macros.html" title="Scripting and macros">Python scripting</a> - <a rel="nofollow" class="external text" href="https://forum.freecadweb.org/viewtopic.php?f=8&amp;t=68826&amp;start=10#p596531">example</a></li></ul>
</td></tr>
<tr>
<td>14
</td>
<td><a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Geometric_dimensioning_and_tolerancing">GD&amp;T</a> directly on 3D models - <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Model-based_definition">MBD</a> approach
</td>
<td>
<ul><li><a href="../Draft_Workbench.html#Annotation" title="Draft Workbench">Draft Annotation</a> tools</li></ul>
</td></tr></tbody></table>
<!-- 
NewPP limit report
Cached time: 20250626080254
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc, no&#8208;toc&#8208;conversion]
CPU time usage: 0.092 seconds
Real time usage: 0.139 seconds
Preprocessor visited node count: 189/1000000
Post&#8208;expand include size: 424/2097152 bytes
Template argument size: 101/2097152 bytes
Highest expansion depth: 4/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1423/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    9.220      1 -total
 42.63%    3.930      1 Template:Incode
 28.23%    2.603      1 Template:Button
 26.54%    2.447      1 Template:True
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:294801-0!canonical and timestamp 20250626080254 and revision id 1596484. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>