<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Help FreeCAD/sv</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="sv" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Help+FreeCAD&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--high" title="FreeCAD Unterst&uuml;tzen (94% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Help_FreeCAD.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Help FreeCAD (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../tr/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="FreeCAD'e yard&#305;m edin (19% translated)" lang="tr" dir="ltr">T&uuml;rk&ccedil;e</a></li>
<li><a href="../es/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="Ayuda a FreeCAD (68% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--complete" title="Contribuer &agrave; FreeCAD (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../hr/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="Pomozite FreeCAD-u (61% translated)" lang="hr" dir="ltr">hrvatski</a></li>
<li><a href="../it/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--complete" title="Contribuire a FreeCAD (100% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--complete" title="Pom&oacute;&#380; w rozwoju FreeCAD (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--low" title="Ajudar o FreeCAD (3% translated)" lang="pt" dir="ltr">portugu&ecirc;s</a></li>
<li><a href="../pt-br/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="Ajude o FreeCAD (68% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../ro/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="Help FreeCAD (32% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><a href="../fi/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--low" title="Auta FreeCADi&auml; (3% translated)" lang="fi" dir="ltr">suomi</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--high" lang="sv" dir="ltr">svenska</span></li>
<li><a href="../cs/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--low" title="Help FreeCAD (3% translated)" lang="cs" dir="ltr">&#269;e&scaron;tina</a></li>
<li><a href="../bg/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--low" title="Help FreeCAD/bg (0% translated)" lang="bg" dir="ltr">&#1073;&#1098;&#1083;&#1075;&#1072;&#1088;&#1089;&#1082;&#1080;</a></li>
<li><a href="../ru/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--complete" title="&#1055;&#1086;&#1084;&#1086;&#1075;&#1080; FreeCAD (100% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li>
<li><a href="../uk/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--low" title="Help FreeCAD (3% translated)" lang="uk" dir="ltr">&#1091;&#1082;&#1088;&#1072;&#1111;&#1085;&#1089;&#1100;&#1082;&#1072;</a></li>
<li><a href="../zh-cn/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="&#24110;&#21161;FreeCAD (52% translated)" lang="zh-Hans-CN" dir="ltr">&#20013;&#25991;&#65288;&#20013;&#22269;&#22823;&#38470;&#65289;</a></li>
<li><a href="../zh-tw/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="&#24171;&#21161;FreeCAD (16% translated)" lang="zh-Hant-TW" dir="ltr">&#20013;&#25991;&#65288;&#33274;&#28771;&#65289;</a></li>
<li><a href="../ja/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="FreeCAD&#12408;&#12398;&#36002;&#29486; (19% translated)" lang="ja" dir="ltr">&#26085;&#26412;&#35486;</a></li>
<li><a href="../ko/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="FreeCAD &#46037;&#44592; (35% translated)" lang="ko" dir="ltr">&#54620;&#44397;&#50612;</a></li></ul></div>
<div style="clear:right; margin-bottom: .5em; float: right; padding: .5em 0 .8em 1.4em; background: none;"><meta property="mw:PageProp/toc"></div>
<p><span id="Introduction"></span>
</p>
<h2><span class="mw-headline" id="Introduktion">Introduktion</span></h2>
<div class="mw-translate-fuzzy">
<p>Om du gillar FreeCAD och skulle vilja hj&auml;lpa till med dess utveckling, s&aring; finns det m&aring;nga saker du kan g&ouml;ra, &auml;ven om du inte &auml;r en programmerare. Det finns faktiskt n&aring;got att g&ouml;ra f&ouml;r alla: anv&auml;ndare, expertanv&auml;ndare och utvecklare:
</p>
</div>
<p><span id="Donate_money"></span>
</p>
<h2><span class="mw-headline" id="Donera_pengar">Donera pengar</span></h2>
<p>&Auml;ven om FreeCAD inte beh&ouml;ver pengar f&ouml;r att utvecklas, kan donationer hj&auml;lpa projektet att v&auml;xa ytterligare och snabbare. P&aring; sidan <a href="../index.php?title=Donera&amp;action=edit&amp;redlink=1.html" class="new" title="Donera (page does not exist)">Donera</a> finns alla alternativ f&ouml;r att donera pengar till projektet.
</p><p><span id="Work_on_the_documentation"></span>
</p>
<h2><span class="mw-headline" id="Arbeta_med_dokumentationen">Arbeta med dokumentationen</span></h2>
<p>Hj&auml;lp oss att bygga, korrigera och ut&ouml;ka denna dokumentation. Korrigera fel, ut&ouml;ka eller korrigera sidor som &auml;r otydliga, skapa nya sidor om ett &auml;mne saknas, etc. Det &auml;r enkelt att bidra till FreeCAD-wikin. P&aring; <a href="../WikiPages.html" title="WikiPages">WikiPages</a> hittar du allm&auml;nna riktlinjer och den hj&auml;lp du beh&ouml;ver f&ouml;r att komma ig&aring;ng. F&ouml;r att redigera wikin beh&ouml;ver du ett wiki-konto med &rdquo;redigeringsbeh&ouml;righet&rdquo; (wikin &auml;r skrivskyddad f&ouml;r att undvika spam). Du kan beg&auml;ra ett konto <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?f=21&amp;t=6830">p&aring; forumet</a> eller p&aring; <a rel="nofollow" class="external text" href="https://wiki.freecad.org/Help#Chat">IRC-kanalen</a>. Observera att IRC-kanalen kanske inte &auml;r lika responsiv som forumet. <a rel="nofollow" class="external text" href="https://forum.freecad.org">Det officiella FreeCAD-forumet</a> b&ouml;r vara den fr&auml;msta platsen att st&auml;lla fr&aring;gor och starta diskussioner, eftersom det hj&auml;lper till att bevara gemenskapens erfarenhet och kunskap.
</p><p>N&aring;gra omr&aring;den som skulle v&auml;lkomna ditt arbete:
</p>
<ul><li><a href="../sv/List_of_Commands.html" class="mw-redirect" title="List of Commands/sv">Lista p&aring; kommandon</a> sidan listar och dokumenterar alla FreeCADs kommandon. De flesta av dem har bara lite, eller ingen information alls. <a href="../sv/Std_ViewScreenShot.html" title="Std ViewScreenShot/sv">Std_ViewScreenShot</a> sidan &auml;r ett bra exempel p&aring; hur alla andra sidor ska se ut.</li>
<li><a href="../sv/Tutorials.html" title="Tutorials/sv">Handledningar</a> sektionen &auml;r fortfarande mycket d&aring;lig. Om du har gjort n&aring;got h&auml;ftigt med FreeCAD, varf&ouml;r inte ber&auml;tta h&auml;r hur du gjorde det?</li></ul>
<p><span id="Share_your_FreeCAD_knowledge"></span>
</p>
<h2><span class="mw-headline" id="Dela_dina_kunskaper_om_FreeCAD">Dela dina kunskaper om FreeCAD</span></h2>
<p>Anv&auml;ndargemenskapen kring FreeCAD &auml;r fortfarande liten, men omfattar redan flera avancerade anv&auml;ndare som g&ouml;r ett mycket viktigt arbete genom att visa nykomlingar hur man anv&auml;nder programvaran. Om du b&ouml;rjar k&auml;nna dig bekv&auml;m med FreeCAD kan dina kunskaper vara mycket v&auml;rdefulla f&ouml;r andra, och du kan bidra med viktiga tillg&aring;ngar, s&aring;som:
</p>
<ul><li>Visa det arbete du g&ouml;r med FreeCAD p&aring; <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewforum.php?f=24">Users Showcase forum</a>. Du kan l&auml;gga upp sk&auml;rmbilder och, &auml;nnu b&auml;ttre, bifoga FreeCAD-filerna s&aring; att andra kan granska dem och f&ouml;rst&aring; hur du gjorde.</li>
<li>Spela in <a rel="nofollow" class="external text" href="https://www.youtube.com/user/FreeCADNews">videor</a> som visar hur du gjorde n&aring;got intressant i FreeCAD. Dessa videor &auml;r oftast mycket bra f&ouml;r att visa nya funktioner.</li>
<li>Skriv <a href="../Tutorials.html" title="Tutorials">tutorials</a> som beskriver eller l&auml;r ut n&aring;got intressant. Du kan skriva tutorials p&aring; din egen blogg, direkt p&aring; v&aring;r wiki eller till och med p&aring; forumet.</li>
<li>Publicera p&aring; det &ouml;ppna k&auml;llkodsbaserade sociala n&auml;tverket <a rel="nofollow" class="external text" href="https://joinmastodon.org/">Mastodon</a> (och <a rel="nofollow" class="external text" href="https://fosstodon.org/@">FreeCAD f&ouml;lj FreeCAD</a> d&auml;r), p&aring; <a rel="nofollow" class="external text" href="https://www.facebook.com/groups/416491481766626">Facebook</a> communityn eller p&aring; <a rel="nofollow" class="external text" href="https://twitter.com">Twitter</a> (och <a rel="nofollow" class="external text" href="https://twitter.com/FreeCADNews">f&ouml;lj FreeCAD</a> d&auml;r). Anv&auml;nd hashtags #FreeCAD, #MadeWithFreeCAD eller #fc3d f&ouml;r att g&ouml;ra dina FreeCAD-relaterade inl&auml;gg l&auml;ttare att hitta f&ouml;r andra FreeCAD-anv&auml;ndare.</li>
<li>Titta p&aring; de senaste FreeCAD-inl&auml;ggen p&aring; <a rel="nofollow" class="external text" href="https://www.reddit.com/search/?">q=freecad&amp;type=link&amp;sort=new Reddit</a>, <a rel="nofollow" class="external text" href="https://3dprinting.stackexchange.com/search?tab=newest&amp;q=freecad">3dprinting.stackexchange</a>, <a rel="nofollow" class="external text" href="https://stackoverflow.com/search?q=freecad">StackOverflow</a>... F&ouml;rs&ouml;k att svara p&aring; dem och delta i diskussionerna genom att dela med dig av dina erfarenheter och din information.</li>
<li>Var n&auml;rvarande p&aring; FreeCAD IRC-kanalen eller <a rel="nofollow" class="external text" href="https://www.freecad.org/wiki/Help#Chat">andra chattgrupper</a>.</li></ul>
<p><span id="Translate_FreeCAD"></span>
</p>
<h2><span id=".C3.96vers.C3.A4tt_FreeCAD"></span><span class="mw-headline" id="&Ouml;vers&auml;tt_FreeCAD">&Ouml;vers&auml;tt FreeCAD</span></h2>
<p>&Ouml;vers&auml;tt FreeCAD till ditt eget spr&aring;k. Alla textstr&auml;ngar i FreeCAD-gr&auml;nssnittet kan enkelt &ouml;vers&auml;ttas till andra spr&aring;k. Allt vi beh&ouml;ver &auml;r n&aring;gon som kan det andra spr&aring;ket och &auml;r villig att hj&auml;lpa till! Alla &ouml;vers&auml;ttningar g&ouml;rs online p&aring; <a rel="nofollow" class="external text" href="https://crowdin.net/project/freecad">Crowdin</a>.
</p><p>F&ouml;r mer information om &ouml;vers&auml;ttning, se <a href="../Localisation.html" title="Localisation">Lokalisering</a>.
</p><p><span id="Translate_the_documentation"></span>
</p>
<h2><span id=".C3.96vers.C3.A4tt_dokumentationen"></span><span class="mw-headline" id="&Ouml;vers&auml;tt_dokumentationen">&Ouml;vers&auml;tt dokumentationen</span></h2>
<p>&Ouml;vers&auml;ttning &auml;r enkelt, FreeCAD-wikin st&ouml;der ett &ouml;vers&auml;ttnings-till&auml;gget som g&ouml;r det m&ouml;jligt att &ouml;vers&auml;tta den engelska basversionen till andra spr&aring;k.
</p><p>F&ouml;r mer information om &ouml;vers&auml;ttning, se <a href="../Localisation.html#Translating_the_wiki" title="Localisation">Localisation#Translating the wiki</a>.
</p><p>Se till att du &auml;r bekant med grunderna i wiki-markering; se <a href="../Help;Editing.html" title="Help:Editing">Help:Editing</a> f&ouml;r referens.
</p><p>G&aring; sedan till <a href="../WikiPages.html" title="WikiPages">WikiPages</a> f&ouml;r att bekanta dig med den stil som anv&auml;nds i denna wiki, s&auml;rskilt n&auml;r det g&auml;ller mallar.
</p><p><span id="Help_others_to_know_FreeCAD"></span>
</p>
<h2><span id="Hj.C3.A4lp_andra_att_l.C3.A4ra_k.C3.A4nna_FreeCAD"></span><span class="mw-headline" id="Hj&auml;lp_andra_att_l&auml;ra_k&auml;nna_FreeCAD">Hj&auml;lp andra att l&auml;ra k&auml;nna FreeCAD</span></h2>
<ul><li>Ber&auml;tta om FreeCAD f&ouml;r andra som kan vara intresserade</li>
<li>Hitta intressanta anv&auml;ndningsomr&aring;den f&ouml;r FreeCAD och dokumentera dem, till exempel med sk&auml;rmbilder. FreeCAD &auml;r fortfarande mycket nytt och det &auml;r inte m&aring;nga som vet vad man kan g&ouml;ra med det. Om du redan &auml;r ett fan av FreeCAD vet du s&auml;kert om n&aring;gra h&auml;ftiga saker som FreeCAD kan g&ouml;ra. Hj&auml;lp oss att visa det f&ouml;r andra!</li>
<li>H&auml;ng p&aring; forumet och hj&auml;lp nykomlingar att l&ouml;sa grundl&auml;ggande fr&aring;gor</li>
<li>Skriv handledningar, spela in videor etc. som visar vad du g&ouml;r med FreeCAD</li>
<li>Bidra med filer, ritningar etc. Vi saknar fortfarande bra exempel p&aring; vad man kan g&ouml;ra med FreeCAD</li>
<li>Hj&auml;lp till att marknadsf&ouml;ra FreeCAD p&aring; GitHub genom att <a rel="nofollow" class="external text" href="https://help.github.com/articles/be-social/#watch-a-project">&rdquo;stj&auml;rnmarkera&rdquo; och &rdquo;bevaka&rdquo;</a> <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD">FreeCAD-arkivet</a></li></ul>
<p><span id="Report_bugs_and_ask_for_interesting_features"></span>
</p>
<h3><span class="mw-headline" id="Rapportera_buggar_och_be_om_intressanta_funktioner">Rapportera buggar och be om intressanta funktioner</span></h3>
<ul><li><a rel="nofollow" class="external text" href="http://sourceforge.net/tracker/?group_id=49159&amp;atid=455298">Rapportera buggar</a>, om du hittar n&aring;gra. Var f&ouml;rsiktig och f&ouml;rs&auml;kra dig om att det du har hittat verkligen &auml;r en bugg, vilket &auml;r n&aring;got som ska fungera, men g&ouml;r det inte. Beskriv och ge tillr&auml;ckligt med information om hur man framkallar buggen, s&aring; att n&aring;gon kan reproducera den.</li>
<li><a rel="nofollow" class="external text" href="http://sourceforge.net/tracker/?group_id=49159&amp;atid=455301">F&ouml;resl&aring; nya funktioner</a>, ingen kan garantera att din &ouml;nskan kommer att uppfyllas, men du kanske kan komma med en intressant ide. Innan di postar en officiell funktionsbeg&auml;ran, s&aring; kan det vara en bra ide att diskutera den p&aring; <a rel="nofollow" class="external text" href="http://forum.freecad.org/index.php">forumet</a>, f&ouml;r att se vad andra tycker om den.</li></ul>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=Bugreport-workflow.png&amp;filetimestamp=20170609105123&amp;.html" class="mw-file-description"><img src="../File/Bugreport-workflow.png" decoding="async" width="871" height="83" class="mw-file-element" data-file-width="871" data-file-height="83"></a><figcaption></figcaption></figure>
<p>&Auml;ven om platsen f&ouml;r att rapportera bekr&auml;ftade buggar och f&ouml;resl&aring; nya funktioner i slut&auml;ndan &auml;r &rsquo;&rsquo;'<a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/issues">FreeCAD Issue Tracker p&aring; GitHub</a>&rsquo;&rsquo;', ska du alltid f&ouml;rst publicera buggrapporter och funktionsf&ouml;rfr&aring;gningar i hj&auml;lpforumet. F&ouml;r att spara tid f&ouml;r utvecklarna (det kan vara mycket tidskr&auml;vande att sortera och hantera sv&aring;rf&ouml;rst&aring;eliga buggar) och undvika frustrationer p&aring; grund av att ditt &auml;rende inte hanterades p&aring; det s&auml;tt du &ouml;nskade, l&auml;s f&ouml;ljande:
</p>
<ul><li>Buggar och &ouml;nskem&aring;l om funktioner hanteras i samma tracker. Markera bara ditt &auml;rende som &rdquo;bug&rdquo; (n&aring;got som inte fungerar som det ska) eller &rdquo;feature&rdquo; (n&aring;got som inte finns men som du tycker skulle vara bra att ha)</li>
<li>Ursprungligen kunde du skicka in problem anonymt, men tyv&auml;rr m&aring;ste detta avbrytas p&aring; grund av spam. Om du vill skapa/redigera &auml;renden m&aring;ste du nu skapa ett konto. Du kommer d&aring; som standard att f&aring; ett meddelande n&auml;r n&aring;gon l&auml;gger till anteckningar till problemet. I m&aring;nga fall kommer den person som hanterar buggen att beh&ouml;va mer information fr&aring;n dig.</li>
<li>N&auml;r du rapporterar ett fel &auml;r det viktigaste att utvecklare kan &aring;terskapa det. Se till att inkludera de exakta stegen som kr&auml;vs f&ouml;r att felet ska uppst&aring;, s&aring; att en annan person kan g&ouml;ra samma sak och se felet uppst&aring; p&aring; sin dator ocks&aring;. Om utvecklaren inte kan se felet kan han inte heller l&ouml;sa det.</li>
<li>Inkludera ocks&aring; information som kan hj&auml;lpa utvecklare att lokalisera problemet, till exempel vilket operativsystem du k&ouml;r FreeCAD p&aring;, den exakta versionen av FreeCAD och relevanta bibliotek. V&auml;nligen skicka alla uppgifter genom att anv&auml;nda knappen &rdquo;kopiera till urklipp&rdquo; i dialogrutan Hj&auml;lp (meny) &rarr; Om FreeCAD.</li>
<li>Oavsett hur s&auml;ker du &auml;r p&aring; att du har hittat ett fel, diskutera alltid fel f&ouml;rst i <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewforum.php?f=3">Hj&auml;lpforum</a>.</li>
<li>Innan du skickar in en funktionsf&ouml;rfr&aring;gan, diskutera den alltid f&ouml;rst med andra anv&auml;ndare p&aring; <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewforum.php?f=8">&Ouml;ppet diskussionsforum</a>, s&aring; att du kan f&aring; ett mer konkret f&ouml;rslag, med st&ouml;rre chans att v&auml;cka en utvecklares intresse f&ouml;r att implementera det.</li>
<li>Kom ih&aring;g att FreeCAD utvecklas av volont&auml;rer som anv&auml;nder sin fritid f&ouml;r att arbeta med det. &Auml;ven om alla g&ouml;r sitt b&auml;sta f&ouml;r att skapa den b&auml;sta m&ouml;jliga applikationen kan din felrapport behandlas med l&aring;g prioritet eller avbrytas om du inte kan ge tillr&auml;cklig information, och din funktionsf&ouml;rfr&aring;gan kan skjutas upp eller till och med avsl&aring;s om ingen utvecklare &auml;r intresserad av att implementera den eller om det skulle kr&auml;va en orealistisk m&auml;ngd arbete.</li></ul>
<p><span id="Triage_bugs"></span>
</p>
<h2><span class="mw-headline" id="Granska_buggar">Granska buggar</span></h2>
<p>Varje vecka rapporteras dussintals buggar p&aring; <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/issues">GitHub</a>. Det tar mycket tid att l&auml;sa igenom dem, kategorisera dem, verifiera om problemet &auml;r reproducerbart, se om det finns n&aring;gra enkla &aring;tg&auml;rder som kan vidtas eller be personen som rapporterat problemet att ge mer information. Det &auml;r enkelt att hj&auml;lpa till med triageringen, g&aring; bara till <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/issues">GitHub</a> och b&ouml;rja kommentera alla problem som du tror att du kan hj&auml;lpa till med!
</p><p><span id="Design_artwork"></span>
</p>
<h2><span class="mw-headline" id="Designa_grafiskt_material">Designa grafiskt material</span></h2>
<p>Se sidan <a href="../Artwork.html" title="Artwork">Artwork</a> och <a href="../Artwork_Guidelines.html" title="Artwork Guidelines">Artwork Guidelines</a> f&ouml;r riktlinjer om hur man designar ikoner f&ouml;r FreeCAD.
</p><p><span id="Write_code"></span>
</p>
<div class="mw-translate-fuzzy">
<h3><span id="Programmera.21"></span><span class="mw-headline" id="Programmera!">Programmera!</span></h3>
<ul><li>Om du kan lite om pythonspr&aring;ket, programmera n&aring;gra anv&auml;ndbara <a href="../sv/Scripting.html" class="mw-redirect" title="Scripting/sv">skript</a>. Du kanske vill ha n&aring;gon liten funktion som saknas? Eller du k&auml;nner dig tillr&auml;ckligt modig f&ouml;r att b&ouml;rja programmera n&aring;got nytt verktyg? Titta i skript sektionen, eller g&aring; till forumet och diskutera dina ideer, du kommer s&auml;kert att hitta mycket hj&auml;lp.</li>
<li>Om du kan programmera i C++, s&aring; &auml;r du klar f&ouml;r st&ouml;rre saker. g&aring; till <a href="../sv/Developer_hub.html" title="Developer hub/sv">Utvecklarsidan</a>!</li></ul>
</div>
<p>Att skriva kod f&ouml;r FreeCAD &auml;r inte sv&aring;rt, och du beh&ouml;ver ingen beh&ouml;righet. Du kan b&ouml;rja direkt med att arbeta p&aring; n&aring;got du vill, sedan skicka in en patch p&aring; <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/issues">issue tracker</a> eller beg&auml;ra en sammanslagning fr&aring;n en <a rel="nofollow" class="external text" href="https://github.com/FreeCAD">git branch</a>. F&ouml;r att undvika huvudv&auml;rk b&ouml;r du f&ouml;rst uppfylla f&ouml;ljande f&ouml;ruts&auml;ttningar:
</p>
<ul><li>Information <a href="../Developer_hub.html#Compiling_FreeCAD" title="Developer hub">om hur man kompilerar FreeCAD</a> finns tillg&auml;nglig f&ouml;r olika operativsystem.</li>
<li>Innan du b&ouml;rjar koda f&ouml;r FreeCAD m&aring;ste du veta hur FreeCAD fungerar. Detta verkar sj&auml;lvklart, men om du inte vet hur det ska fungera vet du inte vad du ska g&ouml;ra internt eller hur du ska g&ouml;ra det.</li>
<li>N&auml;stan allt kan g&ouml;ras i antingen Python eller C++. Det interna fungerar n&auml;stan p&aring; samma s&auml;tt i b&aring;da spr&aring;ken. Vi f&ouml;resl&aring;r att du l&auml;ser igenom sidorna p&aring; <a href="../Power_users_hub.html" title="Power users hub">Power users hub</a>, &auml;ven om du ska koda i C++, eftersom det ger dig en bra &ouml;versikt &ouml;ver det interna.</li>
<li>Om du ska arbeta i C++, se till att du f&ouml;rst kan kompilera FreeCAD utan problem.</li>
<li>Presentera dig f&ouml;r andra utvecklare. FreeCAD &auml;r framf&ouml;r allt ett socialt projekt, vi diskuterar m&aring;nga saker p&aring; <a rel="nofollow" class="external text" href="https://forum.freecad.org">forum</a> innan vi implementerar dem, och det &auml;r alltid b&auml;st att diskutera dina id&eacute;er och ber&auml;tta f&ouml;r andra vad du planerar att g&ouml;ra innan du faktiskt g&ouml;r det. Vi har ocks&aring; en <a rel="nofollow" class="external text" href="https://wiki.freecad.org/Help#Chat">IRC-kanal</a> som &auml;r synkroniserad med v&aring;r <a rel="nofollow" class="external text" href="https://matrix.to/#/#FreeCAD_FreeCAD:gitter.im">Matrix</a>-kanal, samt en <a rel="nofollow" class="external text" href="https://discord.gg/w2cTKGzccC">Discord-kanal</a>.</li>
<li>Sedan 2016 deltar FreeCAD ocks&aring; i <a href="../Google_Summer_of_Code_2020.html" title="Google Summer of Code 2020">Google Summer of Code 2020</a>. Se till att kolla in v&aring;ra id&eacute;er d&auml;r om du &auml;r intresserad av att delta i n&auml;sta upplaga.</li>
<li>Allt fler av FreeCAD:s funktioner skrivs inte i sj&auml;lva FreeCAD-koden utan i till&auml;gg, makron och ut&ouml;kningar. Tillsammans &auml;r det detta ekosystem som g&ouml;r FreeCAD s&aring; kraftfullt. Ofta &auml;r det enklare att arbeta med ett till&auml;gg eftersom det finns mindre kod att l&auml;sa och f&ouml;rst&aring;, och f&auml;rre personer &auml;r inblandade. Kolla in <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD-addons">Addons repository</a> och <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD-macros">Macros repository</a> f&ouml;r att f&aring; n&aring;gra id&eacute;er!</li></ul>
<p><span id="Create_models"></span>
</p>
<h2><span class="mw-headline" id="Skapa_modeller">Skapa modeller</span></h2>
<p>FreeCAD har ett <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD-library">modellbibliotek</a> som &auml;r gratis och &ouml;ppet f&ouml;r alla. Varf&ouml;r inte l&auml;gga till n&aring;gra anv&auml;ndbara delar d&auml;r, som kan &aring;teranv&auml;ndas av andra? Se till att skapa modellerna sj&auml;lv fr&aring;n grunden, s&aring; att biblioteket f&ouml;rblir 100&nbsp;% fritt fr&aring;n eventuellt upphovsr&auml;ttsskyddade eller icke-fria komponenter.
</p><p><br>
</p>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><span typeof="mw:File"><a href="../index.php?title=User_hub.png&amp;filetimestamp=20190221145008&amp;.html" class="mw-file-description"><img src="../File/User_hub.png" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../sv/User_hub.html" title="User hub/sv">User documentation</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b><a href="../sv/Getting_started.html" title="Getting started/sv">Getting started</a></b></li>
<li><b>Installation:</b> <a href="../sv/Download.html" title="Download/sv">Download</a>, <a href="../sv/Installing_on_Windows.html" title="Installing on Windows/sv">Windows</a>, <a href="../sv/Installing_on_Linux.html" title="Installing on Linux/sv">Linux</a>, <a href="../sv/Installing_on_Mac.html" title="Installing on Mac/sv">Mac</a>, <a href="../sv/Installing_additional_components.html" title="Installing additional components/sv">Additional components</a>, <a href="../index.php?title=Compile_on_Docker/sv&amp;action=edit&amp;redlink=1.html" class="new" title="Compile on Docker/sv (page does not exist)">Docker</a>, <a href="../index.php?title=AppImage/sv&amp;action=edit&amp;redlink=1.html" class="new" title="AppImage/sv (page does not exist)">AppImage</a>, <a href="../index.php?title=Ubuntu_Snap/sv&amp;action=edit&amp;redlink=1.html" class="new" title="Ubuntu Snap/sv (page does not exist)">Ubuntu Snap</a></li>
<li><b>Basics:</b> <a href="../sv/About_FreeCAD.html" title="About FreeCAD/sv">About FreeCAD</a>, <a href="../index.php?title=Interface/sv&amp;action=edit&amp;redlink=1.html" class="new" title="Interface/sv (page does not exist)">Interface</a>, <a href="../sv/Mouse_navigation.html" title="Mouse navigation/sv">Mouse navigation</a>, <a href="../index.php?title=Selection_methods/sv&amp;action=edit&amp;redlink=1.html" class="new" title="Selection methods/sv (page does not exist)">Selection methods</a>, <a href="../index.php?title=Object_name/sv&amp;action=edit&amp;redlink=1.html" class="new" title="Object name/sv (page does not exist)">Object name</a>, <a href="../sv/Preferences_Editor.html" title="Preferences Editor/sv">Preferences</a>, <a href="../sv/Workbenches.html" title="Workbenches/sv">Workbenches</a>, <a href="../sv/Document_structure.html" title="Document structure/sv">Document structure</a>, <a href="../sv/Property.html" title="Property/sv">Properties</a>, <a class="mw-selflink selflink">Help FreeCAD</a>, <a href="../index.php?title=Donate/sv&amp;action=edit&amp;redlink=1.html" class="new" title="Donate/sv (page does not exist)">Donate</a></li></ul>
<hr>
<ul><li><b>Help:</b> <a href="../sv/Tutorials.html" title="Tutorials/sv">Tutorials</a>, <a href="../index.php?title=Video_tutorials/sv&amp;action=edit&amp;redlink=1.html" class="new" title="Video tutorials/sv (page does not exist)">Video tutorials</a></li>
<li><b><a href="../sv/Workbenches.html" title="Workbenches/sv">Workbenches</a>:</b> <a href="../index.php?title=Std_Base/sv&amp;action=edit&amp;redlink=1.html" class="new" title="Std Base/sv (page does not exist)">Std Base</a>, <a href="../index.php?title=Assembly_Workbench/sv&amp;action=edit&amp;redlink=1.html" class="new" title="Assembly Workbench/sv (page does not exist)">Assembly</a>, <a href="../index.php?title=BIM_Workbench/sv&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Workbench/sv (page does not exist)">BIM</a>, <a href="../sv/CAM_Workbench.html" title="CAM Workbench/sv">CAM</a>, <a href="../sv/Draft_Workbench.html" title="Draft Workbench/sv">Draft</a>, <a href="../sv/FEM_Workbench.html" title="FEM Workbench/sv">FEM</a>, <a href="../sv/Inspection_Workbench.html" title="Inspection Workbench/sv">Inspection</a>, <a href="../index.php?title=Material_Workbench/sv&amp;action=edit&amp;redlink=1.html" class="new" title="Material Workbench/sv (page does not exist)">Material</a>, <a href="../sv/Mesh_Workbench.html" title="Mesh Workbench/sv">Mesh</a>, <a href="../sv/OpenSCAD_Workbench.html" title="OpenSCAD Workbench/sv">OpenSCAD</a>, <a href="../sv/Part_Workbench.html" title="Part Workbench/sv">Part</a>, <a href="../sv/PartDesign_Workbench.html" title="PartDesign Workbench/sv">PartDesign</a>, <a href="../sv/Points_Workbench.html" title="Points Workbench/sv">Points</a>, <a href="../sv/Reverse_Engineering_Workbench.html" title="Reverse Engineering Workbench/sv">Reverse Engineering</a>, <a href="../sv/Robot_Workbench.html" title="Robot Workbench/sv">Robot</a>, <a href="../sv/Sketcher_Workbench.html" title="Sketcher Workbench/sv">Sketcher</a>, <a href="../sv/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/sv">Spreadsheet</a>, <a href="../sv/Surface_Workbench.html" title="Surface Workbench/sv">Surface</a>, <a href="../sv/TechDraw_Workbench.html" title="TechDraw Workbench/sv">TechDraw</a>, <a href="../sv/Testing.html" title="Testing/sv">Test Framework</a></li></ul>
<hr>
<ul><li><b><a href="../index.php?title=Addon/sv&amp;action=edit&amp;redlink=1.html" class="new" title="Addon/sv (page does not exist)">Addons</a>:</b> <a href="../index.php?title=Std_AddonMgr/sv&amp;action=edit&amp;redlink=1.html" class="new" title="Std AddonMgr/sv (page does not exist)">Addon Manager</a>, <a href="../index.php?title=External_workbenches/sv&amp;action=edit&amp;redlink=1.html" class="new" title="External workbenches/sv (page does not exist)">External workbenches</a>, <a href="../index.php?title=Scripting_and_macros/sv&amp;action=edit&amp;redlink=1.html" class="new" title="Scripting and macros/sv (page does not exist)">Scripting and macros</a></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="../sv/User_hub.html" title="User hub/sv">User hub</a>, <a href="../sv/Power_users_hub.html" title="Power users hub/sv">Power users hub</a>, <a href="../sv/Developer_hub.html" title="Developer hub/sv">Developer hub</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20251012150006
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.107 seconds
Real time usage: 0.126 seconds
Preprocessor visited node count: 146/1000000
Post&#8208;expand include size: 5782/2097152 bytes
Template argument size: 1905/2097152 bytes
Highest expansion depth: 5/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 3722/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    6.851      1 -total
 78.28%    5.363      1 Template:Userdocnavi/sv
 40.04%    2.743      1 Template:Navigation_menu_2
 18.16%    1.244      1 Template:TOCright
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:27729-0!canonical and timestamp 20251012150006 and revision id 1660831. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>