<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Engine Block Tutorial/es</span></h1><?xml encoding="UTF-8"><div class="mw-parser-output"><div class="mw-pt-languages noprint" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../de/Engine_Block_Tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Motorblock Tutorium (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Engine_Block_Tutorial.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Engine Block Tutorial (100% translated)" lang="en" dir="ltr">English</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--low" lang="es" dir="ltr">espa&ntilde;ol</span></li>
<li><a href="../fr/Engine_Block_Tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Tutoriel pour cr&eacute;er un bloc moteur (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/Engine_Block_Tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Tutorial Blocco Motore (100% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Engine_Block_Tutorial.html" class="mw-pt-progress mw-pt-progress--stub" title="Poradnik: Blok silnika (8% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../ro/Engine_Block_Tutorial.html" class="mw-pt-progress mw-pt-progress--low" title="Tutorial Bloc Motor (25% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><a href="../ru/Engine_Block_Tutorial.html" class="mw-pt-progress mw-pt-progress--med" title="&#1052;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1041;&#1083;&#1086;&#1082;&#1072; &#1062;&#1080;&#1083;&#1080;&#1085;&#1076;&#1088;&#1086;&#1074; (43% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li></ul></div>
<div style="text-align:center; background:#FDE0A8;margin:1em 7em;padding:0.5em 2em;border:2px solid #FF5706;">
<p>This documentation is not finished. Please help and contribute documentation.
</p><p><a href="../GuiCommand_model.html" title="GuiCommand model">GuiCommand model</a> explains how commands should be documented. Browse <a href="../Category;UnfinishedDocu.html" title="Category:UnfinishedDocu">Category:UnfinishedDocu</a> to see more incomplete pages like this one. See <a href="../Category;Command_Reference.html" title="Category:Command Reference">Category:Command Reference</a> for all commands.
</p><p>See <a href="../WikiPages.html" title="WikiPages">WikiPages</a> to learn about editing the wiki pages, and go to <a href="../Help_FreeCAD.html" title="Help FreeCAD">Help FreeCAD</a> to learn about other ways in which you can contribute.
</p>
</div> 
<div class="mw-translate-fuzzy">
<table class="fcinfobox wikitable ct" style="width: 230px; float: right; margin-left: 1em">
<tbody><tr>
<td class="ctTitle" style="font-weight: bold; font-size: 125%;"><span typeof="mw:File"><span><img src="../File/Freecad.svg" decoding="async" width="32" height="32"></span></span> Tutorial
</td></tr>
<tr>
<th class="ctOdd">Tema
</th></tr>
<tr>
<td class="ctEven">Part Workbench
</td></tr>
<tr>
<th class="ctOdd">Nivel
</th></tr>
<tr>
<td class="ctEven">Beginner
</td></tr>
<tr>
<th class="ctOdd">Tiempo para completar
</th></tr>
<tr>
<td class="ctEven">
</td></tr>
<tr>
<th class="ctOdd">Autores
</th></tr>
<tr>
<td class="ctEven">
</td></tr>
<tr>
<th class="ctOdd">Versi&oacute;n de FreeCAD
</th></tr>
<tr>
<td class="ctEven">
</td></tr>
<tr>
<th class="ctOdd">Archivos de ejemplos
</th></tr>
<tr>
<td class="ctEven">
</td></tr>
<tr>
<th class="ctOdd">Ver tambi&eacute;n
</th></tr>
<tr>
<td class="ctEven"><i>None</i>
</td></tr>
<tr>
<td class="ctToc"><br><meta property="mw:PageProp/toc">
</td></tr></tbody></table>
</div>
<div class="mw-translate-fuzzy">
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=Engine_Block_Tutorial_-_Finished_Engine_Block.png&amp;filetimestamp=20110526172237&amp;.html" class="mw-file-description"><img src="../File/Engine_Block_Tutorial_-_Finished_Engine_Block.png" decoding="async" width="300" height="181"></a><figcaption></figcaption></figure>
</div>
<p><br>
</p>
<div class="mw-translate-fuzzy">
<p>Este es un tutorial de introducci&oacute;n al modelado en FreeCAD.  El prop&oacute;sito del tutorial es introducirte a los tipos de datos primitivos para los objetos param&eacute;tricos, operaciones booleanas, croquizado 2D, y el proceso de convertir croquis 2D en modelos 3D.  purposes of the tutorial are to introduce you to the primitive data types for parametric objects, boolean operations, 2D drafting, and the process of converting 2D drafts into 3D models.  Como ejemplo de trabajo modelaremos el bloque de un motor simple y el c&aacute;rter visto a la derecha.
</p>
</div>
<div class="mw-translate-fuzzy">
<h2><span class="mw-headline" id="Empezando">Empezando</span></h2>
<p>Para empezar, abre FreeCAD, ve a <i>Archivo -&gt; Nuevo</i> para crear un nuevo documento, y luego a <i>Archivo -&gt; Guardar</i> para guardarlo en tu equipo, he llamado a mi proyecto 'Engine'. Habr&aacute;s notado que despu&eacute;s de guardar el proyecto, la <i>vista en &aacute;rbol</i> a la izquierda de la pantalla mostrar&aacute; el nombre del proyecto en el que estas trabajando. Puedes tener m&aacute;s de un proyecto abierto a la vez y cada proyecto se mostrar&aacute; como la ra&iacute;z de un &aacute;rbol en la vista en &aacute;rbol.
</p>
</div>
<div class="mw-translate-fuzzy">
<h2><span class="mw-headline" id="Definiendo_el_bloque">Definiendo el bloque</span></h2>
<p>Ahora empezaremos a trabajar en el modelo actual. Comenzaremos a&ntilde;adiendo un cubo para el contorno del bloque motor. Para ello necesitamos a&ntilde;adir una <i>pieza</i> al modelo, ve a Vista-&gt;Entorno-&gt;Pieza para seleccionar el <a href="../es/Part_Workbench.html" title="Part Workbench/es">M&oacute;dulo de Pieza</a>. Observaras que despu&eacute;s de seleccionar el entorno, tienes una configuraci&oacute;n de barras de botones diferente en las barras de herramientas de arriba. Cambia a algunos de los otros entornos para familiarizarte con el sistema de entornos y luego vuelve al m&oacute;dulo de pieza.
</p>
</div>
<div class="mw-translate-fuzzy">
<h3><span class="mw-headline" id="El_alojamiento">El alojamiento</span></h3>
<p>En el m&oacute;dulo de pieza ver&aacute;s un pu&ntilde;ado de iconos para crear objetos primitivos como cubos, esferas, conos, etc. Pulsa el icono del cubo (<span typeof="mw:File"><a href="../index.php?title=Part_Box.svg&amp;filetimestamp=20240710103459&amp;.html" class="mw-file-description"><img src="../File/Part_Box.svg" decoding="async" width="16" height="16"></a></span>) para a&ntilde;adir un cubo a la escena. Cada una de las primitivas listada tiene un conjunto de par&aacute;metros que son definidos cuando se a&ntilde;ade la primitiva. Si quieres puedes a&ntilde;adir un tipo de cada primitiva para ver como son. Las primitivas se pueden eliminar de la escena seleccion&aacute;ndolas y pulsando la tecla de suprimir. Existen dos modos de seleccionar objetos, puedes pulsar con el bot&oacute;n izquierdo del rat&oacute;n en la vista 3D, o hacer clic sobre ellos en la vista en &aacute;rbol. En ambos casos, manteniendo la tecla CTRL pulsada te permitir&aacute; seleccionar m&uacute;ltiples elementos. Puedes hacer un zoom en la vista 3D moviendo la rueda de tu rat&oacute;n. Para encuadrar la vista pulsar el bot&oacute;n del medio y mover el rat&oacute;n. Para girar la vista mant&eacute;n presionado el bot&oacute;n central del rat&oacute;n y sin soltarlo presiona el bot&oacute;n izquierdo y mueve el rat&oacute;n. Tambien puedes hacer clic con el bot&oacute;n del medio en alguna parte de tu modelo 3D para hacer que la vista gire alrededor de dicho punto.  Tambi&eacute;n, los n&uacute;meros 1-6 y el 0 te mostrar&aacute;n carias vistas de la escena (planta, alzado, axonom&eacute;trica, etc.). Dedica un minuto o dos habitu&aacute;ndote con la manipulaci&oacute;n de las vistas 3D.
</p>
</div>
<div class="mw-translate-fuzzy">
<dl><dd><i>Lectura adicional: <a href="../es/Mouse_Model.html" class="mw-redirect" title="Mouse Model/es">Navegando en el espacio 3D</a></i></dd></dl>
</div>
<div class="mw-translate-fuzzy">
<p>Una vez que tengas el cubo y est&eacute;s habituado al funcionamiento del rat&oacute;n, comenzaremos definiendo las dimensiones del modelo CAD. Selecciona el cubo haciendo clic en la vista en &aacute;rbol y pulsa en la pesta&ntilde;a 'Datos' en la <i>Vista de Propiedades</i> ubicada debajo de la vista en &aacute;rbol (ve a <i>Vista -&gt; Vistas -&gt; Vista de Propiedades</i> di la has cerrado). En la pesta&ntilde;a Datos puedes modificar las propiedades del objeto que has seleccionado. Dependiendo del tipo de objeto seleccionado habr&aacute; diferentes par&aacute;metros para establecer en la pesta&ntilde;a de Datos. Para un cubo necesitamos 3 vectores, uno para su ubicaci&oacute;n en el espacio 3D, otro para su orientaci&oacute;n, y el tercero para especificar sus dimensiones. Para una esfera podr&iacute;as especificar el centro, y el radio; Los conos tienen un radio,a altura y posici&oacute;n; etc. Estamos construyendo un peque&ntilde;o bloque motor de 2 cilindros de modo que establece el tama&ntilde;o y posici&oacute;n del cubo a los valores siguientes (aseg&uacute;rate de que pones los XYZ en la 'Posici&oacute;n', los de 'Eje' establecen el eje de rotaci&oacute;n y los valores por defecto est&aacute;n como queremos):
</p>
</div>
<div class="mw-translate-fuzzy">
<dl><dd><table class="wikitable" border="1">

<tbody><tr>
<td>X:  0.0 mm</td>
<td>Altura: 110.0 mm
</td></tr>
<tr>
<td>Y:  -40.0 mm</td>
<td>Largo: 140.0 mm
</td></tr>
<tr>
<td>Z:  0.0 mm</td>
<td>Ancho: 80.0 mm
</td></tr>
</tbody></table></dd></dl>
</div>
<div class="mw-translate-fuzzy">
<p>Ahora que tienes el bloque motor dimensionado adecuadamente deber&iacute;amos darle un nombre de descripci&oacute;n. Selecci&oacute;nalo en la vista en &aacute;rbol y pulsa en el bot&oacute;n derecho para renombrarlo o presiona la tecla <i>F2</i>. Ll&aacute;malo "Alojamiento'.
</p>
</div>
<div class="mw-translate-fuzzy">
<h3><span class="mw-headline" id="El_primer_cilindro">El primer cilindro</span></h3>
<p>Despu&eacute;s tallaremos el primer cilindro a trav&eacute;s de todo el bloque motor. Para ello a&ntilde;adiremos un cilindro al modelo con el tama&ntilde;o que queramos abrir y haremos una operaci&oacute;n booleana para "restar" el material del bloque. Pulsa el icono para a&ntilde;adir un cilindro (<span typeof="mw:File"><a href="../index.php?title=Part_Cylinder.png&amp;filetimestamp=20170322212906&amp;.html" class="mw-file-description"><img src="../File/Part_Cylinder.png" decoding="async" width="16" height="16"></a></span>) y luego selecci&oacute;nalo y establece sus propiedades a las siguientes:
</p>
</div>
<dl><dd><table class="wikitable" border="1">

<tbody><tr>
<td>X:  40.0 mm</td>
<td>Altura: 110.0 mm
</td></tr>
<tr>
<td>Y:  0.0 mm</td>
<td>Radio: 25.0 mm
</td></tr>
<tr>
<td>Z:  0.0 mm</td>
<td>
</td></tr>
</tbody></table></dd></dl>
<div class="mw-translate-fuzzy">
<p>Una vez que las propiedades est&eacute;n establecidas correctamente deber&iacute;as ver las caras circulares del cilindro en las partes superior e inferior del bloque motor. Ll&aacute;malo <i>Cilindro 1</i> seleccion&aacute;ndolo en la vista en &aacute;rbol.
</p>
</div>
<div class="mw-translate-fuzzy">
<h3><span class="mw-headline" id="El_segundo_cilindro">El segundo cilindro</span></h3>
<p>Podr&iacute;amos hacer el segundo cilindro del mismo modo, sin embargo es mucho m&aacute;s sencillo copiar el primer cilindro y cambiar la coordenada X de su ubicaci&oacute;n. Para ello, selecciona el <i>Cilindro 1</i> y ve a <i>Editar -&gt; Duplicar selecci&oacute;n</i>. Ver&aacute;s que el segundo cilindro aparece en la vista en &aacute;rbol (ll&aacute;malo <i>Cilindro 2</i>), pero no lo ver&aacute;s en la vista 3D ya que est&aacute; ubicado en la misma posici&oacute;n que el primer cilindro. Ahora selecciona el <i>Cilindro 2</i> en la vista en &aacute;rbol y cambia su coordenada X por 100 mm. Observar&aacute;s que como se ha movido el cilindro en la vista 3D. Una vez que el segundo cilindro est&eacute; debidamente ubicado puedes verlo seleccionando el <i>Alojamiento</i> y pulsando la <i>barra espaciadora</i> para ocultarlo (Observa que los objetos ocultos est&aacute;n difuminados en la vista en &aacute;rbol). Oculta los tres objetos uno a uno y luego vuelve a mostrarlos pulsando de nuevo la barra espaciadora al seleccionarlos en la vista en &aacute;rbol.
</p>
</div>
<p><span id="Boring_out_the_Cylinders"></span>
</p>
<h3><span class="mw-headline" id="Tallando_los_cilindros">Tallando los cilindros</span></h3>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=Engine_Block_Tutorial_-_Bored_Block.png&amp;filetimestamp=20110526171823&amp;.html" class="mw-file-description"><img src="../File/Engine_Block_Tutorial_-_Bored_Block.png" decoding="async" width="300" height="181"></a><figcaption></figcaption></figure>
<div class="mw-translate-fuzzy">
<p>Ahora que ambos cilindros est&aacute;n en su ubicaci&oacute;n los utilizaremos para tallar el bloque. Para ello utilizaremos <i>operaciones booleanas</i> en nuestras 3 primitivas. Comenzaremos haciendo una uni&oacute;n de los dos cilindros. Selecciona el <i>Cilindro 1</i> y pulsa <i>CTRL</i> para seleccionar tambi&eacute;n el <i>Cilindro 2</i>. Ahora pulsa el icono de Uni&oacute;n (<span typeof="mw:File"><a href="../index.php?title=Part_Fuse.png&amp;filetimestamp=20180902230600&amp;.html" class="mw-file-description"><img src="../File/Part_Fuse.png" decoding="async" width="16" height="16"></a></span>) para fusionar los objetos. Observar&aacute;s que en la vista en &aacute;rbol, ahora hay un objeto llamado <i>Fusion</i>. Si pulsas el icono de la flecha a la izquierda de su nombre en la vista en &aacute;rbol ver&aacute;s los dos cilindros, pero su nombre se ha difuminado. En lugar de Fusion, lo renombraremos como <i>Cilindros</i>. Ahora tallaremos el bloque motor. Selecciona el <i>Alojamiento</i> y <i>luego</i> los <i>Cilindros</i> y presiona el icono de Cortar (<span typeof="mw:File"><a href="../index.php?title=Part_Cut.png&amp;filetimestamp=20170322213340&amp;.html" class="mw-file-description"><img src="../File/Part_Cut.png" decoding="async" width="16" height="16"></a></span>). Los dos objetos seleccionados se combinaran de nuevo y el resultado se llamar&aacute; <i>Cut</i> (que podr&iacute;as renombrar a <i>Bloque tallado</i>). Presiona la tecla <i>2</i> para ver la vista en planta, deber&iacute;as ver a trav&eacute;s de los agujeros de los cilindros en el bloque motor. A la derecha puedes ver como deber&iacute;a quedar.
</p>
</div>
<h3><span id="La_ventaja_clave_del_modelado_param.C3.A9trico"></span><span class="mw-headline" id="La_ventaja_clave_del_modelado_param&eacute;trico">La ventaja clave del modelado param&eacute;trico</span></h3>
<p>Ahora que hemos tallado los cilindros tomaremos un momento para ver una de las ventajas de este sistema. Supongamos que en alg&uacute;n punto de nuestro desarrollo, nos damos cuenta de que queremos los cilindros un poco mayores. Debido a que las operaciones se guardan y agrupan en la vista en &aacute;rbol, podemos cambiar el tama&ntilde;o de los cilindros y FreeCAD simplemente recalcular&aacute; la uni&oacute;n y la diferencia.  Prueba a modificar el radio y la posici&oacute;n de los dos cilindros y luego vuelve a dejarlos como se indicaba arriba.
</p><p><span id="The_Crankcase"></span>
</p>
<h2><span id="El_c.C3.A1rter"></span><span class="mw-headline" id="El_c&aacute;rter">El c&aacute;rter</span></h2>
<p><span id="Billet_and_Bearing_Caps"></span>
</p>
<h3><span class="mw-headline" id="Alojamiento_y_tapas_del_acoplamiento">Alojamiento y tapas del acoplamiento</span></h3>
<div class="mw-translate-fuzzy">
<p>A continuaci&oacute;n trabajaremos en el c&aacute;rter bajo el bloque motor. A&ntilde;ade un nuevo cubo, renombralo a  we will work on a crankcase under the engine block.  Add a new box, rename it to <i>Alojamiento del c&aacute;rter</i>, y asignale las siguientes propiedades:
</p>
</div>
<div class="mw-translate-fuzzy">
<dl><dd><table class="wikitable" border="1">

<tbody><tr>
<td>X:  0.0 mm</td>
<td>Height: 85.0 mm
</td></tr>
<tr>
<td>Y:  -50.0 mm</td>
<td>Length: 140.0 mm
</td></tr>
<tr>
<td>Z:  -85.0 mm</td>
<td>Width: 100.0 mm
</td></tr>
</tbody></table></dd></dl>
</div>
<div class="mw-translate-fuzzy">
<p>Para separar el c&aacute;rter le daremos un color diferente. Puedes cambiarlo pulsando con el bot&oacute;n derecho y seleccionando Apariencia. Puedes asignarle un color tu mismo o darle al objeto un color aleatorio (selecciona color aleatorio de nuevo si no te gusta el color). A&ntilde;ade otro cubo llamado <i>Tallado de acoplamiento</i>, y asignale las siguientes propiedades, y luego corta el <i>Tallado de acoplamiento</i> del <i>Alojamiento del c&aacute;rter</i> (selecciona primero el <i>Alojamiento del c&aacute;rter</i>):
</p>
</div>
<p>Add another box called <b>Bearing carve</b>, give it the following properties, and then cut the <b>Bearing carve</b> away from the <b>Crankcase Billet</b> (i.e. select the billet first):
</p>
<div class="mw-translate-fuzzy">
<dl><dd><table class="wikitable" border="1">

<tbody><tr>
<td>X:  0.0 mm</td>
<td>Height: 30.0 mm
</td></tr>
<tr>
<td>Y:  -40.0 mm</td>
<td>Length: 140.0 mm
</td></tr>
<tr>
<td>Z:  -85.0 mm</td>
<td>Width: 80.0 mm
</td></tr>
</tbody></table></dd></dl>
</div>
<div class="mw-translate-fuzzy">
<p>Renombra el corte resultante como <i>C&aacute;rter tallado</i>.
</p>
</div>
<div class="mw-translate-fuzzy">
<h3><span class="mw-headline" id="Tallando_el_alojamiento_del_eje">Tallando el alojamiento del eje</span></h3>
<p>Lo siguiente que haremos ser&aacute; un corte semicircular para situar el cig&uuml;e&ntilde;al. Comenzaremos con un cilindro, pero la orientaci&oacute;n por defecto del cilindro es vertical, y necesitamos uno horizontal. Esto significa que debemos enterarnos de como girar el cilindro para alinearlo correctamente con nuestro motor. Queremos el cig&uacute;e&ntilde;al a lo largo del eje X, esto significa que desde su ubicaci&oacute;n por defecto necesitamos girarlo 90&ordm; alrededor del eje Y. Crea un cilindro llamado <i>Tallado del Cig&uacute;e&ntilde;al</i> y asignale estas propiedades (Observa que tenemos que especificar el par&aacute;metro de orientaci&oacute;n adem&aacute;s de las dimensiones y posici&oacute;n de los casos anteriores):
</p>
</div>
<dl><dd><table class="wikitable" border="1">

<tbody><tr>
<td>Axis X:  0.0 mm</td>
<td>Angle: 90.0 degrees
</td></tr>
<tr>
<td>Axis Y:  1.0 mm</td>
<td>
</td></tr>
<tr>
<td>Axis Z:  0.0 mm</td>
<td>
</td></tr>
<tr>
<td>Position X:  0.0 mm</td>
<td>Height: 140.0 mm
</td></tr>
<tr>
<td>Position Y:  0.0 mm</td>
<td>Radius: 20.0 mm
</td></tr>
<tr>
<td>Position Z:  -55.0 mm</td>
<td>
</td></tr>
</tbody></table></dd></dl>
<div class="mw-translate-fuzzy">
<p>Corta el <i>Tallado del Cig&uacute;e&ntilde;al</i> del <i>C&aacute;rter tallado</i> y renombralo como <i>C&aacute;rter con alojamientos</i>.
</p>
</div>
<p><span id="Finishing_out_the_Crankcase"></span>
</p>
<h3><span id="Terminando_el_c.C3.A1rter"></span><span class="mw-headline" id="Terminando_el_c&aacute;rter">Terminando el c&aacute;rter</span></h3>
<div class="mw-translate-fuzzy">
<p>Para terminar cortaremos dos cubos para que las bielas de los pistones puedan pasar del c&aacute;rter al bloque motor. Crea dos cubos llamados <i>Cubo tallado 1</i> y <i>Cubo tallado 1</i> con las siguientes propiedades, &uacute;nelos en un objeto llamado <i>Cubos tallados</i>, y c&oacute;rtalos del <i>C&aacute;rter con alojamientos</i>, llamando al resultado final "C&aacute;rter". Recuerda que puedes ocultar el bloque motor.
</p>
</div>
<div class="mw-translate-fuzzy">
<dl><dd><table class="wikitable" border="1">

<tbody><tr>
<td>X:  15.0 mm</td>
<td>Height: 55.0 mm
</td></tr>
<tr>
<td>Y:  -25.0 mm</td>
<td>Length: 50.0 mm
</td></tr>
<tr>
<td>Z:  -55.0 mm</td>
<td>Width: 50.0 mm
</td></tr>
</tbody></table></dd></dl>
</div>
<div class="mw-translate-fuzzy">
<dl><dd><table class="wikitable" border="1">

<tbody><tr>
<td>X:  75.0 mm</td>
<td>Height: 55.0 mm
</td></tr>
<tr>
<td>Y:  -25.0 mm</td>
<td>Length: 50.0 mm
</td></tr>
<tr>
<td>Z:  -55.0 mm</td>
<td>Width: 50.0 mm
</td></tr>
</tbody></table></dd></dl>
</div>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=Engine_Block_Tutorial_-_Crankcase.png&amp;filetimestamp=20110526171922&amp;.html" class="mw-file-description"><img src="../File/Engine_Block_Tutorial_-_Crankcase.png" decoding="async" width="300" height="181"></a><figcaption></figcaption></figure>
<p>A la derecha puedes ver el resultado final. Lo siguiente que haremos es utilizar el modo de croquizado para dise&ntilde;ar el patr&oacute;n de pernos de fijaci&oacute;n y eliminar gran parte del material que recubre los cilindros del bloque motor.
</p>
<h2><span id="Croquizado_2D_del_dise.C3.B1o_de_la_junta_del_bloque_motor"></span><span class="mw-headline" id="Croquizado_2D_del_dise&ntilde;o_de_la_junta_del_bloque_motor">Croquizado 2D del dise&ntilde;o de la junta del bloque motor</span></h2>
<p>Para los pernos de fijaci&oacute;n y la forma del bloque motor utilizaremos m&aacute;s operaciones booleanas para "tallar" la partes del bloque que no queremos.
</p>
<div class="mw-translate-fuzzy">
<h3><span class="mw-headline" id="Entrando_al_modo_de_croquizado_2De">Entrando al modo de croquizado 2De</span></h3>
<p>Lo primero que tenemos que hacer es cambiar al entorno de Croquizado 2D, seleccionando <i>Croquizado 2D</i> en la lista desplegable de la barra de herramientas superior, que actualmente dice <i>Pieza</i> o desde <i>Vista -&gt; Entornos</i>. Incluso aunque vamos a hacer un dibujo 2D seguiremos trabajando en la vista en 3D, dici&eacute;ndole a FreeCAD en que plano vamos a trabajar. Despu&eacute;s de activar el entorno de Croquizado 2D se mostrar&aacute; la barra de comandos de croquis, a la derecha de ella se mostrar&aacute;n varios iconos. Si pulsamos en el icono que est&aacute; m&aacute;s a la izquierda nos permitir&aacute; especificar el plano de trabajo. Permite indicar una equidistancia y seleccionar algunos planos predefinidos: XY, XZ, YZ, Vista, y Ninguno. Los tres primeros son la planta, el alzado y el perfil, <i>Vista</i> utilizar&aacute; el plano perpendicular a la direcci&oacute;n de la vista, y la &uacute;ltima opci&oacute;n no proyectar&aacute; sobre ning&uacute;n plano dejando definir las completamente las coordenadas XYZ para cualquier punto. Seleccionamos la opci&oacute;n XY e indicamos un valor de 110 en el cuadro de texto de Equidistancia para trabajar en un plano paralelo al XY localizado a 110 mm de altura.
</p>
</div>
<div class="mw-translate-fuzzy">
<p>Aunque todo lo que dibujemos se proyectar&aacute; sobre el plano de trabajo independientemente de cual sea la vista 3D actual, puede ser &uacute;til situar la vista perpendicular al plano actual. Pulsa la tecla 2 del teclado para activar la vista en planta.
</p>
</div>
<div class="mw-translate-fuzzy">
<h3><span class="mw-headline" id="Dibujando_los_pernos">Dibujando los pernos</span></h3>
<p>Selecciona el icono <i>Circunferencia</i> (<span typeof="mw:File"><a href="../index.php?title=Draft_Circle.png&amp;filetimestamp=20170117141536&amp;.html" class="mw-file-description"><img src="../File/Draft_Circle.png" decoding="async" width="16" height="16"></a></span>). FreeCAD te preguntar&aacute; por la ubicaci&oacute;n del centro y por el radio. Puedes indicarlos con el rat&oacute;n en el &aacute;rea gr&aacute;fica o con el teclado. A&ntilde;adir elementos croquizados con el rat&oacute;n es m&aacute;s sencillo y r&aacute;pido, pero no es muy preciso. Dibujaremos 3 circunferencias en las coordenadas y con los radios indicados a continuaci&oacute;n.
</p>
</div>
<p>Adding drafting elements with the mouse is fast and easy, but it is not very precise.  For the actual bolt pattern we use the fact that moving the mouse will update the numbers in the text boxes just above the 3D view so we can see roughly the coordinates of where we want to place things.  Once we have these rough coordinates we can type in the real values we want for precise positioning.  Reset to the top view of the engine, click the <i>Add circle</i> button, and move your mouse around the top left corner of the engine block taking not of a good location for the head bolt.  It looks like X=10, Y=30, would be a good place for the circle (note the Z coordinate should be grayed out, if it is not you need to set the plane properly like in the previous section, pressing escape will cancel drawing the circle).
</p><p>Now that you see how to easily determine the coordinates of drawing elements you can easily design a bolt pattern or other 2 dimensional layout for a part such as fluid channels, circuit-board traces, etc.  For our 3 head bolts let's on this side of the engine, let's use the following coordinates.  Note that when you are typing in values to the boxes you can press enter to move on to the next box, and it is also a good idea to move your mouse out of the 3D view before you start typing in the coordinates as too much mouse movement will overwrite the numbers you have already entered in the text entry fields.  Also, on my system I had trouble with the typed in circles having their Z coordinates set to 12.5 for some reason, if this is a problem for you, you can set the drawing projection plane to <i>None</i> and then manually enter the Z coordinates for the circles to be 110.  Finally, when creating the circles, make sure to check the box labeled <i>Filled</i> otherwise when we extrude them later they will just create tubes like a toilet paper tube instead of a solid cylinder.
</p>
<dl><dd><table class="wikitable" border="1">

<tbody><tr>
<td>X1:  10</td>
<td>Y1:  25</td>
<td>Radius: 2.5 mm
</td></tr>
<tr>
<td>X2:  70</td>
<td>Y2:  25</td>
<td>Radius: 2.5 mm
</td></tr>
<tr>
<td>X3:  130</td>
<td>Y3:  25</td>
<td>Radius: 2.5 mm
</td></tr></tbody></table></dd></dl>
<div class="mw-translate-fuzzy">
<p>Llama a estas circunferencias <i>Perno 1</i> <i>Perno 2</i> y <i>Perno 3</i>.
</p>
</div>
<div class="mw-translate-fuzzy">
<h3><span class="mw-headline" id="El_otro_lado_del_bloque">El otro lado del bloque</span></h3>
<p>Ahora que los tres primeros pernos est&aacute;n situados de un lado del bloque motor, necesitamos otros tres del otro lado, hay tres formas de crearlos:
</p>
<ul><li>A&ntilde;adiendo circunferencias como hicimos antes.</li></ul>
<ul><li>Seleccionando los tres que hemos creado antes y copiandolos y moviendolos a su ubicaci&oacute;n, al igual que hicimos con los dos cilindros iniciales.</li></ul>
<ul><li>Utilizar la funcionalidad de simetr&iacute;a.</li></ul>
<p>Como ya hemos visto las dos primeras opciones, vamos a utilizar la tercera. Volvemos a activar el entorno de <i>Pieza</i> y pulsamos el icono de Simetr&iacute;a (<span typeof="mw:File"><a href="../index.php?title=Part_Mirror.png&amp;filetimestamp=20170322214027&amp;.html" class="mw-file-description"><img src="../File/Part_Mirror.png" decoding="async" width="16" height="16"></a></span>). Se mostrar&aacute; a la izquierda de la pantalla la Vista de Tareas, donde antes ve&iacute;amos la pesta&ntilde;a Vista del Proyecto, un letrero en el que se pueden especificar los par&aacute;metros del comando Simetr&iacute;a. Selecciona <i>Perno 1</i> de la lista en la Vista de Tareas e indica como de Simetr&iacute;a el XZ, presiona OK (haz lo mismo con <i>Perno 2</i> y <i>Perno 3</i>).
</p>
</div>
<p>Since you should already know how to do the first and second way, we will choose the third way for this example model.  Each of the three methods has its own advantages and disadvantages, but a good operating rule is that simple models (like this one) probably should use the first or second methods, whereas models with lots of duplication and/or duplication of very complicated shapes/objects should probably use the third method.
</p><p>So even though it is a bit of overkill we will mirror these bolts as a demonstration.  Switch back to the part workbench (note that you can always switch to the <i>Complete</i> workbench to see all the tools at once if you would rather not switch back and forth (deprecated since v0.17)) by going to <b>View &rarr; Workbench</b>.  Select the three bolt circles in the tree view, and then press the mirror button (<span typeof="mw:File"><a href="../index.php?title=Part_Mirror.svg&amp;filetimestamp=20240712184557&amp;.html" class="mw-file-description"><img src="../File/Part_Mirror.svg" decoding="async" width="16" height="16"></a></span>). Once you press the mirror button you should notice a new display called the <i>Combo view</i> pop up on in the pane underneath the Tree view.  Many of the tools need additional input before they can run and the Combo view lets you enter these parameters.  You can make the Combo view larger by dragging the divider line separating it from the Property view up or down.  Select <b>Bolt 1</b> from the list on the Combo view and set the <i>mirror plane</i> to XZ, then press OK (do the same for bolts 2 and 3).
</p><p>At this point you should have a basic engine block with the cylinders bored out and the headbolt locations marked.
</p>
<h3><span class="mw-headline" id="Eliminando_el_material_excedente_del_bloque_motor">Eliminando el material excedente del bloque motor</span></h3>
<p>Ahora que tenemos los taladros marcados para los pernos queremos recortar la parte exterior del bloque con una forma m&aacute;s conveniente. Esto har&aacute; el motor m&aacute;s ligero, permitir&aacute; que se enfr&iacute;e mejor y se utilizar&aacute; menos material para fundir el bloque. Al igual que con el los pernos crearemos un croquis 2D con la forma exterior que deseamos para el producto final. Utilizaremos geometr&iacute;a constructiva 2D para servir como referencia al trazar una spline con la forma exterior del bloque.
</p><p>Como gu&iacute;a dibujaremos dos pol&iacute;gonos regulares conc&eacute;ntricos con cada cilindro. Cambia a la vista en planta , oculta el c&aacute;rter y haz visible el bloque motor, cambia al entorno de croquizado 2D seleccionando el plano de trabajo XY y una equidistancia de 110 mm (tal como se hizo anteriormente). Activa el icono del <i>modo de Geometr&iacute;a Constructiva</i> en la barra de comandos (el icono representa una paleta y est&aacute; justo al lado de donde hemos indicado el plano de trabajo). El modo de Geometr&iacute;a Constructiva funciona exactamente como el modo normal, pero los objetos se dibujan con un color diferente y se a&ntilde;aden autom&aacute;ticamente en un grupo separado en la vista en &aacute;rbol.
</p>
<dl><dd><i>Lectura adicional: <a href="../es/Draft_ToggleConstructionMode.html" title="Draft ToggleConstructionMode/es">Modo de Geometr&iacute;a Constructiva</a></i></dd></dl>
<div class="mw-translate-fuzzy">
<p>Pulsa en el icono para crear un <i>Pol&iacute;gono regular</i> (<span typeof="mw:File"><a href="../index.php?title=Draft_Polygon.png&amp;filetimestamp=20170117141632&amp;.html" class="mw-file-description"><img src="../File/Draft_Polygon.png" decoding="async" width="16" height="16"></a></span>) y mueve tu rat&oacute;n sobre la arista de uno de los cilindros mientras presionas la tecla CTRL. Deber&iacute;as ver como el cursor se ajusta al eje del cilindro, selecciona dicho punto haciendo clic. El programa pregunta por el n&uacute;mero de lados del pol&iacute;gono regular y el radio en el que se inscribir&aacute;. Indicamos un radio de 30 e indicamos 14 para el n&uacute;mero de lados. A&ntilde;ade otro pol&iacute;gono centrado en el mismo punto pero de radio 45 mm y 22 lados. Para terminar a&ntilde;ade otros dos pol&iacute;gonos exactamente iguales en el otro cilindro. Cuando termines, deber&iacute;as tener dos figuras "polygon".
</p>
</div>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=Engine_Block_Tutorial_-_Spline.png&amp;filetimestamp=20110526172017&amp;.html" class="mw-file-description"><img src="../File/Engine_Block_Tutorial_-_Spline.png" decoding="async" width="300" height="181"></a><figcaption></figcaption></figure>
<div class="mw-translate-fuzzy">
<p>Ahora dibujaremos una spline para definir el exterior del bloque motor. Como esta va a ser parte del objeto final, desactiva el modo de Geometr&iacute;a Constructiva y selecciona el icono para a&ntilde;adir una spline (<span typeof="mw:File"><a href="../index.php?title=Draft_BSpline.png&amp;filetimestamp=20170117141738&amp;.html" class="mw-file-description"><img src="../File/Draft_BSpline.png" decoding="async" width="16" height="16"></a></span>) apoy&aacute;ndote en los v&eacute;rtices de los pol&iacute;gonos anteriores seleccion&aacute;ndolos mientras se pulsa la tecla CTRL. Cuando est&eacute;s a punto de volver a indicar el primer punto, o punto de partida, para cerrar la spline pulsa el icono "Cerrar" en la barra de comandos de Croquizado.
</p>
</div>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=Engine_Block_Tutorial_-_Spline_Edit_Mode.png&amp;filetimestamp=20110526172139&amp;.html" class="mw-file-description"><img src="../File/Engine_Block_Tutorial_-_Spline_Edit_Mode.png" decoding="async" width="300" height="181"></a><figcaption></figcaption></figure>
<p>The control points are not shown in that picture so I have added a second screenshot showing the finished spline in edit mode (click the <i>Edit mode</i> button to turn editing on or off for the selected object, make sure to turn it off when you are done editing it or just skip over this step if you are satisfied with your engine block shape).  Also, note that there is a discontinuity on the leftmost edge of the spline curve, even though it is closed properly, this is a bug in the program behavior and is currently being fixed, as a result your spline curve may look slightly different if you are running a newer version of the software than is available at this time.
</p><p><span id="Extruding_the_2D_Head_Design_into_our_3D_Model_to_Finish_the_Design"></span>
</p>
<h3><span id="Extrusi.C3.B3n_del_dise.C3.B1o_2D_en_el_modelo_3D_para_finalizar_el_dise.C3.B1o"></span><span class="mw-headline" id="Extrusi&oacute;n_del_dise&ntilde;o_2D_en_el_modelo_3D_para_finalizar_el_dise&ntilde;o">Extrusi&oacute;n del dise&ntilde;o 2D en el modelo 3D para finalizar el dise&ntilde;o</span></h3>
<div class="mw-translate-fuzzy">
<p>Vuelve al entorno de pieza y selecciona el icono <i>Extruir croquis</i> (<span typeof="mw:File"><a href="../index.php?title=Part_Extrude.png&amp;filetimestamp=20170322213717&amp;.html" class="mw-file-description"><img src="../File/Part_Extrude.png" decoding="async" width="16" height="16"></a></span>). En el combobox mostrado utiliza CTRL para seleccionar las 6 circunferencias y el contorno cerrado definido por la spline. La direcci&oacute;n por defecto es en el sentido del eje Z positivo, pero nosotros queremos extruirlo hacia abajo, de modo que la cambiamos a X=0, Y=0 y Z=-1, despu&eacute;s indicamos 110 para la longitud (la altura del bloque motor) y pulsamos OK. En este momento todos los objetos extruidos se llaman "Extrude001..." as&iacute; que los renombraremos como <i>Taladro Perno 1</i>, <i>Taladro Perno 2</i>... hasta el <i>6</i> y a la extrusi&oacute;n de la spline <i>Spline extruida</i>. Vuelve a visualizar todos los componentes ocultos.
</p>
</div>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=Engine_Block_Tutorial_-_Finished_Engine_Block.png&amp;filetimestamp=20110526172237&amp;.html" class="mw-file-description"><img src="../File/Engine_Block_Tutorial_-_Finished_Engine_Block.png" decoding="async" width="300" height="181"></a><figcaption></figcaption></figure>
<div class="mw-translate-fuzzy">
<p>Selecciona los 6 objetos <i>Taladro Perno 1</i>, <i>Taladro Perno 2</i>... y &uacute;nelos llamando al resultado <i>Taladros de los Pernos</i>. Luego selecciona el "Bloque taladrado" y los <i>Taladros de los Pernos</i> en ese orden y realiza una operaci&oacute;n booleana de corte llamando al resultado <i>Bloque con taladros</i>. Finalmente, selecciona el <i>Bloque con taladros</i> y el <i>Spline extruida</i> en ese orden y selecciona la operaci&oacute;n booleana <i>Intersecci&oacute;n</i> (<span typeof="mw:File"><a href="../index.php?title=Part_Common.png&amp;filetimestamp=20170322213318&amp;.html" class="mw-file-description"><img src="../File/Part_Common.png" decoding="async" width="16" height="16"></a></span>), y llama al resultado <i>Bloque motor</i>. El resultado final deber&iacute;a ser similar al de la imagen de la derecha.
</p>
</div>
<p>Your final object should look like the picture on the right.
</p>
<div style="clear:both"></div>
<!-- 
NewPP limit report
Cached time: 20250622001715
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc, no&#8208;toc&#8208;conversion]
CPU time usage: 0.128 seconds
Real time usage: 0.191 seconds
Preprocessor visited node count: 152/1000000
Post&#8208;expand include size: 1400/2097152 bytes
Template argument size: 40/2097152 bytes
Highest expansion depth: 3/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1542/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   15.343      1 -total
 39.43%    6.050      1 Template:UnfinishedDocu/es
 23.31%    3.577      1 Template:Clear
 22.63%    3.472      1 Template:TutorialInfo/es
 11.91%    1.827      1 Template:MenuCommand
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:1482-0!canonical and timestamp 20250622001715 and revision id 1595145. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>