<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">FreeCAD Scripting Basics/es</span></h1><?xml encoding="UTF-8"><div class="mw-parser-output"><div class="mw-pt-languages noprint" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../id/FreeCAD_Scripting_Basics.html" class="mw-pt-progress mw-pt-progress--stub" title="FreeCAD Scripting Basics (2% translated)" lang="id" dir="ltr">Bahasa Indonesia</a></li>
<li><a href="../de/FreeCAD_Scripting_Basics.html" class="mw-pt-progress mw-pt-progress--complete" title="Grundlagen der Skripterstellung in FreeCAD (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../FreeCAD_Scripting_Basics.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="FreeCAD Scripting Basics (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../tr/FreeCAD_Scripting_Basics.html" class="mw-pt-progress mw-pt-progress--stub" title="FreeCAD Scripting Basics (2% translated)" lang="tr" dir="ltr">T&uuml;rk&ccedil;e</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="es" dir="ltr">espa&ntilde;ol</span></li>
<li><a href="../fr/FreeCAD_Scripting_Basics.html" class="mw-pt-progress mw-pt-progress--complete" title="FreeCAD D&eacute;buter avec les scripts (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/FreeCAD_Scripting_Basics.html" class="mw-pt-progress mw-pt-progress--complete" title="Script di base per FreeCAD (100% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/FreeCAD_Scripting_Basics.html" class="mw-pt-progress mw-pt-progress--complete" title="Podstawy tworzenia skrypt&oacute;w FreeCAD (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt/FreeCAD_Scripting_Basics.html" class="mw-pt-progress mw-pt-progress--stub" title="Conceitos b&aacute;sicos de programa&ccedil;&atilde;o em FreeCAD (2% translated)" lang="pt" dir="ltr">portugu&ecirc;s</a></li>
<li><a href="../pt-br/FreeCAD_Scripting_Basics.html" class="mw-pt-progress mw-pt-progress--stub" title="FreeCAD No&ccedil;&otilde;es b&aacute;sicas de programa&ccedil;&atilde;o (2% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../ro/FreeCAD_Scripting_Basics.html" class="mw-pt-progress mw-pt-progress--stub" title="FreeCAD Scripting Basics (16% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><a href="../sv/FreeCAD_Scripting_Basics.html" class="mw-pt-progress mw-pt-progress--stub" title="FreeCAD Scripting Basics (14% translated)" lang="sv" dir="ltr">svenska</a></li>
<li><a href="../cs/FreeCAD_Scripting_Basics.html" class="mw-pt-progress mw-pt-progress--stub" title="FreeCAD Scripting Basics/cs (0% translated)" lang="cs" dir="ltr">&#269;e&scaron;tina</a></li>
<li><a href="../ru/FreeCAD_Scripting_Basics.html" class="mw-pt-progress mw-pt-progress--complete" title="&#1054;&#1089;&#1085;&#1086;&#1074;&#1099; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1074; &#1074; FreeCAD (94% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li>
<li><a href="../zh-cn/FreeCAD_Scripting_Basics.html" class="mw-pt-progress mw-pt-progress--stub" title="FreeCAD&#33050;&#26412;&#22522;&#30784; (6% translated)" lang="zh-Hans-CN" dir="ltr">&#20013;&#25991;&#65288;&#20013;&#22269;&#22823;&#38470;&#65289;</a></li>
<li><a href="../ja/FreeCAD_Scripting_Basics.html" class="mw-pt-progress mw-pt-progress--stub" title="FreeCAD&#12473;&#12463;&#12522;&#12503;&#12486;&#12451;&#12531;&#12464;&#12398;&#22522;&#30990; (6% translated)" lang="ja" dir="ltr">&#26085;&#26412;&#35486;</a></li>
<li><a href="../ko/FreeCAD_Scripting_Basics.html" class="mw-pt-progress mw-pt-progress--low" title="FreeCAD &#49828;&#53356;&#47549;&#53944; &#44592;&#52488; (28% translated)" lang="ko" dir="ltr">&#54620;&#44397;&#50612;</a></li></ul></div>
<div class="docnav" style="background-color: #ececef; border: 1px solid #a2a9b1; padding: 2px 10px; margin: 10px 0; line-height: 1; clear: both; overflow: hidden;">
    <div style="margin: 4px 0; float: left;"><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-left.svg" decoding="async" width="16" height="16"></span></span> <a href="../Python_scripting_tutorial.html" title="Python scripting tutorial">Python scripting tutorial</a></div>
    <div style="margin: 4px 0; float: right;"><a href="../Part_scripting.html" title="Part scripting">Part scripting</a>
 <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-right.svg" decoding="async" width="16" height="16"></span></span></div>
    <div style="text-align:center"><a href="../es/Online_Help_Toc.html" title="Online Help Toc/es">Index</a> <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Online_Help_Toc.svg" decoding="async" width="24" height="24"></span></span></div>
</div>
<div style="clear:right; margin-bottom: .5em; float: right; padding: .5em 0 .8em 1.4em; background: none;"><meta property="mw:PageProp/toc"></div>
<p><span id="Python_scripting_in_FreeCAD"></span>
</p>
<h2><span id="Guionizaci.C3.B3n_Python_en_FreeCAD"></span><span class="mw-headline" id="Guionizaci&oacute;n_Python_en_FreeCAD">Guionizaci&oacute;n Python en FreeCAD</span></h2>
<p>FreeCAD est&aacute; construido desde cero para ser totalmente controlado por gui&oacute;nes de Python. Casi todas las partes de FreeCAD, como la interfaz, el contenido de la escena, e incluso la representaci&oacute;n de este contenido en las vistas 3D, son accesibles desde el int&eacute;rprete de Python incorporado o desde tus propios gui&oacute;nes. Como resultado, FreeCAD es probablemente una de las aplicaciones de ingenier&iacute;a m&aacute;s profundamente personalizables disponibles hoy en d&iacute;a.
</p><p>Si no est&aacute;s familiarizado con Python, te recomendamos que busques tutoriales en Internet y eches un vistazo r&aacute;pido a su estructura. Python es un lenguaje muy f&aacute;cil de aprender, especialmente porque puede ser ejecutado dentro de un int&eacute;rprete, donde comandos simples, hasta programas completos, pueden ser ejecutados sobre la marcha sin necesidad de compilar nada. FreeCAD tiene un int&eacute;rprete de Python incorporado. Si no ves la ventana etiquetada como <b>Consola de Python</b> como se muestra a continuaci&oacute;n, puedes activarla en el <b>Ver &rarr; Paneles &rarr; Consola Python</b>.
</p><p><span id="The_interpreter"></span>
</p>
<h3><span id="El_int.C3.A9rprete"></span><span class="mw-headline" id="El_int&eacute;rprete">El int&eacute;rprete</span></h3>
<p>Desde el int&eacute;rprete, puedes acceder a todos los m&oacute;dulos de Python instalados en el sistema, as&iacute; como a los m&oacute;dulos incorporados de FreeCAD, y a todos los m&oacute;dulos adicionales de FreeCAD que hayas instalado posteriormente. La captura de pantalla de abajo muestra el int&eacute;rprete de Python:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Screenshot_pythoninterpreter.jpg&amp;filetimestamp=20090202153113&amp;.html" class="mw-file-description" title="The FreeCAD Python interpreter"><img alt="The FreeCAD Python interpreter" src="../File/Screenshot_pythoninterpreter.jpg" decoding="async" width="614" height="228"></a></span>
</p><p>Desde el int&eacute;rprete, puedes ejecutar c&oacute;digo Python y navegar a trav&eacute;s de las clases y funciones disponibles. FreeCAD proporciona un navegador de clases muy pr&aacute;ctico para explorar el mundo de FreeCAD: Cuando escribes el nombre de una clase conocida seguido de un punto (lo que significa que quieres a&ntilde;adir algo de esa clase), se abre una ventana del navegador de clases, donde puedes navegar entre las subclases y m&eacute;todos disponibles. Cuando seleccionas algo, se muestra un texto de ayuda asociado (si existe):
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Screenshot_classbrowser.jpg&amp;filetimestamp=20090202153040&amp;.html" class="mw-file-description" title="The FreeCAD class browser"><img alt="The FreeCAD class browser" src="../File/Screenshot_classbrowser.jpg" decoding="async" width="614" height="228"></a></span>
</p><p>Por lo tanto, comience aqu&iacute; escribiendo <code>App.</code> o <code>Gui.</code> y vea lo que sucede. Otra forma m&aacute;s gen&eacute;rica de Python para explorar el contenido de los m&oacute;dulos y clases es utilizar el comando <code>print(dir())</code>. Por ejemplo, escribiendo <code>print(dir())</code> listar&aacute; todos los m&oacute;dulos cargados actualmente en FreeCAD. <code>print(dir(App))</code> te mostrar&aacute; todo lo que hay dentro del m&oacute;dulo App, etc.
</p><p>Otra caracter&iacute;stica &uacute;til del int&eacute;rprete es la posibilidad de retroceder en el historial de comandos y recuperar una l&iacute;nea de c&oacute;digo que ya hayas escrito anteriormente. Para navegar por el historial de comandos, basta con utilizar <span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px;">Flecha arriba</span> o <span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px;">Flecha abajo</span>.
</p><p>Al hacer clic derecho en la ventana del int&eacute;rprete tambi&eacute;n tienes otras opciones, tales como copiar todo el historial (&uacute;til para experimentar con algo, y luego hacer un archivo de gui&oacute;n con todo ello), o insertar el nombre de un archivo con su ruta completa.
</p>
<p><a href="#top">Inicio</a></p>
<p><span id="Python_Help"></span>
</p>
<h3><span class="mw-headline" id="Ayuda_de_Python">Ayuda de Python</span></h3>
<p>En el men&uacute; de FreeCAD <b>Ayuda</b>, encontrar&aacute;s una entrada etiquetada como <b>Documentaci&oacute;n autom&aacute;tica de los m&oacute;dulos de Python</b>, que abrir&aacute; una ventana del navegador que contiene una documentaci&oacute;n completa, generada en tiempo real, de todos los m&oacute;dulos de Python disponibles para el int&eacute;rprete de FreeCAD, incluyendo los m&oacute;dulos incorporados de Python y FreeCAD, los m&oacute;dulos instalados en el sistema y los m&oacute;dulos adicionales de FreeCAD. La documentaci&oacute;n disponible all&iacute; depende del esfuerzo que cada desarrollador de m&oacute;dulos ponga en documentar su c&oacute;digo, pero los m&oacute;dulos de Python tienen la reputaci&oacute;n de estar bastante bien documentados. Tu ventana de FreeCAD debe permanecer abierta para que este sistema de documentaci&oacute;n funcione.
La entrada <b>Documentaci&oacute;n Guionizaci&oacute;n en Python</b> te dar&aacute; un enlace r&aacute;pido a la secci&oacute;n wiki <a href="../es/Power_users_hub.html" title="Power users hub/es">Centro usuarios avanzados</a>.
</p>
<p><a href="#top">Inicio</a></p>
<p><span id="Built-in_modules"></span>
</p>
<h2><span id="M.C3.B3dulos_incorporados"></span><span class="mw-headline" id="M&oacute;dulos_incorporados">M&oacute;dulos incorporados</span></h2>
<p>Dado que FreeCAD est&aacute; dise&ntilde;ado para que tambi&eacute;n pueda ejecutarse sin una interfaz gr&aacute;fica de usuario (GUI), casi toda su funcionalidad est&aacute; separada en dos grupos: La funcionalidad del n&uacute;cleo, llamada <code>App</code>, y la funcionalidad de la GUI, llamada <code>Gui</code>. A estos dos m&oacute;dulos tambi&eacute;n se puede acceder desde scripts fuera del int&eacute;rprete, con los nombres <code>FreeCAD</code> y <code>FreeCADGui</code> respectivamente.
</p>
<ul><li>En el m&oacute;dulo <code>App</code> encontrar&aacute;s todo lo relacionado con la propia aplicaci&oacute;n, como los m&eacute;todos para abrir o cerrar archivos, y con los documentos, como establecer el documento activo o listar su contenido.</li></ul>
<ul><li>En el m&oacute;dulo <code>Gui</code>, encontrar&aacute;s herramientas para acceder y gestionar los elementos de la Gui, como los ambientes de trabajo y sus barras de herramientas, y, lo que es m&aacute;s interesante, la representaci&oacute;n gr&aacute;fica de todo el contenido de FreeCAD.</li></ul>
<p>Listar el contenido de estos m&oacute;dulos no es muy &uacute;til porque crecen bastante r&aacute;pido a medida que FreeCAD se desarrolla. Pero las dos herramientas de navegaci&oacute;n proporcionadas (el navegador de clases y la ayuda de Python) deber&iacute;an darte una documentaci&oacute;n completa y actualizada en cualquier momento.
</p>
<p><a href="#top">Inicio</a></p>
<p><span id="The_App_and_Gui_objects"></span>
</p>
<h3><span class="mw-headline" id="Los_objetos_App_y_Gui">Los objetos App y Gui</span></h3>
<p>Como ya se ha mencionado, en FreeCAD todo est&aacute; separado en n&uacute;cleo y representaci&oacute;n. Esto incluye los objetos 3D. Puedes acceder a las propiedades que definen los objetos (llamados caracter&iacute;sticas en FreeCAD) a trav&eacute;s del m&oacute;dulo <code>App</code>, y cambiar la forma en que se representan en la pantalla a trav&eacute;s del m&oacute;dulo <code>Gui</code>. Por ejemplo, un cubo tiene propiedades que lo definen (como anchura, longitud, altura) que se almacenan en un objeto <code>App</code>, y propiedades de representaci&oacute;n (como color de las caras, modo de dibujo) que se almacenan en un objeto <code>Gui</code> correspondiente.
</p><p>Esta forma de hacer las cosas permite una amplia gama de usos, como los algoritmos que s&oacute;lo funcionan en la parte definitoria de caracter&iacute;sticas, sin la necesidad de ocuparse de ningun aspecto visual, o incluso redirigir el contenido del documento con la aplicaci&oacute;n no-gr&aacute;fica, como listas, hojas de c&aacute;lculo o an&aacute;lisis de elementos.
</p><p>Para cada objeto <code>App</code> en su documento, existe un objeto <code>Gui</code> correspondiente. De hecho, el propio documento tiene tanto un objeto <code>App</code> como un objeto <code>Gui</code>. Esto, por supuesto, s&oacute;lo se aplica cuando se ejecuta FreeCAD con su interfaz completa. En la versi&oacute;n de l&iacute;nea de comandos no existe la interfaz gr&aacute;fica, por lo que s&oacute;lo est&aacute;n disponibles los objetos <code>App</code>. Ten en cuenta que la parte <code>Gui</code> de los objetos se vuelve a generar cada vez que un objeto <code>App</code> se marca como 'a recalcular' (por ejemplo cuando uno de sus par&aacute;metros cambia), por lo que cualquier cambio realizado directamente en el objeto <code>Gui</code> puede perderse.
</p><p>Para acceder a la parte <code>App</code> de algo, se teclea:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">myObject</span> <span class="o">=</span> <span class="n">App</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">getObject</span><span class="p">(</span><span class="s2">"ObjectName"</span><span class="p">)</span>
</pre></div>
<p>donde <code>"ObjectName"</code> es el nombre de su objeto. Tambi&eacute;n puede teclea:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">myObject</span> <span class="o">=</span> <span class="n">App</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">ObjectName</span>
</pre></div>
<p>Para acceder a la parte <code>Gui</code> del mismo objeto, se teclea:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">myViewObject</span> <span class="o">=</span> <span class="n">Gui</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">getObject</span><span class="p">(</span><span class="s2">"ObjectName"</span><span class="p">)</span>
</pre></div>
<p>donde <code>"ObjectName"</code> es el nombre de su objeto. Tambi&eacute;n puede teclea:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">myViewObject</span> <span class="o">=</span> <span class="n">App</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">ObjectName</span><span class="o">.</span><span class="n">ViewObject</span>
</pre></div>
<p>Si est&aacute; en modo de l&iacute;nea de comandos y no tiene GUI, la &uacute;ltima l&iacute;nea devolver&aacute; <code>None</code>.
</p>
<p><a href="#top">Inicio</a></p>
<p><span id="The_Document_objects"></span>
</p>
<h3><span class="mw-headline" id="Los_objetos_Documento">Los objetos Documento</span></h3>
<p>En FreeCAD todo tu trabajo reside dentro de los documentos. Un documento contiene tu geometr&iacute;a y puede ser guardado en un archivo. Se pueden abrir varios documentos al mismo tiempo. El documento, al igual que la geometr&iacute;a que contiene, tiene objetos <code>App</code> y <code>Gui</code>. El objeto <code>App</code> contiene las definiciones reales de la geometr&iacute;a, mientras que el objeto <code>Gui</code> contiene las diferentes vistas del documento. Puedes abrir varias ventanas, cada una de ellas viendo tu trabajo con un factor de zoom diferente o desde una direcci&oacute;n diferente. Todas estas vistas forman parte del objeto <code>Gui</code> de tu documento.
</p><p>Para acceder a la parte <code>App</code> del documento actualmente abierto (activo), se escribe:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">myDocument</span> <span class="o">=</span> <span class="n">App</span><span class="o">.</span><span class="n">ActiveDocument</span>
</pre></div>
<p>Para crear un nuevo documento, teclea:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">myDocument</span> <span class="o">=</span> <span class="n">App</span><span class="o">.</span><span class="n">newDocument</span><span class="p">(</span><span class="s2">"Document Name"</span><span class="p">)</span>
</pre></div>
<p>Para acceder a la parte <code>Gui</code> del documento abierto actualmente (active), teclea:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">myGuiDocument</span> <span class="o">=</span> <span class="n">Gui</span><span class="o">.</span><span class="n">ActiveDocument</span>
</pre></div>
<p>Para acceder a la vista actual, teclea:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">myView</span> <span class="o">=</span> <span class="n">Gui</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">ActiveView</span>
</pre></div>
<p><a href="#top">Inicio</a></p>
<p><span id="Using_additional_modules"></span>
</p>
<h2><span id="Utilizando_m.C3.B3dulos_adicionales"></span><span class="mw-headline" id="Utilizando_m&oacute;dulos_adicionales">Utilizando m&oacute;dulos adicionales</span></h2>
<p>Los m&oacute;dulos <code>FreeCAD</code> y <code>FreeCADGui</code> s&oacute;lo se encargan de crear y gestionar objetos en el documento de FreeCAD. En realidad no hacen nada m&aacute;s como crear o modificar la geometr&iacute;a. Esto se debe a que la geometr&iacute;a puede ser de varios tipos, y por lo tanto requiere m&oacute;dulos adicionales, cada uno responsable de la gesti&oacute;n de un determinado tipo de geometr&iacute;a. Por ejemplo, el <a href="../Part_Workbench.html" title="Part Workbench">Part Workbench</a>, usando el kernel de OpenCascade, es capaz de crear y manipular geometr&iacute;a del tipo <a rel="nofollow" class="external text" href="http://en.wikipedia.org/wiki/Boundary_representation">BRep</a>. Mientras que el <a href="../Mesh_Workbench.html" title="Mesh Workbench">Mesh Workbench</a> es capaz de construir y modificar objetos de malla. De esta manera FreeCAD es capaz de manejar una amplia variedad de tipos de objetos, que pueden coexistir en el mismo documento, y nuevos tipos pueden ser f&aacute;cilmente a&ntilde;adidos en el futuro.
</p>
<p><a href="#top">Inicio</a></p>
<p><span id="Creating_objects"></span>
</p>
<h3><span id="Creaci.C3.B3n_objetos"></span><span class="mw-headline" id="Creaci&oacute;n_objetos">Creaci&oacute;n objetos</span></h3>
<p>Cada m&oacute;dulo tiene su propia manera de tratar la geometr&iacute;a, pero una cosa que normalmente todos pueden hacer es crear objetos en el documento. Pero el documento de FreeCAD tambi&eacute;n es consciente de los tipos de objetos disponibles proporcionados por los m&oacute;dulos:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">FreeCAD</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">supportedTypes</span><span class="p">()</span>
</pre></div>
<p>listar&aacute; todos los objetos posibles que puedes crear. Por ejemplo, vamos a crear una malla (manejada por el m&oacute;dulo <code>Mesh</code>) y una pieza (manejada por el m&oacute;dulo <code>Part</code>):
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">myMesh</span> <span class="o">=</span> <span class="n">FreeCAD</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">addObject</span><span class="p">(</span><span class="s2">"Mesh::Feature"</span><span class="p">,</span> <span class="s2">"myMeshName"</span><span class="p">)</span>
<span class="n">myPart</span> <span class="o">=</span> <span class="n">FreeCAD</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">addObject</span><span class="p">(</span><span class="s2">"Part::Feature"</span><span class="p">,</span> <span class="s2">"myPartName"</span><span class="p">)</span>
</pre></div>
<p>El primer argumento es el tipo de objeto, el segundo el nombre del objeto. Nuestros dos objetos parecen casi iguales: no contienen ninguna geometr&iacute;a todav&iacute;a, y la mayor&iacute;a de sus propiedades son las mismas cuando los inspeccionas con <code>dir(myMesh)</code> y <code>dir(myPart)</code>. Excepto por una cosa, <code>myMesh</code> tiene una propiedad <code>Mesh</code> y <code>myPart</code> tiene una propiedad <code>Shape</code>. Ah&iacute; es donde se almacenan los datos de la Malla y de la Pieza. Por ejemplo, vamos a crear un cubo <code>Part</code> y almacenarlo en nuestro objeto <code>myPart</code>:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="kn">import</span> <span class="nn">Part</span>
<span class="n">cube</span> <span class="o">=</span> <span class="n">Part</span><span class="o">.</span><span class="n">makeBox</span><span class="p">(</span><span class="mi">2</span><span class="p">,</span> <span class="mi">2</span><span class="p">,</span> <span class="mi">2</span><span class="p">)</span>
<span class="n">myPart</span><span class="o">.</span><span class="n">Shape</span> <span class="o">=</span> <span class="n">cube</span>
</pre></div>
<p>Podr&iacute;as intentar almacenar el cubo dentro de la propiedad <code>Mesh</code> del objeto <code>myMesh</code>, pero devolver&aacute; un error. Esto se debe a que cada propiedad est&aacute; hecha para almacenar s&oacute;lo un tipo determinado. En una propiedad <code>Mesh</code>, s&oacute;lo puedes guardar cosas creadas con el m&oacute;dulo <code>Mesh</code>. Tenga en cuenta que la mayor&iacute;a de los m&oacute;dulos tambi&eacute;n tienen un acceso directo para a&ntilde;adir su geometr&iacute;a al documento:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="kn">import</span> <span class="nn">Part</span>
<span class="n">cube</span> <span class="o">=</span> <span class="n">Part</span><span class="o">.</span><span class="n">makeBox</span><span class="p">(</span><span class="mi">2</span><span class="p">,</span> <span class="mi">2</span><span class="p">,</span> <span class="mi">2</span><span class="p">)</span>
<span class="n">Part</span><span class="o">.</span><span class="n">show</span><span class="p">(</span><span class="n">cube</span><span class="p">)</span>
</pre></div>
<p><a href="#top">Inicio</a></p>
<p><span id="Modifying_objects"></span>
</p>
<h3><span class="mw-headline" id="Modificando_objetos">Modificando objetos</span></h3>
<p>Modificaci&oacute;n de un objeto se hace de la misma manera:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="kn">import</span> <span class="nn">Part</span>
<span class="n">cube</span> <span class="o">=</span> <span class="n">Part</span><span class="o">.</span><span class="n">makeBox</span><span class="p">(</span><span class="mi">2</span><span class="p">,</span> <span class="mi">2</span><span class="p">,</span> <span class="mi">2</span><span class="p">)</span>
<span class="n">myPart</span><span class="o">.</span><span class="n">Shape</span> <span class="o">=</span> <span class="n">cube</span>
</pre></div>
<p>Ahora vamos a cambiar la forma por una mayor:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">biggercube</span> <span class="o">=</span> <span class="n">Part</span><span class="o">.</span><span class="n">makeBox</span><span class="p">(</span><span class="mi">5</span><span class="p">,</span> <span class="mi">5</span><span class="p">,</span> <span class="mi">5</span><span class="p">)</span>
<span class="n">myPart</span><span class="o">.</span><span class="n">Shape</span> <span class="o">=</span> <span class="n">biggercube</span>
</pre></div>
<p><a href="#top">Inicio</a></p>
<p><span id="Querying_objects"></span>
</p>
<h3><span class="mw-headline" id="Consultar_objetos">Consultar objetos</span></h3>
<p>Siempre se puede mirar el tipo de un objeto as&iacute;:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">myObj</span> <span class="o">=</span> <span class="n">FreeCAD</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">getObject</span><span class="p">(</span><span class="s2">"myObjectName"</span><span class="p">)</span>
<span class="nb">print</span><span class="p">(</span><span class="n">myObj</span><span class="o">.</span><span class="n">TypeId</span><span class="p">)</span>
</pre></div>
<p>o comprobar si un objeto deriva de uno de los b&aacute;sicos (Caracter&iacute;stica Pieza, Caracter&iacute;stica Malla, etc):
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="nb">print</span><span class="p">(</span><span class="n">myObj</span><span class="o">.</span><span class="n">isDerivedFrom</span><span class="p">(</span><span class="s2">"Part::Feature"</span><span class="p">))</span>
</pre></div>
<p>&iexcl;Ahora puedes empezar a jugar de verdad con FreeCAD! Para una lista completa de los m&oacute;dulos disponibles y sus herramientas, visite la secci&oacute;n <a href="../es/Category;API.html" title="Category:API/es">Categor&iacute;a:API</a>.
</p>
<p><a href="#top">Inicio</a></p>
<div class="mw-translate-fuzzy">
<div class="docnav" style="background-color: #ececef; border: 1px solid #a2a9b1; padding: 2px 10px; margin: 10px 0; line-height: 1; clear: both; overflow: hidden;">
    <div style="margin: 4px 0; float: left;"><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-left.svg" decoding="async" width="16" height="16"></span></span> Python scripting tutorial/es</div>
    <div style="margin: 4px 0; float: right;">Mesh Scripting/es <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-right.svg" decoding="async" width="16" height="16"></span></span></div>
    <div style="text-align:center"><a href="../es/Online_Help_Toc.html" title="Online Help Toc/es">Indice</a> <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Online_Help_Toc.svg" decoding="async" width="24" height="24"></span></span></div>
</div>
</div>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: #fefefe;"><span typeof="mw:File"><a href="../index.php?title=Power_user_hub.png&amp;filetimestamp=20200511213015&amp;.html" class="mw-file-description"><img src="../File/Power_user_hub.png" decoding="async" width="24" height="24"></a></span> <a href="../es/Power_users_hub.html" title="Power users hub/es">Power user documentation</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid #aaaaaa; text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: #fefefe;">
<ul><li><b>FreeCAD scripting:</b> <a href="../es/Python.html" title="Python/es">Python</a>, <a href="../es/Introduction_to_Python.html" title="Introduction to Python/es">Introduction to Python</a>, <a href="../es/Python_scripting_tutorial.html" title="Python scripting tutorial/es">Python scripting tutorial</a>, <a class="mw-selflink selflink">FreeCAD Scripting Basics</a></li></ul>
<hr>
<ul><li><b>Modules:</b> <a href="../es/Builtin_modules.html" title="Builtin modules/es">Builtin modules</a>, <a href="../es/Units.html" title="Units/es">Units</a>, <a href="../index.php?title=Quantity/es&amp;action=edit&amp;redlink=1.html" class="new" title="Quantity/es (page does not exist)">Quantity</a></li>
<li><b>Workbenches:</b> <a href="../es/Workbench_creation.html" title="Workbench creation/es">Workbench creation</a>, <a href="../es/Gui_Command.html" title="Gui Command/es">Gui Commands</a>, <a href="../es/Command.html" title="Command/es">Commands</a>, <a href="../es/Installing_more_workbenches.html" title="Installing more workbenches/es">Installing more workbenches</a></li>
<li><b>Meshes and Parts:</b> <a href="../es/Mesh_Scripting.html" title="Mesh Scripting/es">Mesh Scripting</a>, <a href="../es/Topological_data_scripting.html" title="Topological data scripting/es">Topological data scripting</a>, <a href="../es/Mesh_to_Part.html" title="Mesh to Part/es">Mesh to Part</a>, <a href="../es/PythonOCC.html" title="PythonOCC/es">PythonOCC</a></li></ul>
<hr>
<ul><li><b>Parametric objects:</b> <a href="../es/Scripted_objects.html" title="Scripted objects/es">Scripted objects</a>, <a href="../index.php?title=Viewprovider/es&amp;action=edit&amp;redlink=1.html" class="new" title="Viewprovider/es (page does not exist)">Viewproviders</a> <small>(<a href="../index.php?title=Custom_icon_in_tree_view/es&amp;action=edit&amp;redlink=1.html" class="new" title="Custom icon in tree view/es (page does not exist)">Custom icon in tree view</a>)</small></li>
<li><b>Scenegraph:</b> <a href="../es/Scenegraph.html" title="Scenegraph/es">Coin (Inventor) scenegraph</a>, <a href="../es/Pivy.html" title="Pivy/es">Pivy</a></li>
<li><b>Graphical interface:</b> <a href="../index.php?title=Interface_creation/es&amp;action=edit&amp;redlink=1.html" class="new" title="Interface creation/es (page does not exist)">Interface creation</a>, <a href="../es/Dialog_creation.html" title="Dialog creation/es">Interface creation completely in Python</a> <small>(<a href="../index.php?title=Dialog_creation_with_various_widgets/es&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation with various widgets/es (page does not exist)">1</a>, <a href="../index.php?title=Dialog_creation_reading_and_writing_files/es&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation reading and writing files/es (page does not exist)">2</a>, <a href="../index.php?title=Dialog_creation_setting_colors/es&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation setting colors/es (page does not exist)">3</a>, <a href="../index.php?title=Dialog_creation_image_and_animated_GIF/es&amp;action=edit&amp;redlink=1.html" class="new" title="Dialog creation image and animated GIF/es (page does not exist)">4</a>, <a href="../index.php?title=PySide_usage_snippets/es&amp;action=edit&amp;redlink=1.html" class="new" title="PySide usage snippets/es (page does not exist)">5</a>)</small>, <a href="../es/PySide.html" title="PySide/es">PySide</a>, PySide examples <a href="../es/PySide_Beginner_Examples.html" title="PySide Beginner Examples/es">beginner</a>, <a href="../index.php?title=PySide_Intermediate_Examples/es&amp;action=edit&amp;redlink=1.html" class="new" title="PySide Intermediate Examples/es (page does not exist)">intermediate</a>, <a href="../index.php?title=PySide_Advanced_Examples/es&amp;action=edit&amp;redlink=1.html" class="new" title="PySide Advanced Examples/es (page does not exist)">advanced</a></li>
<li><b>Macros:</b> <a href="../es/Macros.html" title="Macros/es">Macros</a>, <a href="../es/How_to_install_macros.html" title="How to install macros/es">How to install macros</a></li>
<li><b>Embedding:</b> <a href="../es/Embedding_FreeCAD.html" title="Embedding FreeCAD/es">Embedding FreeCAD</a>, <a href="../es/Embedding_FreeCADGui.html" title="Embedding FreeCADGui/es">Embedding FreeCADGui</a></li></ul>
<hr>
<ul><li><b>Other:</b> <a href="../es/Expressions.html" title="Expressions/es">Expressions</a>, <a href="../es/Code_snippets.html" title="Code snippets/es">Code snippets</a>, <a href="../es/Line_drawing_function.html" title="Line drawing function/es">Line drawing function</a>, <a href="../es/FreeCAD_vector_math_library.html" title="FreeCAD vector math library/es">FreeCAD vector math library</a> <small>(deprecated)</small></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="../es/User_hub.html" title="User hub/es">User hub</a>, <a href="../es/Power_users_hub.html" title="Power users hub/es">Power users hub</a>, <a href="../es/Developer_hub.html" title="Developer hub/es">Developer hub</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20250622010135
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc, no&#8208;toc&#8208;conversion]
CPU time usage: 0.184 seconds
Real time usage: 0.621 seconds
Preprocessor visited node count: 750/1000000
Post&#8208;expand include size: 11034/2097152 bytes
Template argument size: 3734/2097152 bytes
Highest expansion depth: 5/100
Expensive parser function count: 16/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 11176/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%  324.185      1 -total
 86.26%  279.637     16 Template:Code
  2.72%    8.828      1 Template:Powerdocnavi/es
  2.03%    6.566      1 Template:TOCright
  1.94%    6.283     51 Template:Incode
  1.82%    5.910      9 Template:Top
  1.47%    4.762      1 Template:Docnav/es
  1.04%    3.369      1 Template:Docnav
  1.00%    3.249      1 Template:Navigation_menu_2
  0.82%    2.657      4 Template:MenuCommand
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:876-0!canonical and timestamp 20250622010134 and revision id 1595278. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>