<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">History/es</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="es" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-History&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/History.html" class="mw-pt-progress mw-pt-progress--complete" title="Geschichte (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../History.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="History (100% translated)" lang="en" dir="ltr">English</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--high" lang="es" dir="ltr">espa&ntilde;ol</span></li>
<li><a href="../fr/History.html" class="mw-pt-progress mw-pt-progress--complete" title="Histoire (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/History.html" class="mw-pt-progress mw-pt-progress--complete" title="La storia di FreeCAD (100% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/History.html" class="mw-pt-progress mw-pt-progress--complete" title="Historia (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt/History.html" class="mw-pt-progress mw-pt-progress--low" title="History/pt (0% translated)" lang="pt" dir="ltr">portugu&ecirc;s</a></li>
<li><a href="../pt-br/History.html" class="mw-pt-progress mw-pt-progress--high" title="Historia (73% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../ro/History.html" class="mw-pt-progress mw-pt-progress--med" title="Istorie (15% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><a href="../ru/History.html" class="mw-pt-progress mw-pt-progress--med" title="&#1048;&#1089;&#1090;&#1086;&#1088;&#1080;&#1103; (35% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li>
<li><a href="../zh-cn/History.html" class="mw-pt-progress mw-pt-progress--low" title="&#21457;&#23637;&#21382;&#21490; (10% translated)" lang="zh-Hans-CN" dir="ltr">&#20013;&#25991;&#65288;&#20013;&#22269;&#22823;&#38470;&#65289;</a></li>
<li><a href="../ja/History.html" class="mw-pt-progress mw-pt-progress--low" title="&#27508;&#21490; (12% translated)" lang="ja" dir="ltr">&#26085;&#26412;&#35486;</a></li>
<li><a href="../ko/History.html" class="mw-pt-progress mw-pt-progress--low" title="&#50669;&#49324; (7% translated)" lang="ko" dir="ltr">&#54620;&#44397;&#50612;</a></li></ul></div>
<meta property="mw:PageProp/toc">
<h2><span class="mw-headline" id="Historia">Historia</span></h2>
<figure typeof="mw:File/Thumb"><a href="../index.php?title=Screenshot_mesh.jpg&amp;filetimestamp=20090514190409&amp;.html" class="mw-file-description"><img src="../File/Screenshot_mesh.jpg" decoding="async" width="300" height="227" class="mw-file-element" data-file-width="634" data-file-height="480"></a><figcaption>Primera versi&oacute;n de FreeCAD, desconocida</figcaption></figure>
<figure typeof="mw:File/Thumb"><a href="../index.php?title=Part_BooleanOperations.png&amp;filetimestamp=20090426092531&amp;.html" class="mw-file-description"><img src="../File/Part_BooleanOperations.png" decoding="async" width="300" height="231" class="mw-file-element" data-file-width="1036" data-file-height="796"></a><figcaption>FreeCAD versi&oacute;n 0.7 de 2009</figcaption></figure>
<h3><span id="C.C3.B3mo_empez.C3.B3_todo"></span><span class="mw-headline" id="C&oacute;mo_empez&oacute;_todo">C&oacute;mo empez&oacute; todo</span></h3>
<p>FreeCAD comenz&oacute; en enero de 2001 cuando <a href="../User;Jriegel.html" title="User:Jriegel">J&uuml;rgen Riegel</a> empez&oacute; a trabajar en el proyecto Cas.CADE. Cas.CADE era un marco de desarrollo de software comercial que inclu&iacute;a un <a href="../Glossary.html#Geometric_modeling_kernel" title="Glossary">n&uacute;cleo de modelado geom&eacute;trico</a> (o kernel CAD): fue publicado bajo una licencia de c&oacute;digo abierto en el a&ntilde;o 2000 y rebautizado como <a href="../es/OpenCASCADE.html" title="OpenCASCADE/es">OpenCASCADE</a>. Esto hizo posible la realizaci&oacute;n de un programa de CAD 3D de c&oacute;digo abierto, ya que tener que programar un n&uacute;cleo de CAD desde cero habr&iacute;a requerido una enorme cantidad de trabajo.
</p><p>En las palabras propio del J&uuml;rgen:
</p>
<blockquote class="templatequote"><p><i>El proyecto FreeCAD fue iniciado por m&iacute; en enero de 2001, como un llamado GOM (Modelador gr&aacute;fico de objetos), con la idea de usar Qt, Python y Cas.CADE, un CAD Kernel comercial que en ese momento usaba en los proyectos de Daimler. Cas.CADE se convirti&oacute; en c&oacute;digo abierto poco antes, por lo que parec&iacute;a el momento adecuado para intentar un movimiento en el, en ese momento, espacio vac&iacute;o de CAD de c&oacute;digo abierto. Tuve una experiencia de dos a&ntilde;os con OpenCascade en un proyecto llamado QSpect en el que, al final, fui el principal dise&ntilde;ador de software. Aprend&iacute; mucho sobre 3D y programaci&oacute;n CAD. Tambi&eacute;n me influy&oacute; Catia V5 y su muy especial interfaz de usuario y programaci&oacute;n... En el 17 de marzo de 2002, dentro del proyecto OpenCascade, registr&eacute; el software como FreeCAD. No se me ocurri&oacute; un nombre mejor, soy muy malo con los nombres... En abril de 2003, Werner Meyer, uno de los compa&ntilde;eros del proyecto QSpect, se pas&oacute; a una empresa llamada Imetric. El contacto con Imetric result&oacute; muy prometedor ya que buscaban una nueva plataforma de software 3D para sus sensores 3D. En 2005, Imetric don&oacute; la mayor parte de su m&oacute;dulo de malla a FreeCAD y a la comunidad de c&oacute;digo abierto, y desde entonces utilizaron FreeCAD como base para el software de su sistema de sensores. Desde entonces, Werner Meyer es un desarrollador muy activo de FreeCAD. En 2005, despu&eacute;s de un a&ntilde;o de lucha, decid&iacute; arrancar el marco documental de OpenCascade y sustituirlo por una implementaci&oacute;n propia. As&iacute; que, al final, s&oacute;lo utilizamos el n&uacute;cleo CAD de OpenCascade y no el resto de su Framework. 2007 fue otro hito interesante. Cambiamos a QT4 y, por tanto, a la LGPL. En ese momento hicimos mucho trabajo, principalmente Werner</i>.</p><div class="templatequotecite">&mdash;<a href="../User;Jriegel.html" title="User:Jriegel">J&uuml;rgen Riegel</a>,&nbsp;<cite><i><a rel="nofollow" class="external text" href="http://forum.freecad.org/viewtopic.php?f=8&amp;t=295">&iquest;Qui&eacute;n est&aacute; detr&aacute;s de FreeCad?</a></i></cite></div>
</blockquote>
<p>El proyecto se anunci&oacute; al p&uacute;blico en general en el <a rel="nofollow" class="external text" href="https://dev.opencascade.org/forums">OpenCascade Forum</a> en 2003:
</p>
<blockquote class="templatequote"><p><i>Hola a todos, mi nombre es Juergen Riegel y hoy quiero anunciar un proyecto OpenCasCade, FreeCAD. Es un RAD CAx de c&oacute;digo abierto basado en OpenCasCade, QT y Python. Presenta algunos conceptos clave como la grabaci&oacute;n de macros, los bancos de trabajo, la capacidad de ejecutarse como servidor y como extensi&oacute;n de aplicaciones cargables din&aacute;micamente, y est&aacute; dise&ntilde;ado para ser independiente de la plataforma... Aunque se encuentra en una fase temprana y no es utilizable por los usuarios ni por los desarrolladores -la primera versi&oacute;n para usuarios est&aacute; prevista para finales de 2003-, me gustar&iacute;a recibir algunos comentarios sobre la direcci&oacute;n y el dise&ntilde;o de FreeCAD. La interfaz gr&aacute;fica de usuario est&aacute; casi terminada y ahora nosotros, mi co-desarrollador Werner Mayer y yo, hemos empezado a a&ntilde;adir las primeras funciones CAD. FreeCAD puede ser visto como un sistema de CAD mec&aacute;nico de prop&oacute;sito general, pero su primera audiencia, creo, ser&aacute;n los desarrolladores de CAx que necesitan un trabajo de base para su propio desarrollo</i>.</p><div class="templatequotecite">&mdash;<a href="../User;Jriegel.html" title="User:Jriegel">J&uuml;rgen Riegel</a>,&nbsp;<cite><i><a rel="nofollow" class="external text" href="https://dev.opencascade.org/content/announcing-freecad-project">Announcing FreeCAD Project on Sun, 08/17/2003 - 19:23</a></i></cite></div>
</blockquote>
<h3><span class="mw-headline" id="Werner_Mayer">Werner Mayer</span></h3>
<p>Werner Mayer se uni&oacute; al proyecto tan pronto como se anunci&oacute; como proyecto de c&oacute;digo abierto (antes del anuncio el proyecto era un proyecto privado de J&uuml;rgen). V&eacute;ase este mensaje de Werner en el foro en alem&aacute;n: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=13&amp;t=40235&amp;start=10#p342330">https://forum.freecad.org/viewtopic.php?f=13&amp;t=40235&amp;start=10#p342330</a>
</p><p>Con el tiempo, el proyecto fue ganando adeptos y se incorporaron nuevos colaboradores clave en la comunidad.
</p>
<ul><li><b>Inicio de Linux</b></li></ul>
<blockquote class="templatequote"><p><i>Un hecho divertido es que quer&iacute;a tener un software CAD de c&oacute;digo abierto principalmente para Linux porque en ese momento no exist&iacute;a nada para esta plataforma. Sin embargo, desde el principio desarrollamos exclusivamente en Windows durante los siguientes 1,5 a&ntilde;os. Entonces un checo hizo una contribuci&oacute;n para hacer el c&oacute;digo del n&uacute;cleo en Linux: <a rel="nofollow" class="external free" href="https://github.com/berndhahnebach/All_FreeCAD/commit/9fd2e27c95ba3dc84778d92e2564cd094793ce2f#diff-480477e89f9b6ddafb30c4383dcdd705">https://github.com/berndhahnebach/All_FreeCAD/commit/9fd2e27c95ba3dc84778d92e2564cd094793ce2f#diff-480477e89f9b6ddafb30c4383dcdd705</a></i>
</p></blockquote>
<blockquote class="templatequote"><p><i>Medio a&ntilde;o m&aacute;s tarde continu&eacute; la construcci&oacute;n de Linux: <a rel="nofollow" class="external free" href="https://github.com/berndhahnebach/All_FreeCAD/commit/35b962d7d751dd80f7c7781df60f93bc9a3da992">https://github.com/berndhahnebach/All_FreeCAD/commit/35b962d7d751dd80f7c7781df60f93bc9a3da992</a></i>
</p></blockquote>
<p><b>P:</b> &iquest;Podr&iacute;a compartir c&oacute;mo fue ese primer a&ntilde;o y medio? &iquest;Se conocieron en persona o en l&iacute;nea?
</p>
<blockquote class="templatequote"><p><i>Bueno, en aquella &eacute;poca &eacute;ramos colegas (hasta 2005), as&iacute; que pod&iacute;amos discutir las cosas cara a cara. Despu&eacute;s de esa &eacute;poca, seguimos teniendo algunos encuentros personales, pero discutimos la mayor&iacute;a de las cosas por correo electr&oacute;nico o por tel&eacute;fono.</i>
</p></blockquote>
<blockquote class="templatequote"><p><i>Como tercer desarrollador del n&uacute;cleo, Yorik se uni&oacute; a finales de 2007, pero pasaron otros 3 o 4 a&ntilde;os hasta que la comunidad y el n&uacute;mero de colaboradores empezaron a crecer significativamente.</i>
</p></blockquote>
<p><b>P:</b> &iquest;Dividieron las tareas o trabajaron en implementaciones que compet&iacute;an entre s&iacute;?
</p>
<blockquote class="templatequote"><p><i>S&iacute;. J&uuml;rgen dise&ntilde;aba e implementaba la mayor parte de la aplicaci&oacute;n y la l&oacute;gica del documento y yo hac&iacute;a lo b&aacute;sico de la interfaz gr&aacute;fica de usuario.</i>
</p><p><i></i>
</p>
</blockquote>
<blockquote class="templatequote"><p><i>Sin embargo, no ha sido un proceso gradual, sino que hemos experimentado con muchas cosas al principio. Por ejemplo, en la versi&oacute;n inicial utilizamos el marco documental de OCC, OCAF, y su visor, pero al cabo de uno o dos a&ntilde;os nos metimos en un callej&oacute;n sin salida porque la documentaci&oacute;n sobre OCC era muy pobre y no conseguimos que funcionara para ampliar OCAF con nuestros propios tipos de caracter&iacute;sticas. As&iacute; que decidimos utilizar &uacute;nicamente las capacidades de modelado de OCC pero desarrollar nuestro propio marco de aplicaci&oacute;n/documento.</i>
</p></blockquote>
<p><b>P:</b> En aquel momento, &iquest;pensabas que FreeCAD estar&iacute;a donde est&aacute; hoy?
</p>
<blockquote class="templatequote"><p><i>No lo sab&iacute;amos pero lo esper&aacute;bamos. Por supuesto, no pod&iacute;amos anticipar c&oacute;mo se ver&iacute;a exactamente FreeCAD hoy en d&iacute;a.<br>Las decisiones de dise&ntilde;o m&aacute;s importantes fueron hacer que estuviera disponible en todas las plataformas principales y hacer que todo el SW fuera lo m&aacute;s accesible posible, es decir, imponer todas las funciones importantes a Python para que los usuarios (avanzados) pudieran extender FreeCAD con sus propias funciones. De esta manera esper&aacute;bamos conseguir una amplia audiencia.</i>
</p></blockquote>
<p>(Ver este post del foro de Werner <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?f=8&amp;t=47703#p411612">Re: Historia de FreeCAD</a>)
</p>
<h3><span class="mw-headline" id="Yorik_se_une_al_proyecto">Yorik se une al proyecto</span></h3>
<p><a href="../User;Yorik.html" title="User:Yorik">Yorik van Havre</a> se uni&oacute; al proyecto en 2008 y comenz&oacute; a trabajar en el <a href="../Draft_Workbench.html" title="Draft Workbench">M&oacute;dulo de Borrador</a>. Antes de ese momento, no hab&iacute;a forma de crear geometr&iacute;a 2D a trav&eacute;s de la <a href="../Glossary.html#GUI" title="Glossary">GUI</a>. Este m&oacute;dulo fue programado completamente en Python en lugar de en C++ (el lenguaje de programaci&oacute;n principal utilizado en FreeCAD). El nuevo banco de trabajo de Borrador demostr&oacute; que la integraci&oacute;n de Python era un &eacute;xito y que pod&iacute;a utilizarse para ampliar o personalizar las capacidades de FreeCAD. Adem&aacute;s de su trabajo en el m&oacute;dulo Draft, Yorik trabaj&oacute; en la expansi&oacute;n de la documentaci&oacute;n de FreeCAD, y se convirti&oacute; en el "director de arte" de facto de FreeCAD, creando muchos iconos para la interfaz gr&aacute;fica de FreeCAD y <a href="../es/Artwork.html" title="Artwork/es">definiendo su estilo</a>.
</p><p>La versi&oacute;n 0.7 de FreeCAD lanzada en abril de 2009 fue la primera en incluir el m&oacute;dulo Borrador. El m&oacute;dulo Pieza proporcionaba un simple flujo de trabajo de <a href="../Glossary.html#Geometr%C3%ADa_S%C3%B3lida_Constructiva" title="Glossary">CSG</a> con la creaci&oacute;n de formas primitivas y operaciones booleanas accesibles a trav&eacute;s del men&uacute; Pieza. Tambi&eacute;n era posible la extrusi&oacute;n de perfiles 2D y el Redondeado.
</p><p>La versi&oacute;n 0.8, lanzada en julio de 2009, incluy&oacute; m&aacute;s trabajo en el m&oacute;dulo de Borrador, incluyendo una nueva herramienta de Dimensi&oacute;n. El m&oacute;dulo de Pieza se benefici&oacute; de una nueva barra de herramientas junto con nuevas herramientas, Revolver y Secci&oacute;n.
</p><p>A finales de 2009, FreeCAD fue aceptado como paquete Debian en los repositorios de Debian. FreeCAD se a&ntilde;adi&oacute; a los repositorios de Ubuntu 10.04 en 2010.
</p>
<h3><span id="El_proyecto_contin.C3.BAa"></span><span class="mw-headline" id="El_proyecto_contin&uacute;a">El proyecto contin&uacute;a</span></h3>
<p>La versi&oacute;n 0.10 fue lanzada en julio de 2010 e introdujo el <a href="../es/Sketcher_Workbench.html" title="Sketcher Workbench/es">Ambiente de trabajo Croquizador</a>, basado en Sketchsolve, un solucionador basado en restricciones para crear geometr&iacute;a 2D. La primera versi&oacute;n estaba limitada a la creaci&oacute;n de rect&aacute;ngulos y l&iacute;neas.
</p><p>A principios de 2011, aprovechando la oportunidad que ofrec&iacute;a la plataforma online <a rel="nofollow" class="external text" href="https://launchpad.net">Launchpad</a>, se cre&oacute; el <a rel="nofollow" class="external text" href="https://launchpad.net/~freecad-maintainers">FreeCAD Equipo de mantenimiento</a> para proporcionar nuevas versiones estables junto con paquetes de construcci&oacute;n diarios de FreeCAD a los usuarios del sistema operativo Ubuntu.
</p><p>La versi&oacute;n 0.11 fue lanzada en mayo de 2011 e introdujo el nuevo ambiente de trabajo Dise&ntilde;oPieza que inclu&iacute;a herramientas como Pastilla, Cajera, Redondeado y  Chafl&aacute;n. El ambiente de trabajo de Borrador recibi&oacute; mejoras y nuevas herramientas, como BSpline. El ambiente de trabajo de Robot present&oacute; m&aacute;s herramientas de la interfaz gr&aacute;fica de usuario.
</p><p>La versi&oacute;n 0.12 se public&oacute; en enero de 2012 y ofrec&iacute;a un ambiente de trabajo de Coquizador m&aacute;s completo. Inclu&iacute;a un solucionador totalmente reescrito, FreeGCS. Fue el resultado de meses de trabajo de los principales desarrolladores de FreeCAD junto con los reci&eacute;n llegados logari81 (que program&oacute; el solucionador) y mrlukeparry. Se a&ntilde;adieron m&aacute;s herramientas al ambiente de trabajo de Dise&ntilde;oPieza.
</p>
<h3><span id="Ampliaci.C3.B3n_del_equipo_de_desarrolladores_del_n.C3.BAcleo"></span><span class="mw-headline" id="Ampliaci&oacute;n_del_equipo_de_desarrolladores_del_n&uacute;cleo">Ampliaci&oacute;n del equipo de desarrolladores del n&uacute;cleo</span></h3>
<p>En abril de 2019 se ampli&oacute; el equipo de desarrolladores del n&uacute;cleo: A J&uuml;rgen, Werner y Yorik se unieron Abdullah, Bernd, sliptonic y WandererFan
</p>
<h2><span class="mw-headline" id="Mensajes_interesantes_en_el_foro">Mensajes interesantes en el foro</span></h2>
<ul><li>sobre PartDesignNext y otras decisiones de dise&ntilde;o: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=8&amp;t=34923&amp;start=130#p297074">https://forum.freecad.org/viewtopic.php?f=8&amp;t=34923&amp;start=130#p297074</a></li>
<li>sobre la historia del foro: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=8&amp;t=7448&amp;start=200#p287106">https://forum.freecad.org/viewtopic.php?f=8&amp;t=7448&amp;start=200#p287106</a></li>
<li>sobre la historia del proyecto: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=8&amp;t=47703">https://forum.freecad.org/viewtopic.php?f=8&amp;t=47703</a></li>
<li>sobre la historia del c&oacute;digo: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=10&amp;t=46733&amp;start=10#p405068">https://forum.freecad.org/viewtopic.php?f=10&amp;t=46733&amp;start=10#p405068</a> BTW: el checkin inicial del c&oacute;digo fue el 18 de marzo de 2002 (&iquest;puede ser el cumplea&ntilde;os?)</li>
<li>Sobre el proyecto que ser&aacute; de c&oacute;digo abierto: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=13&amp;t=40235&amp;start=10#p342330">https://forum.freecad.org/viewtopic.php?f=13&amp;t=40235&amp;start=10#p342330</a></li>
<li>sobre el historial de commits de la versi&oacute;n: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=8&amp;t=23695#p184940">https://forum.freecad.org/viewtopic.php?f=8&amp;t=23695#p184940</a></li>
<li>sobre qui&eacute;n est&aacute; detr&aacute;s de FreeCAD: <a rel="nofollow" class="external free" href="http://forum.freecad.org/viewtopic.php?f=8&amp;t=295">http://forum.freecad.org/viewtopic.php?f=8&amp;t=295</a></li>
<li>sobre la historia MEF: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=18&amp;t=48646#p416389">https://forum.freecad.org/viewtopic.php?f=18&amp;t=48646#p416389</a></li>
<li>sobre la historia MEF Mesher: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=18&amp;t=48733#p417627">https://forum.freecad.org/viewtopic.php?f=18&amp;t=48733#p417627</a></li></ul>
<p><span id="Release_history"></span>
</p>
<h2><span class="mw-headline" id="Historia_del_lanzamiento">Historia del lanzamiento</span></h2>
<h4><span class="mw-headline" id="Overview">Overview</span></h4>
<table class="wikitable" style="margin: 0.4em 0 0.5em;">

<tbody><tr>
<th style="background-color: #cccccc;">Versi&oacute;n
</th>
<th class="unsortable" style="background-color: #cccccc;">Nombre del lanzamiento
</th>
<th style="background-color: #cccccc; white-space: nowrap;">Fecha de lanzamiento
</th>
<th class="unsortable" style="background-color: #cccccc;">Notas de lanzamiento
</th>
<th class="unsortable" style="background-color: #cccccc;">Compromiso de lanzamiento
</th>
<th class="unsortable" style="background-color: #cccccc;">Rama de lanzamiento
<div lang="en" dir="ltr" class="mw-content-ltr">
</div></th></tr>
<tr>
<td style="background-color: #C1E6F5;">1.1
</td>
<td>-
</td>
<td>in development
</td>
<td><a href="../Release_notes_1.1.html" title="Release notes 1.1">Release notes 1.1</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/main">head main</a>
</td>
<td>

<div lang="en" dir="ltr" class="mw-content-ltr">
</div></td></tr>
<tr>
<td style="background-color: #D4F4B4;">1.0
</td>
<td>BGBSWW
</td>
<td>2024-11-18
</td>
<td><a href="../Release_notes_1.0.html" title="Release notes 1.0">Release notes 1.0</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-1-0">release commit 1.0</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-1-0">branch bugfixes 1.0</a>

<div lang="en" dir="ltr" class="mw-content-ltr">
</div></td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.21
</td>
<td>-
</td>
<td>2023-08-02
</td>
<td><a href="../Release_notes_0.21.html" title="Release notes 0.21">Release notes 0.21</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-21">release commit 0.21</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-21">branch bugfixes 0.21</a>

<div class="mw-translate-fuzzy">
</div></td></tr>
<tr>
<td style="background-color: #D4F4B4;">0.20
</td>
<td>-
</td>
<td>2022-06-14
</td>
<td><a href="../es/Release_notes_0.20.html" title="Release notes 0.20/es">Notas del lanzamiento 0.20</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-20">release commit 0.20</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-20">branch bugfixes 0.20</a>

</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.19
</td>
<td>-
</td>
<td>2021-03-20
</td>
<td><a href="../es/Release_notes_0.19.html" title="Release notes 0.19/es">Notas del lanzamiento 0.19</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-19">release commit 0.19</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-19">branch bugfixes 0.19</a>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.18
</td>
<td>-
</td>
<td>2019-03-12
</td>
<td><a href="../Release_notes_0.18.html" title="Release notes 0.18">Notas del lanzamiento 0.18</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-18">release commit 0.18</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-18">branch bugfixes 0.18</a>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.17
</td>
<td>Roland
</td>
<td>2018-04-06
</td>
<td><a href="../Release_notes_0.17.html" title="Release notes 0.17">Notas del lanzamiento 0.17</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-17">release commit 0.17</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-17">branch bugfixes 0.17</a>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.16
</td>
<td>-
</td>
<td>2016-04-18
</td>
<td><a href="../Release_notes_0.16.html" title="Release notes 0.16">Notas del lanzamiento 0.16</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-16">release commit 0.16</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-16">branch bugfixes 0.16</a>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.15
</td>
<td>-
</td>
<td>2015-04-08
</td>
<td><a href="../Release_notes_0.15.html" title="Release notes 0.15">Notas del lanzamiento 0.15</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-15">release commit 0.15</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-15">branch bugfixes 0.15</a>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.14
</td>
<td>-
</td>
<td>2014-07-01
</td>
<td><a href="../Release_notes_0.14.html" title="Release notes 0.14">Notas del lanzamiento 0.14</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-14">release commit 0.14</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-14">branch bugfixes 0.14</a>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.13
</td>
<td>-
</td>
<td>2013-01-29
</td>
<td><a href="../Release_notes_0.13.html" title="Release notes 0.13">Notas del lanzamiento 0.13</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-13">release commit 0.13</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-13">branch bugfixes 0.13</a>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.12
</td>
<td>-
</td>
<td>2011-12-20
</td>
<td><a href="../Release_notes_0.12.html" title="Release notes 0.12">Notas del lanzamiento 0.12</a>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.11
</td>
<td>-
</td>
<td>2011-05-03
</td>
<td><a href="../Release_notes_0.11.html" title="Release notes 0.11">Notas del lanzamiento 0.11</a>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.10
</td>
<td>-
</td>
<td>2010-07-24
</td>
<td>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.9
</td>
<td>-
</td>
<td>2010-01-16
</td>
<td>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.8
</td>
<td>-
</td>
<td>2009-07-10
</td>
<td>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.7
</td>
<td>-
</td>
<td>2009-04-24
</td>
<td>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.6
</td>
<td>-
</td>
<td>2007-02-27
</td>
<td>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.5
</td>
<td>-
</td>
<td>2006-10-05
</td>
<td>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.4
</td>
<td>-
</td>
<td>2006-01-15
</td>
<td>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.3
</td>
<td>-
</td>
<td>2005-10-31
</td>
<td>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.2
</td>
<td>-
</td>
<td>2005-08-09
</td>
<td>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.1
</td>
<td>-
</td>
<td>2003-01-27
</td>
<td>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.0.1
</td>
<td>-
</td>
<td>2002-10-29
</td>
<td>Carga inicial de una versi&oacute;n
</td>
<td>
</td>
<td>
</td></tr></tbody></table>
<p><span id="Legend"></span>
</p>
<h4><span class="mw-headline" id="Leyenda">Leyenda</span></h4>
<div class="mw-translate-fuzzy">


style="background-color: #cccccc;"| Color
style="background-color: #cccccc;"| Tipo de versi&oacute;n

<table class="wikitable" style="margin: 0.4em 0 0.5em;"><tbody><tr>
<td style="background-color: #C1E6F5;">
</td>
<td>Futuro lanzamiento
</td></tr>
<tr>
<td style="background-color: #FED1A0;">
</td>
<td>&Uacute;ltima versi&oacute;n preliminar
</td></tr>
<tr>
<td style="background-color: #D4F4B4;">
</td>
<td><b>&Uacute;ltima versi&oacute;n</b>
</td></tr>
<tr>
<td style="background-color: #FEF8C6;">
</td>
<td>Versi&oacute;n antigua, todav&iacute;a compatible
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">
</td>
<td>Versi&oacute;n antigua
</td></tr>
</tbody></table>
</div>
<h2><span class="mw-headline" id="Enlaces_externos">Enlaces externos</span></h2>
<ul><li><a rel="nofollow" class="external text" href="http://sourceforge.net/projects/free-cad/files/">Secci&oacute;n de archivos de SourceForge</a></li>
<li><a rel="nofollow" class="external text" href="http://sourceforge.net/projects/free-cad/files/OldFiles/">Secci&oacute;n de archivos antiguos de SourceForge</a></li>
<li><a rel="nofollow" class="external text" href="http://www.opencascade.org/org/forum/thread_6572/?forum=11">Anunciando el proyecto FreeCAD</a> en el foro de OpenCascade</li></ul>
<!-- 
NewPP limit report
Cached time: 20251009170410
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.055 seconds
Real time usage: 0.120 seconds
Preprocessor visited node count: 196/1000000
Post&#8208;expand include size: 6615/2097152 bytes
Template argument size: 5670/2097152 bytes
Highest expansion depth: 5/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 2296/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    7.691      1 -total
 94.65%    7.280      9 Template:Quote
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:101812-0!canonical and timestamp 20251009170410 and revision id 1659721. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>