<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Arch tutorial/ro</span></h1><?xml encoding="UTF-8"><div class="mw-parser-output"><div class="mw-pt-languages noprint" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../de/Arch_tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Arch Tutorium (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Arch_tutorial.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Arch tutorial (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/Arch_tutorial.html" class="mw-pt-progress mw-pt-progress--stub" title="Tutorial M&oacute;dulo de Arquitectura (12% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/Arch_tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Arch Tutoriel (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/Arch_tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Tutorial di Architettura (100% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Arch_tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Poradnik dla &#347;rodowiska pracy Architektura (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt-br/Arch_tutorial.html" class="mw-pt-progress mw-pt-progress--stub" title="Tutorial do M&oacute;dulo de Arquitetura (15% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="ro" dir="ltr">rom&acirc;n&#259;</span></li>
<li><a href="../cs/Arch_tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Architektura V&yacute;ukov&yacute; program (81% translated)" lang="cs" dir="ltr">&#269;e&scaron;tina</a></li>
<li><a href="../ru/Arch_tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="&#1059;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082; &#1087;&#1086; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1085;&#1086;&#1084;&#1091; &#1084;&#1086;&#1076;&#1091;&#1083;&#1102; (83% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li>
<li><a href="../uk/Arch_tutorial.html" class="mw-pt-progress mw-pt-progress--stub" title="&#1055;&#1110;&#1076;&#1088;&#1091;&#1095;&#1085;&#1080;&#1082; Arch (2% translated)" lang="uk" dir="ltr">&#1091;&#1082;&#1088;&#1072;&#1111;&#1085;&#1089;&#1100;&#1082;&#1072;</a></li></ul></div>
<div class="mw-translate-fuzzy">
<table class="fcinfobox wikitable ct" style="width: 230px; float: right; margin-left: 1em">
<tbody><tr>
<td class="ctTitle" style="font-weight: bold; font-size: 125%;"><span typeof="mw:File"><span><img src="../File/Freecad.svg" decoding="async" width="32" height="32"></span></span> Tutorial
</td></tr>
<tr>
<th class="ctOdd">Topic
</th></tr>
<tr>
<td class="ctEven">Modeling
</td></tr>
<tr>
<th class="ctOdd">Level
</th></tr>
<tr>
<td class="ctEven">Intermediate
</td></tr>
<tr>
<th class="ctOdd">Time to complete
</th></tr>
<tr>
<td class="ctEven">
</td></tr>
<tr>
<th class="ctOdd">Authors
</th></tr>
<tr>
<td class="ctEven"><a href="../User;Yorik.html" title="User:Yorik">Yorik</a>
</td></tr>
<tr>
<th class="ctOdd">FreeCAD version
</th></tr>
<tr>
<td class="ctEven">0.14
</td></tr>
<tr>
<th class="ctOdd">Example files
</th></tr>
<tr>
<td class="ctEven">
</td></tr>
<tr>
<th class="ctOdd">See also
</th></tr>
<tr>
<td class="ctEven"><i>None</i>
</td></tr>
<tr>
<td class="ctToc"><br><meta property="mw:PageProp/toc">
</td></tr></tbody></table>
</div>
<p><span typeof="mw:File"><a href="../File/Arch_tutorial_00.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_00.jpg" decoding="async" width="600" height="312"></a></span>
</p><p><span id="Introduction"></span>
</p>
<h2><span class="mw-headline" id="Introducere">Introducere</span></h2>
<div class="mw-translate-fuzzy">
<p>Acest tutorial are scopul de a v&#259; oferi elementele de baz&#259; pentru a lucra cu <a href="../Arch_Workbench.html" title="Arch Workbench">Arch Workbench</a>. Voi incerca sa o fac destul de simplu, astfel &icirc;nc&acirc;t sa nu ave&#539;i nevoie de experien&#539;&#259; anterioar&#259; cu FreeCAD, dar sa ave&#539;i o experien&#539;&#259; cu 3D sau cu aplica&#539;ii tip <a rel="nofollow" class="external text" href="http://en.wikipedia.org/wiki/Building_Information_Modeling">BIM</a> . &Icirc;n orice caz, ar trebui s&#259; fi&#539;i preg&#259;tit s&#259; v&#259; c&#259;uta&#539;i informa&#539;ii suplimentare despre modul &icirc;n care func&#539;ioneaz&#259; FreeCAD pe <a href="../Main_Page.html" title="Main Page">FreeCAD documentation wiki</a>. Pagina de pornire <a href="../Getting_started.html" title="Getting started"> Getting started</a> trebuie citit&#259;, dac&#259; nu ave&#539;i experien&#539;&#259; anterioar&#259; cu FreeCAD. De asemenea, verifica&#539;i sec&#539;iunea noastr&#259; <a href="../Tutorials.html" title="Tutorials"> tutorials</a> &#537;i pe <a rel="nofollow" class="external text" href="http://www.youtube.com/results?search_query=freecad">youtube</a> ve&#539;i g&#259;si, de asemenea, mult mai multe tutoriale gratuite.
</p>
</div>
<div class="mw-translate-fuzzy">
<p>Scopul Atelierului  <a href="../Arch_Workbench.html" title="Arch Workbench">Arch Workbench</a> este s&#259; ofere o complet&#259; <a rel="nofollow" class="external text" href="http://en.wikipedia.org/wiki/Building_Information_Modeling">BIM</a> workflow inside FreeCAD. Deoarece este &icirc;nc&#259; &icirc;n curs de dezvoltare, nu v&#259; a&#537;tepta&#539;i s&#259; g&#259;si&#539;i aici acelea&#537;i instrumente &#537;i nivel de completare ca alternativele comerciale adulte cum ar fi <a rel="nofollow" class="external text" href="http://en.wikipedia.org/wiki/Revit">Revit</a> sau [http: /en.wikipedia.org/wiki/Archicad ArchiCAD], dar, pe de alt&#259; parte, FreeCAD fiind folosit &icirc;ntr-un domeniu mult mai mare dec&acirc;t aceste aplica&#539;ii, <a href="../Arch_Workbench.html" title="Arch Workbench">Arch Workbench</a> beneficiaz&#259; foarte mult de celelalte discipline pe care FreeCAD le satisface &#537;i ofer&#259; c&acirc;teva caracteristici rar &icirc;nt&acirc;lnite &icirc;n aplica&#539;iile tradi&#539;ionale BIM.
</p>
</div>
<div class="mw-translate-fuzzy">
<p>Iat&#259;, de exemplu, c&acirc;teva caracteristici interesante ale programului <a href="../Arch_Workbench.html" title="Arch Workbench">Arch Workbench</a> al FreeCAD pe care le ve&#539;i g&#259;si cu greu &icirc;n alte aplica&#539;ii BIM:
</p>
</div>
<ul><li>Obiectele arhitecturale sunt &icirc;ntotdeauna solide. Din fundamentul mecanic puternic al FreeCAD, am &icirc;nv&#259;&#539;at importan&#539;a de a lucra &icirc;ntotdeauna cu obiecte solide. Acest lucru asigur&#259; un flux de lucru mult mai lipsit de erori &#537;i opera&#539;ii booleene foarte fiabile. Deoarece t&#259;ierea prin obiecte 3D cu un plan 2D, pentru extragerea sec&#539;iunilor, este &#537;i o opera&#539;ie boolean&#259;, pute&#539;i vedea imediat importan&#539;a acestui punct.</li></ul>
<ul><li>Obiectele arhitecturale pot avea &icirc;ntotdeauna orice form&#259;. F&#259;r&#259; restric&#539;ii. Pere&#539;ii nu trebuie s&#259; fie verticali, dalele nu trebuie s&#259; arate ca pl&#259;ci. Orice obiect solid poate deveni &icirc;ntotdeauna orice obiect arhitectural. Lucruri foarte complexe, de obicei greu de definit &icirc;n alte aplica&#539;ii BIM, cum ar fi o pardoseal&#259; curbat&#259; &#537;i un zid (da, arhitectul Zaha Hadid, despre care vorbim), nu prezint&#259; nici o problem&#259; special&#259; &icirc;n FreeCAD.</li></ul>
<div class="mw-translate-fuzzy">
<ul><li>&Icirc;ntreaga putere a FreeCAD v&#259; este la &icirc;ndem&acirc;n&#259;. Ave&#539;i posibilitatea s&#259; proiecta&#539;i obiecte arhitecturale cu orice alt instrument al FreeCAD, cum ar fi <a href="../PartDesign_Workbench.html" title="PartDesign Workbench">PartDesign Workbench</a>, &#537;i atunci c&acirc;nd acestea sunt gata, converti&#539;i-le &icirc;n obiecte arhitecturale. Ele vor p&#259;stra &icirc;n continuare istoria lor de modelare complet&#259; &#537;i vor continua s&#259; fie complet editabile. De asemenea, <a href="../Arch_Workbench.html" title="Arch Workbench">Arch Workbench</a> mo&#537;tene&#537;te o mare parte din func&#539;i(ile)onalitatea <a href="../Draft_Workbench.html" title="Draft Workbench">Draft Workbench</a>, cum ar fi  <a href="../Draft_Snap.html" title="Draft Snap">snapping</a> &#537;i <a href="../Draft_SelectPlane.html" title="Draft SelectPlane">working planes</a>.</li></ul>
</div>
<div class="mw-translate-fuzzy">
<ul><li><a href="../Arch_Workbench.html" title="Arch Workbench">Arch Workbench</a> este foarte prietenos cu <a href="../Mesh_Workbench.html" title="Mesh Workbench"> mesh</a>. Pute&#539;i proiecta cu u&#537;urin&#539;&#259; un model arhitectural &icirc;ntr-o aplica&#539;ie bazat&#259; pe plas&#259;, cum ar fi <a rel="nofollow" class="external text" href="http://en.wikipedia.org/wiki/Blender_%28software%29">Blender</a> sau <a rel="nofollow" class="external text" href="http://en.wikipedia.org/wiki/Sketchup">SketchUp</a> &#537;i s&#259; &icirc;l importa&#539;i &icirc;n FreeCAD. Dac&#259; a&#539;i avut grij&#259; de calitatea modelului dvs., iar obiectele sale sunt forme multiple, transformarea lor &icirc;n obiecte arhitecturale necesit&#259; doar ap&#259;sarea unui buton.</li></ul>
</div>
<div class="mw-translate-fuzzy">
<p>&Icirc;n timp ce scriu acest lucru, lucrarea <a href="../Arch_Workbench.html" title="Arch Workbench">Arch Workbench</a>, ca &#537;i restul programului FreeCAD, sufer&#259; unele limit&#259;ri. Cele mai multe sunt lucrate, totu&#537;i, &#537;i vor disp&#259;rea &icirc;n viitor.
</p>
</div>
<div class="mw-translate-fuzzy">
<ul><li>FreeCAD is no 2D application. It is made for 3D. There is a reasonable set of tools for drawing and editing 2D objects with the <a href="../Draft_Workbench.html" title="Draft Workbench">Draft Workbench</a> and <a href="../Sketcher_Workbench.html" title="Sketcher Workbench">Sketcher Workbench</a>, but it is not made for handling very large (and sometimes badly drawn) 2D CAD files. You can usually successfully import 2D files, but don't expect very high performance if you want to keep working on them in 2D. You have been warned.</li></ul>
</div>
<div class="mw-translate-fuzzy">
<ul><li>No materials support. FreeCAD will have a complete <a href="../Material.html" title="Material">Material</a> system, able to define very complex materials, with all the goodies you can expect (custom properties, material families, rendering and visual aspect properties, etc), and the <a href="../Arch_Workbench.html" title="Arch Workbench">Arch Workbench</a> will of course use it when it is ready.</li></ul>
</div>
<ul><li>Very preliminary <a rel="nofollow" class="external text" href="http://en.wikipedia.org/wiki/Industry_Foundation_Classes">IFC</a> support. You can already <a href="../Arch_IFC.html" title="Arch IFC">import IFC files</a>, quite reliably, provided <a rel="nofollow" class="external text" href="http://ifcopenshell.org">IfcOpenShell</a> is installed on your system, but exporting is still not officially supported. This is worked on both by the FreeCAD and IfcOpenShell developers, and in the future we can expect full-powered IFC support.</li></ul>
<ul><li>Most Arch tools are still in development. That means that automatic "wizard" tools that create complex geometry automatically, such as <a href="../Arch_Roof.html" title="Arch Roof">Arch Roof</a> or <a href="../Arch_Stairs.html" title="Arch Stairs">Arch Stairs</a> can only produce certain types of objects, and other tools that have presets, such as <a href="../Arch_Structure.html" title="Arch Structure">Arch Structure</a> or <a href="../Arch_Window.html" title="Arch Window">Arch Window</a> only have a couple of basic presets. This will of course grow over time.</li></ul>
<ul><li><a href="../Units.html" title="Units">Units</a> are being implemented in FreeCAD, which will allow you to work with any unit you wish (even imperial units, you guys from the USA can be eternally grateful for this to J&uuml;rgen, FreeCAD's godfather and dictator). But at the moment the implementation is not complete, and the Arch workbench still doesn't support them. You must consider it "unit-less".</li></ul>
<div class="mw-translate-fuzzy">
<div class="note"><b>FreeCAD version 0.14 required</b>
<p>This tutorial was written using <a href="../Release_notes_0.14.html" title="Release notes 0.14">FreeCAD version 0.14</a>. You will need at least this version number in order to follow it. Earlier versions might not contain all the needed tools, or they could lack options presented here.
</p>
</div>
</div>
<h2><span class="mw-headline" id="Typical_workflows">Typical workflows</span></h2>
<div class="mw-translate-fuzzy">
<p>Atelierul <a href="../Arch_Workbench.html" title="Arch Workbench">Arch Workbenchse</a> face &icirc;n principal pentru dou&#259; tipuri de fluxuri de lucru:
</p>
</div>
<ul><li>Construi&#539;i-v&#259; modelul cu o aplica&#539;ie mai rapid&#259;, bazat&#259; pe plas&#259;, cum ar fi <a rel="nofollow" class="external text" href="http://en.wikipedia.org/wiki/Blender_%28software%29">Blender</a> sau <a rel="nofollow" class="external text" href="http://en.wikipedia.org/wiki/Sketchup">SketchUp</a>,&#537;i le importa&#539;i &icirc;n FreeCAD pentru a extrage planurile &#537;i sec&#539;iunile. FreeCAD fiind conceput pentru modelare de precizie, la un nivel mult mai ridicat dec&acirc;t ceea ce avem nevoie de obicei &icirc;n modelarea arhitectural&#259;, construirea modelelor dvs. direct &icirc;n FreeCAD poate fi greoaie &#537;i lent&#259;. Din acest motiv, un astfel de flux de lucru are mari avantaje. Am descris-o pe blogul meu <a rel="nofollow" class="external text" href="http://yorik.uncreated.net/guestblog.php?2012=180">this article</a>. Dac&#259; ave&#539;i grij&#259; s&#259; modela&#539;i corect &#537;i precis (plase curate, solide, necombinate), acest flux de lucru v&#259; ofer&#259; acela&#537;i nivel de performan&#539;&#259; &#537;i precizie ca cel&#259;lalte.</li></ul>
<div class="mw-translate-fuzzy">
<ul><li>Construi&#539;i-v&#259; modelul direct &icirc;n FreeCAD. A&#537;a voi prezenta &icirc;n acest tutorial. Vom folosi &icirc;n principal trei Ateliere de lucru: <a href="../Arch_Workbench.html" title="Arch Workbench">Arch</a>, bine&#259;&icirc;n&#539;eles, dar &#537;i <a href="../Draft_Workbench.html" title="Draft Workbench">Draft</a>, ale c&#259;ror unelte sunt incluse &icirc;n Aatelierul Arch, astfel &icirc;nc&acirc;t nu este necesar s&#259; se schimbe Atelierele lucru &#537;i <a href="../Sketcher_Workbench.html" title="Sketcher Workbench">Sketcher</a>.</li></ul>
<p>&Icirc;n mod convenabil, pute&#539;i face cum fac eu de obicei, ceea ce &icirc;nseamn&#259; crearea unei bare de instrumente personalizate &icirc;n atelierul lucru Arch, with Tools &rarr; Customize, ad&#259;uga&#539;i instrumentele de la Sketcher pe care &icirc;l utiliza&#539;i frecvent. Acesta este Atelierul meu "personalizat" Arch:
</p>
</div>
<p><span class="mw-default-size" typeof="mw:File"><a href="../File/Arch_tutorial_01.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_01.jpg" decoding="async" width="1024" height="658"></a></span>
</p><p>&Icirc;n acest tutorial, vom modela casa &icirc;n 3D, pe baza desenelor 2D pe care le vom desc&#259;rca de pe net &#537;i vom extrage din acestea documente 2D, cum ar fi planurile, eleva&#539;iile &#537;i sec&#539;iunile.
</p><p><span id="Preparation"></span>
</p>
<h2><span id="Preg.C4.83tirea"></span><span class="mw-headline" id="Preg&#259;tirea">Preg&#259;tirea</span></h2>
<p>&Icirc;n loc s&#259; crea&#539;i un proiect de la zero, s&#259; lu&#259;m un model de exemplu, acesta ne va economisi timp. Am ales aceast&#259; minunat&#259; cas&#259; a celebrului arhitect <a rel="nofollow" class="external text" href="http://en.wikipedia.org/wiki/Jo%C3%A3o_Batista_Vilanova_Artigas">Vilanova Artigas</a> (see a series of <a rel="nofollow" class="external text" href="http://www.leonardofinotti.com/projects/architects-second-house/image/40409-130405-010d">pictures</a> by Leonardo Finotti), pentru c&#259; este aproape de locul &icirc;n care tr&#259;iesc, este simplu, este un exemplu minunat al uimitoarei arhitecturi moderniste din S&atilde;o Paulo, &#537;i desenele &icirc;n format DWG sunt disponibile la  <a rel="nofollow" class="external text" href="http://www.bibliocad.com/library/second-house-vilanova-artigas_72926#">easily available</a>.
</p><p>Vom folosi desene 2D DWG ob&#539;inute de la link-ul de mai sus (trebuie s&#259; v&#259; &icirc;nregistra&#539;i pe site-ul de mai sus pentru a desc&#259;rca, dar este gratuit, sau prinde/&icirc;nha&#539;&#259; direct o versiune DXF <a rel="nofollow" class="external text" href="http://yorik.uncreated.net/scripts/artigas.dxf">here</a>) ca baz&#259; de construre a modelului. So the first thing you'll want to do is to download the file, unzip it, and open the DWG file inside with a dwg application such as <a rel="nofollow" class="external text" href="http://www.3ds.com/products-services/draftsight/overview/">DraftSight</a>. Alternatively, you can convert it to DXF with a free utility such as the <a rel="nofollow" class="external text" href="https://www.opendesign.com/guestfiles/oda_file_converter">ODA File Converter</a>. If you have the ODA converter installed (and its path set in the Arch preferences settings), FreeCAD is also <a href="../Draft_DXF.html" title="Draft DXF">able to import DWG files directly</a>. Dar, din moment ce aceste fi&#537;iere pot fi uneori de proast&#259; calitate &#537;i foarte grele, este de obicei mai bine s&#259; le deschide&#539;i mai &icirc;nt&acirc;i cu o aplica&#539;ie CAD 2D &#537;i s&#259; face&#539;i o cur&#259;&#539;are a lor.
</p><p>Here, I removed all the detail drawings, all the titleblocks and page layouts, did a "clean" ("purge" in AutoCAD slang) to remove all unused entities, reorganized the sections at a logical location in relation to the plan view, and moved everything to the (0,0) point. After that, our file can be opened quite efficiently in FreeCAD. Check the different options available in Edit &rarr; Preferences &rarr; Draft &rarr; Import/Export, they can affect how (and how quickly) DXF/DWG files are imported.
</p><p>This is how the file looks after being opened in FreeCAD. I also changed the thickness of the walls (the contents of the "muros" group), and flipped a couple of doors that were imported with wrong X scale, with the <a href="../Draft_Scale.html" title="Draft Scale">Draft Scale</a> tool:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../File/Arch_tutorial_02.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_02.jpg" decoding="async" width="1024" height="445"></a></span>
</p><p>The <a href="../Draft_DXF.html" title="Draft DXF">DXF importer</a> (which also takes care of DWG files, since when importing DWG files, they are simply converted to DXF first), groups the imported objects by layer. There is no layer in FreeCAD, but there are <a href="../Std_Group.html" title="Std Group">groups</a>. <a href="../Std_Group.html" title="Std Group">Groups</a> offer a similar way to organize the objects of your files, but don't have specific properties, like AutoCAD layers, that apply to their contents. But they can be placed inside other groups, which is very handy. The first thing we might want to do here, is to create a new <a href="../Std_Group.html" title="Std Group">group</a> in the <a href="../Document_structure.html" title="Document structure">tree view</a>, right-click on the document icon, add a group, right click on it to rename it as "base 2D plans", and drag and drop all the other objects into it.
</p><p><span id="Building_the_walls"></span>
</p>
<h2><span id="Construirea_pere.C8.9Bilor"></span><span class="mw-headline" id="Construirea_pere&#539;ilor">Construirea pere&#539;ilor</span></h2>
<div class="mw-translate-fuzzy">
<p>Ca &#537;i multe obiecte <a href="../Arch_Workbench.html" title="Arch Workbench">Arch</a>, <a href="../Arch_Wall.html" title="Arch Wall">walls</a> pot fi construite peste o mare varietate de obiecte: <a href="../Draft_Line.html" title="Draft Line">lines</a>, <a href="../Draft_Wire.html" title="Draft Wire">wires</a> (polylines), <a href="../Sketcher_Workbench.html" title="Sketcher Workbench">sketches</a>, fa&#539;et&#259; sau solid (sau pe nimic, caz &icirc;n care sunt definite prin &icirc;n&#259;l&#539;ime, l&#259;&#539;ime &#537;i lungime). The resulting geometry of the wall depends on that base geometry, and the properties you fill in, such as width and height. As you might guess, a wall based on a line will use that line as its alignment line, while a wall based on a face will use that face as its base footprint, and a wall based on a solid will simply adopt the shape of that solid. This allows about any shape imaginable to become a wall.
</p>
</div>
<div class="mw-translate-fuzzy">
<p>There are different possible strategies to build walls in FreeCAD. One might want to build a complete "floor plan" with the <a href="../Sketcher_Workbench.html" title="Sketcher Workbench">sketcher</a>, and build one, big, wall object from it. This technique works, but you can only give one thickness for all the walls of the project. Or, you can build each piece of wall from separate line segments. Or, this is what we will do here, a mix of both: We will build a couple of <a href="../Draft_Wire.html" title="Draft Wire">wires</a> on top of the imported plan, one for each type of wall:
</p>
</div>
<p><span class="mw-default-size" typeof="mw:File"><a href="../File/Arch_tutorial_03.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_03.jpg" decoding="async" width="1024" height="412"></a></span>
</p><p>As you see, I've drawn in red the lines that will become concrete walls (a <a rel="nofollow" class="external text" href="http://www.google.com/search?tbm=isch&amp;q=casa+artigas+brooklin">pictures search</a> of the house can help you to see the different wall types), the green ones are the exterior brick walls, and the blue ones will become the inner walls. I passed the lines through the doors, because doors will be inserted in the walls later, and will create their openings automatically. Walls can also be aligned left, right or centrally on their baseline, so it doesn't matter which side you draw the baseline. I also took care on avoiding intersections as much as I could, because our model will be cleaner that way. But we'll take care of intersections later.
</p><p>When this is done, place all those lines in a new <a href="../Std_Group.html" title="Std Group">group</a> if you want, select each line one by one, and press the <a href="../Arch_Wall.html" title="Arch Wall">Arch Wall</a> tool to build a wall from each of them. You can also select several lines at once. After doing that, and correcting widths (exterior walls are 25cm wide, inner walls are 15cm wide) and some alignments, we have our walls ready:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../File/Arch_tutorial_04.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_04.jpg" decoding="async" width="1024" height="408"></a></span>
</p><p>We could also have built our walls from scratch. If you press the <a href="../Arch_Wall.html" title="Arch Wall">Arch Wall</a> button with no object selected, you will be able to click two points on the screen to draw a wall. But under the hood, the wall tool will actually draw a line and build a wall on it. In this case, I found it more didactic to show you how things work.
</p><p>Did you notice that I took great care not to cross the walls? This will save us some headache later, for example if we export our work to other applications, that might not like it. I have only one intersection, where I was too lazy to draw two small line segments, and drew one big wire crossing another. This must be fixed. Fortunately, all Arch objects have a great feature: you can add one to another. Doing that will unite their geometries, but they are still editable independently after. To add one of our crossing walls to the other, just select one, CTRL + select the other, and press the <a href="../Arch_Add.html" title="Arch Add">Arch Add</a> tool:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../File/Arch_tutorial_05.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_05.jpg" decoding="async" width="1024" height="414"></a></span>
</p><p>On the left are the two intersecting walls, on the right the result after adding one to the other.
</p>
<div class="mw-translate-fuzzy">
<div class="note"><b>An important note about parametric objects</b>
<p>Something is important to consider already. As you can see, in FreeCAD, everything is parametric: Our new "united" wall is made from two walls, each based on a baseline. When you expand them in the <a href="../Document_structure.html" title="Document structure">tree view</a>, you can see all that chain of dependencies. As you can imagine, this little game can quickly become very complex. Furthermore, if you already know how to work with the <a href="../Sketcher_Workbench.html" title="Sketcher Workbench">sketcher</a>, you might have wanted to draw the baselines with constrained sketches. This whole complexity has a cost: it raises exponentially the number of calculations that FreeCAD has to perform to keep your model geometry up to date. So, think about it, don't add unnecessary complexity when you don't need it. Keep a good balance between simple and complex objects, and keep these for the cases where you really need them.
</p>
</div>
</div>
<p>For example, I could have drawn all my baselines above without caring about what crosses what, and fix things with the <a href="../Arch_Add.html" title="Arch Add">Arch Add</a> tool later. But I would have raised much the complexity of my model, for no gain at all. Better make them correct right from the start, and keeping them as very simple pieces of geometry.
</p><p>Now that our walls are okay, we need to raise their height, until they intersect the roof. Then, since the wall object still cannot be cut automatically by roofs (this will happen some day, though), we will build a "dummy" object, that follows the shape of the roof, to be subtracted from our walls.
</p><p>First, by looking at our 2D drawings, we can see that the highest point of the roof is 5.6m above the ground. So let's give all our walls a height of 6m, so we make sure they will be cut by our dummy roof volume. Why 6m and not 5.6m? You may ask. Well, if you already worked with boolean operations (additions, subtractions, intersections), you must already know that these operations usually don't like much "face-on-face" situations. They prefer clearly, frankly intersecting objects. So by doing this, we keep on the safe side.
</p><p>To raise the height of our walls, simply select all of them (don't forget the one we added to the other) in the tree view, and change the value of their "height" property.
</p><p>Before making our roof and cutting the walls, let's make the remaining objects that will need to be cut: The walls of the above studio, and the columns. The walls of the studio are made the same way as we did, on the superior floor plan, but they will be raised up to level 2.6m. So we will give them the needed height so their top is at 6m too, that is, 3.4m. Once this is done, let's move our walls up by 2.6m: Select them both, put yourself in frontal view (View &rarr; Standard Views &rarr; Front), press the <a href="../Draft_Move.html" title="Draft Move">Draft Move</a> button, select a first point, then enter 0, 2.6, 0 as coordinates, and press enter. Your objects now have jumped 2.6m high:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../File/Arch_tutorial_06.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_06.jpg" decoding="async" width="1024" height="377"></a></span>
</p>
<div class="mw-translate-fuzzy">
<div class="note"><b>About coordinates</b>
<p>The <a href="../Draft_Workbench.html" title="Draft Workbench">Draft</a> objects, and most <a href="../Arch_Workbench.html" title="Arch Workbench">Arch</a> objects too, obey to a Draft system called <a href="../Draft_SelectPlane.html" title="Draft SelectPlane">working planes</a>. This system defines a 2D plane where next operations will take place. If you don't specify any, that working plane adapts itself to the current view. This is why we switched to frontal view, and you see that we indicated a movement in X of 0 and in Y of 2.6. We could also have forced the working plane to stay on the ground, by using the <a href="../Draft_SelectPlane.html" title="Draft SelectPlane">Draft SelectPlane</a> tool. Then, we would have entered a movement of X of 0, Y of 0 and Z of 2.6. 
</p>
</div>
</div>
<p>Now let's move our walls horizontally, to their correct location. Since we have points to snap to, this is easier: Select both walls, press the <a href="../Draft_Move.html" title="Draft Move">Draft Move</a> tool, and move them from one point to the other:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../File/Arch_tutorial_07.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_07.jpg" decoding="async" width="1024" height="531"></a></span>
</p><p>Finally, I changed the color of some walls to a brick-like color (so it's easier to differentiate), and made a small correction: Some walls don't go up to the roof, but stop at a height of 2.60m. I corrected the height of those walls.
</p><p><span id="Raising_the_structure"></span>
</p>
<h2><span class="mw-headline" id="Ridicarea_structurii">Ridicarea structurii</span></h2>
<p>Acum, deoarece va trebui s&#259; ne t&#259;iem zidurile cu un volum de substrac&#539;ie, am putea vedea &#537;i dac&#259; nu exist&#259; alte obiecte care vor trebui s&#259; fie t&#259;iate &icirc;n acest fel. 
Exist&#259; c&acirc;teva coloane. Aceasta este o bun&#259; ocazie de a introduce un al doilea obiect arch(itectural): <a href="../Arch_Structure.html" title="Arch Structure">Arch Structure</a>. Obiectele structurale se comport&#259; mai mult sau mai pu&#539;in ca pere&#539;ii, dar nu sunt f&#259;cute s&#259; urmeze o linie de referin&#539;&#259;. Mai degrab&#259;, prefer&#259; s&#259; lucreze dintr-un profil, care este extrudat (de-a lungul unei linii de profil sau nu). Orice obiect plat poate fi un profil pentru o structur&#259;, cu o singur&#259; cerin&#539;&#259;: trebuie s&#259; formeze o form&#259; &icirc;nchis&#259;.
</p><p>For our columns, we will use another strategy than with the walls. Instead of "drawing" on top of the 2D plans, we will directly use objects from it: the circles that represent the columns in the plan view. In theory, we could just select one of them, and press the <a href="../Arch_Structure.html" title="Arch Structure">Arch Structure</a> button. However, if we do that, we produce an "empty" structural object. This is because you can never be too sure at how well objects were drawn in the DWG file, and often they are not closed shapes. So, before turning them into actual columns, let's turn them into faces, by using the <a href="../Draft_Upgrade.html" title="Draft Upgrade">Draft Upgrade</a> tool twice on them. The first time to convert them into closed wires (polylines), the second time to convert those wires into faces. That second step is not mandatory, but, if you have a face, you are 100% sure that it is closed (otherwise a face cannot be made).
</p><p>After we have converted all our columns to faces, we can use the <a href="../Arch_Structure.html" title="Arch Structure">Arch Structure</a> tool on them, and adjust the height (some have 6m, other only 2.25m height):
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../File/Arch_tutorial_08.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_08.jpg" decoding="async" width="1024" height="434"></a></span>
</p><p>On the image above, you can see two columns that are still as they were in the DWG file, two that were upgraded to faces, and two that were turned into structural objects, and their height set to 6m and 2.25m.
</p><p>Note that those different Arch objects (walls, structures, and all the others we'll discover) all share a lot of things between them (for example all can be added one to another, like we already saw with walls, and any of them can be converted to another). So it's more a matter of taste, we could have made our columns with the wall tool too, and converted them if needed. In fact, some of our walls are concrete walls, we might want to convert them to structures later.
</p><p><span id="Subtractions"></span>
</p>
<h2><span id="Subtrac.C8.9Bia"></span><span class="mw-headline" id="Subtrac&#539;ia">Subtrac&#539;ia</span></h2>
<p>Acum este timpul s&#259; construim volumul de sc&#259;dere. Cea mai u&#537;oar&#259; cale va fi s&#259;-i desenezi profilul &icirc;n partea superioar&#259; a vederii de sec&#539;iune.Apoi, &icirc;l vom roti &#537;i &icirc;l vom pune &icirc;n pozi&#539;ia sa corect&#259;. Vezi de ce am plasat sec&#539;iunile &#537;i eleva&#539;iile de genul &#259;sta &icirc;nainte de a &icirc;ncepe? Va fi foarte util pentru a desena lucruri acolo, apoi pentru a o muta &icirc;n pozi&#539;ia corect&#259; pe model.
</p><p>Let's draw a volume, bigger than the roof, that will be subtracted from our walls. To do that, I drew two lines on top of the base of the roof, then extended them a bit further with the <a href="../Draft_Trimex.html" title="Draft Trimex">Draft Trimex</a> tool. Then, I drew a <a href="../Draft_Wire.html" title="Draft Wire">wire</a>, snapping on these lines, and going well above our 6 meters. I also drew a blue line on the ground level (0.00), that will be our rotation axis.
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_09.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_09.jpg" decoding="async" width="1024" height="479"></a></span>
</p><p>Now is the tricky part: We will use the <a href="../Draft_Rotate.html" title="Draft Rotate">Draft Rotate</a> tool to rotate our profile 90 degrees up, in the right position to be extruded. To do that, we must first change the <a href="../Draft_SelectPlane.html" title="Draft SelectPlane">working plane</a> to the YZ plane. Once this is done, the rotation will happen in that plane. But if we do like we did a bit earlier, and set our view to side view, it will be hard to see and select our profile, and to know where is the basepoint around which it must rotate, right? Then we must set the working plane manually: Press the <a href="../Draft_SelectPlane.html" title="Draft SelectPlane">Draft SelectPlane</a> button (it is in the "tasks" tab of the tree view), and set it to YZ (which is the "side" plane). Once you set the working plane manually, like that, it won't change depending on your view. You can now rotate your view until you have a good view of all the things you must select. To switch the working plane back to "automatic" mode later, press the <a href="../Draft_SelectPlane.html" title="Draft SelectPlane">Draft SelectPlane</a> button again and set it to "None".
</p><p>Now the rotation will be easy to do: Select the profile, press the <a href="../Draft_Rotate.html" title="Draft Rotate">Draft Rotate</a> button, click on a point of the blue line, enter 0 as start angle, and 90 as rotation:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_10.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_10.jpg" decoding="async" width="1024" height="441"></a></span>
</p><p>Now all we need to do it to move the profile a bit closer to the model (set the working plane to XY if needed), and extrude it. This can be done either with the <a href="../Part_Extrude.html" title="Part Extrude">Part Extrude</a> tool, or <a href="../Draft_Trimex.html" title="Draft Trimex">Draft Trimex</a>, which also has the special hidden power to extrude faces. Make sure your extrusion is larger than all the walls it will be subtracted from, to avoid face-on-face situations:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_11.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_11.jpg" decoding="async" width="1024" height="462"></a></span>
</p><p>Now, here comes into action the contrary of the <a href="../Arch_Add.html" title="Arch Add">Arch Add</a> tool: <a href="../Arch_Remove.html" title="Arch Remove">Arch Remove</a>. As you might have guessed, it also makes an object a child of another, but its shape is subtracted from the host object, instead of being united. So now things are simple: Select the volume to subtract (I renamed it as "Roof volume to subtract" in the tree view so it is easy to spot), CTRL + select a wall, and press the <a href="../Arch_Remove.html" title="Arch Remove">Arch Remove</a> button. You'll see that, after the subtraction happened, the volume to subtract disappeared from both the 3D view and the tree view. That is because it has been marked as child of the wall, and "swallowed" by that wall. Select the wall, expand it in the tree view, there is our volume.
</p><p>Now, select the volume in the tree vieew, CTRL + select the next wall, press <a href="../Arch_Remove.html" title="Arch Remove">Arch Remove</a>. Repeat for the next walls until you have everything properly cut:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_12.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_12.jpg" decoding="async" width="1024" height="370"></a></span>
</p><p>Remember that for both <a href="../Arch_Add.html" title="Arch Add">Arch Add</a> and <a href="../Arch_Remove.html" title="Arch Remove">Arch Remove</a>, the order you select the objects is important. The host is always the last one, like in "Remove X from Y" or "Add X to Y"
</p>
<div class="note"><b>A note about additions and subtractions</b>
<p>Arch objects that support such additions and subtractions (all of them except the "visual" helper objects such as the axes) keep track of such objects by having two properties, respectively "Additions" and "Subtractions", that contain a list of links to other objects to be subtracted or added. A same object can be in the lists of several other objects, as it is the case of our subtraction volume here. Each of the fathers will want to swallow it in the tree view, though, so it will usually "live" in the last one. But you can always edit those lists for any object, by double-clicking it in the tree view, which in FreeCAD enters edit mode. Pressing the escape key exits edit mode.
</p>
</div>
<p><br>
<span id="Making_the_roofs"></span>
</p>
<h2><span id="Realizarea_acoperi.C8.99ului"></span><span class="mw-headline" id="Realizarea_acoperi&#537;ului">Realizarea acoperi&#537;ului</span></h2>
<p>Acum, tot ce trebuie s&#259; facem pentru a finaliza structura, este de a face acoperi&#537;ul &#537;i pl&#259;cile de gresie interioare mai mici.Din nou, cea mai u&#537;oar&#259; cale este de a atrage profilurile pe partea superioar&#259; a sec&#539;iunii, cu instrumentul <a href="../Draft_Wire.html" title="Draft Wire">Draft Wire</a>. Aici am desenat 3 profile unul peste cel&#259;lalt (le-am mutat separat &icirc;n imaginea de mai jos pentru a se vedea mai bine). Cel verde va fi folosit pentru marginea lateral&#259; a dalei/pl&#259;cii de acoperi&#537;, apoi cea albastr&#259; pentru p&#259;r&#539;ile laterale &#537;i cele ro&#537;ii pentru partea central&#259; care se afl&#259; deasupra blocului de baie:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_13.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_13.jpg" decoding="async" width="1024" height="325"></a></span>
</p><p>Then, we must repeat the rotation operation above, to rotate the objects in a vertical position, then move them at their correct places, and copy some of them that will need to be extruded twice, with the <a href="../Draft_Move.html" title="Draft Move">Draft Move</a> tool, with the ALT key pressed, which creates copies instead of moving the current object. I also added two more profiles for the side walls of the bathroom opening.
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_14.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_14.jpg" decoding="async" width="1024" height="466"></a></span>
</p><p>When everything is in place, it's just a matter of using the <a href="../Draft_Trimex.html" title="Draft Trimex">Draft Trimex</a> tool to extrude, then convert them to <a href="../Arch_Structure.html" title="Arch Structure">Arch Structure</a> objects. 
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_15.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_15.jpg" decoding="async" width="1024" height="412"></a></span>
</p><p>After that, we can see some problems arising: two of the columns on the right are too short (they should go up to the roof), and there is a gap between the slab and the walls of the studio on the far right (the 2.60 level symbol on the section view was obviously wrong). Thanks to the parametric objects, all this is very easy to solve: For the columns, just change their height to 6m, fish your roof subtraction volume from the tree view, and subtract it to the columns. For the walls, it's even easier: move them a bit down. Since the subtraction volume remains at the same place, the wall geometry will adapt automatically.
</p><p>Now one last thing must be fixed, there is a small slab in the bathroom, that intersects some walls. Let's fix that by creating a new subtraction volume, and subtract it from those walls. Another feature of the <a href="../Draft_Trimex.html" title="Draft Trimex">Draft Trimex</a> tool, that we use to extrude stuff, is that it can also extrude one single face of an existing object. This creates a new, separate object, so there is no risk to "harm" the other object. So we can select the base face of the small slab (look at it from beneath the model, you'll see it), then press the <a href="../Draft_Trimex.html" title="Draft Trimex">Draft Trimex</a> button, and extrude it up to well above the roofs. Then, subtract it from the two inner bathroom walls with the <a href="../Arch_Remove.html" title="Arch Remove">Arch Remove</a> tool:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_16.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_16.jpg" decoding="async" width="1024" height="457"></a></span>
</p><p><span id="Floors,_stairs_and_chimney"></span>
</p>
<h2><span id="Podele.2C_sc.C4.83ri_.C8.99i_co.C8.99ul"></span><span class="mw-headline" id="Podele,_sc&#259;ri_&#537;i_co&#537;ul">Podele, sc&#259;ri &#537;i co&#537;ul</span></h2>
<p>Acum, structura noastr&#259; este complet&#259;, avem doar c&acirc;teva obiecte mai mici de f&#259;cut. 
</p><p><span id="The_chimney"></span>
</p>
<h3><span id="Co.C8.99ul.2F.C8.98emineul"></span><span class="mw-headline" id="Co&#537;ul/&#536;emineul">Co&#537;ul/&#536;emineul</span></h3>
<p>S&#259; &icirc;ncepem cu hornul. Acum &#537;ti&#539;i deja cum func&#539;ioneaz&#259;, nu? Desena&#539;i dou&#259; fire/polilinii &icirc;nchise <a href="../Draft_Wire.html" title="Draft Wire">wires</a>, mi&#537;ca&#539;i - le la &icirc;n&#259;l&#539;imea corect&#259; cu instrumentul <a href="../Draft_Move.html" title="Draft Move">Draft Move</a>, extgruda&#539;i-le cu instrumentul <a href="../Draft_Trimex.html" title="Draft Trimex">Draft Trimex</a>, 
transforma&#539;i pe cea mai mare &icirc;ntr-o <a href="../Arch_Structure.html" title="Arch Structure">structure</a>, &#537;i extrage&#539;i-o pe cea mai mic&#259;. 
Observa&#539;i cum tubul de co&#537; de fum nu a fost desenat &icirc;ntr-o vizualizare plan&#259;, dar am g&#259;sit pozi&#539;ia prin tragerea de linii albastre din sec&#539;iunile de vizualizare.
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_17.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_17.jpg" decoding="async" width="1024" height="466"></a></span>
</p><p><span id="The_floors"></span>
</p>
<h3><span class="mw-headline" id="Podeaua">Podeaua</span></h3>
<p>Podelele nu sunt bine reprezentate &icirc;n desenele de baz&#259;. C&acirc;nd v&#259; uita&#539;i la sec&#539;iuni, nu pute&#539;i &#537;ti unde &#537;i c&acirc;t de groase sunt dalele podelei. A&#537;adar, presupunem c&#259; zidurile stau &icirc;n partea superioar&#259; a blocurilor de funda&#539;ie, la nivelul 0,00, &#537;i c&#259; exist&#259; pl&#259;ci de podea, a&#537;ezate &#537;i pe acele blocuri de 15 cm grosime. Deci, pl&#259;cile de podea nu func&#539;ioneaz&#259; sub pere&#539;i, ci &icirc;n jurul lor. Am putea face asta cre&acirc;nd o plac&#259; dreptunghiular&#259; mare, apoi sc&#259;z&acirc;nd zidurile, dar amintim c&#259; opera&#539;iile de sc&#259;dere ne cost&#259;. Mai bine o face&#539;i &icirc;n buc&#259;&#539;i mai mici, va fi "mai ieftin&#259;" &icirc;n ceea ce prive&#537;te calculul &#537;i, de asemenea, dac&#259; o facem inteligent, camer&#259; pe camer&#259;, acestea vor fi, de asemenea, utile pentru a calcula suprafe&#539;ele de podea mai t&acirc;rziu:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_18.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_18.jpg" decoding="async" width="1024" height="351"></a></span>
</p><p>Odat&#259; ce firele/poliliniile au fost desenate, doar le transforma&#539;i &icirc;n <a href="../Arch_Structure.html" title="Arch Structure">structures</a>, &#537;i le da&#539;i o &icirc;n&#259;l&#539;ime de 0.15:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_19.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_19.jpg" decoding="async" width="1024" height="459"></a></span>
</p><p><span id="The_stairs"></span>
</p>
<h3><span id="Sc.C4.83rile"></span><span class="mw-headline" id="Sc&#259;rile">Sc&#259;rile</span></h3>
<p>Acum sunt sc&#259;rile. 
Face&#539;i cuno&#537;tin&#539;&#259; cu urm&#259;toarele instrumente Arc, <a href="../Arch_Stairs.html" title="Arch Stairs">Arch Stairs</a>. Acest instrument este &icirc;nc&#259; &icirc;ntr-un stadiu incipient de dezvoltare, la momentul &icirc;n care scriu, deci nu v&#259; a&#537;tepta&#539;i prea mult. Dar este deja destul de util s&#259; faci sc&#259;ri simple &#537;i drepte. Un concept este important de &#537;tiut, instrumentul de sc&#259;ri este g&acirc;ndit s&#259; construiasc&#259; sc&#259;ri de la un pod plat p&acirc;n&#259; la un perete. Cu alte cuvinte, c&acirc;nd privim dinspre partea de sus, obiectul sc&#259;rilor ocup&#259; exact spa&#539;iul pe care &icirc;l ocup&#259; &icirc;n vederea planului, astfel &icirc;nc&acirc;t ultima contratreapt&#259; nu este desenat&#259; (dar, desigur, este luat &icirc;n considerare la calcularea &icirc;n&#259;l&#539;imilor).
</p><p>In this case, I preferred to build the stairs on the section view, because we'll need many measurements that are easier to get from that view. Here, I drew a couple of red guidelines, then two blue lines that will be the base of our two pieces of stairs, and two green closed wires, that will form the missing parts. Now select the first blue line, press the <a href="../Arch_Stairs.html" title="Arch Stairs">Arch Stairs</a> tool, set the number of steps to 5, the height to 0.875, the width to 1.30, the structure type to "massive" and the structure thickness to 0.12. Repeat for the other piece.
</p><p>Then, extrude both green wires by 1.30, and rotate and move them to the right position:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_20.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_20.jpg" decoding="async" width="1024" height="483"></a></span>
</p><p>On the elevation view, draw (then rotate) the border:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_21.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_21.jpg" decoding="async" width="1024" height="378"></a></span>
</p><p>Then move everything into place:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_22.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_22.jpg" decoding="async" width="1024" height="420"></a></span>
</p><p>Don't forget also to cut the column that crosses the stairs, because in BIM it's always bad to have intersecting objects. We are building like in the real world, remember, where solid objects cannot intersect. Here, I didn't want to subtract the column directly from the stairs (otherwise the column object would be swallowed by the stairs object in the tree view, and I didn't like that), so I took the face on which the column was built, and extruded it again. This new extrusion was then subtracted from the stairs.
</p><p>Right! All the hard work is now done, let's go on with the very hard work!
</p><p><span id="Doors_and_windows"></span>
</p>
<h2><span id="U.C8.99i_.C8.99i_Ferestre"></span><span class="mw-headline" id="U&#537;i_&#537;i_Ferestre">U&#537;i &#537;i Ferestre</span></h2>
<p><a href="../Arch_Window.html" title="Arch Window">Arch Windows</a> sunt obiecte destul de complexe. Ele sunt folosite pentru a face tot felul de obiecte "introduse", cum ar fi ferestrele sau u&#537;ile. Da, &icirc;n FreeCAD, u&#537;ile sunt doar o fereastr&#259; special&#259;. &#536;i &icirc;n via&#539;a real&#259; este la fel, dac&#259; te g&acirc;nde&#537;ti mai bine, nu? Instrumentul <a href="../Arch_Window.html" title="Arch Window">Arch Window</a> poate fi &icirc;n continuare un pic greu de folosit ast&#259;zi, &icirc;ns&#259; considera&#539;i acest lucru drept un compromis, deoarece a fost construit pentru o putere de calcul maxim&#259;. Aproape orice fel de fereastr&#259; pe care imagina&#539;ia ta o poate produce se poate face cu ea. Dar, deoarece instrumentul va c&acirc;&#537;tiga mai multe preset&#259;ri, aceast&#259; situa&#539;ie va deveni cu siguran&#539;&#259; mai bun&#259; &icirc;n viitor.
</p>
<div class="mw-translate-fuzzy">
<p>The <a href="../Arch_Window.html" title="Arch Window">Arch Window</a> object works like this: It is based on a 2D layout, any 2D object, but preferably a <a href="../Sketcher_Workbench.html" title="Sketcher Workbench">sketch</a>, that contains closed wires (polylines). These wires define the different parts of the window: outer frames, inner frames, glass panels, solid panels, etc. The window objects then has a property that stores what to do with each of these wires: extrude it, place it at a certain offset, etc. Finally, a window can be inserted into a host object such as a wall or structure, and it will automatically create a hole in it. That hole will be calculated by extruding the biggest wire found in the 2D layout.
</p>
</div>
<p>There are two ways to create such objects in FreeCAD: By using a preset, or drawing the window layout from scratch. We'll look at both methods here. But remember that the preset method does nothing else than creating the layout object and defining the necessary extrusions for you.
</p><p><span id="Using_presets"></span>
</p>
<h3><span id="Utilizarea_set.C4.83rilor_prealabile"></span><span class="mw-headline" id="Utilizarea_set&#259;rilor_prealabile">Utilizarea set&#259;rilor prealabile</span></h3>
<p>C&acirc;nd ap&#259;sa&#539;i instrumentul <a href="../Arch_Window.html" title="Arch Window">Arch Window</a> f&#259;r&#259; selectarea obiectului, sunte&#539;i invitat s&#259; alege&#539;i un aspect 2D sau s&#259; utiliza&#539;i una dintre preset&#259;ri. S&#259; folosim presetarea "u&#537;&#259; simpl&#259;" pentru a plasa u&#537;a principal&#259; de intrare a modelului nostru. Da&#539;i-i o l&#259;&#539;ime de 1m, o &icirc;n&#259;l&#539;ime de 2,45m, o dimensiune W1 de 0,15m &#537;i l&#259;sa&#539;i ceilal&#539;i parametri la 0,05m. Apoi face&#539;i clic pe col&#539;ul din st&acirc;nga jos al peretelui &#537;i noua u&#537;&#259; este creat&#259;:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_23.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_23.jpg" decoding="async" width="1024" height="425"></a></span>
</p><p>You will notice that your new door won't appear in the tree view. That is because, by snapping to a wall, we indicated that wall as its host object. Consequently, it has been "swallowed" by the wall. But a right click on it &rarr; Go to selection will find it in the tree.
</p><p>In this case, as our window is not inserted in any wall (the opening was there already), we might as well detach our window from its host wall. This is done by double-clicking the host wall in the tree view to enter its edit mode. There, you will see the window in its "Subtractions" group. Simply select the window there, press the "remove element" button, then "OK". Our window has now been removed from its host wall, and lies at the bottom of the tree view.
</p><p>We have a second door, exactly the same as this one, a bit on the left. Instead of creating a new door from scratch, we have two ways to make a copy of the previous one: By using the <a href="../Draft_Move.html" title="Draft Move">Draft Move</a> tool, with the ALT key pressed, which, as you already know, copies an object instead of moving it. Or, even better, we can use the <a href="../Draft_Clone.html" title="Draft Clone">Draft Clone</a> tool. The clone tool produces a "clone" of a selected object, that you can move around, but that retains the shape of the original object. If the original object changes, the clone changes too.
</p><p>So all we need to do now is select the door, press the <a href="../Draft_Clone.html" title="Draft Clone">Draft Clone</a> tool, then move the clone to its correct position with the <a href="../Draft_Move.html" title="Draft Move">Draft Move</a> tool.
</p><p><span id="Organizing_your_model"></span>
</p>
<h3><span class="mw-headline" id="Organizarea_modelului_dvs">Organizarea modelului dvs</span></h3>
<figure class="mw-halign-left" typeof="mw:File"><a href="../File/Arch_tutorial_24.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_24.jpg" decoding="async" width="400" height="417"></a><figcaption></figcaption></figure>
<p>Acum ar fi un moment bun pentru a face un pic de cur&#259;&#539;enie de cas&#259;. Din moment ce avem deja dou&#259; ferestre, este un moment bun s&#259; facem o cur&#259;&#539;are &icirc;n arborescen&#539;a vizualiz&#259;rilor: Crea&#539;i un nou grup <a href="../Std_Group.html" title="Std Group">Std_Group </a>, redenumi&#539;i-l "windows" &#537;i plasa&#539;i cele 2 ferestre &icirc;n el. 
De asemenea, v&#259; recomand&#259;m s&#259; separa&#539;i alte elemente &icirc;n acest fel, cum ar fi pere&#539;ii &#537;i structurile. Deoarece pute&#539;i crea &#537;i grupuri <a href="../Std_Group.html" title="Std Group">groups</a> &icirc;n interiorul grupurilor, le pute&#539;i organiza mai departe, de exemplu prin plasarea tuturor elementelor care formeaz&#259; acoperi&#537;ul &icirc;ntr-un grup separat, astfel &icirc;nc&acirc;t este u&#537;or s&#259; activa&#539;i &#537;i s&#259; dezactiva&#539;i (s&#259; face&#539;i un grup vizibil sau invizibil &#537;i s&#259; face&#539;i acela&#537;i lucru cu toate obiectele din interior).
</p>
<div class="mw-translate-fuzzy">
<p>Arhitectura <a href="../Arch_Workbench.html" title="Arch Workbench">Arch Workbench</a> are c&acirc;teva instrumente suplimentare pentru a v&#259; organiza modelul: <a href="../Arch_Site.html" title="Arch Site">Arch Site</a>, <a href="../Arch_Building.html" title="Arch Building">Arch Building</a> &#537;i <a href="../Arch_Floor.html" title="Arch Floor">Floor Arch</a>. Aceste 3 obiecte se bazeaz&#259; pe grupul standard FreeCAD, deci se comport&#259; exact ca grupuri, dar au &#537;i c&acirc;teva propriet&#259;&#539;i suplimentare. De exemplu, <a href="../Arch_Floor.html" title="Arch Floor">floors</a> au capacitatea de a defini/seta &#537;i de a controla &icirc;n&#259;l&#539;imea pere&#539;ilor &#537;i structurii con&#539;inute &#537;i, atunci c&acirc;nd sunt mutate, tot con&#539;inutul lor este mutat.
</p>
</div>
<p>But here, since we have only one building with only one (and a half) floor, there is no real need to use such objects, so let's stick with simple groups.
</p>
<div style="clear:both"></div>
<p>Now, let's get back to work. Turn off the roof group, so we can see better inside, and switch the Display Mode of the floor objects to Wireframe (or use the <a href="../Draft_ToggleDisplayMode.html" title="Draft ToggleDisplayMode">Draft ToggleDisplayMode</a> tool) so we can still snap to them, but we can see the plan view underneath. But you can also turn off the floors completely, then place your doors at level 0, then raise them of 15cm with the <a href="../Draft_Move.html" title="Draft Move">Draft Move</a> tool.
</p><p>Let's place the interior doors. Use the "Simple Door" preset again, make doors of 1.00m and 0.70m wide x 2.10m high, with W1 size of 0.1m. Make sure you snap to the correct wall when you place them, so they automatically create a hole in that wall. If it is hard to place them correctly, you can place them at an easier location, at the corner of the wall, for example, then move them. The "hole" will move together.
</p><p>Dac&#259; din gre&#537;eal&#259; a&#539;i g&#259;zduit o fereastr&#259; &icirc;n peretele gre&#537;it, este u&#537;or s&#259; remedia&#539;i: Scoate&#539;i fereastra din grupul de "sc&#259;dere" a peretelui gazd&#259; &icirc;n modul de editare, dup&#259; cum am v&#259;zut mai sus, apoi ad&#259;uga&#539;i-l la grupul de "Subtrac&#539;ie" &icirc;n peretele corect, prin aceea&#537;i metod&#259; sau, pur &#537;i simplu, utiliz&acirc;nd instrumentul <a href="../Arch_Remove.html" title="Arch Remove">Arch Remove</a>.
</p><p>A little work later, all our doors are there:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_25.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_25.jpg" decoding="async" width="1024" height="573"></a></span>
</p><p>After a closer look at the elevation view, I now detected another error: The top of the brick walls is not as 2.60m, but 17.5cm lower, that is, 2.425m. Fortunately, windows based on presets have a facility: You can alter their general dimensions (width and height) from their properties. So let's change their height to 2.425 - 0.15, that is, 2.275. The second window, as it is a clone of the first one, will adapt too. This is basically where the true magic of parametric design appears.
</p><p>Now we can look at the really interesting stuff: How to design your own custom windows.
</p><p><span id="Creating_custom_windows"></span>
</p>
<h3><span class="mw-headline" id="Crearea_de_ferestre_personalizate">Crearea de ferestre personalizate</span></h3>
<div class="mw-translate-fuzzy">
<p>A&#537;a cum am explicat mai sus, obiectele <a href="../Arch_Window.html" title="Arch Window">Arch Window</a> sunt create din elemente 2D, realizate din elemente &icirc;nchise (fire/polilinii, cercuri, dreptunghiuri, orice). 
Deoarece obiectele <a href="../Draft_Workbench.html" title="Draft Workbench">Draft</a> nu pot con&#539;ine mai mult de unul dintre aceste elemente, instrumentul preferat de a desena layout-uri de ferestre este <a href="../Sketcher_Workbench.html" title="Sketcher Workbench">Sketcher</a>. Din nefericire, cu sketcher-ul, nu este posibil&#259; fixarea unor obiecte externe, cum ar fi Atelierul de lucru Draft, care ar fi util aici, deoarece &icirc;n&#259;l&#539;imile noastre sunt deja desenate. Din fericire, exist&#259; o unealt&#259; pentru a converti obeictele Draftt &icirc;ntr-o schi&#539;&#259;: Instrumentul <a href="../Draft_Draft2Sketch.html" title="Draft Draft2Sketch">Draft To Sketch</a>.
</p>
</div>
<p>So, let's start by building our first window layout. I drew it on the elevation, using several <a href="../Draft_Rectangle.html" title="Draft Rectangle">rectangles</a>: One for the outer line, and 4 for the inner lines. I stopped before the door, because, remember, our door already has a frame there:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_26.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_26.jpg" decoding="async" width="1024" height="343"></a></span>
</p><p>Then, select all the rectangles, and press the <a href="../Draft_Draft2Sketch.html" title="Draft Draft2Sketch">Draft To Sketch</a> button (and delete the rectangles, because this tool doesn't delete the original objects, in case something goes wrong). Then, with the new sketch selected, press the <a href="../Arch_Window.html" title="Arch Window">Arch Window</a> tool:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_27.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_27.jpg" decoding="async" width="1024" height="380"></a></span>
</p><p>The tool will detect that the layout has one outer wire and several inner wires, and automatically proposes you a default configuration: One frame, made by subtracting the inner wires from the outer one, extruded by 1m. Let's change that, by entering the window's edit mode, by double-clicking on it in the tree view:
</p><p>You will see a "Default" component, that has been created automatically by the Window tool, that uses the 5 wires (always subtracting the other ones from the biggest one), and has an extrusion value of 1. Let's change its extrusion value to 0.1, to match what we used in the doors.
</p><p>Then, let's add 4 new glass panels, each using a single wire, and give them an extrusion of 0.01, and an offset of 0.05, so they are placed at the middle of the frame. This will be how your window looks like when you are finished:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_28.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_28.jpg" decoding="async" width="1024" height="496"></a></span>
</p><p>I suppose now you must have understood the power of this system: Any combination of frames and panels of any shape is possible. If you can draw it in 2D, it can exist as a full valid 3D object.
</p><p>Now, let's draw the other pieces, then we'll move everything into place together. But first. we'll need to do some corrections to the base 2D drawing, because some lines are clearly missing, where the windows meet the stairs. We can fix that by offsetting the stairs line by 2.5cm with the <a href="../Draft_Offset.html" title="Draft Offset">Draft Offset</a> tool (with ALT pressed of course, to copy our lines instead of moving them). Now we can draw our layout, with <a href="../Draft_Wire.html" title="Draft Wire">wires</a>, then convert them to a sketch, then making a window of it.
</p><p>After doing that a couple of times (I made it in 4 separate pieces, but it's up to you to decide), we have our facade complete:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_29.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_29.jpg" decoding="async" width="1024" height="302"></a></span>
</p><p>Now, as before, it's just a matter of rotating the pieces, and moving them to their correct position:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_30.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_30.jpg" decoding="async" width="1024" height="412"></a></span>
</p><p>Last missing piece, there is a segment of wall that didn't appear on the plan view, that we need to add. We have several options for that, I chose to draw a line on the ground plane, then move it up to the correct height, then create a wall from it. Then, we also need to fish up our roof subtraction volume (it must have stayed in the last column), then subtract it. Now this side of the building is ready:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_31.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_31.jpg" decoding="async" width="1024" height="455"></a></span>
</p><p>Ready? Not quite. Look at the image above, we did our doors with a 5cm frame, remember (it was the default from the preset). But the other windows have 2.5cm frames. This needs to be fixed.
</p><p><span id="Editing_windows"></span>
</p>
<h3><span class="mw-headline" id="Editarea_ferestrelor">Editarea ferestrelor</span></h3>
<p>Am v&#259;zut deja cum s&#259; construim &#537;i s&#259; actualiz&#259;m componentele ferestrei, prin modul de editare al ferestrei, dar putem de asemenea s&#259; edita&#539;i schi&#539;a care st&#259; la baza. 
Ferestrele prestabilite nu difer&#259; de ferestrele personalizate, instrumentul <a href="../Arch_Window.html" title="Arch Window">Arch Window</a> a creat doar schi&#539;a de baz&#259;. Selecta&#539;i obiectul de u&#537;&#259; (originalul, nu copia, aminti&#539;i-v&#259;, am f&#259;cut o clon&#259;) &#537;i l-a&#539;i extins &icirc;n vizualizarea arborescent&#259;. Exist&#259; schi&#539;a noastr&#259;. Face&#539;i dublu clic pe acesta pentru a intra &icirc;n modul de editare.
</p>
<div class="mw-translate-fuzzy">
<p>the <a href="../Sketcher_Workbench.html" title="Sketcher Workbench">Sketcher Workbench</a> is an extremely powerful tool. It doesn't have some of the <a href="../Draft_Workbench.html" title="Draft Workbench">Draft</a> conveniences, such as snapping or working planes, but it has many other advantages. In FreeCAD you will frequently use one or another depending on the need. The most important feature of the sketcher is constraints. Constraints allow you to automatically fix the position of some elements relative to others. For example, you can force a segment to always be vertical, or to always be at a certain distance to another.
</p>
</div>
<p>When we edit our door sketch, we can see that it is made on a fully constrained sketch:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_32.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_32.jpg" decoding="async" width="1024" height="493"></a></span>
</p><p>Now all we need to do is edit the 5cm distances between the outer line and the inner line, by double-clicking them, and changing their value to 2.5cm (Remember, the units are still not fully functional at the time I'm writing this). After clicking the "OK" button, our door (and its clone) have been updated.
</p><p><span id="Working_without_2D_support"></span>
</p>
<h2><span id="Lucrul_f.C4.83r.C4.83_sprijin_2D"></span><span class="mw-headline" id="Lucrul_f&#259;r&#259;_sprijin_2D">Lucrul f&#259;r&#259; sprijin 2D</span></h2>
<p>Pana acum munca noastra a fost relativ usoara, pentru ca am avut desenele 2D subiacente care ne-au pus bazele lucrarii.
Dar acum trebuie s&#259; facem fa&#539;ada opus&#259; &#537;i atriul de sticl&#259; &#537;i lucrurile devin din ce &icirc;n ce mai complicate: desenul fa&#539;adei opuse are multe lucruri gre&#537;ite, nu reprezint&#259; deloc atriul &#537;i pur &#537;i simplu nu avem desen pentru interiorul pere&#539;ii din atrium. A&#537;adar, va trebui s&#259; invent&#259;m c&acirc;teva lucruri noi &icirc;n&#537;ine. Asigura&#539;i-v&#259; c&#259; a&#539;i aruncat o privire la <a rel="nofollow" class="external text" href="http://www.pedrokok.com.br/2010/02/residencia-artigas-sao-paulo-sp/img_8265-533px/">imagini de referin&#539;&#259;</a> pentru a afla cum se fac lucrurile. Sau face&#539;i a&#537;a cum dori&#539;i!
</p><p>One thing we can already do: duplicate the complicated stairs window with the <a href="../Draft_Move.html" title="Draft Move">Draft Move</a> tool, because it is equal on both sides:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_33.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_33.jpg" decoding="async" width="1024" height="462"></a></span>
</p><p>Note that here, I preferred to duplicate with the <a href="../Draft_Move.html" title="Draft Move">Draft Move</a> tool instead of using a <a href="../Draft_Clone.html" title="Draft Clone">clone</a>, because the clone currently doesn't support different colors inside objects. The difference is that the clone is a copy of the final shape of the original object, while if you copy an object, you create a new object and give it all the same properties as the original one (therefore, also its base sketch and its window components definition, which are both stored as properties).
</p><p>Now we must attack the parts that are not drawn anywhere. Let's start with the glass wall between the sitting room and the atrium. It'll be easier to draw it on the elevation view, because we'll get the correct height of the roof. Once you are in plan view, you can rotate the view from the menu View &rarr; Standard Views &rarr; Rotate left or right, until you get a comfortable view to work, like this:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_34.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_34.jpg" decoding="async" width="1024" height="477"></a></span>
</p><p>Note how on the image above, I made a line from the model to the left section, to get the exact width of the window. Then, I reproduced that width on the elevation view and divided it into 4 pieces. Then I built one main window piece, plus 4 additional windows for the sliding doors. The sketcher sometimes has difficulties with overlapping wires, that's why I preferred to keep them separated like this:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_35.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_35.jpg" decoding="async" width="1024" height="454"></a></span>
</p><p>After the necessary rotations, everything clicks perfectly into place:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_36.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_36.jpg" decoding="async" width="1024" height="462"></a></span>
</p><p>We still need some corner piece there. A little useful trick with the <a href="../Draft_SelectPlane.html" title="Draft SelectPlane">Draft SelectPlane</a> tool, if you have a face selected when you press the button, the working plane matches this face (at least its position, and if the face is rectangular, it also tries to match its axes). This is useful to draw 2D objects directly on the model, such as here, we can draw a rectangle to be extruded directly at its correct position:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_37.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_37.jpg" decoding="async" width="1024" height="461"></a></span>
</p><p>Then let's do the two remaining pieces. One is easy, it is a copy of what's on the other side, so we can simply use the 2D drawing:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_38.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_38.jpg" decoding="async" width="1024" height="472"></a></span>
</p>
<div class="mw-translate-fuzzy">
<p>The other one is a bit tricky, by looking at the pictures, we see that it has many vertical divisions, like the stairs windows. By chance (or very good design from Vilanova Artigas), the width of our window, of 4.50m, is exactly the same as the stairs window, so we can use the exact same division: 15 pieces of 30cm. Here I used the <a href="../Draft_Array.html" title="Draft Array">Draft Array</a> tool to copy over the two lines 15 times,and drew rectangles on top of them:
</p>
</div>
<p><span typeof="mw:File"><a href="../File/Arch_tutorial_39.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_39.jpg" decoding="async" width="1024" height="544"></a></span>
</p><p>Once this is done, we can create our window with the same method we already know. Another small useful trick, in case you haven't found it yourself already: When editing a window, if you change the name of a component, it actually creates a duplicate of it. So to create the 15 inner glass panels, instead of clicking 15 times the "add" button and fill 15 times the data, you can just keep editing one, and change its name and wire, it will create a copy each time.
</p><p>After the window is rotated and moved into place, the atrium is complete:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_40.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_40.jpg" decoding="async" width="1024" height="479"></a></span>
</p><p><span id="Edits_and_fixes"></span>
</p>
<h2><span id="Edit.C4.83ri_.C8.99i_rezolv.C4.83ri"></span><span class="mw-headline" id="Edit&#259;ri_&#537;i_rezolv&#259;ri">Edit&#259;ri &#537;i rezolv&#259;ri</span></h2>
<p>Acum, c&acirc;nd ne uit&#259;m la eleva&#539;ia noastr&#259; din spate &#537;i o compar&#259;m cu planul, vedem c&#259; exist&#259; unele diferen&#539;e care trebuie rezolvate. &#536;i anume, ferestrele dormitorului sunt mai mici dec&acirc;t am crezut prima dat&#259; &#537;i va trebui s&#259; ad&#259;ug&#259;m ni&#537;te pere&#539;i. Pentru a face acest lucru &icirc;n mod corespunz&#259;tor, unele etaje trebuie s&#259; fie t&#259;iate:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_41.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_41.jpg" decoding="async" width="1024" height="442"></a></span>
</p>
<div class="mw-translate-fuzzy">
<p>We have of course several ways to do that, making a subtraction volume would be an easy way, but it would add unnecessary complexity to the model. Better to edit the base wire of each floors. This is where the <a href="../Draft_Edit.html" title="Draft Edit">Draft Edit</a> mode comes into action. By expanding these floors in the tree view, then making their base wire visible, we can then double-click them to enter edit mode. There, we can move their points, or add or remove points. With this,editing our floor plates becomes easy.
</p>
</div>
<p><span typeof="mw:File"><a href="../File/Arch_tutorial_42.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_42.jpg" decoding="async" width="1024" height="481"></a></span>
</p><p>After some more sweat (the person who made those drawings obviously became pretty lazy when did this last elevation, much is drawn wrong), we finally have our complete house:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_43.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_43.jpg" decoding="async" width="1024" height="425"></a></span>
</p><p>Note the chimney tube, which is made from a circle I used to make a hole in the chimney block, that I extruded, then converted into a tube with the <a href="../Part_Offset.html" title="Part Offset">Part Offset</a> tool.
</p>
<div class="note"><b>Problems in objects</b>
<p>Sometimes an object you made can have problems. For example, the object it was based onto has been deleted, and the object can therefore not recalculate its shape. These are usually shown to you by a little red sign on their icon, and/or a warning in the output window. There is no generic recipe to fix these problems, because they can have many origins. But, the easiest way to solve them is often to delete them, and, if you didn't delete their base objects, recreate them.
</p>
</div>
<p><br>
<span id="Output"></span>
</p>
<h2><span class="mw-headline" id="Rezultat">Rezultat</span></h2>
<p>Acum, dup&#259; toat&#259; munca grea prin care am trecut pentru a construi acest model, vine recompensa: Ce putem face cu ea? Practic, acesta este marele avantaj al colabor&#259;rii cu BIM, toate modelele noastre arhitecturale tradi&#539;ionale, cum ar fi desene 2d (planuri, sec&#539;iuni etc.), rand&#259;ri &#537;i calcule (facturi de cantit&#259;&#539;i etc.) pot fi extrase din model. &#536;i, chiar mai bine, regenerat&#259; de fiecare dat&#259; c&acirc;nd modelul se schimb&#259;. V&#259; voi ar&#259;ta aici cum s&#259; ob&#539;ine&#539;i aceste documente diferite.
</p><p><span id="Preparations"></span>
</p>
<h3><span id="Preg.C4.83tiri"></span><span class="mw-headline" id="Preg&#259;tiri">Preg&#259;tiri</span></h3>
<p>&Icirc;nainte de a &icirc;ncepe s&#259; exporta&#539;i diverse chestii, este interesant de luat &icirc;n considerarea un lucru: dup&#259; cum a&#539;i v&#259;zut, modelul nostru devine din ce &icirc;n ce mai complex, cu o mul&#539;ime de rela&#539;ii &icirc;ntre obiecte. Acest lucru poate face opera&#539;iuni ulterioare de calcul subsecvente, cum ar fi t&#259;ierea prin model, dificile. O modalitate rapid&#259; de a "simplifica" &icirc;n mod drastic modelul dvs., este s&#259; elimina&#539;i toate aceste complexit&#259;&#539;i, export&acirc;ndu-le pe formatul <a rel="nofollow" class="external text" href="http://en.wikipedia.org/wiki/ISO_10303-21">STEP</a>. Acest format v&#259; va p&#259;stra toat&#259; geometria, dar va renun&#539;a la toate rela&#539;iile &#537;i construc&#539;iile parametrice, p&#259;str&acirc;nd doar forma final&#259;. C&acirc;nd reimporta&#539;i acel fi&#537;ier STEP &icirc;n FreeCAD, ve&#539;i ob&#539;ine un model care nu mai are nicio rela&#539;ie &#537;i o dimensiune mult mai mic&#259; a fi&#537;ierului. G&acirc;ndi&#539;i-v&#259; la acesta ca la un fi&#537;ier "de ie&#537;ire", pe care &icirc;l pute&#539;i regenera oric&acirc;nd din fi&#537;ierul "master":
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_44.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_44.jpg" decoding="async" width="1024" height="592"></a></span>
</p><p><span id="Exporting_to_IFC_and_other_applications"></span>
</p>
<h3><span id="Exportul_fi.C8.99ierelor_IFC_.C8.99i_alte_aplica.C8.9Bii"></span><span class="mw-headline" id="Exportul_fi&#537;ierelor_IFC_&#537;i_alte_aplica&#539;ii">Exportul fi&#537;ierelor IFC &#537;i alte aplica&#539;ii</span></h3>
<figure class="mw-halign-left" typeof="mw:File"><a href="../File/Arch_tutorial_45.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_45.jpg" decoding="async" width="400" height="244"></a><figcaption></figcaption></figure>
<p>Unul dintre lucrurile fundamentale de care ave&#539;i nevoie atunci c&acirc;nd lucra&#539;i cu BIM este de a putea s&#259; importa&#539;i &#537;i s&#259; exporta&#539;i <a rel="nofollow" class="external text" href="http://en.wikipedia.org/wiki/Industry_Foundation_Classes">IFC</a> files.  Aceasta este &icirc;nc&#259; o lucrare &icirc;n desf&#259;&#537;urare &icirc;n FreeCAD. Formatul <a href="../Arch_IFC.html" title="Arch IFC"> IFC</a> este deja acceptat &#537;i importul fi&#537;ierelor IFC &icirc;n FreeCAD este deja destul de fiabil. Exportul este &icirc;nc&#259; experimental &#537;i are &icirc;n prezent numeroase limit&#259;ri. Cu toate acestea, lucrurile se &icirc;mbun&#259;t&#259;&#539;esc continuu &#537;i ar trebui s&#259; ob&#539;inem exportul adecvat al IFC foarte cur&acirc;nd.
</p><p><a href="../Arch_IFC.html" title="Arch IFC">IFC export</a> requires very little setup, once the necessary software libraries are installed. You only need to recreate the building structure, which is needed in all IFC files, by adding an <a href="../Arch_Building.html" title="Arch Building">Arch Building</a> to your file, then an <a href="../Arch_Floor.html" title="Arch Floor">Arch Floor</a>, then moving all the groups of objects that compose your model in it. Make sure you leave your construction geometry (all the 2D stuff we've been drawing) out of it to avoid making your IFC file unnecessarily heavy.
</p><p>Another thing to set, is to check the "Role" property of structural elements. Since IFC has no "generic" structural element, like FreeCAD, we need to assign them roles (column, beam, etc...) so the exporter knows what element to create in the IFC file.
</p><p>In this case, we need our whole architectural system, so the IFC exporter can know if an object must be exported as a wall or a column, so we are using our "master" model, not our "output" model.
</p><p>Once this is done, simply select your building object, and choose the "Industry Foundation Classes" format. Exporting to non-BIM applications, such as <a rel="nofollow" class="external text" href="http://www.sketchup.com/">Sketchup</a> is also easy, you have several export formats at your disposal, such as <a href="../Arch_DAE.html" title="Arch DAE">Collada</a>, STEP, IGES ou OBJ.
</p>
<div style="clear:both"></div>
<p><span id="Rendering"></span>
</p>
<h3><span class="mw-headline" id="Randarea">Randarea</span></h3>
<div class="mw-translate-fuzzy">
<p>FreeCAD include, de asemenea, un modul de randare, <a href="../Raytracing_Workbench.html" title="Raytracing Workbench">Raytracing Workbench</a>. Acest suport de lucru accept&#259; &icirc;n prezent dou&#259; motoare de randare, <a rel="nofollow" class="external text" href="http://www.povray.org/">PovRay</a> &#537;i <a rel="nofollow" class="external text" href="http://www.luxrender.net">LuxRender</a>. Deoarece FreeCAD nu este proiectat pentru randarea imaginilor, caracteristicile pe care le ofer&#259; Atelierul de lucru Raytracing sunt oarecum limitate. Cea mai bun&#259; cale de ac&#539;iune atunci c&acirc;nd dori&#539;i s&#259; face&#539;i redarea corect&#259; este s&#259; exporta&#539;i modelul &icirc;ntr-un format bazat pe plas&#259;, cum ar fi OBJ sau STL, &#537;i s&#259;-l deschide&#539;i &icirc;ntr-o aplica&#539;ie mai potrivit&#259; pentru randare, cum ar fi [http: // www. blender.org blender]. Imaginea de mai jos a fost redat&#259; cu motorul ciclurilor blenderului:
</p>
</div>
<p><span typeof="mw:File"><a href="../File/Arch_tutorial_47.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_47.jpg" decoding="async" width="1024" height="480"></a></span>
</p><p>But, for a quick rendering, the Raytracing workbench can already do a good job, with the advantage of being very easy to setup, thanks to its templates system. This is a rendering of our model fully made within FreeCAD, with the Luxrender engine, using the "indoor" template.
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_48.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_48.jpg" decoding="async" width="1024" height="599"></a></span>
</p><p>The Raytracing workbench still offers you very limited control over materials, but lighting and environments are defined in templates, so they can be fully customized.
</p><p><span id="2D_drawings"></span>
</p>
<h3><span class="mw-headline" id="Desene_2D">Desene 2D</span></h3>
<p>Desigur, cea mai important&#259; utilizare a BIM este s&#259; produc&#259; automat desene 2D. Acest lucru se face &icirc;n FreeCAD cu instrumentul <a href="../Arch_SectionPlane.html" title="Arch SectionPlane">Arch SectionPlane</a>. Acest instrument v&#259; permite s&#259; plasa&#539;i un obiect plan de sec&#539;iune &icirc;n vizualizarea 3D, pe care &icirc;l pute&#539;i orienta pentru a produce planuri, sec&#539;iuni &#537;i eleva&#539;ii. Planurile de sec&#539;iune trebuie s&#259; &#537;tie ce obiecte trebuie s&#259; ia &icirc;n considerare, a&#537;a c&#259; odat&#259; ce le-a&#539;i creat, trebuie s&#259; ad&#259;uga&#539;i obiecte cu ajutorul instrumentului <a href="../Arch_Add.html" title="Arch Add">Arch Add</a>. Pute&#539;i ad&#259;uga obiecte individuale sau, mai convenabil, un grup, un podea sau o cl&#259;dire &icirc;ntreag&#259;. Acest lucru v&#259; permite s&#259; modifica&#539;i cu u&#537;urin&#539;&#259; domeniul de aplicare a unui anumit plan de sec&#539;iune mai t&acirc;rziu, ad&#259;ug&acirc;nd sau elimin&acirc;nd obiecte &icirc;n / din grupul respectiv. Orice modificare a acestor obiecte se reflect&#259; &icirc;n vizualiz&#259;rile produse de planul sec&#539;iunii.
</p><p>The section plane automatically produces cut views of the objects it intersects. In other words, to produce views instead of sections, you just need to place the section plane outside of your objects.
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_49.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_49.jpg" decoding="async" width="1024" height="470"></a></span>
</p>
<div class="mw-translate-fuzzy">
<p>The section planes can produce two different outputs: <a href="../Part_Workbench.html" title="Part Workbench">shape</a> objects, that live in the same document as your 3D model, or <a href="../Drawing_Workbench.html" title="Drawing Workbench">drawing views</a>, that are made to use on a drawing sheet produced by the <a href="../Drawing_Workbench.html" title="Drawing Workbench">Drawing workbench</a>. Each of these behave differently, and has its own advantages.
</p>
</div>
<p><b>Vederea formelor</b>
</p>
<div class="mw-translate-fuzzy">
<p>Aceast&#259; ie&#537;ire este produs&#259; utiliz&acirc;nd instrumentul <a href="../Draft_Shape2DView.html" title="Draft Shape2DView">Draft Shape2DView</a> cu un plan de sec&#539;iune selectat. Efectua&#539;i o vizualizare 2D a modelului direct &icirc;n spa&#539;iul 3D, ca &icirc;n imaginea de mai sus. Principalul avantaj aici este c&#259; pute&#539;i lucra la ele folosind instrumentele <a href="../Draft_Workbench.html" title="Draft Workbench"> Draft</a> (sau orice alt instrument standard al FreeCAD), astfel &icirc;nc&acirc;t s&#259; pute&#539;i ad&#259;uga texte, dimensiuni, simboluri etc:
</p>
</div>
<p><span typeof="mw:File"><a href="../File/Arch_tutorial_50.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_50.jpg" decoding="async" width="1024" height="457"></a></span>
</p><p>On the image above, two <a href="../Draft_Shape2DView.html" title="Draft Shape2DView">Shape2D views</a> have been produced for each section, one showing everything, the other showing only the cut lines. This allows us to give it a different line weight, and turn hatching on. Then, dimensions, texts and symbols have been added, and a couple of DXF blocks have been imported to represent the furniture. These views are then easy to export to DXF or DWG, and open in your favorite 2D CAD application, such as <a rel="nofollow" class="external text" href="http://www.librecad.org">LibreCAD</a> or <a rel="nofollow" class="external text" href="http://www.3ds.com/products-services/draftsight/overview/">DraftSight</a>, where you can work further on them:
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_51.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_51.jpg" decoding="async" width="1024" height="541"></a></span>
</p><p>Note that some features are still not supported by the <a href="../Draft_DXF.html" title="Draft DXF">DXF/DWG exporter</a> so the result in your 2D application might differ a bit. For example, in the image above, I had to redo the hatching, and correct the position of some dimension texts. If you place your objects in different groups in FreeCAD, these become layers in your 2D CAD application.
</p><p><b>ArchViews</b>
</p><p>The other kind of output that can be produced from <a href="../Arch_SectionPlane.html" title="Arch SectionPlane">section planes</a> are <a href="../TechDraw_ArchView.html" title="TechDraw ArchView">TechDraw ArchViews</a>. This method has one big limitation compared to the previous one: you have limited possibilities to edit the results, and at the moment, things like dimensioning or hatching are still not natively supported.
</p><p>On the other hand, the final output being easier to manipulate, and the graphical possibilities of the SVG format being huge, in the future, undoubtedly this will be the preferred method. At the moment, though, you'll get better results using the previous one.
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_52.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_52.jpg" decoding="async" width="1024" height="631"></a></span>
</p>
<div class="mw-translate-fuzzy">
<p>On the image above, the geometry is the direct output of the section plane, but some other Draft objects have been added, such as dimensions and hatched polygons, and another view object with same scale and offset values has been produced from them with the <a href="../Draft_Drawing.html" title="Draft Drawing">Draft Drawing</a> tool. In the future, such operations will be done directly on the Drawing page, leaving your model totally clean.
</p>
</div>
<p><span id="Quantities_extraction"></span>
</p>
<h3><span id="Extragerea_cantit.C4.83.C8.9Bilor"></span><span class="mw-headline" id="Extragerea_cantit&#259;&#539;ilor">Extragerea cantit&#259;&#539;ilor</span></h3>
<div class="mw-translate-fuzzy">
<p>Aceasta este o alt&#259; sarcin&#259; foarte important&#259; care trebuie efectuat&#259; pe modelele BIM. &Icirc;n FreeCAD, lucrurile arat&#259; bine &icirc;nc&#259; de la &icirc;nceput, deoarece kernelul OpenCasCade al FreeCAD are deja grij&#259; de calculul lungimilor, zonelor &#537;i volumelor pentru toate formele pe care le produce. Deoarece toate obiectele <a href="../ro/Arch_Workbench.html" title="Arch Workbench/ro">Arch</a> sunt solide, ave&#539;i &icirc;ntotdeauna garan&#539;ia c&#259; ve&#539;i putea ob&#539;ine un volum din ele.
</p>
</div>
<p><b>Using spreadsheets</b>
</p><p>To populate a spreadsheet with values extracted from the model the Arch_Schedule tool can be used.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../File/Arch_schedule_example03.jpg" class="mw-file-description"><img src="../File/Arch_schedule_example03.jpg" decoding="async" width="858" height="555"></a></span>
</p><p><b>The survey mode</b>
</p><p>O alt&#259; modalitate de a v&#259; cerceta modelul &#537;i de a extrage valorile este s&#259; utiliza&#539;i modul <a href="../Arch_Survey.html" title="Arch Survey">Arch Survey</a>. &Icirc;n acest mod, pute&#539;i face clic pe puncte, muchii, fe&#539;e sau face&#539;i dublu clic pentru a selecta obiecte &icirc;ntregi &#537;i ve&#539;i ob&#539;ine valorile altitudinii, lungimii, zonei sau volumului, afi&#537;ate pe model, imprimate pe fereastra de ie&#537;ire FreeCAD &#537;i copiate &icirc;n clipboard, astfel &icirc;nc&acirc;t s&#259; pute&#539;i alege &#537;i lipi cu u&#537;urin&#539;&#259; valorile &icirc;ntr-o alt&#259; aplica&#539;ie deschis&#259;
</p><p><span typeof="mw:File"><a href="../File/Arch_tutorial_54.jpg" class="mw-file-description"><img src="../File/Arch_tutorial_54.jpg" decoding="async" width="1024" height="666"></a></span>
</p><p><span id="Conclusion"></span>
</p>
<h2><span class="mw-headline" id="Concluzii">Concluzii</span></h2>
<div class="mw-translate-fuzzy">
<p>Sper c&#259; acest lucru v&#259; ofer&#259; o imagine de ansamblu asupra instrumentelor disponibile, asigura&#539;i-v&#259; c&#259; v&#259; referi&#539;i la documenta&#539;ia pentru Atelierul <a href="../Arch_Workbench.html" title="Arch Workbench">Arch Workbench</a> sau Atelierul <a href="../Draft_Workbench.html" title="Draft Workbench">Draft Workbench</a> pentru informa&#539;ii suplimentare (exist&#259; mai multe instrumente pe care nu le-am men&#539;ionat aici), &#537;i, &icirc;n general, cu restul <a href="../Main_Page.html" title="Main Page">FreeCAD documentation</a>. Vizita&#539;i &#537;i <a rel="nofollow" class="external text" href="http://forum.freecadweb.org">forum</a>,  multe probleme pot fi de obicei rezolvate acolo &icirc;n cel mai scurt timp, &#537;i urma&#539;i-m&#259; pe <a rel="nofollow" class="external text" href="http://yorik.uncreated.net/guestblog.php?tag=freecad">blog</a> pentru nout&#259;&#539;i despre dezvoltarea Atelierului Arch .
</p>
</div>
<div class="mw-translate-fuzzy">
<p>Fi&#537;ierul creat pe durata acestui tutorial poate fi g&#259;sit la  <a rel="nofollow" class="external text" href="http://yorik.uncreated.net/archive/freecad/casa_artigas.fcstd">here</a>
</p>
</div>
<p><br>
</p>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: #fefefe;"><span typeof="mw:File"><a href="../File/Workbench_BIM.svg" class="mw-file-description"><img src="../File/Workbench_BIM.svg" decoding="async" width="24" height="24"></a></span> <a href="../index.php?title=BIM_Workbench/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Workbench/ro (page does not exist)">BIM</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid #aaaaaa; text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: #fefefe;">
<ul><li><b>2D drafting:</b> <a href="../index.php?title=BIM_Sketch/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Sketch/ro (page does not exist)">Sketch</a>, <a href="../ro/Draft_Line.html" title="Draft Line/ro">Line</a>, <a href="../ro/Draft_Wire.html" title="Draft Wire/ro">Polyline</a>, <a href="../ro/Draft_Circle.html" title="Draft Circle/ro">Circle</a>, <a href="../ro/Draft_Arc.html" title="Draft Arc/ro">Arc</a>, <a href="../index.php?title=Draft_Arc_3Points/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Draft Arc 3Points/ro (page does not exist)">Arc by 3 points</a>, <a href="../index.php?title=Draft_Fillet/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Draft Fillet/ro (page does not exist)">Fillet</a>, <a href="../ro/Draft_Ellipse.html" title="Draft Ellipse/ro">Ellipse</a>, <a href="../ro/Draft_Polygon.html" title="Draft Polygon/ro">Polygon</a>, <a href="../ro/Draft_Rectangle.html" title="Draft Rectangle/ro">Rectangle</a>, <a href="../ro/Draft_BSpline.html" title="Draft BSpline/ro">B-spline</a>, <a href="../ro/Draft_BezCurve.html" title="Draft BezCurve/ro">B&eacute;zier curve</a>, <a href="../index.php?title=Draft_CubicBezCurve/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Draft CubicBezCurve/ro (page does not exist)">Cubic B&eacute;zier curve</a>, <a href="../ro/Draft_Point.html" title="Draft Point/ro">Point</a></li></ul>
<hr>
<ul><li><b>3D/BIM:</b> <a href="../index.php?title=BIM_Project/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Project/ro (page does not exist)">Project</a>, <a href="../ro/Arch_Site.html" title="Arch Site/ro">Site</a>, <a href="../ro/Arch_Building.html" title="Arch Building/ro">Building</a>, <a href="../index.php?title=Arch_Floor/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Arch Floor/ro (page does not exist)">Level</a>, <a href="../ro/Arch_Space.html" title="Arch Space/ro">Space</a>, <a href="../ro/Arch_Wall.html" title="Arch Wall/ro">Wall</a>, <a href="../index.php?title=Arch_CurtainWall/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Arch CurtainWall/ro (page does not exist)">Curtain Wall</a>, <a href="../index.php?title=BIM_Column/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Column/ro (page does not exist)">Column</a>, <a href="../index.php?title=BIM_Beam/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Beam/ro (page does not exist)">Beam</a>, <a href="../index.php?title=BIM_Slab/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Slab/ro (page does not exist)">Slab</a>, <a href="../index.php?title=BIM_Door/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Door/ro (page does not exist)">Door</a>, <a href="../ro/Arch_Window.html" title="Arch Window/ro">Window</a>, <a href="../ro/Arch_Pipe.html" title="Arch Pipe/ro">Pipe</a>, <a href="../ro/Arch_PipeConnector.html" title="Arch PipeConnector/ro">Pipe Connector</a>, <a href="../ro/Arch_Stairs.html" title="Arch Stairs/ro">Stairs</a>, <a href="../ro/Arch_Roof.html" title="Arch Roof/ro">Roof</a>, <a href="../ro/Arch_Panel.html" title="Arch Panel/ro">Panel</a>, <a href="../ro/Arch_Frame.html" title="Arch Frame/ro">Frame</a>, <a href="../index.php?title=Arch_Fence/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Arch Fence/ro (page does not exist)">Fence</a>, <a href="../index.php?title=Arch_Truss/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Arch Truss/ro (page does not exist)">Truss</a>, <a href="../index.php?title=Arch_Equipment/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Arch Equipment/ro (page does not exist)">Equipment</a>
<ul><li><b>Reinforcement tools:</b> <a href="../ro/Arch_Rebar.html" title="Arch Rebar/ro">Custom Rebar</a>, <a href="../ro/Reinforcement_StraightRebar.html" title="Reinforcement StraightRebar/ro">Straight Rebar</a>, <a href="../ro/Reinforcement_UShapeRebar.html" title="Reinforcement UShapeRebar/ro">U-Shape Rebar</a>, <a href="../ro/Reinforcement_LShapeRebar.html" title="Reinforcement LShapeRebar/ro">L-Shape Rebar</a>, <a href="../ro/Reinforcement_StirrupRebar.html" title="Reinforcement StirrupRebar/ro">Stirrup</a>, <a href="../ro/Reinforcement_BentShapeRebar.html" title="Reinforcement BentShapeRebar/ro">Bent-Shape Rebar</a>, <a href="../ro/Reinforcement_HelicalRebar.html" title="Reinforcement HelicalRebar/ro">Helical Rebar</a>, <a href="../index.php?title=Reinforcement_ColumnRebars/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Reinforcement ColumnRebars/ro (page does not exist)">Column Reinforcement</a>, <a href="../index.php?title=Reinforcement_BeamRebars/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Reinforcement BeamRebars/ro (page does not exist)">Beam Reinforcement</a>, <a href="../index.php?title=Reinforcement_SlabRebars/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Reinforcement SlabRebars/ro (page does not exist)">Slab Reinforcement</a>, <a href="../index.php?title=Reinforcement_FootingRebars/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Reinforcement FootingRebars/ro (page does not exist)">Footing Reinforcement</a></li>
<li><b>Generic 3D tools:</b> <a href="../index.php?title=Arch_Profile/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Arch Profile/ro (page does not exist)">Profile</a>, <a href="../ro/BIM_Box.html" title="BIM Box/ro">Box</a>, <a href="../ro/Part_Builder.html" title="Part Builder/ro">Shape builder...</a>, <a href="../ro/Draft_Facebinder.html" title="Draft Facebinder/ro">Facebinder</a>, <a href="../ro/BIM_Library.html" title="BIM Library/ro">Objects library</a>, <a href="../ro/Arch_Component.html" title="Arch Component/ro">Component</a>, <a href="../ro/Arch_Reference.html" title="Arch Reference/ro">External reference</a></li></ul></li></ul>
<hr>
<ul><li><b>Annotation:</b> <a href="../BIM_Text.html" title="BIM Text">Text</a>, <a href="../ro/Draft_ShapeString.html" title="Draft ShapeString/ro">Shape from text</a>, <a href="../index.php?title=BIM_DimensionAligned/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM DimensionAligned/ro (page does not exist)">Aligned dimension</a>, <a href="../index.php?title=BIM_DimensionHorizontal/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM DimensionHorizontal/ro (page does not exist)">Horizontal dimension</a>, <a href="../index.php?title=BIM_DimensionVertical/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM DimensionVertical/ro (page does not exist)">Vertical dimension</a>, <a href="../index.php?title=BIM_Leader/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Leader/ro (page does not exist)">Leader</a>, <a href="../ro/Draft_Label.html" title="Draft Label/ro">Label</a>, <a href="../ro/Arch_Axis.html" title="Arch Axis/ro">Axis</a>, <a href="../ro/Arch_AxisSystem.html" title="Arch AxisSystem/ro">Axes System</a>, <a href="../index.php?title=Arch_Grid/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Arch Grid/ro (page does not exist)">Grid</a>, <a href="../ro/Arch_SectionPlane.html" title="Arch SectionPlane/ro">Section Plane</a>, <a href="../index.php?title=Draft_Hatch/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Draft Hatch/ro (page does not exist)">Hatch</a>, <a href="../index.php?title=BIM_TDPage/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM TDPage/ro (page does not exist)">Page</a>, <a href="../index.php?title=BIM_TDView/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM TDView/ro (page does not exist)">View</a>, <a href="../index.php?title=BIM_Shape2DView/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Shape2DView/ro (page does not exist)">Shape-based view</a></li></ul>
<hr>
<ul><li><b><a href="../ro/Draft_Snap.html" title="Draft Snap/ro">Snapping</a>:</b> <a href="../ro/Draft_Snap_Lock.html" title="Draft Snap Lock/ro">Snap lock</a>, <a href="../ro/Draft_Snap_Endpoint.html" title="Draft Snap Endpoint/ro">Snap endpoint</a>, <a href="../ro/Draft_Snap_Midpoint.html" title="Draft Snap Midpoint/ro">Snap midpoint</a>, <a href="../ro/Draft_Snap_Center.html" title="Draft Snap Center/ro">Snap center</a>, <a href="../ro/Draft_Snap_Angle.html" title="Draft Snap Angle/ro">Snap angle</a>, <a href="../ro/Draft_Snap_Intersection.html" title="Draft Snap Intersection/ro">Snap intersection</a>, <a href="../index.php?title=Draft_Snap_Perpendicular/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Draft Snap Perpendicular/ro (page does not exist)">Snap perpendicular</a>, <a href="../ro/Draft_Snap_Extension.html" title="Draft Snap Extension/ro">Snap extension</a>, <a href="../ro/Draft_Snap_Parallel.html" title="Draft Snap Parallel/ro">Snap parallel</a>, <a href="../ro/Draft_Snap_Special.html" title="Draft Snap Special/ro">Snap special</a>, <a href="../ro/Draft_Snap_Near.html" title="Draft Snap Near/ro">Snap near</a>, <a href="../index.php?title=Draft_Snap_Ortho/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Draft Snap Ortho/ro (page does not exist)">Snap ortho</a>, <a href="../ro/Draft_Snap_Grid.html" title="Draft Snap Grid/ro">Snap grid</a>, <a href="../ro/Draft_Snap_WorkingPlane.html" title="Draft Snap WorkingPlane/ro">Snap working plane</a>, <a href="../index.php?title=Draft_Snap_Dimensions/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Draft Snap Dimensions/ro (page does not exist)">Snap dimensions</a>, <a href="../ro/Draft_ToggleGrid.html" title="Draft ToggleGrid/ro">Toggle grid</a>, <a href="../index.php?title=BIM_SetWPTop/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM SetWPTop/ro (page does not exist)">Working Plane Top</a>, <a href="../index.php?title=BIM_SetWPFront/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM SetWPFront/ro (page does not exist)">Working Plane Front</a>, <a href="../index.php?title=BIM_SetWPSide/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM SetWPSide/ro (page does not exist)">Working Plane Side</a></li></ul>
<hr>
<ul><li><b>Modify:</b> <a href="../ro/Draft_Move.html" title="Draft Move/ro">Move</a>, <a href="../ro/BIM_Copy.html" title="BIM Copy/ro">Copy</a>, <a href="../ro/Draft_Rotate.html" title="Draft Rotate/ro">Rotate</a>, <a href="../index.php?title=BIM_Clone/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Clone/ro (page does not exist)">Clone</a>, <a href="../ro/BIM_SimpleCopy.html" class="mw-redirect" title="BIM SimpleCopy/ro">Create simple copy</a>, <a href="../ro/BIM_Compound.html" class="mw-redirect" title="BIM Compound/ro">Make compound</a>, <a href="../ro/Draft_Offset.html" title="Draft Offset/ro">Offset</a>, <a href="../ro/BIM_Offset2D.html" class="mw-redirect" title="BIM Offset2D/ro">2D Offset...</a>, <a href="../ro/Draft_Trimex.html" title="Draft Trimex/ro">Trimex</a>, <a href="../index.php?title=Draft_Join/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Draft Join/ro (page does not exist)">Join</a>, <a href="../index.php?title=Draft_Split/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Draft Split/ro (page does not exist)">Split</a>, <a href="../ro/Draft_Scale.html" title="Draft Scale/ro">Scale</a>, <a href="../ro/Draft_Stretch.html" title="Draft Stretch/ro">Stretch</a>, <a href="../ro/Draft_Draft2Sketch.html" title="Draft Draft2Sketch/ro">Draft to sketch</a>, <a href="../ro/Draft_Upgrade.html" title="Draft Upgrade/ro">Upgrade</a>, <a href="../ro/Draft_Downgrade.html" title="Draft Downgrade/ro">Downgrade</a>, <a href="../ro/Arch_Add.html" title="Arch Add/ro">Add component</a>, <a href="../ro/Arch_Remove.html" title="Arch Remove/ro">Remove component</a>, <a href="../index.php?title=Draft_OrthoArray/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Draft OrthoArray/ro (page does not exist)">Array</a>, <a href="../ro/Draft_PathArray.html" title="Draft PathArray/ro">Path array</a>, <a href="../index.php?title=Draft_PolarArray/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Draft PolarArray/ro (page does not exist)">Polar array</a>, <a href="../ro/Draft_PointArray.html" title="Draft PointArray/ro">Point array</a>, <a href="../index.php?title=Arch_CutPlane/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Arch CutPlane/ro (page does not exist)">Cut with plane</a>, <a href="../ro/Draft_Mirror.html" title="Draft Mirror/ro">Mirror</a>, <a href="../ro/BIM_Extrude.html" class="mw-redirect" title="BIM Extrude/ro">Extrude...</a>, <a href="../ro/BIM_Cut.html" class="mw-redirect" title="BIM Cut/ro">Difference</a>, <a href="../ro/BIM_Fuse.html" class="mw-redirect" title="BIM Fuse/ro">Union</a>, <a href="../ro/BIM_Common.html" class="mw-redirect" title="BIM Common/ro">Intersection</a></li></ul>
<hr>
<ul><li><b>Manage:</b> <a href="../ro/BIM_Setup.html" title="BIM Setup/ro">BIM Setup...</a>, <a href="../index.php?title=BIM_Views/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Views/ro (page does not exist)">Views manager</a>, <a href="../ro/BIM_ProjectManager.html" title="BIM ProjectManager/ro">Manage project...</a>, <a href="../index.php?title=BIM_Windows/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Windows/ro (page does not exist)">Manage doors and windows...</a>, <a href="../index.php?title=BIM_IfcElements/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM IfcElements/ro (page does not exist)">Manage IFC elements...</a>, <a href="../index.php?title=BIM_IfcQuantities/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM IfcQuantities/ro (page does not exist)">Manage IFC quantities...</a>, <a href="../index.php?title=BIM_IfcProperties/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM IfcProperties/ro (page does not exist)">Manage IFC properties...</a>, <a href="../index.php?title=BIM_Classification/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Classification/ro (page does not exist)">Manage classification...</a>, <a href="../index.php?title=BIM_Layers/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Layers/ro (page does not exist)">Manage layers...</a>, <a href="../index.php?title=BIM_Material/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Material/ro (page does not exist)">Material</a>, <a href="../ro/Arch_Schedule.html" title="Arch Schedule/ro">Schedule</a>, <a href="../index.php?title=BIM_Preflight/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Preflight/ro (page does not exist)">Preflight checks...</a>, <a href="../index.php?title=Draft_AnnotationStyleEditor/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Draft AnnotationStyleEditor/ro (page does not exist)">Annotation styles...</a></li></ul>
<hr>
<ul><li><b>Utils:</b> <a href="../index.php?title=BIM_TogglePanels/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM TogglePanels/ro (page does not exist)">Toggle bottom panels</a>, <a href="../index.php?title=BIM_Trash/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Trash/ro (page does not exist)">Move to Trash</a>, <a href="../index.php?title=BIM_WPView/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM WPView/ro (page does not exist)">Working Plane View</a>, <a href="../ro/Draft_SelectGroup.html" title="Draft SelectGroup/ro">Select group</a>, <a href="../ro/Draft_Slope.html" title="Draft Slope/ro">Set slope</a>, <a href="../ro/Draft_WorkingPlaneProxy.html" title="Draft WorkingPlaneProxy/ro">Create working plane proxy</a>, <a href="../ro/Draft_AddConstruction.html" title="Draft AddConstruction/ro">Add to construction group</a>, <a href="../ro/Arch_SplitMesh.html" title="Arch SplitMesh/ro">Split Mesh</a>, <a href="../ro/Arch_MeshToShape.html" title="Arch MeshToShape/ro">Mesh to Shape</a>, <a href="../ro/Arch_SelectNonSolidMeshes.html" title="Arch SelectNonSolidMeshes/ro">Select non-manifold meshes</a>, <a href="../ro/Arch_RemoveShape.html" title="Arch RemoveShape/ro">Remove Shape from Arch</a>, <a href="../ro/Arch_CloseHoles.html" title="Arch CloseHoles/ro">Close Holes</a>, <a href="../ro/Arch_MergeWalls.html" title="Arch MergeWalls/ro">Merge Walls</a>, <a href="../ro/Arch_Check.html" title="Arch Check/ro">Check</a>, <a href="../ro/Arch_ToggleIfcBrepFlag.html" title="Arch ToggleIfcBrepFlag/ro">Toggle IFC Brep flag</a>, <a href="../ro/Arch_ToggleSubs.html" title="Arch ToggleSubs/ro">Toggle subcomponents</a>, <a href="../ro/Arch_Survey.html" title="Arch Survey/ro">Survey</a>, <a href="../index.php?title=BIM_Diff/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Diff/ro (page does not exist)">IFC Diff</a>, <a href="../ro/BIM_IfcExplorer.html" title="BIM IfcExplorer/ro">IFC explorer</a>, <a href="../ro/Arch_IfcSpreadsheet.html" title="Arch IfcSpreadsheet/ro">Create IFC spreadsheet...</a>, <a href="../index.php?title=BIM_ImagePlane/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM ImagePlane/ro (page does not exist)">Image plane</a>, <a href="../index.php?title=BIM_Unclone/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Unclone/ro (page does not exist)">Unclone</a>, <a href="../index.php?title=BIM_Rewire/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Rewire/ro (page does not exist)">Rewire</a>, <a href="../index.php?title=BIM_Glue/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Glue/ro (page does not exist)">Glue</a>, <a href="../index.php?title=BIM_Reextrude/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Reextrude/ro (page does not exist)">Reextrude</a>
<ul><li><b>Panel tools:</b> <a href="../ro/Arch_Panel.html" title="Arch Panel/ro">Panel</a>, <a href="../ro/Arch_Panel_Cut.html" title="Arch Panel Cut/ro">Panel Cut</a>, <a href="../index.php?title=Arch_Panel_Sheet/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Arch Panel Sheet/ro (page does not exist)">Panel Sheet</a>, <a href="../ro/Arch_Nest.html" title="Arch Nest/ro">Nest</a></li>
<li><b>Structure tools:</b> <a href="../ro/Arch_Structure.html" title="Arch Structure/ro">Structure</a>, <a href="../index.php?title=Arch_StructuralSystem/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Arch StructuralSystem/ro (page does not exist)">Structural System</a>, <a href="../index.php?title=Arch_StructuresFromSelection/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Arch StructuresFromSelection/ro (page does not exist)">Multiple Structures</a></li>
<li><b>IFC tools:</b> <a href="../index.php?title=IFC_Diff/ro&amp;action=edit&amp;redlink=1.html" class="new" title="IFC Diff/ro (page does not exist)">IFC Diff...</a>, <a href="../index.php?title=IFC_Expand/ro&amp;action=edit&amp;redlink=1.html" class="new" title="IFC Expand/ro (page does not exist)">IFC Expand</a>, <a href="../index.php?title=IFC_MakeProject/ro&amp;action=edit&amp;redlink=1.html" class="new" title="IFC MakeProject/ro (page does not exist)">Make IFC project</a>, <a href="../index.php?title=IFC_UpdateIOS/ro&amp;action=edit&amp;redlink=1.html" class="new" title="IFC UpdateIOS/ro (page does not exist)">IfcOpenShell update</a></li>
<li><b>Nudge:</b> <a href="../index.php?title=BIM_Nudge_Switch/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Nudge Switch/ro (page does not exist)">Nudge Switch</a>, <a href="../index.php?title=BIM_Nudge_Up/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Nudge Up/ro (page does not exist)">Nudge Up</a>, <a href="../index.php?title=BIM_Nudge_Down/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Nudge Down/ro (page does not exist)">Nudge Down</a>, <a href="../index.php?title=BIM_Nudge_Left/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Nudge Left/ro (page does not exist)">Nudge Left</a>, <a href="../index.php?title=BIM_Nudge_Right/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Nudge Right/ro (page does not exist)">Nudge Right</a>, <a href="../index.php?title=BIM_Nudge_RotateLeft/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Nudge RotateLeft/ro (page does not exist)">Nudge Rotate Left</a>, <a href="../index.php?title=BIM_Nudge_RotateRight/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Nudge RotateRight/ro (page does not exist)">Nudge Rotate Right</a>, <a href="../index.php?title=BIM_Nudge_Extend/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Nudge Extend/ro (page does not exist)">Nudge Extend</a>, <a href="../index.php?title=BIM_Nudge_Shrink/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Nudge Shrink/ro (page does not exist)">Nudge Shrink</a></li></ul></li></ul>
<hr>
<ul><li><b>Additional:</b> <a href="../index.php?title=BIM_Preferences/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Preferences/ro (page does not exist)">Preferences</a>, <a href="../index.php?title=Fine-tuning/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Fine-tuning/ro (page does not exist)">Fine tuning</a>, <a href="../ro/Import_Export_Preferences.html" title="Import Export Preferences/ro">Import Export Preferences</a>, <a href="../index.php?title=Arch_IFC/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Arch IFC/ro (page does not exist)">IFC</a>, <a href="../index.php?title=Arch_DAE/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Arch DAE/ro (page does not exist)">DAE</a>, <a href="../index.php?title=Arch_OBJ/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Arch OBJ/ro (page does not exist)">OBJ</a>, <a href="../index.php?title=Arch_JSON/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Arch JSON/ro (page does not exist)">JSON</a>, <a href="../index.php?title=Arch_3DS/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Arch 3DS/ro (page does not exist)">3DS</a>, <a href="../index.php?title=Arch_SHP/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Arch SHP/ro (page does not exist)">SHP</a></li></ul></div>
    </div></div>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: #fefefe;"><span typeof="mw:File"><a href="../File/User_hub.png" class="mw-file-description"><img src="../File/User_hub.png" decoding="async" width="24" height="24"></a></span> <a href="../ro/User_hub.html" title="User hub/ro">User documentation</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid #aaaaaa; text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: #fefefe;">
<ul><li><b><a href="../ro/Getting_started.html" title="Getting started/ro">Getting started</a></b></li>
<li><b>Installation:</b> <a href="../ro/Download.html" title="Download/ro">Download</a>, <a href="../ro/Installing_on_Windows.html" title="Installing on Windows/ro">Windows</a>, <a href="../ro/Installing_on_Linux.html" title="Installing on Linux/ro">Linux</a>, <a href="../ro/Installing_on_Mac.html" title="Installing on Mac/ro">Mac</a>, <a href="../ro/Installing_additional_components.html" title="Installing additional components/ro">Additional components</a>, <a href="../index.php?title=Compile_on_Docker/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Compile on Docker/ro (page does not exist)">Docker</a>, <a href="../index.php?title=AppImage/ro&amp;action=edit&amp;redlink=1.html" class="new" title="AppImage/ro (page does not exist)">AppImage</a>, <a href="../index.php?title=Ubuntu_Snap/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Ubuntu Snap/ro (page does not exist)">Ubuntu Snap</a></li>
<li><b>Basics:</b> <a href="../ro/About_FreeCAD.html" title="About FreeCAD/ro">About FreeCAD</a>, <a href="../index.php?title=Interface/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Interface/ro (page does not exist)">Interface</a>, <a href="../ro/Mouse_navigation.html" title="Mouse navigation/ro">Mouse navigation</a>, <a href="../index.php?title=Selection_methods/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Selection methods/ro (page does not exist)">Selection methods</a>, <a href="../index.php?title=Object_name/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Object name/ro (page does not exist)">Object name</a>, <a href="../ro/Preferences_Editor.html" title="Preferences Editor/ro">Preferences</a>, <a href="../ro/Workbenches.html" title="Workbenches/ro">Workbenches</a>, <a href="../ro/Document_structure.html" title="Document structure/ro">Document structure</a>, <a href="../ro/Property.html" title="Property/ro">Properties</a>, <a href="../ro/Help_FreeCAD.html" title="Help FreeCAD/ro">Help FreeCAD</a>, <a href="../index.php?title=Donate/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Donate/ro (page does not exist)">Donate</a></li></ul>
<hr>
<ul><li><b>Help:</b> <a href="../ro/Tutorials.html" title="Tutorials/ro">Tutorials</a>, <a href="../ro/Video_tutorials.html" title="Video tutorials/ro">Video tutorials</a></li>
<li><b><a href="../ro/Workbenches.html" title="Workbenches/ro">Workbenches</a>:</b> <a href="../ro/Std_Base.html" title="Std Base/ro">Std Base</a>, <a href="../index.php?title=Assembly_Workbench/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Assembly Workbench/ro (page does not exist)">Assembly</a>, <a href="../index.php?title=BIM_Workbench/ro&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Workbench/ro (page does not exist)">BIM</a>, <a href="../ro/CAM_Workbench.html" title="CAM Workbench/ro">CAM</a>, <a href="../ro/Draft_Workbench.html" title="Draft Workbench/ro">Draft</a>, <a href="../ro/FEM_Workbench.html" title="FEM Workbench/ro">FEM</a>, <a href="../ro/Inspection_Workbench.html" title="Inspection Workbench/ro">Inspection</a>, <a href="../index.php?title=Material_Workbench/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Material Workbench/ro (page does not exist)">Material</a>, <a href="../ro/Mesh_Workbench.html" title="Mesh Workbench/ro">Mesh</a>, <a href="../ro/OpenSCAD_Workbench.html" title="OpenSCAD Workbench/ro">OpenSCAD</a>, <a href="../ro/Part_Workbench.html" title="Part Workbench/ro">Part</a>, <a href="../ro/PartDesign_Workbench.html" title="PartDesign Workbench/ro">PartDesign</a>, <a href="../ro/Points_Workbench.html" title="Points Workbench/ro">Points</a>, <a href="../ro/Reverse_Engineering_Workbench.html" title="Reverse Engineering Workbench/ro">Reverse Engineering</a>, <a href="../ro/Robot_Workbench.html" title="Robot Workbench/ro">Robot</a>, <a href="../ro/Sketcher_Workbench.html" title="Sketcher Workbench/ro">Sketcher</a>, <a href="../ro/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/ro">Spreadsheet</a>, <a href="../ro/Surface_Workbench.html" title="Surface Workbench/ro">Surface</a>, <a href="../ro/TechDraw_Workbench.html" title="TechDraw Workbench/ro">TechDraw</a>, <a href="../ro/Testing.html" title="Testing/ro">Test Framework</a></li></ul>
<hr>
<ul><li><b><a href="../index.php?title=Addon/ro&amp;action=edit&amp;redlink=1.html" class="new" title="Addon/ro (page does not exist)">Addons</a>:</b> <a href="../ro/Std_AddonMgr.html" title="Std AddonMgr/ro">Addon Manager</a>, <a href="../ro/External_workbenches.html" title="External workbenches/ro">External workbenches</a>, <a href="../ro/Scripting_and_macros.html" title="Scripting and macros/ro">Scripting and macros</a></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="../ro/User_hub.html" title="User hub/ro">User hub</a>, <a href="../ro/Power_users_hub.html" title="Power users hub/ro">Power users hub</a>, <a href="../ro/Developer_hub.html" title="Developer hub/ro">Developer hub</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20250613120132
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc, no&#8208;toc&#8208;conversion]
CPU time usage: 0.324 seconds
Real time usage: 0.433 seconds
Preprocessor visited node count: 669/1000000
Post&#8208;expand include size: 25048/2097152 bytes
Template argument size: 11756/2097152 bytes
Highest expansion depth: 5/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 2049/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   23.465      1 -total
 34.37%    8.066      1 Template:BIM_Tools_navi/ro
 29.38%    6.895      1 Template:Userdocnavi/ro
 19.70%    4.623      2 Template:Navigation_menu_2
 19.03%    4.465      1 Template:TutorialInfo/ro
  7.65%    1.796      5 Template:Note
  4.84%    1.136      2 Template:Clear
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:100145-0!canonical and timestamp 20250613120132 and revision id 1591309. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>