<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Release notes 0.14/it</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="it" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Release+notes+0.14&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/Release_notes_0.14.html" class="mw-pt-progress mw-pt-progress--complete" title="Versionshinweise 0.14 (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Release_notes_0.14.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Release notes 0.14 (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/Release_notes_0.14.html" class="mw-pt-progress mw-pt-progress--low" title="Notas del lanzamiento 0.14 (1% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/Release_notes_0.14.html" class="mw-pt-progress mw-pt-progress--complete" title="Notes de version 0.14 (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="it" dir="ltr">italiano</span></li>
<li><a href="../pl/Release_notes_0.14.html" class="mw-pt-progress mw-pt-progress--complete" title="Informacje o wydaniu 0.14 (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../cs/Release_notes_0.14.html" class="mw-pt-progress mw-pt-progress--low" title="Release notes 0.14 (1% translated)" lang="cs" dir="ltr">&#269;e&scaron;tina</a></li>
<li><a href="../ru/Release_notes_0.14.html" class="mw-pt-progress mw-pt-progress--low" title="&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1103; &#1082; &#1074;&#1099;&#1087;&#1091;&#1089;&#1082;&#1091; 0.14 (1% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li></ul></div>
<p>FreeCAD 0.14 &egrave; stato rilasciato il 1 Luglio 2014. Questo &egrave; un riassunto dei cambiamenti pi&ugrave; interessanti. L'elenco completo delle modifiche &egrave; disponibile in <a rel="nofollow" class="external text" href="http://www.freecad.org/tracker/changelog_page.php">Mantis changelog</a>. Versioni precedenti in: <a href="../it/Release_notes_0.13.html" title="Release notes 0.13/it">0.13</a> - <a href="../it/Release_notes_0.12.html" title="Release notes 0.12/it">0.12</a> - <a href="../it/Release_notes_0.11.html" title="Release notes 0.11/it">0.11</a>
</p><p><span typeof="mw:File"><a href="../index.php?title=Freecad_jeep.png&amp;filetimestamp=20140213174108&amp;.html" class="mw-file-description"><img src="../File/Freecad_jeep.png" decoding="async" width="1024" height="618" class="mw-file-element" data-file-width="1280" data-file-height="772"></a></span>
</p>
<center>Jeep modellata da Psicofil</center>
<p><span id="General"></span>
</p>
<meta property="mw:PageProp/toc">
<h2><span class="mw-headline" id="Aspetti_generali">Aspetti generali</span></h2>
<p><span id="Site_migration"></span>
</p>
<h3><span class="mw-headline" id="Migrazione_del_sito">Migrazione del sito</span></h3>
<p>Abbiamo finalmente spostato tutte le applicazioni web di FreeCAD da <a rel="nofollow" class="external text" href="http://www.sourceforge.net">SourceForge</a> al nostro <a rel="nofollow" class="external text" href="http://www.freecad.org">own domain</a>. La nuova homepage di FreeCAD si trova all'indirizzo <a rel="nofollow" class="external free" href="http://www.freecad.org">http://www.freecad.org</a>, il wiki ora &egrave; a <a rel="nofollow" class="external free" href="http://www.freecad.org/wiki">http://www.freecad.org/wiki</a>, il bug and features tracker a <a rel="nofollow" class="external free" href="http://www.freecad.org/tracker">http://www.freecad.org/tracker</a>, e il forum a <a rel="nofollow" class="external free" href="http://forum.freecad.org">http://forum.freecad.org</a>. Se avevate un account per una di queste applicazioni quando eravamo su SourceForge, &egrave; possibile recuperarlo seguendo queste <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?f=8&amp;t=4942">istruzioni</a>.
</p><p>L'unica parte di FreeCAD che rimane in SourceForge &egrave; il repository git principale, allo stesso indirizzo: <a rel="nofollow" class="external free" href="http://sourceforge.net/p/free-cad/code/ci/master/tree/">http://sourceforge.net/p/free-cad/code/ci/master/tree/</a> ma tale codice &egrave; anche riflesso automaticamente su GitHub, all'indirizzo <a rel="nofollow" class="external free" href="http://github.com/FreeCAD/FreeCAD_sf_master">http://github.com/FreeCAD/FreeCAD_sf_master</a>
</p><p>Se non conosci ancora l'incredibile comunit&agrave; FreeCAD, facci visita sul forum, e sarai stupito dal suo talento, energia e disponibilit&agrave;.
</p><p><span id="Move_to_pyside,_FreeCAD_is_now_fully_LGPL"></span>
</p>
<h3><span id="Passato_a_PySide.2C_FreeCAD_.C3.A8_ora_pienamente_LGPL"></span><span class="mw-headline" id="Passato_a_PySide,_FreeCAD_&egrave;_ora_pienamente_LGPL">Passato a PySide, FreeCAD &egrave; ora pienamente LGPL</span></h3>
<p>Date le molte complicazioni causate dal modello a doppia licenza di FreeCAD (LGPL &amp; GPL), alcuni dei componenti di FreeCAD (cio&egrave; il kernel OpenCasCade) incompatibili con il codice GPL, abbiamo deciso di convertire tutte le restanti parti di codice GPL di FreeCAD in LGPL. Come risultato di questa operazione, <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/PyQt">PyQt</a> non pi&ugrave; usato, ed &egrave; sostituito da <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/PySide">PySide</a>. Non ci sono grosse conseguenze per gli autori di script python, PyQt pu&ograve; ancora essere utilizzato all'interno FreeCAD.
</p><p>Dopo che abbiamo completato il passaggio a LGPL, anche  OpenCascade &egrave; <a rel="nofollow" class="external text" href="http://www.opencascade.org/getocc/license/">passata a LGPL</a>, cosa che avrebbe anche risolto tutti i nostri conflitti licenza. Ma ora abbiamo un modello di licenza molto pi&ugrave; chiaro e unitario, che dovrebbe soddisfare tutte le distribuzioni linux pi&ugrave; severe.
</p><p><span id="Plugins_and_side_projects:_Parts_library,_BOLTS,_Eagle_importer"></span>
</p>
<h3><span id="Plugins_e_progetti_collaterali:_Parts_library.2C_BOLTS.2C_importatore_Eagle"></span><span class="mw-headline" id="Plugins_e_progetti_collaterali:_Parts_library,_BOLTS,_importatore_Eagle">Plugins e progetti collaterali: Parts library, BOLTS, importatore Eagle</span></h3>
<p>L'ultimo anno ha visto emergere alcuni progetti collaterali interessanti a fianco di FreeCAD. &Egrave; stato avviato dalla comunit&agrave; e sta lentamente crescendo una <a rel="nofollow" class="external text" href="http://github.com/yorikvanhavre/FreeCAD-library">Parts library</a> costituita da un insieme di parti riutilizzabili da aggiungere ai propri  modelli FreeCAD. Pu&ograve; essere avviata e utilizzata dall'interno di FreeCAD con l'uso di una macro.
</p><p>Un altro progetto simile, ma pi&ugrave; ambizioso &egrave; <a rel="nofollow" class="external text" href="http://bolts-library.org/">BOLTS</a>, che &egrave; anche una libreria di parti, ma costruite con script parametrici, in grado di produrre una grande variet&agrave; di parti parametriche. BOLTS, anche se applicazione indipendente, pu&ograve; anche essere eseguito da FreeCAD avviando una macro. L'immagine sottostante mostra BOLTS in esecuzione all'interno FreeCAD.
</p><p><span typeof="mw:File"><a href="../index.php?title=Freecad-bearing.png&amp;filetimestamp=20131108132832&amp;.html" class="mw-file-description"><img src="../File/Freecad-bearing.png" decoding="async" width="1024" height="563" class="mw-file-element" data-file-width="1920" data-file-height="1055"></a></span>
</p><p>Un altro progetto esterno interessante &egrave; <a rel="nofollow" class="external text" href="http://sourceforge.net/projects/eaglepcb2freecad/">EAGLE importer</a>, che permette di importare in FreeCAD progetti di schede PCB realizzati da diverse applicazioni.
</p><p><span id="WebGL_export"></span>
</p>
<h3><span class="mw-headline" id="Esportazione_WebGL">Esportazione WebGL</span></h3>
<p>Ora, da FreeCAD, &egrave; possibile esportare la scena come un file <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/WebGL">WebGL</a>-abilitato html. Questo file include un visualizzatore embedded <a rel="nofollow" class="external text" href="http://threejs.org/">three.js</a>-based che consente di ispezionare la scena dal web senza alcun plugin, purch&eacute; lo si visualizzi con un browser WebGL-compatibile.
</p><p><span id="Units_system"></span>
</p>
<h3><span id="Sistema_di_unit.C3.A0_di_misura"></span><span class="mw-headline" id="Sistema_di_unit&agrave;_di_misura">Sistema di unit&agrave; di misura</span></h3>
<p>Infine, &egrave; stato implementato un sistema di <a href="../it/Units.html" title="Units/it">unit&agrave; di misura</a> a livello di FreeCAD, quindi a disposizione di tutti i moduli. Ora &egrave; possibile scegliere uno schema unit&agrave; dalle preferenze. Gli schemi attualmente disponibili includono millimetri, metri e misure imperiali, ma a breve dovrebbe diventare disponibile molto altro. Una volta che lo schema &egrave; impostato, la maggior parte delle propriet&agrave; e gli strumenti di FreeCAD utilizzano di preferenza questa unit&agrave;. Ma il sistema &egrave; molto flessibile, e nella maggior parte dei casi, si possono mescolare le unit&agrave; quanto si vuole, per esempio dando misure in pollici in un set di documenti in millimetri.
</p>
<h3><span class="mw-headline" id="Style_Sheets">Style Sheets</span></h3>
<p>FreeCAD 0.14 diventa ancora pi&ugrave; personalizzabile con l'aggiunta di <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?f=8&amp;t=4700&amp;start=30">Style Sheets</a> utilizzato per controllare l'immagine di sfondo nella finestra principale. L'utente non &egrave; pi&ugrave; vincolato allo sfondo di pietra grigia. Quasi ogni tipo di immagine, o disegno personalizzato possono essere utilizzati per riempire lo sfondo della finestra principale di FreeCAD.
</p><p><span typeof="mw:File"><a href="../index.php?title=Style_Sheets.png&amp;filetimestamp=20140214213519&amp;.html" class="mw-file-description"><img src="../File/Style_Sheets.png" decoding="async" width="1024" height="576" class="mw-file-element" data-file-width="1600" data-file-height="900"></a></span>
</p><p><span id="Display_style_override"></span>
</p>
<h3><span class="mw-headline" id="Stile_di_visualizzazione">Stile di visualizzazione</span></h3>
<p>La barra predefinita degli strumenti Vista &egrave; stato ampliato con un paio di nuovi pulsanti per commutare facilmente la visualizzazione di tutta la vista tra la modalit&agrave; 3D wireframe, ombreggiata o linee.
</p><p><span id="3D_window_anti-aliasing"></span>
</p>
<h3><span class="mw-headline" id="Finestra_3D_anti-aliasing">Finestra 3D anti-aliasing</span></h3>
<p>Nuove opzioni anti-aliasing, che si possono trovare nelle preferenze, sono state aggiunte al sistema vista 3D di FreeCAD. Se avete un buon chip grafico 3D, ora &egrave; possibile apprezzare FreeCAD con una elevata qualit&agrave; anti-aliasing.
</p>
<h2><span class="mw-headline" id="Part">Part</span></h2>
<p><span id="Loft_and_Sweep"></span>
</p>
<h3><span class="mw-headline" id="Loft_e_Sweep">Loft e Sweep</span></h3>
<p>Gli strumenti <a href="../it/Part_Loft.html" title="Part Loft/it">Part Loft</a> e <a href="../it/Part_Sweep.html" title="Part Sweep/it">Part Sweep</a> &egrave; sono stati migliorati e ora &egrave; possibile utilizzare gli oggetti Draft come profili.
</p>
<h3><span class="mw-headline" id="Offset">Offset</span></h3>
<p>Il nuovo strumento <a href="../it/Part_Offset.html" title="Part Offset/it">Part Offset</a> crea copie di una forma selezionata ad una determinata distanza dalla forma base.
</p><p><span id="Thickness"></span>
</p>
<h3><span class="mw-headline" id="Spessore">Spessore</span></h3>
<p>Ora &egrave; disponibile un nuovo strumento <a href="../it/Part_Thickness.html" title="Part Thickness/it">Part Thickness</a>. Questo strumento funziona su una forma solida, e la trasforma in un oggetto cavo, dando a ciascuna delle sue facce un dato spessore.
</p>
<h3><span class="mw-headline" id="Make_Compound">Make Compound</span></h3>
<p>L'ambiente <a href="../it/Part_Workbench.html" title="Part Workbench/it">Part</a> ora fornisce uno strumento <a href="../index.php?title=Part%CC%9E_Compound/it&amp;action=edit&amp;redlink=1.html" class="new" title="Part&#798; Compound/it (page does not exist)">Crea un composto</a>, che consente di creare rapidamente un oggetto composto da un insieme di forme selezionate.
</p><p><span id="Part_Primitives"></span>
</p>
<h3><span class="mw-headline" id="Primitive_Part">Primitive Part</span></h3>
<p>Nuove Part primitive sono state aggiunte allo strumento <a href="../it/Part_CreatePrimitives.html" class="mw-redirect" title="Part CreatePrimitives/it">Crea primitive</a>: Prismi, poligoni regolari e spirali ora sono facili da creare compilando un paio di parametri. Inoltre, alcuni strumenti del modulo <a href="../it/Draft_Workbench.html" title="Draft Workbench/it">Draft</a> ora possono usufruire di questa funzione e creare anche queste primitive, invece del loro regolare oggetto Draft, se l'opzione corrispondente &egrave; impostata nelle impostazioni delle preferenze Draft.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Part_Create_Primitives1.jpeg&amp;filetimestamp=20140212125446&amp;.html" class="mw-file-description"><img src="../File/Part_Create_Primitives1.jpeg" decoding="async" width="428" height="467" class="mw-file-element" data-file-width="428" data-file-height="467"></a></span>
</p><p><span id="Measure_tools"></span>
</p>
<h3><span class="mw-headline" id="Strumenti_Misura">Strumenti Misura</span></h3>
<p>Un nuovo set di strumenti di misura &egrave; stato aggiunto a <a href="../it/Part_Workbench.html" title="Part Workbench/it">Part</a>. Con questi, &egrave; possibile selezionare due elementi di una forma (vertici, spigoli o facce), e visualizzare la loro distanza in distanza assoluta, e lungo assi X e Y.
</p>
<h2><span id="PartDesign_.26_Sketcher"></span><span class="mw-headline" id="PartDesign_&amp;_Sketcher">PartDesign &amp; Sketcher</span></h2>
<h3><span class="mw-headline" id="Validate_sketch">Validate sketch</span></h3>
<p>Ora l'ambiente <a href="../it/Sketcher_Workbench.html" title="Sketcher Workbench/it">Sketcher</a> dispone del nuovo strumento <a href="../it/Sketcher_ValidateSketch.html" title="Sketcher ValidateSketch/it">Convalida lo schizzo</a> per aiutarvi a convalidare uno schizzo, trovando vincoli mancanti o ridondanti. Si pu&ograve; anche aggiungere automaticamente alcuni vincoli mancanti, al fine di rendere lo schizzo completamente vincolato.
</p>
<h3><span class="mw-headline" id="Gear_generator">Gear generator</span></h3>
<p>Uno strumento <a href="../it/PartDesign_InvoluteGear.html" title="PartDesign InvoluteGear/it">involute gear generator</a> &egrave; stato aggiunto all'ambiente <a href="../it/PartDesign_Workbench.html" title="PartDesign Workbench/it">PartDesign</a>, per creare rapidamente gli ingranaggi da parametri.
</p>
<h2><span class="mw-headline" id="Drawing">Drawing</span></h2>
<p><span id="Automatic_projections"></span>
</p>
<h3><span class="mw-headline" id="Proiezioni_automatiche">Proiezioni automatiche</span></h3>
<p>L'ambiente Drawing continua ad essere migliorato con alcune nuove interessanti funzionalit&agrave;. Proiezioni ortogonali ora permette di visualizzare tutte le viste, nonch&eacute; un maggiore controllo sulle singole viste. Un'altra caratteristica fondamentale, Drawing Templates ora pu&ograve; contenere i dati che definiscono la posizione di Bordo e Cartiglio il che limita automaticamente le proiezioni all'interno del Bordo, e allo stesso tempo evita automaticamente di inserirle nello spazio occupato dal cartiglio. 
</p><p><span typeof="mw:File"><a href="../index.php?title=DrawingWB.png&amp;filetimestamp=20140217184143&amp;.html" class="mw-file-description"><img src="../File/DrawingWB.png" decoding="async" width="1024" height="576" class="mw-file-element" data-file-width="1600" data-file-height="900"></a></span>
</p><p><span id="Symbols"></span>
</p>
<h3><span class="mw-headline" id="Simboli">Simboli</span></h3>
<p>Nell'ambiente <a href="../it/Drawing_Workbench.html" title="Drawing Workbench/it">Drawing</a> &egrave; disponibile un nuovo strumento <a href="../it/Drawing_Symbol.html" title="Drawing Symbol/it">Simbolo</a>  consentendo di inserire rapidamente oggetti SVG sul foglio da disegno. Questi oggetti vengono memorizzati nel file di FreeCAD, quindi non c'&egrave; bisogno di inviare il file in formato SVG originale quando si distribuiscono dei file.
</p>
<h2><span class="mw-headline" id="Raytracing">Raytracing</span></h2>
<p><span id="New_rendering_tools"></span>
</p>
<h3><span class="mw-headline" id="Nuovi_strumenti_di_rendering">Nuovi strumenti di rendering</span></h3>
<p><span typeof="mw:File"><a href="../index.php?title=Raytracing_example.jpg&amp;filetimestamp=20131002160611&amp;.html" class="mw-file-description"><img src="../File/Raytracing_example.jpg" decoding="async" width="1024" height="574" class="mw-file-element" data-file-width="1836" data-file-height="1030"></a></span>
</p><p>Anche l'ambiente <a href="../it/Raytracing_Workbench.html" title="Raytracing Workbench/it">Raytracing</a> ha ricevuto qualche attenzione, e la sua barra degli strumenti &egrave; stata rielaborata. I "vecchi" pulsanti che producevano manualmente i file Povray parziali sono stati rimossi (sono ancora presenti nel menu Raytracing), e ora si pu&ograve; produrre un rendering pi&ugrave; o meno allo stesso modo come si usa l'ambiente <a href="../it/Drawing_Workbench.html" title="Drawing Workbench/it">Drawing</a>: Si crea un nuovo progetto, si assegna ad esso un modello, poi lo si riempie con la vista degli oggetti. Quando si ha finito, basta premere il pulsante di rendering, o esportarlo in un file pronto per il rendering esterno a FreeCAD.
</p><p>Inoltre, il sistema di <a href="../Raytracing_Workbench.html#Templates/it" title="Raytracing Workbench">modelli Raytracing</a> &egrave; stato esteso, e i modelli ora sono pi&ugrave; facili da manipolare e creare.
</p><p>Gli script .pov prodotti da FreeCAD ora contengono il rapporto di auto-aspetto. Gli utenti non devono pi&ugrave; mantenere un rapporto di aspetto 4:3 nelle impostazioni Raytracing o modificare manualmente l'uscita e cambiare i rapporti, per ottenere un corretto rendering. Ora possono essere inseriti qualsiasi larghezza e altezza senza timore che gli oggetti vengano restituiti schiacciati o allungati.
</p><p><span id="Luxrender_support"></span>
</p>
<h3><span class="mw-headline" id="Supporto_Luxrender">Supporto Luxrender</span></h3>
<p>Insieme al supporto esistente per <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/POV-Ray">POV-Ray</a>, il modulo <a href="../it/Raytracing_Workbench.html" title="Raytracing Workbench/it">Raytracing</a> ora supporta anche <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/LuxRender">LuxRender</a>. Se POV-Ray &egrave; un  <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Ray_tracing_%28graphics%29">classical-style raytracer</a>, che spara raggi dalla telecamera per trovare il colore di ogni pixel dell'immagine, Luxrender invece &egrave; un  <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Unbiased_rendering">unbiased renderer</a>, che richiede molto pi&ugrave; tempo per rendere le scene, ma &egrave; in grado di produrre una illuminazione molto pi&ugrave; realistica.
</p><p><span id="Spreadsheet"></span>
</p>
<h2><span class="mw-headline" id="Foglio_di_calcolo">Foglio di calcolo</span></h2>
<p>In FreeCAD &egrave; stato aggiunto un nuovo <a href="../it/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/it">ambiente Spreadsheet</a>. Esso consente di creare un oggetto <a href="../it/Spreadsheet_Create.html" class="mw-redirect" title="Spreadsheet Create/it">foglio di calcolo</a>, che contiene dati in un foglio bidimensionale. Dispone inoltre di un editor in modo da poter modificare il contenuto del foglio di calcolo (sono supportati testi, numeri e alcune formule di base), e uno speciale oggetto <a href="../it/Spreadsheet_Controller.html" class="mw-redirect" title="Spreadsheet Controller/it">cell controller</a>, che pu&ograve; eseguire la scansione del documento per certi tipi di oggetti, estrarre da essi una certa propriet&agrave;, e compilare un determinato intervallo di celle con questi valori.
</p><p><span typeof="mw:File"><a href="../index.php?title=Arch_tutorial_53.jpg&amp;filetimestamp=20140310001644&amp;.html" class="mw-file-description"><img src="../File/Arch_tutorial_53.jpg" decoding="async" width="1024" height="690" class="mw-file-element" data-file-width="1024" data-file-height="690"></a></span>
</p>
<h2><span class="mw-headline" id="Draft">Draft</span></h2>
<p><span id="DWG_import/export"></span>
</p>
<h3><span class="mw-headline" id="Importare_e_esportare_DWG">Importare e esportare DWG</span></h3>
<p>Ora FreeCAD &egrave; in grado di importare ed esportare verso il <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/.dwg">formato DWG</a>, grazie al multipiattaforma free <a rel="nofollow" class="external text" href="https://www.opendesign.com/guestfilesoda_file_converter">ODA File Converter</a>. Quando questo &egrave; installato, e il suo percorso &egrave; impostato nelle preferenze di Draft, FreeCAD &egrave; in grado di usarlo per importare ed esportare file DWG, convertendoli in dxf, quindi utilizzando l'importatore ed esportatore dxf di Draft. L'importazione e l'esportazione dei file DWG ha quindi le stesse limitazioni del <a href="../it/Draft_DXF.html" title="Draft DXF/it">formato dxf</a>.
</p><p><span id="Draft_to_Drawing_works_with_groups"></span>
</p>
<h3><span class="mw-headline" id="Lavorare_con_i_gruppi_da_Draft_verso_Drawing">Lavorare con i gruppi da Draft verso Drawing</span></h3>
<p>Lo strumento <a href="../it/Draft_Drawing.html" title="Draft Drawing/it">Draft to Drawing</a>, utilizzato per posizionare oggetti di Draft in un foglio di disegno <a href="../it/Drawing_Workbench.html" title="Drawing Workbench/it">Drawing</a>, ora pu&ograve; essere applicato ai gruppi, e permette di creare un numero inferiore di Viste di oggetti nel foglio di disegno. Combinando in modo razionale gli oggetti Draft in gruppi, si dispone di un modo rapido per controllare l'aspetto di molti oggetti nella pagina.
</p><p><span id="Dimensions_recoded"></span>
</p>
<h3><span class="mw-headline" id="Dimensioni_ricodificate">Dimensioni ricodificate</span></h3>
<p>Lo strumento <a href="../it/Draft_Dimension.html" title="Draft Dimension/it">Dimensioni</a> &egrave; stato completamente ricodificato, e gli oggetti Dimensione ora si comportano molto meglio, hanno acquisito alcune nuove propriet&agrave;, come frecce pi&ugrave; belle e scalabili, un maggiore controllo sulla posizione del testo e sulla direzione della dimensione , e soprattutto un migliore supporto per l'ambiente <a href="../it/Drawing_Workbench.html" title="Drawing Workbench/it">Drawing</a>. Ora &egrave; possibile inserire le dimensioni in qualsiasi piano dello spazio 3D, e ottenere risultati corretti quando si metteno su un foglio di disegno con lo strumento <a href="../it/Draft_Drawing.html" title="Draft Drawing/it">Drawing</a>.
</p><p><span typeof="mw:File"><a href="../index.php?title=Draft_dimensions_recode.jpg&amp;filetimestamp=20140212195754&amp;.html" class="mw-file-description"><img src="../File/Draft_dimensions_recode.jpg" decoding="async" width="1024" height="538" class="mw-file-element" data-file-width="1740" data-file-height="915"></a></span>
</p><p><span id="Hatches"></span>
</p>
<h3><span class="mw-headline" id="Tratteggio">Tratteggio</span></h3>
<p>L'ambiente <a href="../it/Draft_Workbench.html" title="Draft Workbench/it">Draft</a> dispone anche di un nuovo "giocattolo": tratteggio. Sul specifici oggetti Draft (quelli che formano una forma chiusa come polilinee chiuse, rettangoli, poligoni regolari o cerchi), ora &egrave; possibile applicare un tratteggio. Attualmente, sono disponibili di default solo un paio di modelli di tratteggio, ma poich&eacute; tali modelli sono molto facili da creare (sono semplici file SVG), e possono gi&agrave; essere aggiunti dall'utente dei modelli personalizzati, la collezione di default potrebbe crescere rapidamente. Gli oggetti Draft con i riempimenti sono anche supportati fedelmente dall'ambiente <a href="../it/Drawing_Workbench.html" title="Drawing Workbench/it">Drawing</a>.
</p><p><span typeof="mw:File"><a href="../index.php?title=Draft_hatches.jpg&amp;filetimestamp=20140212195816&amp;.html" class="mw-file-description"><img src="../File/Draft_hatches.jpg" decoding="async" width="1024" height="537" class="mw-file-element" data-file-width="1730" data-file-height="908"></a></span>
</p><p><span id="Ellipses"></span>
</p>
<h3><span class="mw-headline" id="Ellissi">Ellissi</span></h3>
<p>&Egrave; stato aggiunto il supporto per le <a href="../it/Draft_Ellipse.html" title="Draft Ellipse/it">ellissi</a>, l'ambiente Draft ora permette di disegnare ellissi complete o porzioni di ellissi.
</p><p><span id="Chamfer"></span>
</p>
<h3><span class="mw-headline" id="Smussi">Smussi</span></h3>
<p>Allo stesso modo dei raccordi, che erano apparsi nella <a href="../it/Release_notes_0.13.html" title="Release notes 0.13/it">versione 0.13</a>, ora i rettangoli, contorni e poligoni di Draft hanno una propriet&agrave; smusso, che smussa i loro angolo. Lo smusso viene applicato prima del raccordo, e entrambe le propriet&agrave; possono essere utilizzate insieme, questo consente di trasformare rapidamente un contorno molto semplice in un oggetto complesso fatto di molte sezioni.
</p><p><span id="Upgrade_and_downgrade_recoded"></span>
</p>
<h3><span class="mw-headline" id="Upgrade_e_Downgrade_ricodificati">Upgrade e Downgrade ricodificati</span></h3>
<p>Gli strumenti <a href="../it/Draft_Upgrade.html" title="Draft Upgrade/it">Upgrade</a> e <a href="../it/Draft_Downgrade.html" title="Draft Downgrade/it">Downgrade</a>, prima ermetici pezzi di magia, di cui non si era mai troppo sicuri di quello che sarebbe stato il risultato, sono stati ricodificati, e ora appare un messaggio molto pi&ugrave; amichevole che informa su quanto &egrave; stato fatto e perch&eacute;. Ora sono disponibili anche per gli scripting Python, non solo il blocco, ma anche le loro singole operazioni interne, in modo da poter ordinare con precisione un determinato tipo di Upgrade da eseguire.
</p>
<h3><span class="mw-headline" id="Facebinder">Facebinder</span></h3>
<p>&Egrave; stato aggiunto un nuovo strumento <a href="../it/Draft_Facebinder.html" title="Draft Facebinder/it">Facebinder</a>, che fa un'operazione molto semplice, ma potenzialmente molto utile: Riunisce qualsiasi quantit&agrave; di facce selezionate da diversi oggetti, e le usa per creare un nuovo oggetto. Il nuovo oggetto mantiene i collegamenti agli oggetti originali, in modo che qualsiasi successiva loro modifica viene riflessa nell'oggetto facebinder. Questo dovrebbe essere utile soprattutto per gli oggetti <a href="../it/Arch_Workbench.html" title="Arch Workbench/it">architettura</a>, dove ora &egrave; possibile creare nuovi oggetti dalle facce di diversi altri oggetti.
</p>
<h3><span class="mw-headline" id="Shape_strings">Shape strings</span></h3>
<p>Lo strumento <a href="../it/Draft_ShapeString.html" title="Draft ShapeString/it">ShapeString</a> crea oggetti planari da un testo e un tipo di carattere TrueType. Questi oggetti, a differenza delle comuni annotazioni come sono i <a href="../it/Draft_Text.html" title="Draft Text/it">Testi</a>, sono oggetti 3D reali, possono essere estrusi, e quindi possono essere usati per creare incisioni o altri tipi di oggetti 3D con il testo in rilievo.
</p><p><span id="Bezier_Curves"></span>
</p>
<h3><span class="mw-headline" id="Curve_di_Bezier">Curve di Bezier</span></h3>
<p>Accanto alle curve <a href="../it/Draft_Arc.html" title="Draft Arc/it">arco di circonferenza</a> e <a href="../it/Draft_BSpline.html" title="Draft BSpline/it">B-spline</a> gi&agrave; esistenti, nell'ambiente Draft ne &egrave; stata inserita una nuova: la <a href="../it/Draft_BezCurve.html" title="Draft BezCurve/it">curva di Bezier</a>. Pu&ograve; essere creata cliccando dei punti, allo stesso modo di altri oggetti Draft, ma poi si pu&ograve; <a href="../it/Draft_Edit.html" title="Draft Edit/it">editare</a> e modificare i suoi punti di ancoraggio, controllare con precisione la forma della curva.
</p>
<h2><span class="mw-headline" id="Arch">Arch</span></h2>
<p><span id="Structure_presets_+_profiles"></span>
</p>
<h3><span class="mw-headline" id="Struttura_Preset_e_profili">Struttura Preset e profili</span></h3>
<p>Lo strumento <a href="../it/Arch_Structure.html" title="Arch Structure/it">Struttura</a> ha avuto diversi miglioramenti: ora &egrave; dotato di caratteristiche predefinite che consentono di creare rapidamente una trave o una colonna sulla base di un profilo standard di tipo INP o HEB, e di un sistema di posizionamento pi&ugrave; facile, con una speciale modalit&agrave; di <a href="../it/Draft_Snap.html" title="Draft Snap/it">aggancio</a>. Ora &egrave; anche possibile assegnare agli elementi strutturali un percorso di estrusione, quindi sono diventate possibili delle configurazioni molto avanzate. Alcuni dei pezzi offerti da  <a href="#Plugins_and_side_projects:_Parts_library.2C_BOLTS.2C_Eagle_importer">BOLTS</a> possono anche essere creati direttamente come elementi strutturali Arch.
</p><p><span id="Window_presets"></span>
</p>
<h3><span class="mw-headline" id="Finestre_predefinite">Finestre predefinite</span></h3>
<p>Anche allo strumento <a href="../it/Arch_Window.html" title="Arch Window/it">Finestra</a> &egrave; stato aggiunto un sistema di finestre predefinite. Anche se ancora basate su schizzi, cosa che assicura la massima flessibilit&agrave; (praticamente si pu&ograve; creare facilmente qualsiasi tipo di finestra), ora si possono costruire nuove finestre partendo da una serie predefinita. Basta scegliere un preset, inserire alcuni parametri, e posizionare la finestra in un muro esistente o in un elemento strutturale, se lo si desidera. A livello inferiore, verr&agrave; creato lo schizzo appropriato, che &egrave; modificabile in qualsiasi momento.
</p><p><span typeof="mw:File"><a href="../index.php?title=Screenshot_arch_window.jpg&amp;filetimestamp=20140222145537&amp;.html" class="mw-file-description"><img src="../File/Screenshot_arch_window.jpg" decoding="async" width="1024" height="634" class="mw-file-element" data-file-width="1024" data-file-height="634"></a></span>
</p><p><span id="Spaces"></span>
</p>
<h3><span class="mw-headline" id="Spazio">Spazio</span></h3>
<p>Ora &egrave; disponibile un nuovo oggetto <a href="../it/Arch_Space.html" title="Arch Space/it">Spazio</a> che consente di costruire, marcare e calcolare spazi ed aree del pavimento. Questi oggetti spazio comprendono sempre un volume solido, in modo da poter sempre conoscere il loro volume e superficie. Essi possono essere costruiti da una forma solida, o dalla serie delle facce di contorno.
</p><p><span id="Multilayer_walls"></span>
</p>
<h3><span class="mw-headline" id="Muri_multistrato">Muri multistrato</span></h3>
<p>Ora i <a href="../it/Arch_Wall.html" title="Arch Wall/it">Muri</a> possono essere multistrato con un trucco molto semplice: pi&ugrave; pareti possono essere basate su una stessa linea di base, specificando una distanza di spostamento dalla linea di base. Questo, combinato ad esempio con <a href="../it/Arch_Frame.html" title="Arch Frame/it">Carpenteria</a>, consente di realizzare complesse strutture di pareti, o pareti con strati isolamenti. Inoltre, questi muri sono consapevoli dei loro "muri fratelli" (le altre pareti basati sulla stessa linea di base), e qualsiasi finestra posta su una di queste pareti anche creare una apertura nei suoi fratelli.
</p><p><span typeof="mw:File"><a href="../index.php?title=Screenshot_arch_multiwall.jpg&amp;filetimestamp=20140222145331&amp;.html" class="mw-file-description"><img src="../File/Screenshot_arch_multiwall.jpg" decoding="async" width="1024" height="631" class="mw-file-element" data-file-width="1024" data-file-height="631"></a></span>
</p><p><span id="Stairs"></span>
</p>
<h3><span class="mw-headline" id="Scale">Scale</span></h3>
<p>&Egrave; stato aggiunto anche un nuovo strumento <a href="../it/Arch_Stairs.html" title="Arch Stairs/it">Scala</a>, che permette di costruire le scale complesse impostando alcuni parametri. Attualmente sono disponibili solo scale dritte, ma la lista crescer&agrave; nel tempo. Queste scale hanno molti parametri di configurazione, quali le dimensioni dello scalino, l'alzata, o il tipo di struttura.
</p><p><span id="Reinforcing_bars"></span>
</p>
<h3><span class="mw-headline" id="Armature">Armature</span></h3>
<p>Con lo strumento <a href="../it/Arch_Rebar.html" title="Arch Rebar/it">Armature</a> sono stati introdotti i rinforzi. Anche essi si basano anche sugli schizzi, per garantire grande flessibilit&agrave;. Essi sono creati essenzialmente disegnando la sagoma delle barre sulle facce appropriate degli <a href="../it/Arch_Structure.html" title="Arch Structure/it">elementi strutturali</a>, poi convertendo le sagome in armature reali. 
</p><p><span typeof="mw:File"><a href="../index.php?title=Screenshot_arch_rebar.jpg&amp;filetimestamp=20140222145407&amp;.html" class="mw-file-description"><img src="../File/Screenshot_arch_rebar.jpg" decoding="async" width="1024" height="631" class="mw-file-element" data-file-width="1024" data-file-height="631"></a></span>
</p><p><span id="Frames"></span>
</p>
<h3><span class="mw-headline" id="Carpenteria">Carpenteria</span></h3>
<p>I sistemi carpenteria sono utilizzati ovunque in architettura: cancello, sistemi strutturali, telaio dei muri, ecc. Il nuovo strumento <a href="../it/Arch_Frame.html" title="Arch Frame/it">Carpenteria</a> (Frame) permette di creare facilmente tutti i tipi di telai, combinando un oggetto profilo, che pu&ograve; essere qualsiasi forma piatta estrudibile, quale un rettangolo o un cerchio, e un oggetto percorso, che definisce le linee della estrusione a cui gli elementi dell'oggetto profilo sono sottoposti. I percorsi sono tipicamente disegnati con l'ambiente <a href="../it/Sketcher_Workbench.html" title="Sketcher Workbench/it">Sketcher</a>. Questi oggetti Carpenteria possono poi essere trasformati in pareti o strutture, se necessario.
</p><p><span id="Survey"></span>
</p>
<h3><span class="mw-headline" id="Ispeziona">Ispeziona</span></h3>
<p>Ora nell'ambiente Arch &egrave; disponibile un altro strumento semplice, ma utile: la modalit&agrave; <a href="../it/Arch_Survey.html" title="Arch Survey/it">Ispeziona</a>. In questa modalit&agrave;, quando si clicca su vertici, spigoli, facce o oggetti interi, si ottiene la loro altezza, lunghezza, area o volume. Queste informazioni sono visualizzate sul modello, ma sono anche copiate negli appunti, e raccolte come testo, quindi &egrave; facile incollale in altre applicazioni, fornendo un flusso di lavoro piuttosto veloce per definire le fatture.
</p>
<h3><span class="mw-headline" id="Tutorial">Tutorial</span></h3>
<p>Un nuovo <a href="../it/Arch_tutorial.html" title="Arch tutorial/it">tutorial</a> di 35 pagine descrive l'ambiente Arch in tutti i suoi dettagli, proponendo un esercizio completo.
</p><p><span id="IFC_import_&amp;_export"></span>
</p>
<h3><span class="mw-headline" id="Importare_e_esportare_file_IFC">Importare e esportare file IFC</span></h3>
<p>&Egrave; stato fatto molto lavoro sia su FreeCAD che su  <a rel="nofollow" class="external text" href="http://www.ifcopenshell.org">IfcOpenShell</a>, che &egrave; la parte di software responsabile della gestione dei file IFC nell'ambiente Arch. Quando si utilizza una <a rel="nofollow" class="external text" href="http://github.com/aothms/IfcOpenShell">versione di sviluppo</a> di IfcOpenShell, oltre a uno spettacolare incremento di velocit&agrave; durante l'importazione di un file IFC medio (circa 50Mb), FreeCAD &egrave; anche in grado di esportare i modelli in formato IFC. Il supporto all'esportazione &egrave; ancora nelle prime fasi di sviluppo, ma riesce gi&agrave; a esportare i file in modo leggibile senza errori dalla maggior parte delle principali applicazioni che supportano IFC.
</p><p><span id="Full_list"></span>
</p>
<h2><span class="mw-headline" id="Lista_completa">Lista completa</span></h2>
<p>L'elenco completo delle correzioni e delle nuove funzionalit&agrave; pu&ograve; essere letto suhttp://freecad.org/tracker/changelog_page.php
</p>
<!-- 
NewPP limit report
Cached time: 20251009171819
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.092 seconds
Real time usage: 0.098 seconds
Preprocessor visited node count: 261/1000000
Post&#8208;expand include size: 9/2097152 bytes
Template argument size: 0/2097152 bytes
Highest expansion depth: 2/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1723/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    0.000      1 -total
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:31203-0!canonical and timestamp 20251009171819 and revision id 1659622. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>