<link href="site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">About FreeCAD</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="en" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="index.php?title=Special;Translate&amp;group=page-About+FreeCAD&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="id/About_FreeCAD.html" class="mw-pt-progress mw-pt-progress--low" title="About FreeCAD/id (7% translated)" lang="id" dir="ltr">Bahasa Indonesia</a></li>
<li><a href="de/About_FreeCAD.html" class="mw-pt-progress mw-pt-progress--complete" title="&Uuml;ber FreeCAD (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><span class="mw-pt-languages-ui mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="en" dir="ltr">English</span></li>
<li><a href="tr/About_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="FreeCAD Hakk&#305;nda (33% translated)" lang="tr" dir="ltr">T&uuml;rk&ccedil;e</a></li>
<li><a href="es/About_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="Acerca de FreeCAD (53% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="fr/About_FreeCAD.html" class="mw-pt-progress mw-pt-progress--complete" title="&Agrave; propos de FreeCAD (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="hr/About_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="O FreeCAD-u (53% translated)" lang="hr" dir="ltr">hrvatski</a></li>
<li><a href="it/About_FreeCAD.html" class="mw-pt-progress mw-pt-progress--complete" title="Informazioni su FreeCAD (100% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="pl/About_FreeCAD.html" class="mw-pt-progress mw-pt-progress--complete" title="Informacje na temat FreeCAD. (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="pt/About_FreeCAD.html" class="mw-pt-progress mw-pt-progress--complete" title="Acerca do FreeCAD (100% translated)" lang="pt" dir="ltr">portugu&ecirc;s</a></li>
<li><a href="pt-br/About_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="Sobre o FreeCAD (67% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="ro/About_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="A propos de FreeCAD (33% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><a href="sk/About_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="O FreeCADe (53% translated)" lang="sk" dir="ltr">sloven&#269;ina</a></li>
<li><a href="sv/About_FreeCAD.html" class="mw-pt-progress mw-pt-progress--low" title="About FreeCAD (13% translated)" lang="sv" dir="ltr">svenska</a></li>
<li><a href="cs/About_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="O FreeCADu (27% translated)" lang="cs" dir="ltr">&#269;e&scaron;tina</a></li>
<li><a href="bg/About_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="&#1047;&#1072; FreeCAD (27% translated)" lang="bg" dir="ltr">&#1073;&#1098;&#1083;&#1075;&#1072;&#1088;&#1089;&#1082;&#1080;</a></li>
<li><a href="ru/About_FreeCAD.html" class="mw-pt-progress mw-pt-progress--complete" title="&#1054; FreeCAD (100% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li>
<li><a href="uk/About_FreeCAD.html" class="mw-pt-progress mw-pt-progress--low" title="About FreeCAD (7% translated)" lang="uk" dir="ltr">&#1091;&#1082;&#1088;&#1072;&#1111;&#1085;&#1089;&#1100;&#1082;&#1072;</a></li>
<li><a href="zh/About_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="&#20851;&#20110;FreeCAD (47% translated)" lang="zh" dir="ltr">&#20013;&#25991;</a></li>
<li><a href="zh-cn/About_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="&#20851;&#20110; FreeCAD (40% translated)" lang="zh-Hans-CN" dir="ltr">&#20013;&#25991;&#65288;&#20013;&#22269;&#22823;&#38470;&#65289;</a></li>
<li><a href="zh-tw/About_FreeCAD.html" class="mw-pt-progress mw-pt-progress--low" title="&#38364;&#26044; FreeCAD (7% translated)" lang="zh-Hant-TW" dir="ltr">&#20013;&#25991;&#65288;&#33274;&#28771;&#65289;</a></li>
<li><a href="ja/About_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="FreeCAD&#12395;&#12388;&#12356;&#12390; (60% translated)" lang="ja" dir="ltr">&#26085;&#26412;&#35486;</a></li>
<li><a href="ko/About_FreeCAD.html" class="mw-pt-progress mw-pt-progress--complete" title="FreeCAD&#50640; &#45824;&#54644; (100% translated)" lang="ko" dir="ltr">&#54620;&#44397;&#50612;</a></li></ul></div>
<div class="docnav">
    <div><span class="mw-default-size" typeof="mw:File"><span><img src="File/Arrow-left.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span> <a href="Online_Help_Startpage.html" title="Online Help Startpage">&#1589;&#1601;&#1581;&#1577; &#1575;&#1604;&#1605;&#1587;&#1575;&#1593;&#1583;&#1577; &#1593;&#1604;&#1609; &#1575;&#1604;&#1573;&#1606;&#1578;&#1585;&#1606;&#1578;</a></div>
    <div><a href="Feature_list.html" title="Feature list">&#1602;&#1575;&#1574;&#1605;&#1577; &#1575;&#1604;&#1605;&#1610;&#1586;&#1575;&#1578;</a>
 <span class="mw-default-size" typeof="mw:File"><span><img src="File/Arrow-right.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span></div>
    <div><a href="Online_Help_Toc.html" title="Online Help Toc">Index</a> <span class="mw-default-size" typeof="mw:File"><span><img src="File/Online_Help_Toc.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span></div>
</div>
<figure class="mw-halign-center" typeof="mw:File"><a href="index.php?title=Freecad_default.jpg&amp;filetimestamp=20130925032446&amp;.html" class="mw-file-description"><img src="File/Freecad_default.jpg" decoding="async" width="1024" height="604" class="mw-file-element" data-file-width="1564" data-file-height="922"></a><figcaption></figcaption></figure> 
<p><b>FreeCAD</b> &#1607;&#1608; &#1576;&#1585;&#1606;&#1575;&#1605;&#1580; &#1606;&#1605;&#1584;&#1580;&#1577; &#1579;&#1604;&#1575;&#1579;&#1610;&#1577; &#1575;&#1604;&#1571;&#1576;&#1593;&#1575;&#1583; <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Open_source">&#1605;&#1601;&#1578;&#1608;&#1581; &#1575;&#1604;&#1605;&#1589;&#1583;&#1585;</a> &#1610;&#1593;&#1578;&#1605;&#1583; &#1593;&#1604;&#1609; &#1575;&#1604;&#1606;&#1605;&#1575;&#1584;&#1580; &#1575;&#1604;&#1576;&#1575;&#1585;&#1575;&#1605;&#1578;&#1585;&#1610;&#1577;&#1548; &#1608;&#1610;&#1615;&#1585;&#1582;&#1589; &#1576;&#1605;&#1608;&#1580;&#1576; <a href="License.html" title="License">&#1585;&#1582;&#1589;&#1577; LGPL</a>. &#1610;&#1607;&#1583;&#1601; FreeCAD &#1605;&#1576;&#1575;&#1588;&#1585;&#1577; &#1573;&#1604;&#1609; <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Mechanical_engineering">&#1575;&#1604;&#1607;&#1606;&#1583;&#1587;&#1577; &#1575;&#1604;&#1605;&#1610;&#1603;&#1575;&#1606;&#1610;&#1603;&#1610;&#1577;</a> &#1608; <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Product_design">&#1578;&#1589;&#1605;&#1610;&#1605; &#1575;&#1604;&#1605;&#1606;&#1578;&#1580;&#1575;&#1578;</a>&#1548; &#1608;&#1604;&#1603;&#1606;&#1607;&#1548; &#1604;&#1603;&#1608;&#1606;&#1607; &#1593;&#1575;&#1605; &#1580;&#1583;&#1611;&#1575;&#1548; &#1610;&#1589;&#1604;&#1581; &#1571;&#1610;&#1590;&#1611;&#1575; &#1604;&#1575;&#1587;&#1578;&#1582;&#1583;&#1575;&#1605;&#1575;&#1578; &#1571;&#1608;&#1587;&#1593; &#1601;&#1610; &#1605;&#1580;&#1575;&#1604;&#1575;&#1578; &#1575;&#1604;&#1607;&#1606;&#1583;&#1587;&#1577;&#1548; &#1605;&#1579;&#1604; &#1575;&#1604;&#1593;&#1605;&#1575;&#1585;&#1577;&#1548; &#1608;&#1578;&#1581;&#1604;&#1610;&#1604; &#1575;&#1604;&#1593;&#1606;&#1575;&#1589;&#1585; &#1575;&#1604;&#1605;&#1581;&#1583;&#1608;&#1583;&#1577;&#1548; &#1608;&#1575;&#1604;&#1591;&#1576;&#1575;&#1593;&#1577; &#1579;&#1604;&#1575;&#1579;&#1610;&#1577; &#1575;&#1604;&#1571;&#1576;&#1593;&#1575;&#1583;&#1548; &#1608;&#1605;&#1607;&#1575;&#1605; &#1571;&#1582;&#1585;&#1609;.
</p><p>&#1610;&#1581;&#1578;&#1608;&#1610; FreeCAD &#1593;&#1604;&#1609; &#1571;&#1583;&#1608;&#1575;&#1578; &#1605;&#1588;&#1575;&#1576;&#1607;&#1577; &#1604;&#1578;&#1604;&#1603; &#1575;&#1604;&#1605;&#1608;&#1580;&#1608;&#1583;&#1577; &#1601;&#1610; <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/CATIA">CATIA</a> &#1608; <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Solidworks">SolidWorks</a> &#1608; <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Solid_Edge">Solid Edge</a> &#1571;&#1608; <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Autodesk_Revit">Revit</a>&#1548; &#1608;&#1576;&#1575;&#1604;&#1578;&#1575;&#1604;&#1610; &#1610;&#1606;&#1578;&#1605;&#1610; &#1571;&#1610;&#1590;&#1611;&#1575; &#1573;&#1604;&#1609; &#1601;&#1574;&#1575;&#1578; <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/CAD">CAD</a> &#1608; <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Product_Lifecycle_Management">PLM</a> &#1608; <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/CAx">CAx</a> &#1608; <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Computer-aided_engineering">CAE</a> &#1608; <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Building_information_modeling">BIM</a>. &#1608;&#1607;&#1608; <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Parametric_feature_based_modeler">&#1606;&#1605;&#1575;&#1584;&#1580; &#1576;&#1575;&#1585;&#1575;&#1605;&#1578;&#1585;&#1610;&#1577; &#1602;&#1575;&#1574;&#1605;&#1577; &#1593;&#1604;&#1609; &#1575;&#1604;&#1605;&#1610;&#1586;&#1575;&#1578;</a> &#1605;&#1593; &#1576;&#1606;&#1610;&#1577; &#1576;&#1585;&#1605;&#1580;&#1610;&#1577; &#1605;&#1593;&#1610;&#1575;&#1585;&#1610;&#1577; &#1578;&#1578;&#1610;&#1581; &#1573;&#1590;&#1575;&#1601;&#1577; &#1608;&#1592;&#1575;&#1574;&#1601; &#1573;&#1590;&#1575;&#1601;&#1610;&#1577; &#1583;&#1608;&#1606; &#1578;&#1593;&#1583;&#1610;&#1604; &#1575;&#1604;&#1606;&#1592;&#1575;&#1605; &#1575;&#1604;&#1571;&#1587;&#1575;&#1587;&#1610;.
</p><p>&#1605;&#1579;&#1604; &#1576;&#1575;&#1602;&#1610; &#1576;&#1585;&#1575;&#1605;&#1580; &#1575;&#1604;&#1606;&#1605;&#1584;&#1580;&#1577; &#1575;&#1604;&#1579;&#1604;&#1575;&#1579;&#1610;&#1577; &#1575;&#1604;&#1571;&#1576;&#1593;&#1575;&#1583;&#1548; &#1610;&#1581;&#1578;&#1608;&#1610; &#1593;&#1604;&#1609; &#1575;&#1604;&#1593;&#1583;&#1610;&#1583; &#1605;&#1606; &#1575;&#1604;&#1605;&#1603;&#1608;&#1606;&#1575;&#1578; &#1579;&#1606;&#1575;&#1574;&#1610;&#1577; &#1575;&#1604;&#1571;&#1576;&#1593;&#1575;&#1583; &#1604;&#1585;&#1587;&#1605; &#1575;&#1604;&#1571;&#1588;&#1603;&#1575;&#1604; &#1575;&#1604;&#1605;&#1587;&#1578;&#1608;&#1610;&#1577; &#1571;&#1608; &#1573;&#1606;&#1588;&#1575;&#1569; &#1575;&#1604;&#1585;&#1587;&#1608;&#1605;&#1575;&#1578; &#1575;&#1604;&#1573;&#1606;&#1578;&#1575;&#1580;&#1610;&#1577;. &#1608;&#1605;&#1593; &#1584;&#1604;&#1603;&#1548; &#1601;&#1573;&#1606; &#1575;&#1604;&#1585;&#1587;&#1605; &#1579;&#1606;&#1575;&#1574;&#1610; &#1575;&#1604;&#1571;&#1576;&#1593;&#1575;&#1583; &#1575;&#1604;&#1605;&#1576;&#1575;&#1588;&#1585; (&#1605;&#1579;&#1604; <a rel="nofollow" class="external text" href="https://inkscape.org/">Inkscape</a> &#1571;&#1608; <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/AutoCAD#AutoCAD_LT">AutoCAD LT</a>) &#1604;&#1610;&#1587; &#1607;&#1608; &#1575;&#1604;&#1578;&#1585;&#1603;&#1610;&#1586;&#1548; &#1608;&#1603;&#1584;&#1604;&#1603; &#1604;&#1610;&#1587;&#1578; &#1575;&#1604;&#1585;&#1587;&#1608;&#1605; &#1575;&#1604;&#1605;&#1578;&#1581;&#1585;&#1603;&#1577; &#1571;&#1608; &#1578;&#1581;&#1585;&#1610;&#1585; &#1575;&#1604;&#1588;&#1576;&#1603;&#1575;&#1578; (&#1605;&#1579;&#1604; <a rel="nofollow" class="external text" href="https://www.blender.org/">Blender</a> &#1608; <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Maya_(software)">Maya</a> &#1608; <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Autodesk_3ds_Max">Autodesk 3ds Max</a> &#1571;&#1608; <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/CINEMA_4D">Cinema 4D</a>). &#1608;&#1605;&#1593; &#1584;&#1604;&#1603;&#1548; &#1576;&#1601;&#1590;&#1604; &#1602;&#1575;&#1576;&#1604;&#1610;&#1578;&#1607; &#1575;&#1604;&#1608;&#1575;&#1587;&#1593;&#1577; &#1604;&#1604;&#1578;&#1603;&#1610;&#1601;&#1548; &#1601;&#1573;&#1606; FreeCAD &#1605;&#1601;&#1610;&#1583; &#1601;&#1610; &#1605;&#1580;&#1575;&#1604; &#1571;&#1608;&#1587;&#1593; &#1576;&#1603;&#1579;&#1610;&#1585; &#1581;&#1608;&#1604; &#1605;&#1580;&#1605;&#1608;&#1593;&#1577; &#1605;&#1610;&#1586;&#1575;&#1578;&#1607; &#1575;&#1604;&#1571;&#1587;&#1575;&#1587;&#1610;&#1577;.
</p><p>&#1610;&#1593;&#1578;&#1605;&#1583; FreeCAD &#1576;&#1588;&#1603;&#1604; &#1603;&#1576;&#1610;&#1585; &#1593;&#1604;&#1609; &#1605;&#1603;&#1578;&#1576;&#1575;&#1578; &#1605;&#1601;&#1578;&#1608;&#1581;&#1577; &#1575;&#1604;&#1605;&#1589;&#1583;&#1585; &#1605;&#1608;&#1580;&#1608;&#1583;&#1577; &#1601;&#1610; &#1605;&#1580;&#1575;&#1604; <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Scientific_Computation">&#1575;&#1604;&#1581;&#1608;&#1587;&#1576;&#1577; &#1575;&#1604;&#1593;&#1604;&#1605;&#1610;&#1577;</a>. &#1608;&#1605;&#1606; &#1576;&#1610;&#1606;&#1607;&#1575; <a rel="nofollow" class="external text" href="https://OpenCascade.org">Open Cascade Technology (OCCT)</a>&#1548; &#1608;&#1607;&#1610; &#1606;&#1608;&#1575;&#1577; CAD &#1602;&#1608;&#1610;&#1577;&#1563; &#1608; <a rel="nofollow" class="external text" href="https://github.com/coin3d/coin/wiki">Coin3D</a>&#1548; &#1608;&#1607;&#1610; &#1605;&#1580;&#1605;&#1608;&#1593;&#1577; &#1571;&#1583;&#1608;&#1575;&#1578; &#1604;&#1578;&#1591;&#1608;&#1610;&#1585; &#1575;&#1604;&#1585;&#1587;&#1608;&#1605;&#1575;&#1578; &#1579;&#1604;&#1575;&#1579;&#1610;&#1577; &#1575;&#1604;&#1571;&#1576;&#1593;&#1575;&#1583; &#1605;&#1578;&#1608;&#1575;&#1601;&#1602;&#1577; &#1605;&#1593; <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Open_Inventor">Open Inventor</a>&#1563; &#1608; <a rel="nofollow" class="external text" href="https://www.qt.io">Qt</a>&#1548; &#1573;&#1591;&#1575;&#1585; &#1593;&#1605;&#1604; &#1608;&#1575;&#1580;&#1607;&#1577; &#1575;&#1604;&#1605;&#1587;&#1578;&#1582;&#1583;&#1605; &#1575;&#1604;&#1588;&#1607;&#1610;&#1585; &#1593;&#1575;&#1604;&#1605;&#1610;&#1611;&#1575;&#1563; &#1608; <a rel="nofollow" class="external text" href="https://python.org">Python</a>&#1548; &#1604;&#1594;&#1577; &#1576;&#1585;&#1605;&#1580;&#1577; &#1581;&#1583;&#1610;&#1579;&#1577; &#1604;&#1604;&#1587;&#1603;&#1585;&#1610;&#1576;&#1578;&#1575;&#1578;. &#1603;&#1605;&#1575; &#1610;&#1605;&#1603;&#1606; &#1575;&#1587;&#1578;&#1582;&#1583;&#1575;&#1605; FreeCAD &#1606;&#1601;&#1587;&#1607; &#1603;&#1605;&#1603;&#1578;&#1576;&#1577; &#1605;&#1606; &#1602;&#1576;&#1604; &#1576;&#1585;&#1575;&#1605;&#1580; &#1571;&#1582;&#1585;&#1609;.
</p><p>FreeCAD &#1607;&#1608; &#1571;&#1610;&#1590;&#1611;&#1575; <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Cross-platform">&#1605;&#1578;&#1593;&#1583;&#1583; &#1575;&#1604;&#1605;&#1606;&#1589;&#1575;&#1578;</a>&#1548; &#1608;&#1610;&#1593;&#1605;&#1604; &#1581;&#1575;&#1604;&#1610;&#1611;&#1575; &#1593;&#1604;&#1609; &#1571;&#1606;&#1592;&#1605;&#1577; Linux/Unix &#1608;Windows &#1608;macOS &#1576;&#1606;&#1601;&#1587; &#1575;&#1604;&#1605;&#1592;&#1607;&#1585; &#1608;&#1575;&#1604;&#1608;&#1592;&#1575;&#1574;&#1601; &#1593;&#1604;&#1609; &#1580;&#1605;&#1610;&#1593; &#1575;&#1604;&#1605;&#1606;&#1589;&#1575;&#1578;.
</p><p>&#1604;&#1605;&#1586;&#1610;&#1583; &#1605;&#1606; &#1575;&#1604;&#1605;&#1593;&#1604;&#1608;&#1605;&#1575;&#1578; &#1581;&#1608;&#1604; &#1602;&#1583;&#1585;&#1575;&#1578; FreeCAD&#1548; &#1610;&#1605;&#1603;&#1606;&#1603; &#1575;&#1604;&#1575;&#1591;&#1604;&#1575;&#1593; &#1593;&#1604;&#1609; <a href="Feature_list.html" title="Feature list">&#1602;&#1575;&#1574;&#1605;&#1577; &#1575;&#1604;&#1605;&#1610;&#1586;&#1575;&#1578;</a> &#1608; <a href="Feature_list.html#Release_notes" title="Feature list">&#1570;&#1582;&#1585; &#1605;&#1604;&#1575;&#1581;&#1592;&#1575;&#1578; &#1575;&#1604;&#1573;&#1589;&#1583;&#1575;&#1585;</a> &#1608;&#1605;&#1602;&#1575;&#1604;&#1575;&#1578; <a href="Getting_started.html" title="Getting started">&#1575;&#1604;&#1576;&#1583;&#1569;</a>&#1548; &#1571;&#1608; &#1605;&#1588;&#1575;&#1607;&#1583;&#1577; &#1575;&#1604;&#1605;&#1586;&#1610;&#1583; &#1605;&#1606; <a href="Screenshots.html" title="Screenshots">&#1575;&#1604;&#1604;&#1602;&#1591;&#1575;&#1578; &#1575;&#1604;&#1605;&#1589;&#1608;&#1585;&#1577;</a>.
</p>
<h3><span id=".D8.AD.D9.88.D9.84_.D9.85.D8.B4.D8.B1.D9.88.D8.B9_FreeCAD"></span><span class="mw-headline" id="&#1581;&#1608;&#1604;_&#1605;&#1588;&#1585;&#1608;&#1593;_FreeCAD">&#1581;&#1608;&#1604; &#1605;&#1588;&#1585;&#1608;&#1593; FreeCAD</span></h3>
<p>&#1578;&#1605; &#1576;&#1583;&#1569; &#1605;&#1588;&#1585;&#1608;&#1593; FreeCAD &#1605;&#1606;&#1584; &#1593;&#1575;&#1605; 2001&#1548; &#1603;&#1605;&#1575; &#1607;&#1608; &#1605;&#1608;&#1590;&#1581; &#1601;&#1610; &#1589;&#1601;&#1581;&#1577; <a href="History.html" title="History">&#1575;&#1604;&#1578;&#1575;&#1585;&#1610;&#1582;</a>.
</p><p>&#1610;&#1578;&#1605; &#1589;&#1610;&#1575;&#1606;&#1577; FreeCAD &#1608;&#1578;&#1591;&#1608;&#1610;&#1585;&#1607; &#1605;&#1606; &#1602;&#1576;&#1604; <a href="Contributors.html" title="Contributors">&#1605;&#1580;&#1578;&#1605;&#1593; &#1605;&#1606; &#1575;&#1604;&#1605;&#1591;&#1608;&#1585;&#1610;&#1606; &#1608;&#1575;&#1604;&#1605;&#1587;&#1578;&#1582;&#1583;&#1605;&#1610;&#1606; &#1575;&#1604;&#1605;&#1578;&#1581;&#1605;&#1587;&#1610;&#1606;</a>&#1548; &#1608;&#1610;&#1578;&#1605; &#1576;&#1606;&#1575;&#1572;&#1607; &#1605;&#1606; &#1582;&#1604;&#1575;&#1604; &#1575;&#1604;&#1593;&#1605;&#1604; &#1575;&#1604;&#1605;&#1578;&#1608;&#1575;&#1589;&#1604; &#1604;&#1605;&#1574;&#1575;&#1578; &#1575;&#1604;&#1605;&#1587;&#1575;&#1607;&#1605;&#1610;&#1606;&#1548; &#1576;&#1593;&#1590;&#1607;&#1605; &#1605;&#1606;&#1578;&#1592;&#1605; &#1608;&#1576;&#1593;&#1590;&#1607;&#1605; &#1593;&#1585;&#1590;&#1610;. &#1605;&#1593;&#1592;&#1605; &#1575;&#1604;&#1593;&#1605;&#1604; &#1593;&#1604;&#1609; FreeCAD &#1610;&#1578;&#1605; &#1578;&#1591;&#1608;&#1593;&#1610;&#1611;&#1575;. &#1610;&#1615;&#1593;&#1583;&#1617; <a rel="nofollow" class="external text" href="https://forum.freecad.org">&#1605;&#1606;&#1578;&#1583;&#1609; FreeCAD</a> &#1575;&#1604;&#1605;&#1603;&#1575;&#1606; &#1575;&#1604;&#1584;&#1610; &#1578;&#1615;&#1606;&#1575;&#1602;&#1588; &#1601;&#1610;&#1607; &#1605;&#1593;&#1592;&#1605; &#1575;&#1604;&#1571;&#1601;&#1603;&#1575;&#1585; &#1608;&#1575;&#1604;&#1602;&#1585;&#1575;&#1585;&#1575;&#1578;&#1548; &#1608; <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD">&#1605;&#1587;&#1578;&#1608;&#1583;&#1593; GitHub</a> &#1607;&#1608; &#1575;&#1604;&#1605;&#1603;&#1575;&#1606; &#1575;&#1604;&#1584;&#1610; &#1610;&#1615;&#1581;&#1601;&#1592; &#1601;&#1610;&#1607; &#1575;&#1604;&#1603;&#1608;&#1583;&#1548; &#1608;&#1610;&#1615;&#1588;&#1575;&#1585;&#1603; &#1608;&#1610;&#1615;&#1606;&#1575;&#1602;&#1588; &#1608;&#1610;&#1615;&#1593;&#1605;&#1604; &#1593;&#1604;&#1610;&#1607;. &#1571;&#1610; &#1588;&#1582;&#1589; <a href="Help_FreeCAD.html" title="Help FreeCAD">&#1605;&#1585;&#1581;&#1576; &#1576;&#1607; &#1604;&#1604;&#1605;&#1588;&#1575;&#1585;&#1603;&#1577;</a>.
</p>
<h3><span id=".D8.AD.D9.88.D9.84_FPA"></span><span class="mw-headline" id="&#1581;&#1608;&#1604;_FPA">&#1581;&#1608;&#1604; FPA</span></h3>
<p>&#1603;&#1605;&#1575; &#1610;&#1583;&#1593;&#1605; &#1605;&#1588;&#1585;&#1608;&#1593; FreeCAD &#1605;&#1606;&#1592;&#1605;&#1577; &#1594;&#1610;&#1585; &#1585;&#1576;&#1581;&#1610;&#1577;&#1548; &#1608;&#1607;&#1610; <a rel="nofollow" class="external text" href="https://fpa.freecad.org">&#1580;&#1605;&#1593;&#1610;&#1577; &#1605;&#1588;&#1585;&#1608;&#1593; FreeCAD (FPA)</a>. FPA &#1607;&#1610; &#1607;&#1610;&#1574;&#1577; &#1605;&#1587;&#1578;&#1602;&#1604;&#1577; &#1571;&#1606;&#1588;&#1571;&#1607;&#1575; &#1576;&#1593;&#1590; &#1582;&#1576;&#1585;&#1575;&#1569; FreeCAD &#1601;&#1610; &#1593;&#1575;&#1605; 2021 &#1604;&#1580;&#1605;&#1593; <a href="Donate.html" title="Donate">&#1575;&#1604;&#1578;&#1576;&#1585;&#1593;&#1575;&#1578;</a> &#1608;&#1575;&#1604;&#1605;&#1608;&#1575;&#1585;&#1583; &#1575;&#1604;&#1571;&#1582;&#1585;&#1609; &#1604;&#1583;&#1593;&#1605; &#1575;&#1604;&#1605;&#1588;&#1585;&#1608;&#1593; &#1608;&#1605;&#1580;&#1578;&#1605;&#1593;&#1607;&#1548; &#1608;&#1575;&#1604;&#1605;&#1587;&#1575;&#1593;&#1583;&#1577; &#1601;&#1610; &#1581;&#1605;&#1575;&#1610;&#1577; &#1607;&#1584;&#1575; &#1575;&#1604;&#1605;&#1580;&#1578;&#1605;&#1593; &#1608;&#1575;&#1604;&#1587;&#1605;&#1575;&#1581; &#1604;&#1607; &#1576;&#1575;&#1604;&#1575;&#1587;&#1578;&#1605;&#1585;&#1575;&#1585; &#1601;&#1610; &#1575;&#1604;&#1578;&#1591;&#1608;&#1610;&#1585; &#1601;&#1610; &#1571;&#1601;&#1590;&#1604; &#1575;&#1604;&#1592;&#1585;&#1608;&#1601;&#1548; &#1608;&#1578;&#1605;&#1579;&#1610;&#1604; &#1575;&#1604;&#1605;&#1588;&#1585;&#1608;&#1593; &#1571;&#1605;&#1575;&#1605; &#1580;&#1607;&#1575;&#1578; &#1571;&#1582;&#1585;&#1609; &#1605;&#1579;&#1604; &#1575;&#1604;&#1588;&#1585;&#1603;&#1575;&#1578; &#1608;&#1575;&#1604;&#1605;&#1572;&#1587;&#1587;&#1575;&#1578;.
</p>
<div class="docnav">
    <div><span class="mw-default-size" typeof="mw:File"><span><img src="File/Arrow-left.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span> <a href="Online_Help_Startpage.html" title="Online Help Startpage">&#1589;&#1601;&#1581;&#1577; &#1575;&#1604;&#1605;&#1587;&#1575;&#1593;&#1583;&#1577; &#1593;&#1604;&#1609; &#1575;&#1604;&#1573;&#1606;&#1578;&#1585;&#1606;&#1578;</a></div>
    <div><a href="Feature_list.html" title="Feature list">&#1602;&#1575;&#1574;&#1605;&#1577; &#1575;&#1604;&#1605;&#1610;&#1586;&#1575;&#1578;</a>
 <span class="mw-default-size" typeof="mw:File"><span><img src="File/Arrow-right.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span></div>
    <div><a href="Online_Help_Toc.html" title="Online Help Toc">Index</a> <span class="mw-default-size" typeof="mw:File"><span><img src="File/Online_Help_Toc.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span></div>
</div>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><span typeof="mw:File"><a href="index.php?title=User_hub.png&amp;filetimestamp=20190221145008&amp;.html" class="mw-file-description"><img src="File/User_hub.png" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="User_hub.html" title="User hub">User documentation</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b><a href="Getting_started.html" title="Getting started">Getting started</a></b></li>
<li><b>Installation:</b> <a href="Download.html" title="Download">Download</a>, <a href="Installing_on_Windows.html" title="Installing on Windows">Windows</a>, <a href="Installing_on_Linux.html" title="Installing on Linux">Linux</a>, <a href="Installing_on_Mac.html" title="Installing on Mac">Mac</a>, <a href="Installing_additional_components.html" title="Installing additional components">Additional components</a>, <a href="Compile_on_Docker.html" title="Compile on Docker">Docker</a>, <a href="AppImage.html" title="AppImage">AppImage</a>, <a href="Ubuntu_Snap.html" title="Ubuntu Snap">Ubuntu Snap</a></li>
<li><b>Basics:</b> <a class="mw-selflink selflink">About FreeCAD</a>, <a href="Interface.html" title="Interface">Interface</a>, <a href="Mouse_navigation.html" title="Mouse navigation">Mouse navigation</a>, <a href="Selection_methods.html" title="Selection methods">Selection methods</a>, <a href="Object_name.html" title="Object name">Object name</a>, <a href="Preferences_Editor.html" title="Preferences Editor">Preferences</a>, <a href="Workbenches.html" title="Workbenches">Workbenches</a>, <a href="Document_structure.html" title="Document structure">Document structure</a>, <a href="Property.html" title="Property">Properties</a>, <a href="Help_FreeCAD.html" title="Help FreeCAD">Help FreeCAD</a>, <a href="Donate.html" title="Donate">Donate</a></li></ul>
<hr>
<ul><li><b>Help:</b> <a href="Tutorials.html" title="Tutorials">Tutorials</a>, <a href="Video_tutorials.html" title="Video tutorials">Video tutorials</a></li>
<li><b><a href="Workbenches.html" title="Workbenches">Workbenches</a>:</b> <a href="Std_Base.html" title="Std Base">Std Base</a>, <a href="Assembly_Workbench.html" title="Assembly Workbench">Assembly</a>, <a href="BIM_Workbench.html" title="BIM Workbench">BIM</a>, <a href="CAM_Workbench.html" title="CAM Workbench">CAM</a>, <a href="Draft_Workbench.html" title="Draft Workbench">Draft</a>, <a href="FEM_Workbench.html" title="FEM Workbench">FEM</a>, <a href="Inspection_Workbench.html" title="Inspection Workbench">Inspection</a>, <a href="Material_Workbench.html" title="Material Workbench">Material</a>, <a href="Mesh_Workbench.html" title="Mesh Workbench">Mesh</a>, <a href="OpenSCAD_Workbench.html" title="OpenSCAD Workbench">OpenSCAD</a>, <a href="Part_Workbench.html" title="Part Workbench">Part</a>, <a href="PartDesign_Workbench.html" title="PartDesign Workbench">PartDesign</a>, <a href="Points_Workbench.html" title="Points Workbench">Points</a>, <a href="Reverse_Engineering_Workbench.html" title="Reverse Engineering Workbench">Reverse Engineering</a>, <a href="Robot_Workbench.html" title="Robot Workbench">Robot</a>, <a href="Sketcher_Workbench.html" title="Sketcher Workbench">Sketcher</a>, <a href="Spreadsheet_Workbench.html" title="Spreadsheet Workbench">Spreadsheet</a>, <a href="Surface_Workbench.html" title="Surface Workbench">Surface</a>, <a href="TechDraw_Workbench.html" title="TechDraw Workbench">TechDraw</a>, <a href="Testing.html" title="Testing">Test Framework</a></li></ul>
<hr>
<ul><li><b><a href="Addon.html" title="Addon">Addons</a>:</b> <a href="Std_AddonMgr.html" title="Std AddonMgr">Addon Manager</a>, <a href="External_workbenches.html" title="External workbenches">External workbenches</a>, <a href="Scripting_and_macros.html" title="Scripting and macros">Scripting and macros</a></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="User_hub.html" title="User hub">User hub</a>, <a href="Power_users_hub.html" title="Power users hub">Power users hub</a>, <a href="Developer_hub.html" title="Developer hub">Developer hub</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20251220024830
Cache expiry: 86400
Reduced expiry: false
Complications: []
CPU time usage: 0.085 seconds
Real time usage: 0.164 seconds
Preprocessor visited node count: 151/1000000
Post&#8208;expand include size: 6745/2097152 bytes
Template argument size: 2228/2097152 bytes
Highest expansion depth: 5/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 4058/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   12.128      1 -total
 65.01%    7.884      1 Template:Userdocnavi
 36.61%    4.440      1 Template:Navigation_menu_2
 33.53%    4.066      2 Template:Docnav
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:8-0!canonical and timestamp 20251220024829 and revision id 1718492. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="site.js"></script>