<link href="site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Russian Translation</span></h1><?xml encoding="UTF-8"><div class="mw-parser-output"><div class="mw-collapsible mw-collapsed">
<p>&#1047;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1091; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1099; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1074;&#1079;&#1103;&#1090;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072; <a href="Spanish_Translation.html" title="Spanish Translation">Spanish Translation</a>.
&#1057;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1072; 2 &#1084;&#1072;&#1103; 2025&#1075;.
&#1057; &#1091;&#1074;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084; AMK.
</p>
</div> 
<div style="text-align:center; background:#FDE0A8;margin:1em 7em;padding:0.5em 2em;border:2px solid #FF5706;">
<p>&#1069;&#1090;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1085;&#1077; &#1079;&#1072;&#1082;&#1086;&#1085;&#1095;&#1077;&#1085;&#1072;. &#1055;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1087;&#1086;&#1084;&#1086;&#1075;&#1080;&#1090;&#1077; &#1080; &#1074;&#1085;&#1077;&#1089;&#1080;&#1090;&#1077; &#1089;&#1074;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076; &#1074; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1091; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080;.
</p><p><a href="ru/GuiCommand_model.html" title="GuiCommand model/ru">&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; Gui</a> &#1086;&#1073;&#1098;&#1103;&#1089;&#1085;&#1103;&#1077;&#1090;, &#1082;&#1072;&#1082; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1079;&#1072;&#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1099; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;. &#1055;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; <a href="ru/Category;UnfinishedDocu.html" title="Category:UnfinishedDocu/ru"> Category:UnfinishedDocu/ru</a>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1085;&#1077;&#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1105;&#1085;&#1085;&#1099;&#1093; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;, &#1087;&#1086;&#1076;&#1086;&#1073;&#1085;&#1099;&#1093; &#1101;&#1090;&#1086;&#1081;. &#1057;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; <a href="ru/Category;Command_Reference.html" title="Category:Command Reference/ru"> Category:Command Reference/ru</a> &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;.
</p><p>&#1057;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; <a href="ru/WikiPages.html" title="WikiPages/ru">Wiki &#1057;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;</a>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1079;&#1085;&#1072;&#1090;&#1100; &#1086; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1074;&#1080;&#1082;&#1080;-&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;, &#1080; &#1079;&#1072;&#1081;&#1076;&#1080;&#1090;&#1077; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; <a href="ru/Help_FreeCAD.html" title="Help FreeCAD/ru">&#1055;&#1086;&#1084;&#1086;&#1075;&#1080; FreeCAD</a>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1079;&#1085;&#1072;&#1090;&#1100; &#1086; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1072;&#1093;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084;&#1080; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1074;&#1085;&#1077;&#1089;&#1090;&#1080; &#1089;&#1074;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076;.
</p>
</div>
<p>&#1069;&#1090;&#1086; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1091; &#1085;&#1072; &#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081; &#1103;&#1079;&#1099;&#1082; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1086; &#1082;&#1072;&#1082; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086; &#1074;&#1099;&#1073;&#1086;&#1088;&#1091; &#1083;&#1091;&#1095;&#1096;&#1080;&#1093; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1086;&#1074; &#1085;&#1072; &#1088;&#1091;&#1089;&#1089;&#1082;&#1086;&#1084; &#1076;&#1083;&#1103; &#1076;&#1086;&#1089;&#1090;&#1080;&#1078;&#1077;&#1085;&#1080;&#1103; &#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1072; &#1074; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1087;&#1086;&#1076;&#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;&#1093;, &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1093; &#1101;&#1082;&#1086;&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091; FreeCAD.
</p><p>&#1050;&#1072;&#1078;&#1076;&#1072;&#1103; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1072;&#1094;&#1080;&#1103; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100; &#1087;&#1086;&#1076;&#1090;&#1074;&#1077;&#1088;&#1078;&#1076;&#1077;&#1085;&#1072; &#1085;&#1072; &#1088;&#1091;&#1089;&#1089;&#1082;&#1086;&#1084; &#1092;&#1086;&#1088;&#1091;&#1084;&#1077;: <i><a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=36954">&#1055;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076; Wiki &#1080; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072;</a>'</i>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1103;&#1097;&#1080;&#1084; &#1084;&#1077;&#1089;&#1090;&#1086;&#1084; &#1076;&#1083;&#1103; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103;. &#1044;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1072; &#1089;&#1074;&#1103;&#1079;&#1100; &#1084;&#1077;&#1078;&#1076;&#1091; &#1087;&#1086;&#1089;&#1090;&#1086;&#1084; &#1087;&#1086;&#1076;&#1090;&#1074;&#1077;&#1088;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103; &#1080; &#1101;&#1090;&#1086;&#1081; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077;&#1081;. 
</p><p>&#1044;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1086;&#1074; &#1085;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1099; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; <b>&#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1072;</b>, &#1089; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084;&#1080; &#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1085;&#1099; &#1080;&#1083;&#1080; &#1091;&#1078;&#1077; &#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1080;&#1083;&#1080;&#1089;&#1100; &#1090;&#1077;, &#1082;&#1090;&#1086; &#1075;&#1086;&#1090;&#1086;&#1074; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1072;&#1090;&#1100; &#1080;&#1093; &#1085;&#1072; &#1092;&#1086;&#1088;&#1091;&#1084;&#1077;, &#1080; &#1085;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1072; <b>&#1089;&#1087;&#1088;&#1072;&#1074;&#1082;&#1072; &#1087;&#1086; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1091;</b> &#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1086;&#1074;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1093; &#1074; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1087;&#1086;&#1085;&#1103;&#1090;&#1085;&#1099;&#1077;, &#1090;&#1086;&#1095;&#1085;&#1099;&#1077; &#1080; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1099;&#1077; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1099;.
</p><p>
&#1055;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072; FreeCAD &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1087;&#1083;&#1072;&#1090;&#1092;&#1086;&#1088;&#1084;&#1077; <a rel="nofollow" class="external text" href="https://crowdin.com/project/freecad/ru">Crowdin</a> </p><div style="clear:right; margin-bottom: .5em; float: right; padding: .5em 0 .8em 1.4em; background: none;"><div id="toc" class="toc" role="navigation" aria-labelledby="mw-toc-heading"><input type="checkbox" role="button" id="toctogglecheckbox" class="toctogglecheckbox" style="display:none"><div class="toctitle" lang="en" dir="ltr"><h2 id="mw-toc-heading">Contents</h2><span class="toctogglespan"><label class="toctogglelabel" for="toctogglecheckbox"></label></span></div>
<ul>
<li class="toclevel-1 tocsection-1"><a href="#%D0%92%D0%B2%D0%B5%D0%B4%D0%B5%D0%BD%D0%B8%D0%B5"><span class="tocnumber">1</span> <span class="toctext">&#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;</span></a></li>
</ul>
</div>
</div>
<h3><span id=".D0.92.D0.B2.D0.B5.D0.B4.D0.B5.D0.BD.D0.B8.D0.B5"></span><span class="mw-headline" id="&#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;">&#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;</span></h3>
<p>&#1057;&#1083;&#1091;&#1095;&#1072;&#1083;&#1086;&#1089;&#1100; &#1083;&#1080; &#1089; &#1074;&#1072;&#1084;&#1080; &#1090;&#1072;&#1082;&#1086;&#1077;?  &#1042;&#1099; &#1080;&#1097;&#1077;&#1090;&#1077; &#1089;&#1087;&#1088;&#1072;&#1074;&#1082;&#1091; &#1074; &#1088;&#1091;&#1089;&#1089;&#1082;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; &#1074;&#1080;&#1082;&#1080;, &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1077; &#1085;&#1091;&#1078;&#1085;&#1091;&#1102; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091;, &#1085;&#1077;&#1084;&#1085;&#1086;&#1075;&#1086; &#1095;&#1080;&#1090;&#1072;&#1077;&#1090;&#1077;, &#1091;&#1076;&#1080;&#1074;&#1083;&#1103;&#1077;&#1090;&#1077;&#1089;&#1100; &#1073;&#1077;&#1089;&#1089;&#1084;&#1099;&#1089;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1072;&#1084; &#1080; &#1091;&#1090;&#1074;&#1077;&#1088;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103;&#1084; &#1080; &#1095;&#1080;&#1090;&#1072;&#1077;&#1090;&#1077; &#1086;&#1088;&#1080;&#1075;&#1080;&#1085;&#1072;&#1083; &#1085;&#1072; &#1072;&#1085;&#1075;&#1083;&#1080;&#1081;&#1089;&#1082;&#1086;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1085;&#1103;&#1090;&#1100;, &#1086; &#1095;&#1105;&#1084; &#1080;&#1076;&#1105;&#1090; &#1088;&#1077;&#1095;&#1100;, &#1080;&#1083;&#1080; &#1080;&#1097;&#1077;&#1090;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1091; &#1087;&#1086; &#1077;&#1105; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1102; &#1085;&#1072; &#1088;&#1091;&#1089;&#1089;&#1082;&#1086;&#1084;, &#1080; &#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1095;&#1090;&#1086; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076; &#1074; &#1074;&#1080;&#1082;&#1080; &#1086;&#1090;&#1083;&#1080;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1090; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1072; &#1074; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;.
</p><p>&#1058;&#1072;&#1082;&#1086;&#1077; &#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100; &#1094;&#1077;&#1083;&#1100;&#1102; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1072; &#1082;&#1072;&#1082; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072; FreeCAD, &#1090;&#1072;&#1082; &#1080; &#1074;&#1080;&#1082;&#1080;-&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;.
</p><p>&#1055;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; &#1084;&#1077;&#1078;&#1076;&#1091; &#1088;&#1072;&#1079;&#1085;&#1099;&#1084;&#1080; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1072;&#1084;&#1080; &#1088;&#1072;&#1079;&#1076;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;, &#1085;&#1077; &#1090;&#1072;&#1082; &#1083;&#1080;?
</p><p>&#1050;&#1072;&#1082; &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1083;&#1091;&#1095;&#1096;&#1080;&#1090;&#1100; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1072;, &#1079;&#1072;&#1084;&#1077;&#1085;&#1103;&#1103; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1099;&#1077; &#1092;&#1086;&#1088;&#1084;&#1091;&#1083;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080; &#1074; &#1083;&#1091;&#1095;&#1096;&#1077;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1099;&#1084;&#1080; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103;&#1084;&#1080;, &#1095;&#1090;&#1086;&#1073;&#1099; <i>&#1087;&#1088;&#1080;&#1073;&#1083;&#1080;&#1079;&#1080;&#1090;&#1100;&#1089;&#1103; &#1082; &#1072;&#1085;&#1075;&#1083;&#1080;&#1081;&#1089;&#1082;&#1086;&#1084;&#1091; &#1086;&#1088;&#1080;&#1075;&#1080;&#1085;&#1072;&#1083;&#1091;</i> - &#1079;&#1072;&#1075;&#1072;&#1076;&#1082;&#1072; &#1076;&#1083;&#1103; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; &#1080; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1095;&#1080;&#1082;&#1086;&#1074;, &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086; &#1091;&#1095;&#1072;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1093; &#1074; &#1092;&#1086;&#1088;&#1091;&#1084;&#1077;.  &#1048;&#1079; &#1076;&#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1080;&#1080; &#1085;&#1072; &#1092;&#1086;&#1088;&#1091;&#1084;&#1077; &#1086; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1086;&#1074; &#1074;&#1099;&#1090;&#1077;&#1082;&#1072;&#1077;&#1090; &#1086;&#1073;&#1097;&#1077;&#1077; &#1078;&#1077;&#1083;&#1072;&#1085;&#1080;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1087;&#1086;&#1085;&#1103;&#1090;&#1085;&#1099;&#1077; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1072;&#1094;&#1080;&#1080; &#1076;&#1083;&#1103; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1072; &#1082;&#1072;&#1082; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1075;&#1086; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072; FreeCAD, &#1090;&#1072;&#1082; &#1080; &#1074;&#1080;&#1082;&#1080;-&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;.
</p><p><br>
&#1056;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1072;&#1094;&#1080;&#1080;, &#1087;&#1088;&#1086;&#1096;&#1077;&#1076;&#1096;&#1080;&#1077; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072; &#1092;&#1086;&#1088;&#1091;&#1084;&#1077;, &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1099; &#1085;&#1080;&#1078;&#1077;.
</p>
<div class="mw-collapsible mw-collapsed">
<p><br>
</p>
<table border="2" cellspacing="0" cellpadding="4" rules="all" class="hintergrundfarbe1 rahmenfarbe1" style="margin:1em 1em 1em 0; border-style:solid; border-width:1px; border-collapse:collapse; empty-cells:show; width: 100%">
<tbody><tr>
<th>&#1056;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1072;&#1094;&#1080;&#1103;
</th>
<th>&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;
</th></tr>
<tr>
<td>&#1042;&#1089;&#1077;&#1075;&#1076;&#1072; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077; Workbench &#1082;&#1072;&#1082; <b>&#1042;&#1077;&#1088;&#1089;&#1090;&#1072;&#1082;</b>.
</td>
<td>
</td></tr>


 
</tbody></table></div>
<!-- 
NewPP limit report
Cached time: 20250513194432
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc, no&#8208;toc&#8208;conversion]
CPU time usage: 0.008 seconds
Real time usage: 0.010 seconds
Preprocessor visited node count: 23/1000000
Post&#8208;expand include size: 1453/2097152 bytes
Template argument size: 11/2097152 bytes
Highest expansion depth: 3/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 0/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    3.295      1 -total
 54.81%    1.806      1 Template:UnfinishedDocu/ru
 21.94%    0.723      1 Template:Prettytable
 18.18%    0.599      1 Template:TOCright
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:381262-0!canonical and timestamp 20250513194440 and revision id 1583923. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="site.js"></script>