<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">FEM Shear of a Composite Block/pl</span></h1><?xml encoding="UTF-8"><div class="mw-parser-output"><div class="mw-pt-languages noprint" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../de/FEM_Shear_of_a_Composite_Block.html" class="mw-pt-progress mw-pt-progress--stub" title="FEM Scherung eines Verbundwerkstoff Blocks (8% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../FEM_Shear_of_a_Composite_Block.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="FEM Shear of a Composite Block (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/FEM_Shear_of_a_Composite_Block.html" class="mw-pt-progress mw-pt-progress--stub" title="FEM: Shear of a Composite Block/Cizalla de un bloque compuesto (5% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/FEM_Shear_of_a_Composite_Block.html" class="mw-pt-progress mw-pt-progress--complete" title="FEM Cisaillement d'un bloc composite (97% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/FEM_Shear_of_a_Composite_Block.html" class="mw-pt-progress mw-pt-progress--med" title="Analisi del taglio FEM di un blocco composito (57% translated)" lang="it" dir="ltr">italiano</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="pl" dir="ltr">polski</span></li>
<li><a href="../ro/FEM_Shear_of_a_Composite_Block.html" class="mw-pt-progress mw-pt-progress--med" title="FEM: Shear of a Composite Block/Forfecarea unui Block Compozit (41% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><a href="../ru/FEM_Shear_of_a_Composite_Block.html" class="mw-pt-progress mw-pt-progress--med" title="FEM: &#1040;&#1085;&#1072;&#1083;&#1080;&#1079; &#1076;&#1077;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1082;&#1086;&#1084;&#1087;&#1086;&#1079;&#1080;&#1090;&#1085;&#1086;&#1075;&#1086; &#1073;&#1083;&#1086;&#1082;&#1072; (54% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li></ul></div>
<table class="fcinfobox wikitable ct" style="width: 230px; float: right; margin-left: 1em">
<tbody><tr>
<td class="ctTitle" style="font-weight: bold; font-size: 125%;"><span typeof="mw:File"><span><img src="../File/Freecad.svg" decoding="async" width="32" height="32"></span></span> &#262;wiczenie
</td></tr>
<tr>
<th class="ctOdd">Temat
</th></tr>
<tr>
<td class="ctEven">Analiza metod&#261; element&oacute;w sko&#324;czonych
</td></tr>
<tr>
<th class="ctOdd">Poziom trudno&#347;ci
</th></tr>
<tr>
<td class="ctEven">Pocz&#261;tkuj&#261;cy/&#347;rednio zaawansowany
</td></tr>
<tr>
<th class="ctOdd">Czas wykonania
</th></tr>
<tr>
<td class="ctEven">30 minut
</td></tr>
<tr>
<th class="ctOdd">Autorzy
</th></tr>
<tr>
<td class="ctEven"><a rel="nofollow" class="external text" href="http://www.freecadweb.org/wiki/index.php?title=User:">HarryvL</a>
</td></tr>
<tr>
<th class="ctOdd">Wersja FreeCAD
</th></tr>
<tr>
<td class="ctEven">0.17.12960 lub nowszy
</td></tr>
<tr>
<th class="ctOdd">Pliki z przyk&#322;adami
</th></tr>
<tr>
<td class="ctEven"><i>Nie do&#322;&#261;czono</i>
</td></tr>
<tr>
<th class="ctOdd">Zobacz r&oacute;wnie&#380;
</th></tr>
<tr>
<td class="ctEven"><i>-</i>
</td></tr>
<tr>
<td class="ctToc"><br><div id="toc" class="toc" role="navigation" aria-labelledby="mw-toc-heading"><input type="checkbox" role="button" id="toctogglecheckbox" class="toctogglecheckbox" style="display:none"><div class="toctitle" lang="en" dir="ltr"><h2 id="mw-toc-heading">Contents</h2><span class="toctogglespan"><label class="toctogglelabel" for="toctogglecheckbox"></label></span></div>
<ul>
<li class="toclevel-1 tocsection-1"><a href="#Wprowadzenie"><span class="tocnumber">1</span> <span class="toctext">Wprowadzenie</span></a></li>
<li class="toclevel-1 tocsection-2"><a href="#Geometria"><span class="tocnumber">2</span> <span class="toctext">Geometria</span></a></li>
<li class="toclevel-1 tocsection-3"><a href="#Siatka_i_obszary_siatki"><span class="tocnumber">3</span> <span class="toctext">Siatka i obszary siatki</span></a></li>
<li class="toclevel-1 tocsection-4"><a href="#Przypisanie_materia%C5%82u"><span class="tocnumber">4</span> <span class="toctext">Przypisanie materia&#322;u</span></a></li>
<li class="toclevel-1 tocsection-5"><a href="#Podpora_przesuwna"><span class="tocnumber">5</span> <span class="toctext">Podpora przesuwna</span></a></li>
<li class="toclevel-1 tocsection-6"><a href="#Utwierdzone_w%C4%99z%C5%82y"><span class="tocnumber">6</span> <span class="toctext">Utwierdzone w&#281;z&#322;y</span></a></li>
<li class="toclevel-1 tocsection-7"><a href="#Si%C5%82y_styczne"><span class="tocnumber">7</span> <span class="toctext">Si&#322;y styczne</span></a></li>
<li class="toclevel-1 tocsection-8"><a href="#Analiza_w_CalculiX"><span class="tocnumber">8</span> <span class="toctext">Analiza w CalculiX</span></a></li>
<li class="toclevel-1 tocsection-9"><a href="#Wyniki_CalculiX"><span class="tocnumber">9</span> <span class="toctext">Wyniki CalculiX</span></a></li>
<li class="toclevel-1 tocsection-10"><a href="#Dalsza_praca"><span class="tocnumber">10</span> <span class="toctext">Dalsza praca</span></a></li>
</ul>
</div>

</td></tr></tbody></table>
<p><span id="Introduction"></span>
</p>
<h2><span class="mw-headline" id="Wprowadzenie">Wprowadzenie</span></h2>
<p>W tym przyk&#322;adzie przeanalizujemy deformacj&#281; postaciow&#261; kompozytowego bloku sk&#322;adaj&#261;cego si&#281; ze sztywnego rdzenia osadzonego w mi&#281;kkiej matrycy. Zademonstrowane b&#281;dzie u&#380;ycie narz&#281;dzi BooleanFragments i CompoundFilter do utworzenia bry&#322; dla bloku i matrycy z dw&oacute;ch wsp&oacute;&#322;&#347;rodkowych sze&#347;cian&oacute;w. To podej&#347;cie zapewnia mo&#380;liwo&#347;&#263; przypisania obszar&oacute;w siatki, materia&#322;&oacute;w i warunk&oacute;w brzegowych osobno dla bloku i otaczaj&#261;cej go matrycy. Do wybrania wewn&#281;trznych obszar&oacute;w wykorzystamy <a rel="nofollow" class="external text" href="https://github.com/drhooves/SelectionTools">makro autorstwa Markusa Hovorki</a> lub alternatywne podej&#347;cie. Wyniki z solvera CalculiX wyra&#378;nie pokazuj&#261; wp&#322;yw sztywnego rdzenia na odpowied&#378; bloku kompozytowego.
</p><p><span id="Geometry"></span>
</p>
<h2><span class="mw-headline" id="Geometria">Geometria</span></h2>
<p>Najpierw utworzymy dwie wsp&oacute;&#322;&#347;rodkowe kostki, jedn&#261; o rozmiarze 10mm a drug&#261; o rozmiarze 5mm. Robimy to w &#347;rodowisku pracy <a href="../pl/Part_Workbench.html" title="Part Workbench/pl">Cz&#281;&#347;&#263;</a>. Domy&#347;lnie sze&#347;cian jest umieszczony w &#347;rodku uk&#322;adu wsp&oacute;&#322;rz&#281;dnych [0,0,0]. wi&#281;c mniejszy sze&#347;cian nale&#380;y przeskalowa&#263; i przesun&#261;&#263; poprzez zmian&#281; ustawie&#324; w zak&#322;adce Dane panelu w&#322;a&#347;ciwo&#347;ci. Aby uczyni&#263; rdze&#324; widocznym, przezroczysto&#347;&#263; zewn&#281;trznego bloku jest ustawiana na 50 w zak&#322;adce Widok <a href="../Property_editor.html" title="Property editor">Edytora w&#322;a&#347;ciwo&#347;ci</a>. Wynik jest pokazany poni&#380;ej.
</p><p><span typeof="mw:File"><a href="../File/Pic1.png" class="mw-file-description"><img src="../File/Pic1.png" decoding="async" width="700" height="351"></a></span>
</p><p>Nast&#281;pnie zaznaczmy dwa bloki w drzewie i utw&oacute;rzmy obiekt BooleanFragments <i>(<b>Cz&#281;&#347;&#263; &rarr; Rozdziel &rarr; Fragmentacja funkcj&#261; logiczn&#261;</b>)</i>. W zak&#322;adce Dane panuelu w&#322;a&#347;ciwo&#347;ci zmie&#324; tryb na Bry&#322;aZ&#322;o&#380;ona <i>(CompSolid)</i>. Teraz zaznacz obiekt BooleanFragments w drzewie modelu i utw&oacute;rz Filtr z&#322;o&#380;e&#324; <i>(<b>Cz&#281;&#347;&#263; &rarr; Z&#322;o&#380;enie &rarr; Filtr z&#322;o&#380;e&#324;</b>)</i>.
</p><p><span typeof="mw:File"><a href="../File/Pic2.png" class="mw-file-description"><img src="../File/Pic2.png" decoding="async" width="700" height="351"></a></span>
</p><p><span id="Mesh_and_Mesh_Regions"></span>
</p>
<h2><span class="mw-headline" id="Siatka_i_obszary_siatki">Siatka i obszary siatki</span></h2>
<p>W &#347;rodowisku pracy MES tworzymy kontener Analiza. B&#281;dzie on zawiera&#322; wszystkie definicje wymagane do analizy w solverze CalculiX i jej wyniki. Zauwa&#380;, &#380;e ten kontener Analiza musi by&#263; aktywowany <i>(kliknij prawym przyciskiem myszy i wybierz "Aktywuj analiz&#281;")</i> przy ka&#380;dym ponownym wczytaniu pliku lub po prze&#322;&#261;czeniu si&#281; z innej analizy. Aby rozpocz&#261;&#263; proces generowania siatki, zaznacz obiekt CompoundFilter w drzewie modelu i aktywuj okno dialogowe <b>Siatka &rarr;  Siatka MES z kszta&#322;tu przy pomocy generatora Gmsh</b>. Opu&#347;&#263; okno dialogowe klikaj&#261;c OK. 
</p><p>Obiekt siatki jest tworzony w drzewie modelu. Zaznacz go i utw&oacute;rz Obszar siatki poprzez <b>Siatka &rarr; Obszar siatki MES</b>. Otw&oacute;rz okno dialogowe dla tego obszaru siatki klikaj&#261;c na nim dwukrotnie i zaznacz przycisk dla Solid. Nast&#281;pnie wci&#347;nij przycisk "Dodaj odniesienie" i wybierz obiekt CompoundFilter w oknie graficznym. Powinno to doda&#263; odniesienie do "CompoundFilter:Solid1" na li&#347;cie obiekt&oacute;w obszaru siatki. Wreszcie, podaj maksymalny rozmiar element&oacute;w dla tego obszaru (tutaj 5mm). Opu&#347;&#263; okno dialogowe klikaj&#261;c OK.
</p><p><span typeof="mw:File"><a href="../File/Pic3.png" class="mw-file-description"><img src="../File/Pic3.png" decoding="async" width="700" height="351"></a></span>
</p><p>Nast&#281;pnie utw&oacute;rz nowy obiekt siatki jak powy&#380;ej i u&#380;yj makra do wskazywania <i>(skr&oacute;t S, E)</i> aby wybra&#263; obiekt Cube_Core w oknie graficznym. Tym razem lista odniesie&#324; powinna pokaza&#263; "CompoundFilter:Solid2", jak poni&#380;ej. Alternatywnie mo&#380;na ukry&#263; obiekt Compound i pokaza&#263; obiekt Cube_Core <i>(rozwijaj&#261;c Compound w drzewie, wybieraj&#261;c ka&#380;dy z nich i naciskaj&#261;c spacj&#281;)</i>. Wybieramy maksymalny rozmiar element&oacute;w 1mm. 
</p><p>Uwaga1: Wyb&oacute;r obiektu "CompoundFilter:Solid2" wymaga wskazania jednej z jego &#347;cian. 
</p><p>Uwaga2: Je&#347;li masz problem z wyborem obiektu "CompoundFilter:Solid2", mo&#380;e to wynika&#263; z pomini&#281;cia ustawienia trybu Bry&#322;aZ&#322;o&#380;ona (CompSolid) w obiekcie BooleanFragments.
</p><p><span typeof="mw:File"><a href="../File/Pic4.png" class="mw-file-description"><img src="../File/Pic4.png" decoding="async" width="700" height="351"></a></span>
</p><p><span id="Material_Assignment"></span>
</p>
<h2><span id="Przypisanie_materia.C5.82u"></span><span class="mw-headline" id="Przypisanie_materia&#322;u">Przypisanie materia&#322;u</span></h2>
<p>Materia&#322; jest przypisywany do obszaru siatki poprzez obiekt SolidMaterial. W tym przyk&#322;adzie przypisujemy dwa materia&#322;y, jeden dla matrycy i jeden dla rdzenia. 
</p><p>Zacznij od zaznaczenia obiektu CompoundFilter w drzewie modelu. Nast&#281;pnie utw&oacute;rz obiekt SolidMaterial poprzez opcj&#281; <b>Model &rarr; Materia&#322; MES dla bry&#322;y</b>. Otw&oacute;rz okno dialogowe i zaznacz przycisk dla Solid, wci&#347;nij "Dodaj odniesienie" i wybierz obiekt CompoundFilter z okna graficznego. Lista odniesie&#324; powinna teraz pokazywa&#263; "CompoundFilter:Solid1", jak poprzednio. Przypisujemy materia&#322; ABS do matrycy, z modu&#322;em Younga oko&#322;o 1% warto&#347;ci dla stali.   
</p><p><span typeof="mw:File"><a href="../File/Pic5.png" class="mw-file-description"><img src="../File/Pic5.png" decoding="async" width="700" height="351"></a></span> 
</p><p>Potw&oacute;rz powy&#380;sz&#261; procedur&#281; dla rdzenia <i>("CompoundFilter:Solid2")</i> z pomoc&#261; makra do zaznaczania lub alternatywnego podej&#347;cia, opisanego wcze&#347;niej. Tym razem przypisujemy materia&#322; CalculiX-Steel, kt&oacute;ry jest znacznie sztywniejszy od materia&#322;u ABS matrycy.
</p><p><span id="Sliding_Support"></span>
</p>
<h2><span class="mw-headline" id="Podpora_przesuwna">Podpora przesuwna</span></h2>
<p>Aby uzyska&#263; stan prostego &#347;cinania dla bloku kompozytowego, nale&#380;y pozostawi&#263; nie zablokowane deformacje na brzegach. &#379;eby to uzyska&#263;, blok jest umieszczany na podporze przesuwnej. Pozostawia to trzy stopnie swobody w p&#322;aszczy&#378;nie podpory (2 translacje i 1 obr&oacute;t) i te stopnie swobody b&#281;d&#261; zwi&#261;zane p&oacute;&#378;niej. <i>(Uwaga: poniewa&#380; p&#322;aszczyzna zapobiega deplanacji &#347;ciany, nadal wprowadza ona drobne wi&#261;zanie, kt&oacute;ry mo&#380;na by wyeliminowa&#263; poprzez inny wyb&oacute;r warunk&oacute;w brzegowych)</i>. Aby utworzy&#263; podpor&#281; przesuwn&#261;, dodaj obiekt FemConstraintDisplacement <i>(<b>Model &rarr; Warunki brzegowe i obci&#261;&#380;enia mechaniczne &rarr; Warunek brzegowy przemieszczenia</b>)</i>. W otwartym oknie dialogowym najpierw wska&#380; &#347;cian&#281;, do kt&oacute;rej warunek b&#281;dzie przy&#322;o&#380;ony a nast&#281;pnie kliknij przycisk Dodaj. Poniewa&#380; blok b&#281;dzie m&oacute;g&#322; si&#281; przesuwa&#263; po p&#322;aszczy&#378;nie x-y, wybierany jest tylko przycisk "Nieruchomy" dla "Przemieszczenie z" a pozosta&#322;e przyciski s&#261; pozostawione jako wolne.
</p><p><span typeof="mw:File"><a href="../File/Pic6.png" class="mw-file-description"><img src="../File/Pic6.png" decoding="async" width="700" height="351"></a></span>
</p><p><span id="Fixed_Nodes"></span>
</p>
<h2><span id="Utwierdzone_w.C4.99z.C5.82y"></span><span class="mw-headline" id="Utwierdzone_w&#281;z&#322;y">Utwierdzone w&#281;z&#322;y</span></h2>
<p>Aby zapobiec ruchowi sztywnemu w p&#322;aszczy&#378;nie przesuwu, trzy niezale&#380;ne stopnie swobody musz&#261; zosta&#263; wyeliminowane. &#379;eby to osi&#261;gn&#261;&#263;, jeden wierzcho&#322;ek w p&#322;aszczy&#378;nie przesuwu jest blokowany w kierunkach x i y (eliminacja 2 stopni swobody) a inny jest blokowany w kierunku x (eliminacja ostatniego stopnia swobody). Do tego celu tworzone s&#261; dwa dodatkowe obiekty FemConstraintDisplacement a efekt jest pokazany poni&#380;ej.
</p><p><span typeof="mw:File"><a href="../File/Pic7.png" class="mw-file-description"><img src="../File/Pic7.png" decoding="async" width="700" height="351"></a></span>
</p><p><span id="Shear_Forces"></span>
</p>
<h2><span id="Si.C5.82y_styczne"></span><span class="mw-headline" id="Si&#322;y_styczne">Si&#322;y styczne</span></h2>
<p>Ostatni etap definicji analizy to zadanie obci&#261;&#380;e&#324;. Aby utworzy&#263; stan prostego &#347;cinania, przyk&#322;adany jest zestaw si&#322; stycznych, jak pokazano poni&#380;ej. Ka&#380;de obci&#261;&#380;enie ma warto&#347;&#263; 1000 N i bior&#261;c pod uwag&#281; kierunki przy&#322;o&#380;enia, r&oacute;wnowaga si&#322; i moment&oacute;w jest osi&#261;gni&#281;ta dla wszystkich translacyjnych i obrotowych stopni swobody. W programie FreeCAD wymaga to dodania czterech obiekt&oacute;w FemConstraintForce <i>(<b>Model &rarr; Warunki brzegowe i obci&#261;&#380;enia mechaniczne &rarr; Obci&#261;&#380;enie si&#322;&#261;</b>)</i> - jeden dla ka&#380;dej &#347;ciany. W otwartym oknie dialogowym najpierw wci&#347;nij przycisk Dodaj odniesienie a nast&#281;pnie wska&#380; &#347;cian&#281;, do kt&oacute;rej ma by&#263; przy&#322;o&#380;ony warunek brzegowy <i>(Uwaga: to inna sekwencja ni&#380; dla FemConstraintDisplacement)</i>. Domy&#347;lnie, tworzy to zestaw si&#322; prostopad&#322;ych do &#347;ciany <i>(si&#322;y normalne)</i>. Aby zmieni&#263; je na styczne, wci&#347;nij przycisk kierunku i wybierz kraw&#281;d&#378; sze&#347;cianu, kt&oacute;ra przebiega w odpowiednim kierunku. Je&#347;li uzyskany zwrot si&#322;y jest nieodpowiedni, mo&#380;na go zmieni&#263; zaznaczaj&#261;c opcj&#281; "Odwr&oacute;&#263; kierunek".
</p><p><span typeof="mw:File"><a href="../File/Pic8.png" class="mw-file-description"><img src="../File/Pic8.png" decoding="async" width="700" height="351"></a></span>
</p><p><span id="CalculiX_Analysis"></span>
</p>
<h2><span class="mw-headline" id="Analiza_w_CalculiX">Analiza w CalculiX</span></h2>
<p>Teraz wszystkie obszary siatki, materia&#322;y i warunki brzegowe s&#261; zdefiniowane i jeste&#347;my gotowi do przeanalizowania deformacji bloku przy pomocy solvera CalculiX. Aktywuj kontener Analiza klikaj&#261;c "Aktywuj analiz&#281;", otw&oacute;rz okno dialogowe CalciliX klikaj&#261;c dwukrotnie na obiekcie CalculiXccxTools i wybierz lokalizacj&#281; dla plik&oacute;w tymczasowych tworzonych przez FreeCAD i CalculiX. Zapisz plik wej&#347;ciowy CalculiX'a i sprawd&#378; czy wyst&#281;puj&#261; ostrze&#380;enia lub b&#322;&#281;dy.  
</p><p><span typeof="mw:File"><a href="../File/PIC9.png" class="mw-file-description"><img src="../File/PIC9.png" decoding="async" width="700" height="351"></a></span>
</p><p>Po tym mo&#380;na uruchomi&#263; analiz&#281; wciskaj&#261;c przycisk Uruchom analiz&#281;. Je&#347;li wszystko p&oacute;jdzie prawid&#322;owo, okno CalculiX'a powinno pokaza&#263; nast&#281;puj&#261;ce wiadomo&#347;ci.
</p><p><span typeof="mw:File"><a href="../File/Pic10.png" class="mw-file-description"><img src="../File/Pic10.png" decoding="async" width="700" height="351"></a></span>
</p><p><span id="CalculiX_Results"></span>
</p>
<h2><span class="mw-headline" id="Wyniki_CalculiX">Wyniki CalculiX</span></h2>
<p>Po uko&#324;czeniu analizy kliknij dwukrotnie na obiekcie "CalculiX_static_results" i wybierz opcj&#281; "Przemieszczenie bezwzgl&#281;dne". Maksymalna warto&#347;&#263; przemieszczenia ~ 0.08mm zostanie wy&#347;wietlona w odpowiednim polu. Poniewa&#380; maksymalne przemieszczenia jest stosunkowo ma&#322;e w por&oacute;wnaniu z wymiarami bloku (&lt;1% rozmiaru bloku), przemieszczenia nale&#380;y przeskalowa&#263;. Mo&#380;na to zrobi&#263; pod napisem "Przemieszczenie", zaznaczaj&#261;c przycisk "Poka&#380;" i skaluj&#261;c przemieszczenie np. wsp&oacute;&#322;czynnikiem 20. Maksymalne przemieszczenie b&#281;dzie teraz przesadzone do ok. 20% rozmiaru bloku. Po zamkni&#281;ciu okna dialogowego, zdeformowana siatka mo&#380;e by&#263; ponownie wy&#347;wietlona poprzez zaznaczenie obiektu Result_mesh i wci&#347;ni&#281;cie klawisza Spacja. 
</p><p><span typeof="mw:File"><a href="../File/Figure_11_Deformed_Mesh.png" class="mw-file-description"><img src="../File/Figure_11_Deformed_Mesh.png" decoding="async" width="700" height="351"></a></span>
</p><p>Aby sprawdzi&#263; deformacj&#281; rdzenia, musimy przeci&#261;&#263; blok. Mo&#380;na tego dokona&#263; tworz&#261;c filtr przycinania. Aby aktywowa&#263; t&#261; funkcjonalno&#347;&#263;, najpierw musimy utworzy&#263; "obiekt prezentacji graficznej wynik&oacute;w" poprzez zaznaczenie obiektu "CalculiX_static_results" i wybranie opcji <b>Wyniki &rarr; Prezentacja graficzna wynik&oacute;w</b> z menu. Nast&#281;pnie, z zaznaczonym obiektem prezentacji graficznej wynik&oacute;w, utw&oacute;rz filtr wizualizacji deformacji (Wyniki &rarr; Filtr wizualizacji deformacji), ustaw Wektor=Displacement i Warto&#347;&#263;=20 aby przeskalowa&#263; przemieszczenie oraz Tryb = "Surface with Edges", Pole = "Displacement", Wektor = "Magnitude" aby pokaza&#263; kontury przemieszczenia. Wcisnij Zastosuj i OK. Jako ostatni krok, dodaj Filtr przyci&#281;cia obszaru (Wyniki &rarr; Filtr przyci&#281;cie obszaru) i utw&oacute;rz p&#322;aszczyzn&#281; z pocz&#261;tkiem [5.0,2.5,5.0] i kierunkiem normalnym [0,1,0], tj. na &#347;cianie rdzenia z kierunkiem normalnym w osi y. Zaznacz przycisk "Wytnij kom&oacute;rki" aby uzyska&#263; g&#322;adk&#261; powierzchni&#281;. Jak poprzednio, ustaw Tryb = "Surface with Edges", Pole = "Displacement", Wektor = "Magnitude" aby pokaza&#263; kontury przemieszczenia. Wci&#347;nij Zastosuj i OK. Wreszcie, wy&#322;&#261;cz widoczno&#347;&#263; Filtra przyci&#281;cia obszaru aby pokaza&#263; tylko blok przeci&#281;cia. 
</p><p><span typeof="mw:File"><a href="../File/Figure12_Deformed_Mesh_Clipped_View_(2).png" class="mw-file-description"><img src="../File/Figure12_Deformed_Mesh_Clipped_View_%282%29.png" decoding="async" width="700" height="351"></a></span>
</p><p>Na podstawie wynik&oacute;w mo&#380;na &#322;atwo wywnioskowa&#263;, &#380;e rdze&#324; pozostaje w wi&#281;kszo&#347;ci niezdeformowany i pomaga oprze&#263; si&#281; deformacji mi&#281;kkiej matrycy (por&oacute;wnaj k&#261;t &#347;ci&#281;cia niebieskiej cz&#281;&#347;ci z k&#261;tem &#347;ci&#281;cia zielonej cz&#281;&#347;ci). Wida&#263; te&#380; jednak, &#380;e w warunkach prostego &#347;cinania, &#347;ciany kompozytowego bloku ulegaj&#261; wypaczeniu, co sugeruje, &#380;e podpora przesuwna na podstawie sze&#347;cianu to nieodpowiedni warunek brzegowy.
</p><p><span id="Further_work"></span>
</p>
<h2><span class="mw-headline" id="Dalsza_praca">Dalsza praca</span></h2>
<p>Nast&#281;puj&#261;ce wyzwania mog&#261; by&#263; ciekawe jako dalsze &#263;wiczenia:
</p><p>1) Poprawa warunku brzegowego z podpory przesuwnej
</p><p>2) Spr&oacute;buj utworzy&#263; warunki kontaktu mi&#281;dzy rdzeniem i matryc&#261; aby zobaczy&#263; czy wyst&#281;puje separacja
</p><p>Plik programu FreeCAD dla tego przyk&#322;adu jest za&#322;&#261;czony poni&#380;ej jako punkt wyj&#347;cia.
</p><p><a rel="nofollow" class="external free" href="https://forum.freecadweb.org/viewtopic.php?f=18&amp;t=26517&amp;start=20">https://forum.freecadweb.org/viewtopic.php?f=18&amp;t=26517&amp;start=20</a>
</p><p>Baw si&#281; dobrze&nbsp;!
</p><p><br>
</p>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: #fefefe;"><span typeof="mw:File"><a href="../File/Workbench_FEM.svg" class="mw-file-description"><img src="../File/Workbench_FEM.svg" decoding="async" width="24" height="24"></a></span> <a href="../pl/FEM_Workbench.html" title="FEM Workbench/pl">&#346;rodowisko pracy MES</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid #aaaaaa; text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: #fefefe;">
<ul><li><a href="../pl/FEM_Analysis.html" title="FEM Analysis/pl">Analiza MES</a></li></ul>
<ul><li><b>Materia&#322;:</b> <a href="../pl/FEM_MaterialSolid.html" title="FEM MaterialSolid/pl">Bry&#322;a</a>, <a href="../pl/FEM_MaterialFluid.html" title="FEM MaterialFluid/pl">Ciecz</a>, <a href="../pl/FEM_MaterialMechanicalNonlinear.html" title="FEM MaterialMechanicalNonlinear/pl">Nieliniowy materia&#322; mechaniczny</a>, <a href="../pl/FEM_MaterialReinforced.html" title="FEM MaterialReinforced/pl">Materia&#322; zbrojony (beton)</a>, <a href="../pl/FEM_MaterialEditor.html" title="FEM MaterialEditor/pl">Edytor materia&#322;u</a></li></ul>
<ul><li><b>Geometria elementu:</b> <a href="../pl/FEM_ElementGeometry1D.html" title="FEM ElementGeometry1D/pl">Geometria elementu</a>, <a href="../pl/FEM_ElementRotation1D.html" title="FEM ElementRotation1D/pl">Obr&oacute;t w ok&oacute;&#322; osi</a>, <a href="../pl/FEM_ElementGeometry2D.html" title="FEM ElementGeometry2D/pl">Geometria elementu 2D</a>, <a href="../pl/FEM_ElementFluid1D.html" title="FEM ElementFluid1D/pl">Element przep&#322;ywu</a></li></ul>
<hr>
<p><b>Wi&#261;zania</b>
</p>
<ul><li><b>Elektromagnetyczne:</b> <a href="../pl/FEM_ConstraintElectrostaticPotential.html" title="FEM ConstraintElectrostaticPotential/pl">Potencja&#322; elektryczny</a>, <a href="../pl/FEM_ConstraintCurrentDensity.html" title="FEM ConstraintCurrentDensity/pl">G&#281;sto&#347;&#263; pr&#261;du</a>, <a href="../pl/FEM_ConstraintMagnetization.html" title="FEM ConstraintMagnetization/pl">Magnetyzacja</a></li></ul>
<ul><li><b>Ciecz:</b> <a href="../pl/FEM_ConstraintInitialFlowVelocity.html" title="FEM ConstraintInitialFlowVelocity/pl">Warunek pocz&#261;tkowy pr&#281;dko&#347;ci przep&#322;ywu</a>, <a href="../pl/FEM_ConstraintInitialPressure.html" title="FEM ConstraintInitialPressure/pl">Ci&#347;nienie pocz&#261;tkowe</a>, <a href="../pl/FEM_ConstraintFlowVelocity.html" title="FEM ConstraintFlowVelocity/pl">Pr&#281;dko&#347;&#263; przep&#322;ywu</a></li></ul>
<ul><li><b>Geometryczne:</b> <a href="../pl/FEM_ConstraintPlaneRotation.html" title="FEM ConstraintPlaneRotation/pl">Obr&oacute;t w p&#322;aszczy&#378;nie</a>, <a href="../pl/FEM_ConstraintSectionPrint.html" title="FEM ConstraintSectionPrint/pl">Zapis wynik&oacute;w z przekroju</a>, <a href="../pl/FEM_ConstraintTransform.html" title="FEM ConstraintTransform/pl">Zdefiniuj odkszta&#322;cenie</a></li></ul>
<ul><li><b>Mechaniczne:</b> <a href="../pl/FEM_ConstraintFixed.html" title="FEM ConstraintFixed/pl">Zdefiniuj przytwierdzenie</a>, <a href="../pl/FEM_ConstraintDisplacement.html" title="FEM ConstraintDisplacement/pl">Zdefiniuj przemieszczenie</a>, <a href="../pl/FEM_ConstraintContact.html" title="FEM ConstraintContact/pl">Zdefiniuj kontakt</a>, <a href="../pl/FEM_ConstraintTie.html" title="FEM ConstraintTie/pl">Zdefiniuj powi&#261;zanie</a>, <a href="../pl/FEM_ConstraintSpring.html" title="FEM ConstraintSpring/pl">Wi&#261;zanie spr&#281;&#380;yny</a>, <a href="../pl/FEM_ConstraintForce.html" title="FEM ConstraintForce/pl">Zdefiniuj si&#322;&#281;</a>, <a href="../pl/FEM_ConstraintPressure.html" title="FEM ConstraintPressure/pl">Zdefiniuj obci&#261;&#380;enie ci&#347;nieniem</a>, <a href="../pl/FEM_ConstraintCentrif.html" title="FEM ConstraintCentrif/pl">Zdefiniuj si&#322;&#281; od&#347;rodkow&#261;</a>, <a href="../pl/FEM_ConstraintSelfWeight.html" title="FEM ConstraintSelfWeight/pl">Zdefiniuj obci&#261;&#380;enie ci&#281;&#380;arem w&#322;asnym</a></li></ul>
<ul><li><b>Termiczne:</b> <a href="../pl/FEM_ConstraintInitialTemperature.html" title="FEM ConstraintInitialTemperature/pl">Warunek pocz&#261;tkowy temperatury</a>, <a href="../pl/FEM_ConstraintHeatflux.html" title="FEM ConstraintHeatflux/pl">Zdefiniuj strumie&#324; ciep&#322;a</a>, <a href="../pl/FEM_ConstraintTemperature.html" title="FEM ConstraintTemperature/pl">Zdefiniuj temperatur&#281;</a>, <a href="../pl/FEM_ConstraintBodyHeatSource.html" title="FEM ConstraintBodyHeatSource/pl">Zdefiniuj obj&#281;to&#347;ciowe &#378;r&oacute;d&#322;o ciep&#322;a</a></li></ul>
<ul><li><b>Zmieniaj&#261;ce wi&#261;zania:</b> <a href="../pl/FEM_ConstantVacuumPermittivity.html" title="FEM ConstantVacuumPermittivity/pl">Zdefiniuj przenikalno&#347;&#263; elektryczn&#261; pr&oacute;&#380;ni</a></li></ul>
<hr>
<ul><li><b>Siatki:</b> <a href="../pl/FEM_MeshNetgenFromShape.html" title="FEM MeshNetgenFromShape/pl">Siatka Netgen</a>, <a href="../pl/FEM_MeshGmshFromShape.html" title="FEM MeshGmshFromShape/pl">Siatka GMSH</a>, <a href="../pl/FEM_MeshBoundaryLayer.html" title="FEM MeshBoundaryLayer/pl">Warstwa graniczna siatki</a>, <a href="../pl/FEM_MeshRegion.html" title="FEM MeshRegion/pl">Obszar siatki</a>, <a href="../pl/FEM_MeshGroup.html" title="FEM MeshGroup/pl">Grupa siatki</a>, <a href="../pl/FEM_CreateNodesSet.html" title="FEM CreateNodesSet/pl">Utw&oacute;rz zestaw w&#281;z&#322;&oacute;w</a>, <a href="../pl/FEM_FemMesh2Mesh.html" title="FEM FemMesh2Mesh/pl">Siatka MES na obiekt &#347;rodowiska Siatka</a></li></ul>
<ul><li><b>Solver:</b> <a href="../pl/FEM_SolverCalculixCxxtools.html" title="FEM SolverCalculixCxxtools/pl">Narz&#281;dzia CalculiX</a>, <a href="../pl/FEM_SolverElmer.html" title="FEM SolverElmer/pl">Elmer</a>, <a href="../pl/FEM_SolverMystran.html" title="FEM SolverMystran/pl">Mystran</a>, <a href="../pl/FEM_SolverZ88.html" title="FEM SolverZ88/pl">Z88</a>; <b>R&oacute;wnania:</b> <a href="../pl/FEM_EquationElasticity.html" title="FEM EquationElasticity/pl">Elastyczno&#347;ci</a>, <a href="../pl/FEM_EquationElectrostatic.html" title="FEM EquationElectrostatic/pl">Elektrostatyczne</a>, <a href="../pl/FEM_EquationElectricforce.html" title="FEM EquationElectricforce/pl">Si&#322;y elektrostatycznej</a>, <a href="../pl/FEM_EquationMagnetodynamic.html" title="FEM EquationMagnetodynamic/pl">Magnetodynamiczne</a>, <a href="../pl/FEM_EquationMagnetodynamic2D.html" title="FEM EquationMagnetodynamic2D/pl">RMagnetodynamiczne 2D</a>, <a href="../pl/FEM_EquationFlow.html" title="FEM EquationFlow/pl">Przep&#322;ywu</a>, <a href="../pl/FEM_EquationFlux.html" title="FEM EquationFlux/pl">Strumienia</a>, <a href="../pl/FEM_EquationHeat.html" title="FEM EquationHeat/pl">Ciep&#322;a</a>; <b>Solver:</b> <a href="../pl/FEM_SolverControl.html" title="FEM SolverControl/pl">Kontrola pracy solvera</a>, <a href="../pl/FEM_SolverRun.html" title="FEM SolverRun/pl">Uruchom solver</a></li></ul>
<ul><li><b>Wyniki:</b> <a href="../pl/FEM_ResultsPurge.html" title="FEM ResultsPurge/pl">Oczyszczanie z wynik&oacute;w</a>, <a href="../pl/FEM_ResultShow.html" title="FEM ResultShow/pl">Prezentacja wynik&oacute;w</a>; <b>Postprocessing:</b> <a href="../pl/FEM_PostApplyChanges.html" title="FEM PostApplyChanges/pl">Zastosuj zmiany</a>, <a href="../pl/FEM_PostPipelineFromResult.html" title="FEM PostPipelineFromResult/pl">Prezentacja graficzna</a>, <a href="../pl/FEM_PostFilterWarp.html" title="FEM PostFilterWarp/pl">Filtr rozpraszaj&#261;cy</a>, <a href="../pl/FEM_PostFilterClipScalar.html" title="FEM PostFilterClipScalar/pl">Skalarny filtr obcinaj&#261;cy</a>, <a href="../pl/FEM_PostFilterCutFunction.html" title="FEM PostFilterCutFunction/pl">Filtr odci&#281;cia funkcji</a>, <a href="../pl/FEM_PostFilterClipRegion.html" title="FEM PostFilterClipRegion/pl">Filtr odci&#281;cia obszaru</a>, <a href="../pl/FEM_PostFilterContours.html" title="FEM PostFilterContours/pl">Filtr kontur&oacute;w</a>, <a href="../pl/FEM_PostFilterDataAlongLine.html" title="FEM PostFilterDataAlongLine/pl">Filtr danych wzd&#322;u&#380; linii</a>, <a href="../pl/FEM_PostFilterLinearizedStresses.html" title="FEM PostFilterLinearizedStresses/pl">Wykres liniowo&#347;ci napr&#281;&#380;e&#324;</a>, <a href="../pl/FEM_PostFilterDataAtPoint.html" title="FEM PostFilterDataAtPoint/pl">Filtr obcinania danych w punkcie</a>, <a href="../pl/FEM_PostCreateFunctions.html" class="mw-redirect" title="FEM PostCreateFunctions/pl">Utw&oacute;rz funkcj&#281;</a>, <a href="../pl/FEM_PostCreateFunctionPlane.html" title="FEM PostCreateFunctionPlane/pl">Filtr funkcji p&#322;aszczyzny</a>, <a href="../pl/FEM_PostCreateFunctionSphere.html" title="FEM PostCreateFunctionSphere/pl">Filtr funkcji sfery</a>, <a href="../pl/FEM_PostCreateFunctionCylinder.html" title="FEM PostCreateFunctionCylinder/pl">Filtr funkcji walca</a>, <a href="../pl/FEM_PostCreateFunctionBox.html" title="FEM PostCreateFunctionBox/pl">Filtr funkcji prostopad&#322;o&#347;cianu</a></li></ul>
<ul><li><b>Narz&#281;dzia:</b> <a href="../pl/FEM_ClippingPlaneAdd.html" title="FEM ClippingPlaneAdd/pl">P&#322;aszczyzna tn&#261;ca</a>, <a href="../pl/FEM_ClippingPlaneRemoveAll.html" title="FEM ClippingPlaneRemoveAll/pl">Usu&#324; p&#322;aszczyzn&#281; tn&#261;ca</a>, <a href="../pl/FEM_Examples.html" title="FEM Examples/pl">Przyk&#322;ady</a>; <a href="../pl/FEM_MeshClear.html" title="FEM MeshClear/pl">Usu&#324; siatk&#281;</a>, <a href="../pl/FEM_MeshDisplayInfo.html" title="FEM MeshDisplayInfo/pl">Informacje o siatce</a></li></ul>
<hr>
<ul><li><b>Dodatkowe:</b> <a href="../pl/FEM_Preferences.html" title="FEM Preferences/pl">Konfiguracja</a>, <a href="../pl/FEM_Install.html" title="FEM Install/pl">Instalacja &#347;rodowiska MES</a>, <a href="../pl/FEM_Mesh.html" title="FEM Mesh/pl">Siatka</a>, <a href="../pl/FEM_Solver.html" title="FEM Solver/pl">FEM Solver</a>, <a href="../pl/FEM_CalculiX.html" title="FEM CalculiX/pl">CalculiX</a>, <a href="../pl/FEM_Concrete.html" title="FEM Concrete/pl">Beton</a>, <a href="../pl/FEM_Element_Types.html" title="FEM Element Types/pl">Rodzaje element&oacute;w</a></li></ul></div>
    </div></div>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: #fefefe;"><span typeof="mw:File"><a href="../File/User_hub.png" class="mw-file-description"><img src="../File/User_hub.png" decoding="async" width="24" height="24"></a></span> <a href="../pl/User_hub.html" title="User hub/pl">Centrum u&#380;ytkownika</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid #aaaaaa; text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: #fefefe;">
<ul><li><b><a href="../pl/Getting_started.html" title="Getting started/pl">Jak zacz&#261;&#263;</a></b></li>
<li><b>Instalacja:</b> <a href="../pl/Download.html" title="Download/pl">Pobieranie programu</a>, <a href="../pl/Installing_on_Windows.html" title="Installing on Windows/pl">Windows</a>, <a href="../pl/Installing_on_Linux.html" title="Installing on Linux/pl">Linux</a>, <a href="../pl/Installing_on_Mac.html" title="Installing on Mac/pl">Mac</a>, <a href="../pl/Installing_additional_components.html" title="Installing additional components/pl">Dodatkowych komponent&oacute;w</a>, <a href="../pl/Compile_on_Docker.html" title="Compile on Docker/pl">Docker</a>, <a href="../pl/AppImage.html" title="AppImage/pl">AppImage</a>, <a href="../pl/Ubuntu_Snap.html" title="Ubuntu Snap/pl">Ubuntu Snap</a></li>
<li><b>Podstawy:</b> <a href="../pl/About_FreeCAD.html" title="About FreeCAD/pl">Informacje na temat FreeCAD</a>, <a href="../pl/Interface.html" title="Interface/pl">Interfejs u&#380;ytkownika</a>, <a href="../pl/Mouse_navigation.html" title="Mouse navigation/pl">Profil nawigacji myszk&#261;</a>, <a href="../pl/Selection_methods.html" title="Selection methods/pl">Metody wyboru</a>, <a href="../pl/Object_name.html" title="Object name/pl">Nazwa obiektu</a>, <a href="../pl/Preferences_Editor.html" title="Preferences Editor/pl">Edytor ustawie&#324;</a>, <a href="../pl/Workbenches.html" title="Workbenches/pl">&#346;rodowiska pracy</a>, <a href="../pl/Document_structure.html" title="Document structure/pl">Struktura dokumentu</a>, <a href="../pl/Property.html" title="Property/pl">W&#322;a&#347;ciwo&#347;ci</a>, <a href="../pl/Help_FreeCAD.html" title="Help FreeCAD/pl">Pom&oacute;&#380; w rozwoju FreeCAD</a>, <a href="../pl/Donate.html" title="Donate/pl">Dotacje</a></li></ul>
<hr>
<ul><li><b>Pomoc:</b> <a href="../pl/Tutorials.html" title="Tutorials/pl">Poradniki</a>, <a href="../pl/Video_tutorials.html" title="Video tutorials/pl">Wideo poradniki</a></li>
<li><b><a href="../pl/Workbenches.html" title="Workbenches/pl">&#346;rodowiska pracy</a>:</b> <a href="../pl/Std_Base.html" title="Std Base/pl">Strona Startowa</a>, <a href="../pl/Assembly_Workbench.html" title="Assembly Workbench/pl">Z&#322;o&#380;enie</a>, <a href="../pl/Arch_Workbench.html" title="Arch Workbench/pl">BIM</a>, <a href="../pl/CAM_Workbench.html" title="CAM Workbench/pl">CAM</a>, <a href="../pl/Draft_Workbench.html" title="Draft Workbench/pl">Rysunek Roboczy</a>, <a href="../pl/FEM_Workbench.html" title="FEM Workbench/pl">MES</a>, <a href="../pl/Inspection_Workbench.html" title="Inspection Workbench/pl">Inspekcja</a>, <a href="../pl/Mesh_Workbench.html" title="Mesh Workbench/pl">Siatka</a>, <a href="../pl/OpenSCAD_Workbench.html" title="OpenSCAD Workbench/pl">OpenSCAD</a>, <a href="../pl/Part_Workbench.html" title="Part Workbench/pl">Cz&#281;&#347;&#263;</a>, <a href="../pl/PartDesign_Workbench.html" title="PartDesign Workbench/pl">Projekt Cz&#281;&#347;ci</a>, <a href="../pl/Points_Workbench.html" title="Points Workbench/pl">Punkty</a>, <a href="../pl/Reverse_Engineering_Workbench.html" title="Reverse Engineering Workbench/pl">In&#380;ynieria Wsteczna</a>, <a href="../pl/Robot_Workbench.html" title="Robot Workbench/pl">Robot</a>, <a href="../pl/Sketcher_Workbench.html" title="Sketcher Workbench/pl">Szkicownik</a>, <a href="../pl/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/pl">Arkusz Kalkulacyjny</a>, <a href="../pl/Surface_Workbench.html" title="Surface Workbench/pl">Powierzchnia 3D</a>, <a href="../pl/TechDraw_Workbench.html" title="TechDraw Workbench/pl">Rysunek Techniczny</a>, <a href="../pl/Testing.html" title="Testing/pl">Test Framework</a></li></ul>
<hr>
<ul><li><b><a href="../pl/Addon.html" title="Addon/pl">Dodatki</a>:</b> <a href="../pl/Std_AddonMgr.html" title="Std AddonMgr/pl">Menad&#380;er dodatk&oacute;w</a>, <a href="../pl/External_workbenches.html" title="External workbenches/pl">Zewn&#281;trzne &#347;rodowiska pracy</a>, <a href="../pl/Scripting_and_macros.html" title="Scripting and macros/pl">Skrypty i makrodefinicje</a></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="../pl/User_hub.html" title="User hub/pl">Centrum u&#380;ytkownika</a>, <a href="../pl/Power_users_hub.html" title="Power users hub/pl">Centrum Power u&#380;ytkownika</a>, <a href="../pl/Developer_hub.html" title="Developer hub/pl">Centrum programisty</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20250103130537
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc, no&#8208;toc&#8208;conversion]
CPU time usage: 0.098 seconds
Real time usage: 0.120 seconds
Preprocessor visited node count: 195/1000000
Post&#8208;expand include size: 17595/2097152 bytes
Template argument size: 6915/2097152 bytes
Highest expansion depth: 5/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1759/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   11.450      1 -total
 61.69%    7.064      1 Template:FEM_Tools_navi/pl
 27.20%    3.115      1 Template:TutorialInfo/pl
 17.38%    1.990      2 Template:Navigation_menu_2
  9.00%    1.030      1 Template:Userdocnavi/pl
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:248097-0!canonical and timestamp 20250103130537 and revision id 1528175. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>