<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">FEM Geometry Preparation and Meshing/pl</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="pl" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-FEM+Geometry+Preparation+and+Meshing&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/FEM_Geometry_Preparation_and_Meshing.html" class="mw-pt-progress mw-pt-progress--med" title="FEM Geometrie vorbereiten und vernetzen (43% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../FEM_Geometry_Preparation_and_Meshing.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="FEM Geometry Preparation and Meshing (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../fr/FEM_Geometry_Preparation_and_Meshing.html" class="mw-pt-progress mw-pt-progress--high" title="FEM Pr&eacute;paration de la g&eacute;om&eacute;trie et maillage (99% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--high" lang="pl" dir="ltr">polski</span></li>
<li><a href="../ru/FEM_Geometry_Preparation_and_Meshing.html" class="mw-pt-progress mw-pt-progress--low" title="&#1052;&#1050;&#1069; &#1055;&#1086;&#1076;&#1075;&#1086;&#1090;&#1086;&#1074;&#1082;&#1072; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080; &#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1089;&#1077;&#1090;&#1082;&#1080; (1% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li></ul></div>
<table class="fcinfobox wikitable ct" style="width: 230px; float: right; margin-left: 1em">
<tbody><tr>
<td class="ctTitle" style="font-weight: bold; font-size: 125%;"><span typeof="mw:File"><span><img src="../File/Freecad.svg" decoding="async" width="32" height="32" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span> &#262;wiczenie
</td></tr>
<tr>
<th class="ctOdd">Temat
</th></tr>
<tr>
<td class="ctEven">Analiza MES
</td></tr>
<tr>
<th class="ctOdd">Poziom trudno&#347;ci
</th></tr>
<tr>
<td class="ctEven">pocz&#261;tkuj&#261;cy
</td></tr>
<tr>
<th class="ctOdd">Czas wykonania
</th></tr>
<tr>
<td class="ctEven">Nie dotyczy
</td></tr>
<tr>
<th class="ctOdd">Autorzy
</th></tr>
<tr>
<td class="ctEven"><a rel="nofollow" class="external text" href="https://www.freecad.org/wiki/index.php?title=User:NewJoker">NewJoker</a>
</td></tr>
<tr>
<th class="ctOdd">Wersja FreeCAD
</th></tr>
<tr>
<td class="ctEven">1.0 lub nowszy
</td></tr>
<tr>
<th class="ctOdd">Pliki z przyk&#322;adami
</th></tr>
<tr>
<td class="ctEven"><i>Nie do&#322;&#261;czono</i>
</td></tr>
<tr>
<th class="ctOdd">Zobacz r&oacute;wnie&#380;
</th></tr>
<tr>
<td class="ctEven"><a href="../pl/FEM_Workbench.html" title="FEM Workbench/pl">&#347;rodowisko pracy MES</a>
</td></tr>
<tr>
<td class="ctToc"><br><meta property="mw:PageProp/toc">
</td></tr></tbody></table>
<p><span id="Background"></span>
</p>
<h2><span class="mw-headline" id="Kontekst">Kontekst</span></h2>
<p>Przygotowanie geometrii i tworzenie siatek to kluczowe elementy preprocessingu symulacji MES <i>(metoda element&oacute;w sko&#324;czonych)</i>. Podczas gdy &#322;atwo dost&#281;pne oprogramowanie do analiz po&#322;&#261;czone ze &#347;rodowiskiem CAD <i>(takie jak <a href="../pl/FEM_Workbench.html" title="FEM Workbench/pl">&#347;rodowisko pracy MES</a> we FreeCAD)</i> zach&#281;ca do przeprowadzania symulacji na nowych projektach bez &#380;adnych przygotowa&#324;, nale&#380;y pami&#281;ta&#263;, &#380;e MES to zaawansowana metoda i wymaga odpowiednio przygotowanej geometrii i siatki aby zapewni&#263; prawid&#322;owe wyniki. Stara zasada <a rel="nofollow" class="external text" href="https://pl.wikipedia.org/wiki/Garbage_in,_garbage_out"><i>garbage in, garbage out</i></a> <i>(&#347;mieci na wej&#347;ciu - &#347;mieci na wyj&#347;ciu)</i> jest tu szczeg&oacute;lnie istotna. S&#261; jeszcze inne istotne ustawienia, od kt&oacute;rych w znacz&#261;cym stopniu zale&#380;y dok&#322;adno&#347;&#263; analiz MES <i>(takie jak w&#322;a&#347;ciwo&#347;ci materia&#322;&oacute;w i warunki brzegowe)</i>, ale pierwsze etapy i jedne z najcz&#281;stszych &#378;r&oacute;de&#322; b&#322;&#281;d&oacute;w to w&#322;a&#347;nie przygotowanie geometrii i tworzenie siatek, opisane na tej stronie.
</p><p><span id="Types_of_geometry_used_for_FEM_in_FreeCAD"></span>
</p>
<h2><span id="Typy_geometrii_u.C5.BCywanej_do_analiz_MES_we_FreeCAD"></span><span class="mw-headline" id="Typy_geometrii_u&#380;ywanej_do_analiz_MES_we_FreeCAD">Typy geometrii u&#380;ywanej do analiz MES we FreeCAD</span></h2>
<ul><li>Linie - u&#380;ywane w analizach z elementami belkowymi</li>
<li>Powierzchnie - u&#380;ywane w analizach z elementami pow&#322;okowymi i 2D (p&#322;aski stan napr&#281;&#380;e&#324;/odkszta&#322;ce&#324; i osiowosymetryczne)</li>
<li>Bry&#322;y - u&#380;ywane w analizach z elementami bry&#322;owymi</li></ul>
<p><span id="Choice_of_the_type_of_geometry"></span>
</p>
<h2><span id="Wyb.C3.B3r_typu_geometrii"></span><span class="mw-headline" id="Wyb&oacute;r_typu_geometrii">Wyb&oacute;r typu geometrii</span></h2>
<p>Podczas gdy wi&#281;kszo&#347;&#263; modeli CAD sk&#322;ada si&#281; z bry&#322;, cz&#281;sto bardzo zalecane jest u&#380;ycie linii i powierzchni w analizach MES je&#347;li pozwala na to dana konstrukcja:
</p>
<ul><li>je&#347;li cz&#281;&#347;&#263; jest smuk&#322;a <i>(d&#322;uga i w&#261;ska)</i> i przypomina belk&#281; oraz ma regularny przekr&oacute;j nale&#380;&#261;cy do jednego z obecnie wspieranych typ&oacute;w przekroj&oacute;w belkowych <i>(prostok&#261;tny, okr&#261;g&#322;y lub rurowy)</i> to powinna by&#263; liczona z u&#380;yciem element&oacute;w belkowych <i>(chyba &#380;e wyst&#281;puj&#261; pewne specyficzne formy obci&#261;&#380;enia, odpowiedzi lub detale geometrii, kt&oacute;rych nie mo&#380;na pomin&#261;&#263;, a kt&oacute;re sprawiaj&#261;, &#380;e to za&#322;o&#380;enie upraszczaj&#261;ce jest nieprawdziwe)</i>. Nale&#380;y po prostu narysowa&#263; lini&#281; &#347;rodkow&#261; <i>(kilka rad na temat jej uzyskiwania z istniej&#261;cej geometrii bry&#322;owej mo&#380;na znale&#378;&#263; w <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=81589">tym w&#261;tku na forum</a> - w skr&oacute;cie, u&#380;yj <a href="../pl/Draft_Wire.html" title="Draft Wire/pl">Polilinii</a> lub <a href="../pl/Draft_BSpline.html" title="Draft BSpline/pl">Krzywej z&#322;o&#380;oej</a> z odpowiednim <a href="../pl/Draft_Workbench.html#Pasek_narz%C4%99dzi_Rysunek_roboczy:_Przyci%C4%85gnij" title="Draft Workbench/pl">przyci&#261;ganiem</a> i <a href="../pl/Draft_Line.html" title="Draft Line/pl">liniami</a> jako geometriami pomocniczymi)</i> i zdefiniowa&#263; odpowiedni <a href="../pl/FEM_ElementGeometry1D.html" title="FEM ElementGeometry1D/pl">przekr&oacute;j belki</a> z opcjonalnym <a href="../pl/FEM_ElementRotation1D.html" title="FEM ElementRotation1D/pl">obrotem</a>. Nie ma jednej przyj&#281;tej zasady kiedy mo&#380;na u&#380;ywa&#263; element&oacute;w belkowych, ale cz&#281;sto zaleca si&#281; aby wymiary przekroju by&#322;y &lt; 1/10 d&#322;ugo&#347;ci cz&#281;&#347;ci &#380;eby mo&#380;na by&#322;o zastosowa&#263; teori&#281; belek.</li></ul>
<p><span typeof="mw:File"><a href="../index.php?title=FEM_beam_model.JPG&amp;filetimestamp=20231228195452&amp;.html" class="mw-file-description"><img src="../File/FEM_beam_model.JPG" decoding="async" width="600" height="233" class="mw-file-element" data-file-width="1104" data-file-height="429"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Smuk&#322;a cz&#281;&#347;&#263; nadaj&#261;ca si&#281; do analizy przy pomocy element&oacute;w belkowych - pod&#347;wietlona linia &#347;rodkowa</p>
<ul><li>je&#347;li cz&#281;&#347;&#263; jest cienko&#347;cienna <i>(np. konstrukcje blachowe)</i> to powinna by&#263; liczona z u&#380;yciem element&oacute;w pow&#322;okowych <i>(chyba, &#380;e potrzebne s&#261; dok&#322;adne wyniki zwi&#261;zane z kontaktem lub problem stanowi&#261; pewne ograniczenia element&oacute;w pow&#322;okowych)</i>. Jest to bardzo istotne i cz&#281;sto pomijane. Do uzyskania odpowiedniej dok&#322;adno&#347;ci wynik&oacute;w <i>(zw&#322;aszcza gdy wyst&#281;puje zginanie)</i> potrzeba kilku element&oacute;w <i>(co najmniej 3-5)</i> po grubo&#347;ci. W przypadku cz&#281;&#347;ci cienko&#347;ciennych, zwykle prowadzi to do uzyskania du&#380;ych siatek <i>(szczeg&oacute;lnie gdy u&#380;ywane s&#261; elementy czworo&#347;cienne, poniewa&#380; sze&#347;cio&#347;cienne nie mog&#261; by&#263; wygenerowane we FreeCAD)</i> i znacznego zwi&#281;kszenia kosztu oblicze&#324; <i>(wymaganej mocy komputera i czasu analizy)</i>. Aby uzyska&#263; geometri&#281; odpowiedni&#261; do analizy z u&#380;yciem element&oacute;w pow&#322;okowych, nale&#380;y narysowa&#263; powierzchni&#281; &#347;rodkow&#261; cz&#281;&#347;ci <i>(kilka rad na temat jej uzyskiwania z istniej&#261;cej geometrii bry&#322;owej mo&#380;na znale&#378;&#263; w <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=67505">tym w&#261;tku na forum</a>, <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=71821">tym</a> oraz <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=81834">tym</a> - w skr&oacute;cie, u&#380;yj <a href="../pl/PartDesign_SubShapeBinder.html" title="PartDesign SubShapeBinder/pl">&#321;&#261;cznika kszta&#322;t&oacute;w podrz&#281;dnych</a> lub <a href="../pl/Draft_Facebinder.html" title="Draft Facebinder/pl">&#321;&#261;cznika kszta&#322;tu</a> a nast&#281;pnie <a href="../pl/Part_Offset.html" title="Part Offset/pl">Odsuni&#281;cia 3D</a> i wreszcie &#321;&#261;cznika kszta&#322;t&oacute;w podrz&#281;dnych i <a href="../pl/Part_Extrude.html" title="Part Extrude/pl">Wyci&#261;gni&#281;cia</a> do wyd&#322;u&#380;enia kraw&#281;dzi powierzchni &#347;rodkowych aby zamkn&#261;&#263; przerwy mi&#281;dzy nimi)</i> i zdefiniowa&#263; odpowiedni&#261; <a href="../pl/FEM_ElementGeometry2D.html" title="FEM ElementGeometry2D/pl">grubo&#347;&#263;</a>. Tu r&oacute;wnie&#380; nie ma jednej przyj&#281;tej zasady, ale zaleca si&#281; aby grubo&#347;&#263; by&#322;a &lt; 1/10 typowego wymiaru globalnego <i>(d&#322;ugo&#347;&#263; / szeroko&#347;&#263;)</i> cz&#281;&#347;ci &#380;eby mo&#380;na by&#322;o zastosowa&#263; teori&#281; pow&#322;ok.</li></ul>
<p><span typeof="mw:File"><a href="../index.php?title=FEM_shell_model.JPG&amp;filetimestamp=20231228195539&amp;.html" class="mw-file-description"><img src="../File/FEM_shell_model.JPG" decoding="async" width="600" height="282" class="mw-file-element" data-file-width="1444" data-file-height="678"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Cienko&#347;cienna cz&#281;&#347;&#263; nadaj&#261;ca si&#281; do analizy przy pomocy element&oacute;w pow&#322;okowych - pod&#347;wietlona powierzchnia &#347;rodkowa</p>
<ul><li>w niekt&oacute;rych przypadkach mo&#380;liwe s&#261; te&#380; analizy 2D, kt&oacute;re mo&#380;na aktywowa&#263; ustawiaj&#261;c odpowiednio w&#322;a&#347;ciwo&#347;&#263; <span style="font-size:60%; padding-right:0.8em;">DANE</span><b>Model Space</b> <a href="../pl/FEM_SolverCalculixCcxtools.html" title="FEM SolverCalculixCcxtools/pl">obiektu solvera CalculiX</a>:
<ul><li>plane stress (p&#322;aski stan napr&#281;&#380;e&#324;) - dla cienkich cz&#281;&#347;ci, kt&oacute;re mo&#380;na upro&#347;ci&#263; do p&#322;askich powierzchni reprezentuj&#261;cych profil do wyci&#261;gni&#281;cia (grubo&#347;&#263; jest definiowana tak samo jak dla pow&#322;ok), s&#261; obci&#261;&#380;one i deformuj&#261; si&#281; tylko w p&#322;aszczy&#378;nie i maj&#261; zerowe napr&#281;&#380;enia w kierunku poza p&#322;aszczyznowym. Dost&#281;pne s&#261; jedynie dwa stopnie swobody - przemieszczenia w kierunkach X i Y. Powierzchnie musz&#261; w tym przypadku le&#380;e&#263; na p&#322;aszczy&#378;nie XY. To podej&#347;cie jest dosy&#263; powszechne. Przyk&#322;adowo, mo&#380;na w ten spos&oacute;b analizowa&#263; cienk&#261; p&#322;ytk&#281; poddan&#261; rozci&#261;ganiu.</li>
<li>plane strain (p&#322;aski stan odkszta&#322;ce&#324;) - dla grubych cz&#281;&#347;ci, kt&oacute;re mo&#380;na upro&#347;ci&#263; do p&#322;askich powierzchni reprezentuj&#261;cych profil do wyci&#261;gni&#281;cia (grubo&#347;&#263; jest definiowana tak samo jak dla pow&#322;ok), s&#261; obci&#261;&#380;one i deformuj&#261; si&#281; tylko w p&#322;aszczy&#378;nie i maj&#261; zerowe odkszta&#322;cenia w kierunku poza p&#322;aszczyznowym. Dost&#281;pne s&#261; jedynie dwa stopnie swobody - przemieszczenia w kierunkach X i Y. Powierzchnie musz&#261; w tym przypadku le&#380;e&#263; na p&#322;aszczy&#378;nie XY. To podej&#347;cie nie jest tak cz&#281;sto u&#380;ywane. Przyk&#322;adowo, mo&#380;na w ten spos&oacute;b analizowa&#263; d&#322;ugie tamy, &#347;ciany lub rury poddane ci&#347;nieniu r&oacute;wnomiernemu na ca&#322;ej d&#322;ugo&#347;ci.</li>
<li>axisymmetric (osiowosymetryczne) - dla cz&#281;&#347;ci, kt&oacute;re mo&#380;na upro&#347;ci&#263; do p&#322;askich powierzchni reprezentuj&#261;cych profil do obr&oacute;cenia (grubo&#347;&#263; nie ma tu znaczenia) i s&#261; obci&#261;&#380;one r&oacute;wnomiernie na ca&#322;ym obwodzie. Dost&#281;pne s&#261; jedynie dwa stopnie swobody - przesuni&#281;cie w kierunku promieniowym i osiowym. Powierzchnie musz&#261; le&#380;e&#263; na p&#322;aszczy&#378;nie XY, po prawej stronie osi Y. To podej&#347;cie jest bardzo cz&#281;sto stosowane. Przyk&#322;adowo, mo&#380;na w ten spos&oacute;b analizowa&#263; niekt&oacute;re zbiorniki ci&#347;nieniowe, gumowe wibroizolatory, tulejki, uszczelki, ko&#322;nierze a nawet po&#322;&#261;czenia &#347;rubowe (traktuj&#261;c gwint jako osiowosymetryczny).</li></ul></li></ul>
<p>Nale&#380;y pami&#281;ta&#263;, &#380;e elementy belkowe, pow&#322;okowe, p&#322;askiego stanu napr&#281;&#380;e&#324;/odkszta&#322;ce&#324; i osiowosymetryczne w CalculiX nie s&#261; prawdziwymi elementami tego typu <i>(nie korzystaj&#261; z klasycznych sformu&#322;owa&#324; znanych z literatury i innego oprogramowania)</i> - wewn&#281;trznie s&#261; przekszta&#322;cane w elementy bry&#322;owe. Pomimo tego, zaleca si&#281; korzystanie z nich w wy&#380;ej wymienionych przypadkach.
</p><p><span id="Geometry_validity"></span>
</p>
<h2><span id="Poprawno.C5.9B.C4.87_geometrii"></span><span class="mw-headline" id="Poprawno&#347;&#263;_geometrii">Poprawno&#347;&#263; geometrii</span></h2>
<p>Geometria u&#380;ywana w analizach MES musi by&#263; poprawna. Przede wszystkim, nie mog&#261; wyst&#281;powa&#263; &#380;adne przenikania. Jest to cz&#281;sty problem, zwykle wyst&#281;puj&#261;cy gdy z&#322;o&#380;enia s&#261; modelowane bez odpowiednich po&#322;&#261;cze&#324; mi&#281;dzy cz&#281;&#347;ciami. Narz&#281;dzie <a href="../pl/Part_SectionCut.html" title="Part SectionCut/pl">Cz&#281;&#347;&#263;: Wycinek z przekroju</a> mo&#380;e pom&oacute;c w znalezieniu takich przenika&#324; mi&#281;dzy cz&#281;&#347;ciami. Oczywi&#347;cie narz&#281;dzie <a href="../pl/Part_Fuse.html" title="Part Fuse/pl">Cz&#281;&#347;&#263;: Po&#322;&#261;czenie</a> mo&#380;e pom&oacute;c je naprawi&#263; je&#347;li s&#261; celowe. Inne problemy z geometri&#261; <i>(takie jak geometrie typu non-manifold, zb&#281;dne kraw&#281;dzie i &#347;ciany itp.)</i> r&oacute;wnie&#380; musz&#261; by&#263; naprawione przed przyst&#261;pieniem do tworzenia siatki. Narz&#281;dzie <a href="../pl/Part_CheckGeometry.html" title="Part CheckGeometry/pl">Cz&#281;&#347;&#263;: Sprawd&#378; geometri&#281;</a> mo&#380;e by&#263; pomocne, ale istotna jest te&#380; wizualna ocena. Przy przygotowywaniu symulacji z u&#380;yciem element&oacute;w bry&#322;owych, w razie w&#261;tpliwo&#347;ci czy cz&#281;&#347;&#263; faktycznie jest bry&#322;&#261; czy tylko zamkni&#281;t&#261; pow&#322;ok&#261;, wy&#380;ej wymienione narz&#281;dzia <i>(Cz&#281;&#347;&#263;: Wycinek z przekroju i zak&#322;adka </i>Zawarto&#347;&#263; kszta&#322;tu<i> w wynikach narz&#281;dzia Cz&#281;&#347;&#263;: Sprawd&#378; geometri&#281;)</i> mog&#261; rozwia&#263; te w&#261;tpliwo&#347;ci.
</p><p><span id="Surface_normals"></span>
</p>
<h2><span class="mw-headline" id="Kierunki_normalne_powierzchni">Kierunki normalne powierzchni</span></h2>
<p>W przypadku geometrii powierzchniowych u&#380;ywanych do analiz z elementami pow&#322;okowymi i 2D, kierunki normalne powierzchni mog&#261; by&#263; istotne. S&#261; stosowane do rozr&oacute;&#380;nienia dodatniej i ujemnej strony powierzchniowej siatki element&oacute;w sko&#324;czonych i wp&#322;ywaj&#261; na cechy analizy, takie jak obci&#261;&#380;enia ci&#347;nieniem i kontakt. Ponadto, analizy 2D (p&#322;askiego stanu napr&#281;&#380;e&#324;/odkszta&#322;ce&#324; i osiowosymetryczne) z solverem CalculiX wymagaj&#261; kierunk&oacute;w normalnych zwr&oacute;conych w dodatni&#261; stron&#281; osi Z. Gdy s&#261; one odwr&oacute;cone, pojawiaj&#261; si&#281; b&#322;&#281;dy o ujemnych jakobianach.
</p><p>Aby sprawdzi&#263; kierunki normalne, u&#380;yj jednego z nast&#281;puj&#261;cych podej&#347;&#263;:
</p>
<ul><li>w&#322;&#261;cz &#346;wiat&#322;o pod&#347;wietlenia w <a href="../pl/Preferences_Editor.html" title="Preferences Editor/pl">Preferencjach</a> i ustaw w&#322;a&#347;ciwo&#347;&#263; <span style="font-size:60%; padding-right:0.8em;">WIDOK</span><b>Lighting</b> obiektu powierzchniowego na <i>One side</i> - ujemny kierunek normalny b&#281;dzie po ciemniejszej stronie,</li>
<li>u&#380;yj <a href="../pl/Macro_Normal_Vector.html" title="Macro Normal Vector/pl">makra Normal Vector</a>,</li>
<li>utw&oacute;rz siatk&#281; dla kszta&#322;tu powierzchniowego w &#347;rodowisku pracy MES - siatka b&#281;dzie pokolorowana tylko od strony dodatniego kierunku normalnego.</li></ul>
<p>Aby odwr&oacute;ci&#263; kierunki normalne, u&#380;yj narz&#281;dzia <a href="../pl/Part_ReverseShape.html" title="Part ReverseShape/pl">Odwr&oacute;&#263; kszta&#322;ty</a>.
</p><p><span id="Using_surface_meshes_for_FEM"></span>
</p>
<h2><span id="U.C5.BCywanie_siatek_powierzchniowych_w_MES"></span><span class="mw-headline" id="U&#380;ywanie_siatek_powierzchniowych_w_MES">U&#380;ywanie siatek powierzchniowych w MES</span></h2>
<p><a href="../pl/Mesh_MeshObject.html" title="Mesh MeshObject/pl">Siatki powierzchniowe</a>, zwykle importowane z plik&oacute;w STL, OBJ i podobnych format&oacute;w lub tworzone w <a href="../pl/Mesh_Workbench.html" title="Mesh Workbench/pl">&#347;rodowisku pracy Siatka</a> nie mog&#261; by&#263; bezpo&#347;rednio u&#380;ywane w &#347;rodowisku pracy MES. Nale&#380;y najpierw <a href="../pl/Part_ShapeFromMesh.html" title="Part ShapeFromMesh/pl">utw&oacute;rzy&#263; kszta&#322;t z siatki</a>. Nast&#281;pnie dla tego kszta&#322;tu w &#347;rodowisku pracy MES mo&#380;na utworzy&#263; powierzchniow&#261; (pow&#322;okow&#261; / dwuwymiarow&#261;) siatk&#281; element&oacute;w sko&#324;czonych. Je&#347;li potrzebna jest bry&#322;owa (tr&oacute;jwymiarowa) siatka element&oacute;w sko&#324;czonych, po utworzeniu kszta&#322;tu nale&#380;y przeprowadzi&#263; <a href="../pl/Part_MakeSolid.html" title="Part MakeSolid/pl">konwersj&#281; do bry&#322;y</a>.
</p><p>Najwi&#281;kszym problemem z kszta&#322;tami utworzonymi z siatek powierzchniowych jest to, &#380;e wszystkie ich tr&oacute;jk&#261;ty staj&#261; si&#281; &#347;ciankami wygenerowanego kszta&#322;tu. W przygotowaniu analiz MES, znacznie utrudnia to przypisywanie cech analiz (takich jak obci&#261;&#380;enia i warunki brzegowe). W przypadku p&#322;askich powierzchni, <a href="../pl/Part_RefineShape.html" title="Part RefineShape/pl">Udoskonalenie kszta&#322;tu</a> mo&#380;e usun&#261;&#263; zb&#281;dne tr&oacute;jk&#261;tne &#347;cianki. W praktyce jednak wi&#281;kszo&#347;&#263; z nich pozostanie i dlatego nie zaleca si&#281; u&#380;ywania siatek powierzchniowych w MES. Zamiast nich powinno si&#281; stosowa&#263; geometrie CAD (utworzone we FreeCAD lub zaimportowane z plik&oacute;w STEP/IGES). Czasem mo&#380;e by&#263; nawet konieczne odtworzenie geometrii w oparciu o siatk&#281; powierzchniow&#261;.
</p><p><span id="Geometry_simplification"></span>
</p>
<h2><span class="mw-headline" id="Upraszczanie_geometrii">Upraszczanie geometrii</span></h2>
<p><span id="Defeaturing"></span>
</p>
<h3><span class="mw-headline" id="Usuwanie_cech">Usuwanie cech</span></h3>
<p>Projekty przygotowane w programach CAD cz&#281;sto s&#261; zbyt szczeg&oacute;&#322;owe &#380;eby nadawa&#322;y si&#281; do analiz MES. W wielu przypadkach konieczne jest najpierw ich uproszczenie. Ten krok jest cz&#281;sto pomijany a jest bardzo istotny, poniewa&#380; mo&#380;e by&#263; trudno uzyska&#263; dobr&#261; siatk&#281; je&#347;li cz&#281;&#347;&#263; jest zbyt szczeg&oacute;&#322;owa a nawet je&#347;li uda si&#281; w ko&#324;cu uzyska&#263; tak&#261; siatk&#281;, to mo&#380;e by&#263; bardzo g&#281;sta, prowadz&#261;c do przesadnie d&#322;ugiego czasu rozwi&#261;zywania. Zatem nale&#380;y zawsze przyjrze&#263; si&#281; projektowi i postara&#263; si&#281; go upro&#347;ci&#263; tak bardzo jak to mo&#380;liwe, zostawiaj&#261;c tylko te cechy geometrii, kt&oacute;re mog&#261; mie&#263; istotny wp&#322;yw na wyniki <i>(wytrzyma&#322;o&#347;&#263; / sztywno&#347;&#263;)</i>, wi&#281;c nie mo&#380;na ich pomin&#261;&#263;. Nast&#281;puj&#261;ce cechy zwykle s&#261; pomijane:
</p>
<ul><li>ma&#322;e zaokr&#261;glenia i sfazowania,</li>
<li>ma&#322;e otwory,</li>
<li>inne ma&#322;e detale,</li>
<li>spawy,</li>
<li>&#347;ruby, gwinty,</li>
<li>elementy dekoracyjne (loga, grawerunki).</li></ul>
<p>Narz&#281;dzie <a href="../pl/Part_Defeaturing.html" title="Part Defeaturing/pl">Cz&#281;&#347;&#263;: Usuwanie cech</a> i dodatkowe <a href="../pl/Defeaturing_Workbench.html" title="Defeaturing Workbench/pl">&#347;rodowisko pracy Upraszczanie</a> mog&#261; by&#263; pomocne podczas upraszczania cz&#281;&#347;ci do analiz.
</p><p><span typeof="mw:File"><a href="../index.php?title=FEM_bracket_original.PNG&amp;filetimestamp=20240105151839&amp;.html" class="mw-file-description"><img src="../File/FEM_bracket_original.PNG" decoding="async" width="400" height="471" class="mw-file-element" data-file-width="600" data-file-height="706"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Oryginalna geometria k&#261;townika</p>
<p><span typeof="mw:File"><a href="../index.php?title=FEM_bracket_simplified.PNG&amp;filetimestamp=20240105151930&amp;.html" class="mw-file-description"><img src="../File/FEM_bracket_simplified.PNG" decoding="async" width="400" height="466" class="mw-file-element" data-file-width="609" data-file-height="710"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Geometria k&#261;townika uproszczona przy pomocy samego narz&#281;dzia Cz&#281;&#347;&#263;: Usuwanie cech</p>
<p><span id="Replacing_parts_with_boundary_conditions"></span>
</p>
<h3><span id="Zast.C4.99powanie_cz.C4.99.C5.9Bci_warunkami_brzegowymi"></span><span class="mw-headline" id="Zast&#281;powanie_cz&#281;&#347;ci_warunkami_brzegowymi">Zast&#281;powanie cz&#281;&#347;ci warunkami brzegowymi</span></h3>
<p>W przypadku z&#322;o&#380;e&#324; <i>(wi&#281;cej o nich w jednej z kolejnych sekcji)</i>, cz&#281;sto niekt&oacute;re cz&#281;&#347;ci mo&#380;na wykluczy&#263; z symulacji i zast&#261;pi&#263; warunkami brzegowymi je&#347;li by&#322;y one po&#322;&#261;czone z cz&#281;&#347;ciami podlegaj&#261;cymi analizie. Takie podej&#347;cie jest prawid&#322;owe je&#347;li wykluczone cz&#281;&#347;ci s&#261; znacznie sztywniejsze (w rozumieniu sztywno&#347;ci strukturalnej, wi&#281;c bior&#261;c pod uwag&#281; nie tylko materia&#322;, ale te&#380; geometri&#281; cz&#281;&#347;ci) ni&#380; analizowane cz&#281;&#347;ci, z kt&oacute;rymi by&#322;y po&#322;&#261;czone. Jest tak dlatego, &#380;e warunki brzegowe blokady przemieszcze&#324; wprowadzaj&#261; sztywno&#347;&#263; (jakby analizowana cz&#281;&#347;&#263; by&#322;a po&#322;&#261;czona z niesko&#324;czenie sztywnym komponentem) a podpory spr&#281;&#380;yste, takie jak elementy typu spr&#281;&#380;yna, nie s&#261; dost&#281;pne w &#347;rodowisku pracy MES programu FreeCAD w przypadku korzystania z solvera CalculiX (Elmer ma zaimplementowane <a href="../pl/FEM_ConstraintSpring.html" title="FEM ConstraintSpring/pl">spr&#281;&#380;yny</a>).
</p><p><span id="Utilizing_planar_symmetry"></span>
</p>
<h3><span class="mw-headline" id="Korzystanie_z_symetrii_planarnej">Korzystanie z symetrii planarnej</span></h3>
<p>Upraszczanie geometrii do analiz MES mo&#380;e te&#380; oznacza&#263; jej ci&#281;cie w jednej z p&#322;aszczyzn symetrii aby skorzysta&#263; z za&#322;o&#380;enia symetrii planarnej w symulacji. Jest ono prawid&#322;owe tylko gdy wszystkie poni&#380;sze aspekty modelu wykazuj&#261; symetri&#281; w danej p&#322;aszczy&#378;nie:
</p>
<ul><li>geometria,</li>
<li>obci&#261;&#380;enia,</li>
<li>warunki brzegowe,</li>
<li>odpowied&#378; <i>(nale&#380;y uwa&#380;a&#263; w przypadku analiz cz&#281;stotliwo&#347;ci drga&#324; w&#322;asnych i wyboczenia korzystaj&#261;cych z symetrii - nie uzyska si&#281; asymetrycznych postaci drga&#324; w&#322;asnych i wyboczenia)</i>.</li></ul>
<p>Korzystanie z symetrii <i>(1/2, 1/4 lub 1/8 modelu)</i> jest zalecane gdy tylko wchodzi to w gr&#281;, poniewa&#380; mo&#380;na w ten spos&oacute;b znacznie zredukowa&#263; koszt oblicze&#324;. Inn&#261; zalet&#261; jest to, &#380;e eliminowane s&#261; niekt&oacute;re ruchy sztywne, dzi&#281;ki czemu &#322;atwiej jest zwi&#261;za&#263; cz&#281;&#347;&#263;. Warunek brzegowy symetrii powinien by&#263; zadany na &#347;ciany nale&#380;&#261;ce do p&#322;aszczyzny symetrii:
</p>
<ul><li>przesuni&#281;cie w kierunku normalnym do p&#322;aszczyzny symetrii powinno by&#263; zablokowane dla cz&#281;&#347;ci bry&#322;owych,</li>
<li>przesuni&#281;cie w kierunku normalnym do p&#322;aszczyzny symetrii i obroty w kierunkach innych ni&#380; wok&oacute;&#322; osi normalnej do p&#322;aszczyzny symetrii powinny by&#263; zablokowane dla cz&#281;&#347;ci pow&#322;okowych i belkowych.</li></ul>
<p>Przy&#322;o&#380;on&#261; si&#322;&#281; nale&#380;y odpowiednio zredukowa&#263; je&#347;li p&#322;aszczyzna symetrii przecina obszar jej przy&#322;o&#380;enia (nieistotne w przypadku obci&#261;&#380;enia ci&#347;nieniem).
</p><p><span typeof="mw:File"><a href="../index.php?title=FEM_symmetric_vessel.JPG&amp;filetimestamp=20231228201421&amp;.html" class="mw-file-description"><img src="../File/FEM_symmetric_vessel.JPG" decoding="async" width="400" height="447" class="mw-file-element" data-file-width="641" data-file-height="717"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Model 1/8 zbiornika cylindrycznego z warunkami brzegowymi symetrii i ci&#347;nieniem wewn&#281;trznym</p>
<p><span id="Utilizing_cyclic_symmetry"></span>
</p>
<h3><span class="mw-headline" id="Korzystanie_z_symetrii_cyklicznej">Korzystanie z symetrii cyklicznej</span></h3>
<p>Innym, rzadziej stosowanym typem symetrii dost&#281;pnym w &#347;rodowisku pracy MES jest symetria cykliczna. Mo&#380;na j&#261; zdefiniowa&#263; przy pomocy <a href="../pl/FEM_ConstraintTie.html#Symetria_cykliczna" title="FEM ConstraintTie/pl">wi&#281;zu tie</a> i umo&#380;liwia analizowanie reprezentatywnego sektora konstrukcji sk&#322;adaj&#261;cej si&#281; z takiego szyku ko&#322;owego wok&oacute;&#322; osi. Zak&#322;ada si&#281;, &#380;e warunki brzegowe i obci&#261;&#380;enia r&oacute;wnie&#380; wykazuj&#261; ten typ symetrii. Mo&#380;na zadawa&#263; obci&#261;&#380;enia styczne, wi&#281;c da si&#281; w ten spos&oacute;b symulowa&#263; skr&#281;canie. Jednak z symetri&#261; cykliczn&#261; cz&#281;sto u&#380;ywane jest <a href="../pl/FEM_ConstraintCentrif.html" title="FEM ConstraintCentrif/pl">obci&#261;&#380;enie si&#322;&#261; od&#347;rodkow&#261;</a>. To podej&#347;cie mo&#380;na stosowa&#263; m.in. dla wirnik&oacute;w, wa&#322;&oacute;w, turbin, wiatrak&oacute;w czy k&oacute;&#322; zamachowych.
</p><p><span id="Geometry_partitioning"></span>
</p>
<h2><span class="mw-headline" id="Partycjonowanie_geometrii">Partycjonowanie geometrii</span></h2>
<p><span id="Partitioning_basics"></span>
</p>
<h3><span class="mw-headline" id="Podstawy_partycjonowania">Podstawy partycjonowania</span></h3>
<p>Tak zwane partycjonowanie to podzia&#322; geometrii na mniejsze segmenty. W innych programach jest to powszechnie u&#380;ywane aby umo&#380;liwi&#263; tworzenie siatek z&#322;o&#380;onych z element&oacute;w sze&#347;cio&#347;ciennych, ale we FreeCAD mo&#380;e by&#263; przydatne z innych powod&oacute;w:
</p>
<ul><li>tworzenie podobszar&oacute;w do przypisywania cech analizy,</li>
<li>dzielenie cz&#281;&#347;ci na sekcje wykonane z r&oacute;&#380;nych materia&#322;&oacute;w,</li>
<li>tworzenie obszar&oacute;w dla <a href="../pl/FEM_MeshRegion.html" title="FEM MeshRegion/pl">zag&#281;szczenia siatki</a>,</li>
<li>kontrolowanie algorytmu generowania siatki poprzez zmuszenie go do uwzgl&#281;dniania dodatkowych kraw&#281;dzi (szczeg&oacute;lnie przydatne do kontroli <a href="../pl/FEM_MeshGmshFromShape.html#Wzrost_siatki" title="FEM MeshGmshFromShape/pl">wzrostu siatki Gmsh</a>).</li></ul>
<p><span id="Partitioning_faces_of_solids_with_sketches"></span>
</p>
<h3><span id="Partycjonowanie_.C5.9Bcian_bry.C5.82_przy_pomocy_szkic.C3.B3w"></span><span class="mw-headline" id="Partycjonowanie_&#347;cian_bry&#322;_przy_pomocy_szkic&oacute;w">Partycjonowanie &#347;cian bry&#322; przy pomocy szkic&oacute;w</span></h3>
<p>G&#322;&oacute;wnym zastosowaniem partycjonowania s&#261; przypadki gdy obci&#261;&#380;enie <i>(lub warunek brzegowy)</i> trzeba przy&#322;o&#380;y&#263; tylko do wybranego obszaru na powierzchni cz&#281;&#347;ci. Naj&#322;atwiejszym sposobem aby to osi&#261;gn&#261;&#263; dla cz&#281;&#347;ci bry&#322;owych jest utworzenie szkicu z odpowiednim konturem na &#347;cianie i u&#380;ycie narz&#281;dzia <a href="../pl/Part_BooleanFragments.html" title="Part BooleanFragments/pl">Cz&#281;&#347;&#263;: Fragmentacja funkcj&#261; logiczn&#261;</a> aby podzieli&#263; &#347;cian&#281; przy pomocy szkicu.
</p><p><span typeof="mw:File"><a href="../index.php?title=FEM_partition.JPG&amp;filetimestamp=20231228200133&amp;.html" class="mw-file-description"><img src="../File/FEM_partition.JPG" decoding="async" width="400" height="404" class="mw-file-element" data-file-width="634" data-file-height="641"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Cz&#281;&#347;&#263; ze &#347;cian&#261; podzielon&#261; do zadania obci&#261;&#380;enia lub warunku brzegowego</p>
<p><span id="Partitioning_volumes_of_solids_with_datum_planes"></span>
</p>
<h3><span id="Partycjonowanie_obj.C4.99to.C5.9Bci_bry.C5.82_przy_pomocy_p.C5.82aszczyzn_konstrukcyjnych"></span><span class="mw-headline" id="Partycjonowanie_obj&#281;to&#347;ci_bry&#322;_przy_pomocy_p&#322;aszczyzn_konstrukcyjnych">Partycjonowanie obj&#281;to&#347;ci bry&#322; przy pomocy p&#322;aszczyzn konstrukcyjnych</span></h3>
<div class="mw-translate-fuzzy">
<p>Innym powodem partycjonowania mo&#380;e by&#263; przypadek gdy na jedn&#261; cz&#281;&#347;&#263; trzeba na&#322;o&#380;y&#263; wiele materia&#322;&oacute;w <i>(bez u&#380;ywania wielu cz&#281;&#347;ci po&#322;&#261;czonych ze sob&#261;)</i>. Wtedy partycjonowania mo&#380;na dokona&#263; przy pomocy <a href="../pl/PartDesign_Plane.html" title="PartDesign Plane/pl">p&#322;aszczyzny odniesienia</a> i narz&#281;dzia Fragmentacja funkcj&#261; logiczn&#261; z trybem <i>Compsolid</i> <i>(bry&#322;a z&#322;o&#380;ona)</i>.
</p>
</div>
<p><span id="Partitioning_surface_geometries_with_sketches"></span>
</p>
<h3><span id="Partycjonowanie_geometrii_powierzchniowych_przy_pomocy_szkic.C3.B3w"></span><span class="mw-headline" id="Partycjonowanie_geometrii_powierzchniowych_przy_pomocy_szkic&oacute;w">Partycjonowanie geometrii powierzchniowych przy pomocy szkic&oacute;w</span></h3>
<p>W przypadku geometrii powierzchniowych (pow&#322;okowych), naj&#322;atwiejszym sposobem utworzenia partycji w oparciu o szkic mog&#322;oby by&#263; u&#380;ycie narz&#281;dzia <a href="../pl/Part_BooleanFragments.html" title="Part BooleanFragments/pl">Fragmentacja funkcj&#261; logiczn&#261;</a> (jak w przypadku partycji &#347;cian bry&#322;). Ale, jak wyja&#347;niono <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=96029#p820241">tutaj</a>, je&#347;li w <a href="../pl/FEM_Preferences.html#Og%C3%B3lne" title="FEM Preferences/pl">preferencjach MES</a> w&#322;&#261;czone jest tworzenie grup siatki, mo&#380;e to nie zadzia&#322;a&#263; prawid&#322;owo i powinno si&#281; skorzysta&#263; z nast&#281;puj&#261;cego podej&#347;cia:
</p>
<ol><li>Utw&oacute;rz &#347;cian&#281; dla jednej strony przy pomocy np. narz&#281;dzia <a href="../pl/Part_MakeFace.html" title="Part MakeFace/pl">Utw&oacute;rz &#347;cian&#281; z polilinii</a> (np. kwadratowa p&#322;ytka z okr&#261;g&#322;ym otworem).</li>
<li>Utw&oacute;rz &#347;cian&#281; dla drugiej strony w analogiczny spos&oacute;b (np. okr&#261;g&#322;a &#347;cian wype&#322;niaj&#261;ca otw&oacute;r w kwadratowej p&#322;ytce).</li>
<li>Zastosuj narz&#281;dzie <a href="../pl/Part_Builder.html" title="Part Builder/pl">Konstruktor kszta&#322;tu</a> z trybem <i>Pow&#322;oka ze &#347;cian</i> i odznaczonym polem <i>Udoskonal kszta&#322;t</i> na utworzonych wcze&#347;niej &#347;cianach.</li></ol>
<p><span typeof="mw:File"><a href="../index.php?title=FEM_shell_partition.JPG&amp;filetimestamp=20250701143021&amp;.html" class="mw-file-description"><img src="../File/FEM_shell_partition.JPG" decoding="async" width="400" height="249" class="mw-file-element" data-file-width="845" data-file-height="526"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Kwadratowa p&#322;ytka z okr&#261;g&#322;&#261; partycj&#261; &#347;ciany</p>
<p><span id="Partitioning_faces_of_solids_with_datum_planes"></span>
</p>
<h3><span id="Partycjonowanie_.C5.9Bcian_bry.C5.82_przy_pomocy_p.C5.82aszczyzn_konstrukcyjnych"></span><span class="mw-headline" id="Partycjonowanie_&#347;cian_bry&#322;_przy_pomocy_p&#322;aszczyzn_konstrukcyjnych">Partycjonowanie &#347;cian bry&#322; przy pomocy p&#322;aszczyzn konstrukcyjnych</span></h3>
<p>Partycjonowanie tylko wybranych &#347;cian bry&#322;y przy pomocy p&#322;aszczyzn konstrukcyjnych zamiast szkic&oacute;w bez dzielenia ca&#322;ej obj&#281;to&#347;ci r&oacute;wnie&#380; jest utrudnione. Jedno z mo&#380;liwych podej&#347;&#263; to:
</p>
<ol><li><a href="../pl/Draft_Downgrade.html" title="Draft Downgrade/pl">Rozbij kszta&#322;t</a> bry&#322;y na &#347;ciany.</li>
<li>Wybierz &#347;cian&#281; do podzia&#322;u i p&#322;aszczyzn&#281; konstrukcyjn&#261; i u&#380;yj narz&#281;dzia <a href="../pl/Part_SliceApart.html" title="Part SliceApart/pl">Rozetnij</a>.</li>
<li>Usu&#324; kontener Exploded Slice bez usuwania jego zawarto&#347;ci.</li>
<li>Zaznacz wszystkie &#347;ciany i obiekty Slice i <a href="../pl/Draft_Upgrade.html" title="Draft Upgrade/pl">Ulepsz kszta&#322;t</a> do pow&#322;oki (Shell).</li>
<li><a href="../pl/Draft_Upgrade.html" title="Draft Upgrade/pl">Ulepsz kszta&#322;t</a> pow&#322;oki do bry&#322;y (Solid) lub u&#380;yj narz&#281;dzia <a href="../pl/Part_MakeSolid.html" title="Part MakeSolid/pl">Przekszta&#322;&#263; na bry&#322;&#281;</a>.</li></ol>
<p>Inne podej&#347;cie to:
</p>
<ol><li>Utw&oacute;rz <a href="../pl/PartDesign_SubShapeBinder.html" title="PartDesign SubShapeBinder/pl">&#322;&#261;cznik kszta&#322;tu obiektu podrz&#281;dnego</a> ze &#347;ciany do podzia&#322;u.</li>
<li>Podziel &#322;&#261;cznik kszta&#322;tu obiektu podrz&#281;dnego p&#322;aszczyzn&#261; za pomoc&#261; narz&#281;dzia <a href="../pl/Part_SliceApart.html" title="Part SliceApart/pl">Rozetnij</a>.</li>
<li>Utw&oacute;rz now&#261; <a href="../pl/PartDesign_Body.html" title="PartDesign Body/pl">Zawarto&#347;&#263;</a> (aby unikn&#261;&#263; cyklicznej zale&#380;no&#347;ci).</li>
<li>Utw&oacute;rz nowy &#322;&#261;cznik kszta&#322;tu obiektu podrz&#281;dnego z kraw&#281;dzi uzyskanych z przeci&#281;cia poprzedniego &#322;&#261;cznika kszta&#322;tu obiektu podrz&#281;dnego p&#322;aszczyzn&#261; konstrukcyjn&#261;.</li>
<li>Wybierz oryginaln&#261; Zawarto&#347;&#263; i nowy &#322;&#261;cznik kszta&#322;tu obiektu podrz&#281;dnego i u&#380;yj narz&#281;dzia <a href="../pl/Part_BooleanFragments.html" title="Part BooleanFragments/pl">Fragmentacja funkcj&#261; logiczn&#261;</a>.</li></ol>
<p>Inne pomys&#322;y mo&#380;na znale&#378;&#263; w <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=98528">tym w&#261;tku na forum</a>, ale s&#261; mniej uniwersalne.
</p><p><span typeof="mw:File"><a href="../index.php?title=FEM_split_face_solid.JPG&amp;filetimestamp=20250723164225&amp;.html" class="mw-file-description"><img src="../File/FEM_split_face_solid.JPG" decoding="async" width="400" height="345" class="mw-file-element" data-file-width="598" data-file-height="516"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Cylindryczna &#347;ciana otworu podzielona p&#322;aszczyzn&#261; aby zada&#263; obci&#261;&#380;enie od sworznia roz&#322;o&#380;one na 180&deg;</p>
<p><span id="Assembly_geometries"></span>
</p>
<h2><span id="Geometrie_z.C5.82o.C5.BCe.C5.84"></span><span class="mw-headline" id="Geometrie_z&#322;o&#380;e&#324;">Geometrie z&#322;o&#380;e&#324;</span></h2>
<p>Obecnie jednym z najwi&#281;kszych ogranicze&#324; &#347;rodowiska pracy MES jest brak wsparcia dla wielu siatek w jednej analizie. W praktyce oznacza to, &#380;e nie mo&#380;na na&#322;o&#380;y&#263; siatki na ka&#380;d&#261; cz&#281;&#347;&#263; z&#322;o&#380;enia osobno i po&#322;&#261;czy&#263; je odpowiednimi wi&#281;zami do analizy. Zamiast tego, nale&#380;y utworzy&#263; pojedynczy obiekt zawieraj&#261;cy wszystkie cz&#281;&#347;ci z&#322;o&#380;enia i na&#322;o&#380;y&#263; siatk&#281; na ten obiekt. Jest tu kilka opcji, wszystkie korzystaj&#261;ce z <a href="../pl/Part_Workbench.html#Pasek_narz%C4%99dzi_Operacje_logiczne" title="Part Workbench/pl">operacji logicznych</a>. Wyb&oacute;r zale&#380;y od oczekiwanego efektu - czy poszczeg&oacute;lne cz&#281;&#347;ci / obj&#281;to&#347;ci i ich brzegi maj&#261; mie&#263; mo&#380;liwo&#347;&#263; wskazania <i>(np. do przypisania materia&#322;&oacute;w lub definicji warunk&oacute;w brzegowych na wewn&#281;trznych &#347;cianach)</i> czy nie:
</p>
<ul><li><a href="../pl/Part_Fuse.html" title="Part Fuse/pl">Cz&#281;&#347;&#263;: Po&#322;&#261;czenie</a> - scala cz&#281;&#347;ci, uniemo&#380;liwiaj&#261;c ich indywidualne wskazywanie np. do definicji materia&#322;&oacute;w,</li>
<li><a href="../pl/Part_Compound.html" title="Part Compound/pl">Cz&#281;&#347;&#263;: Utw&oacute;rz kszta&#322;t z&#322;o&#380;ony</a> - tworzy obiekt z&#322;o&#380;ony, umo&#380;liwiaj&#261;c wskazywanie poszczeg&oacute;lnych cz&#281;&#347;ci,</li>
<li><a href="../pl/Part_JoinConnect.html" title="Part JoinConnect/pl">Cz&#281;&#347;&#263;: Po&#322;&#261;cz obiekty</a> - dzia&#322;a jak Cz&#281;&#347;&#263;: Po&#322;&#261;czenie, scalaj&#261;c cz&#281;&#347;ci i uniemo&#380;liwiaj&#261;c ich indywidualne wskazywanie,</li>
<li><a href="../pl/Part_BooleanFragments.html" title="Part BooleanFragments/pl">Cz&#281;&#347;&#263;: Fragmentacja funkcj&#261; logiczn&#261;</a> - dzia&#322;a jak Cz&#281;&#347;&#263;: Utw&oacute;rz kszta&#322;t z&#322;o&#380;ony, uniemo&#380;liwiaj&#261;c indywidualne wskazywanie cz&#281;&#347;ci.</li></ul>
<p>Nale&#380;y wspomnie&#263;, &#380;e je&#347;li cz&#281;&#347;ci si&#281; dok&#322;adnie stykaj&#261; to na obiekcie boolowskim powstanie ci&#261;g&#322;a siatka i nie b&#281;dzie potrzeby zadawania wi&#281;z&oacute;w do symulacji (chyba &#380;e u&#380;ywany jest Kszta&#322;t z&#322;o&#380;ony i w&#281;z&#322;y nie s&#261; zbie&#380;ne lub <a href="../pl/FEM_MeshGmshFromShape.html#W%C5%82a%C5%9Bciwo%C5%9Bci" title="FEM MeshGmshFromShape/pl">w&#322;a&#347;ciwo&#347;&#263; <i>Coherence Mesh</i> generatora siatki Gmsh</a> jest ustawiona na <code>FA&#321;SZ</code>). Je&#347;li jest nawet drobna przerwa (albo przenikanie w przypadku narz&#281;dzia Utw&oacute;rz kszta&#322;t z&#322;o&#380;ony) mi&#281;dzy cz&#281;&#347;ciami, siatka nie b&#281;dzie ci&#261;g&#322;a i konieczne b&#281;d&#261; wi&#281;zy takie jak <a href="../pl/FEM_ConstraintTie.html" title="FEM ConstraintTie/pl">tie</a> lub <a href="../pl/FEM_ConstraintContact.html" title="FEM ConstraintContact/pl">kontakt</a>. Przeprowadzenie analizy cz&#281;stotliwo&#347;ci drga&#324; w&#322;asnych to dobry spos&oacute;b na sprawdzenie czy siatka jest ci&#261;g&#322;a czy nie - je&#347;li cz&#281;&#347;ci nie s&#261; po&#322;&#261;czone to pierwsze postacie drga&#324; w&#322;asnych z deformacj&#261; zwizualizowan&#261; przy pomocy <a href="../pl/FEM_PostFilterWarp.html" title="FEM PostFilterWarp/pl">filtra wizualizacji deformacji</a> poka&#380;&#261; ich separacj&#281; - cz&#281;&#347;ci b&#281;d&#261; "odlatywa&#263;".
</p><p><span typeof="mw:File"><a href="../index.php?title=FEM_modal_separation.JPG&amp;filetimestamp=20231228205154&amp;.html" class="mw-file-description"><img src="../File/FEM_modal_separation.JPG" decoding="async" width="400" height="484" class="mw-file-element" data-file-width="597" data-file-height="722"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Pierwsza posta&#263; drga&#324; w&#322;asnych z filtrem wizualizacji deformacji - analizie poddano dwie kostki z niewielk&#261; pocz&#261;tkow&#261; przerw&#261; mi&#281;dzy nimi</p>
<p>Cz&#281;sto zalecane jest korzystanie z narz&#281;dzia Fragmentacja funkcj&#261; logiczn&#261; z trybem Compsolid a nast&#281;pnie stosowanie na nim <a href="../pl/Part_CompoundFilter.html" title="Part CompoundFilter/pl">Filtra z&#322;o&#380;e&#324;</a>, szczeg&oacute;lnie w przypadku analizowania z&#322;o&#380;e&#324; z wieloma materia&#322;ami i bry&#322; osadzonych w innych bry&#322;ach bez wyci&#281;&#263; (jak w przyk&#322;adzie <a href="../pl/FEM_Shear_of_a_Composite_Block.html" title="FEM Shear of a Composite Block/pl">MES: &#346;cinanie bloku kompozytowego</a>). Jak mo&#380;na zauwa&#380;y&#263; w zak&#322;adce <i>Shape Content</i> narz&#281;dzia <a href="../pl/Part_CheckGeometry.html" title="Part CheckGeometry/pl">Sprawd&#378; geometri&#281;</a> (wa&#380;ne jest korzystanie z tego narz&#281;dzia gdy ma si&#281; w&#261;tpliwo&#347;ci w takich przypadkach), Filtr z&#322;o&#380;e&#324; usuwa Kszta&#322;t z&#322;o&#380;ony i zostawia tylko obiekt Compsolid sk&#322;adaj&#261;cy si&#281; z wielu bry&#322; z po&#322;&#261;czonymi &#347;cianami.
</p><p>Obej&#347;cia dla b&#322;&#281;d&oacute;w takich jak:
</p>
<div class="mw-highlight mw-highlight-lang-text mw-content-ltr" dir="ltr"><pre><span></span>ERROR: femelement_table&nbsp;!= count_femelements
Error in get_femelement_sets -- &gt; femelements_count_ok() failed!
</pre></div>
<p>oraz:
</p>
<div class="mw-highlight mw-highlight-lang-text mw-content-ltr" dir="ltr"><pre><span></span>*ERROR in calinput: no material was assigned
to element ...
</pre></div>
<p>obejmuj&#261;:
</p>
<ul><li>pozostawianie ostatniego materia&#322;u bez &#380;adnej przypisanej bry&#322;y (zostanie wtedy automatycznie przypisany do wszystkich bry&#322;, do kt&oacute;rych nie odnosz&#261; si&#281; pozosta&#322;e definicje materia&#322;&oacute;w),</li>
<li>u&#380;ywanie generatora siatki Netgen zamiast Gmsh,</li>
<li>rozdzielanie cz&#281;&#347;ci o niewielk&#261; odleg&#322;o&#347;&#263; i stosowanie wi&#261;za&#324; tie do po&#322;&#261;czenia ich w symulacji.</li></ul>
<p>Takie b&#322;&#281;dy s&#261; wywo&#322;ane brakuj&#261;cymi lub nak&#322;adaj&#261;cymi si&#281; definicjami materia&#322;&oacute;w w niekt&oacute;rych elementach. <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=97120&amp;start=50#p829295">Ten post na forum</a> wymienia &#378;r&oacute;d&#322;a, kt&oacute;re pokazuj&#261; to w czytelny spos&oacute;b a sam w&#261;tek, z kt&oacute;rego pochodzi ten post, mo&#380;e r&oacute;wnie&#380; by&#263; przydatny w przypadku napotkania podobnych b&#322;&#281;d&oacute;w.
</p><p><span id="Selection_of_interior_entities"></span>
</p>
<h3><span id="Wybieranie_wewn.C4.99trznych_obiekt.C3.B3w"></span><span class="mw-headline" id="Wybieranie_wewn&#281;trznych_obiekt&oacute;w">Wybieranie wewn&#281;trznych obiekt&oacute;w</span></h3>
<p>Wskazywanie wewn&#281;trznych obszar&oacute;w <i>(np. &#347;cian / obj&#281;to&#347;ci)</i> bywa problematyczne. Mo&#380;e by&#263; konieczne do zdefiniowania r&oacute;&#380;nych materia&#322;&oacute;w, obci&#261;&#380;e&#324; obj&#281;to&#347;ciowych lub warunk&oacute;w brzegowych <i>(zw&#322;aszcza w analizach termicznych i elektromagnetycznych)</i>. Istnieje kilka sposob&oacute;w:
</p>
<ul><li>w&#322;&#261;czenie <a href="../pl/Std_ToggleClipPlane.html" title="Std ToggleClipPlane/pl">p&#322;aszczyzny tn&#261;cej</a> na czas dokonywania wskazania i wybranie wewn&#281;trznych &#347;cian,</li>
<li>schowanie obiektu boolowskiego, zostawiaj&#261;c pokazan&#261; tylko jedn&#261; z cz&#281;&#347;ci, na kt&oacute;rych zosta&#322; on zastosowany i wybranie jej,</li>
<li><a href="../pl/Std_ToggleTransparency.html" title="Std ToggleTransparency/pl">w&#322;&#261;czenie przezroczysto&#347;ci</a> i u&#380;ycie <a href="../pl/Selection_view.html" class="mw-redirect" title="Selection view/pl">Widoku wyboru</a> z zaznaczon&#261; opcj&#261; <i>Picked object list</i> jak opisano <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=96984#p826693">tutaj</a>,</li>
<li>wybranie innego, zewn&#281;trznego obiektu i edycja w&#322;a&#347;ciwo&#347;ci <i>References</i> w zak&#322;adce <i>Dane</i> okre&#347;lonej cechy analizy <i>(wymaga r&#281;cznego podania numeru obiektu geometrycznego)</i>.</li></ul>
<p><span id="Meshing_basics"></span>
</p>
<h2><span class="mw-headline" id="Podstawy_tworzenia_siatek">Podstawy tworzenia siatek</span></h2>
<p><span id="Choosing_element_size"></span>
</p>
<h3><span id="Dob.C3.B3r_rozmiaru_element.C3.B3w"></span><span class="mw-headline" id="Dob&oacute;r_rozmiaru_element&oacute;w">Dob&oacute;r rozmiaru element&oacute;w</span></h3>
<p>Zbyt rzadka siatka to jedno z najcz&#281;stszych &#378;r&oacute;de&#322; niedok&#322;adno&#347;ci i innych problem&oacute;w w MES. Cz&#281;sto jest to po cz&#281;&#347;ci wina automatycznych ustawie&#324; generator&oacute;w siatek - zwykle tworz&#261; bardzo rzadkie, nienadaj&#261;ce si&#281; do analizy siatki gdy rozmiar elementu nie jest r&#281;cznie podany tylko zostawiony z domy&#347;ln&#261; warto&#347;ci&#261;. Nale&#380;y zawsze zna&#263; przybli&#380;one rozmiary cz&#281;&#347;ci, zw&#322;aszcza rozmiar najmniejszej istotnej cechy <i>(mo&#380;e w tym pom&oacute;c narz&#281;dzie <a href="../pl/Std_Measure.html" title="Std Measure/pl">Pomiary</a>)</i> i wprowadza&#263; odpowiedni maksymalny rozmiar elementu w oparciu o to. Dost&#281;pne jest te&#380; ustawienie minimalnego rozmiaru elementu, kt&oacute;re zapobiega powstawaniu zbyt drobnych element&oacute;w wok&oacute;&#322; ma&#322;ych cech geometrii, co mo&#380;e prowadzi&#263; do niepotrzebnie g&#281;stych siatek <i>(a czasem nawet crashy i zawieszania si&#281; programu FreeeCAD podczas pr&oacute;b generowania takich siatek)</i>. Og&oacute;lnie rzecz bior&#261;c, lepiej zacz&#261;&#263; od rzadszej siatki <i>(generowanej szybciej)</i>, zobaczy&#263; jak wygl&#261;da <i>(potrzeba pewnego do&#347;wiadczenia)</i> i zag&#281;&#347;ci&#263; j&#261; w razie potrzeby. Cz&#281;sto sens ma u&#380;ycie g&#281;stej siatki tylko w pobli&#380;u obszar&oacute;w zainteresowania <i>(miejsc z du&#380;ymi gradientami / koncentracjami napr&#281;&#380;e&#324; - karby)</i> i wzgl&#281;dnie rzadkiej siatki z dala od nich. Dzi&#281;ki temu liczba element&oacute;w jest znacz&#261;co redukowana, co prowadzi do kr&oacute;tszego czasu oblicze&#324;. Lokalnego zag&#281;szczenia siatki mo&#380;na dokona&#263; przy pomocy narz&#281;dzia <a href="../pl/FEM_MeshRegion.html" title="FEM MeshRegion/pl">MES: Obszar siatki</a>.
</p><p><span typeof="mw:File"><a href="../index.php?title=FEM_default_mesh.PNG&amp;filetimestamp=20231228215838&amp;.html" class="mw-file-description"><img src="../File/FEM_default_mesh.PNG" decoding="async" width="400" height="238" class="mw-file-element" data-file-width="829" data-file-height="493"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Domy&#347;lna, zbyt rzadka siatka</p>
<p><span typeof="mw:File"><a href="../index.php?title=FEM_globally_refined_mesh.PNG&amp;filetimestamp=20231228220052&amp;.html" class="mw-file-description"><img src="../File/FEM_globally_refined_mesh.PNG" decoding="async" width="400" height="239" class="mw-file-element" data-file-width="826" data-file-height="493"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Globalnie zag&#281;szczona siatka</p>
<p><span typeof="mw:File"><a href="../index.php?title=FEM_locally_refined_mesh.PNG&amp;filetimestamp=20231228220149&amp;.html" class="mw-file-description"><img src="../File/FEM_locally_refined_mesh.PNG" decoding="async" width="400" height="239" class="mw-file-element" data-file-width="838" data-file-height="501"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Lokalnie zag&#281;szczona siatka</p>
<p><span id="Choosing_element_type"></span>
</p>
<h3><span id="Dob.C3.B3r_typu_element.C3.B3w"></span><span class="mw-headline" id="Dob&oacute;r_typu_element&oacute;w">Dob&oacute;r typu element&oacute;w</span></h3>
<p>Wyb&oacute;r typu element&oacute;w sko&#324;czonych nie jest &#322;atwy i zale&#380;y od wielu czynnik&oacute;w, ale og&oacute;ln&#261; zasad&#261; jest to, &#380;e preferowane s&#261; elementy sze&#347;cio&#347;cienne i czworok&#261;tne w stosunku do czworo&#347;ciennych i tr&oacute;jk&#261;tnych. Jednak skomplikowane geometrie nie mog&#261; by&#263; dyskretyzowane przy pomocy element&oacute;w sze&#347;cio&#347;ciennych a FreeCAD nie potrafi ich porz&#261;dnie generowa&#263; <i>(tylko przy pomocy algorytmu Subdivision generatora Gmsh, ale jego wyniki nie s&#261; tym, czego mo&#380;na by oczekiwa&#263; od siatki z elementami sze&#347;cio&#347;ciennymi)</i>. Siatki z&#322;o&#380;one z element&oacute;w czworok&#261;tnych lub z dominuj&#261;cymi elementami tego typu mo&#380;na normalnie generowa&#263; na powierzchniach - zobacz <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=20351">ten w&#261;tek na forum</a>. Elementy sze&#347;cio&#347;cienne mo&#380;na zaimportowa&#263; z zewn&#281;trznych generator&oacute;w takich jak <a rel="nofollow" class="external text" href="https://gmsh.info">Gmsh</a>  i wykorzysta&#263; w &#347;rodowisku pracy MES, co pokazano w <a rel="nofollow" class="external text" href="https://www.youtube.com/watch?v=vylt24G7qj4&amp;t=932s">tym filmiku</a>.
</p><p><span id="Choosing_element_order"></span>
</p>
<h3><span id="Dob.C3.B3r_rz.C4.99du_element.C3.B3w"></span><span class="mw-headline" id="Dob&oacute;r_rz&#281;du_element&oacute;w">Dob&oacute;r rz&#281;du element&oacute;w</span></h3>
<p>Wyb&oacute;r rz&#281;du element&oacute;w <i>(pierwszy lub drugi)</i> zale&#380;y od warunk&oacute;w analizy, ale w wi&#281;kszo&#347;ci przypadk&oacute;w preferowane s&#261; elementy drugiego rz&#281;du. Jest tak zw&#322;aszcza w przypadku element&oacute;w tr&oacute;jk&#261;tnych i czworok&#261;tnych - ich wersje pierwszego rz&#281;du <i>(liniowe)</i> nie powinny by&#263; normalnie u&#380;ywane - zaleca si&#281; korzystanie z nich tylko jak z wype&#322;niaczy w ma&#322;o istotnych obszarach. Jednak poniewa&#380; FreeCAD nie mo&#380;e porz&#261;dnie generowa&#263; element&oacute;w sze&#347;cio&#347;ciennych to mo&#380;na korzysta&#263; z liniowych czworo&#347;cian&oacute;w w niekt&oacute;rych przypadkach je&#347;li siatki s&#261; wystarczaj&#261;co g&#281;ste. Dotyczy to zw&#322;aszcza analiz z <a href="../pl/FEM_ConstraintContact.html" title="FEM ConstraintContact/pl">kontaktem</a>.
</p><p><span id="Negative_Jacobians"></span>
</p>
<h2><span class="mw-headline" id="Ujemne_Jacobiany">Ujemne Jacobiany</span></h2>
<p>Je&#347;li przestrzega si&#281; powy&#380;szych zasad (szczeg&oacute;lnie w kwestii poprawno&#347;ci geometrii, usuwania jej zb&#281;dnych cech i doboru rozmiaru element&oacute;w), to siatka powinna zosta&#263; poprawnie wygenerowana. Jednak w niekt&oacute;rych przypadkach geometrii nie mo&#380;na za bardzo upro&#347;ci&#263; albo procedura modelowania jest prawid&#322;owa, ale i tak prowadzi do ma&#322;ych kraw&#281;dzi i &#347;cianek. Wtedy tworzenie siatki z elementami drugiego rz&#281;du mo&#380;e si&#281; nie uda&#263; ze wzgl&#281;du na ujemne Jacobiany. Wynika to z faktu, i&#380; generatory siatek musz&#261; pod&#261;&#380;a&#263; za geometri&#261; CAD i umieszczaj&#261; w&#281;z&#322;y &#347;rodkowe element&oacute;w drugiego rz&#281;du na geometrii. Dla bardziej z&#322;o&#380;onych kszta&#322;t&oacute;w mo&#380;e to prowadzi&#263; do rozci&#261;gni&#281;cia element&oacute;w w takim stopniu, &#380;e zostaj&#261; odwr&oacute;cone na drug&#261; stron&#281;. Jacobian to jedna z g&#322;&oacute;wnych miar jako&#347;ci siatki. opisuje rozbie&#380;no&#347;&#263; mi&#281;dzy idealnym a rzeczywistym kszta&#322;tem elementu. Staje si&#281; ujemny gdy element odwraca si&#281; na drug&#261; stron&#281; z powodu du&#380;ych deformacji w trakcie analizy (nie omawiane tutaj) lub ze wzgl&#281;du na opisane wy&#380;ej problemy z generowaniem siatki. Ujemne Jacobiany w &#347;rodowisku pracy MES programu FreeCAD mo&#380;e zg&#322;asza&#263; Gmsh lub CalculiX. Ich po&#322;o&#380;enia na siatce s&#261; pod&#347;wietlane gdy w&#322;&#261;cza si&#281; analizy z CalculiX przy pomocy przycisku <a href="../pl/FEM_SolverRun.html" title="FEM SolverRun/pl">Uruchom solver</a>. Nast&#281;puj&#261;ce zalecenia mog&#261; pom&oacute;c wyeliminowa&#263; ujemne Jacobiany:
</p>
<ul><li>ustaw w&#322;a&#347;ciwo&#347;&#263; <i>Second Order Linear</i> obiektu <a href="../pl/FEM_MeshGmshFromShape.html" title="FEM MeshGmshFromShape/pl">FEMMeshGmsh</a> na <i>prawda</i> - to powoduje, &#380;e w&#281;z&#322;y &#347;rodkowe element&oacute;w drugiego rz&#281;du s&#261; bezpo&#347;rednio dodawane w &#347;rodku prostych kraw&#281;dzi element&oacute;w (pocz&#261;tkowo) pierwszego rz&#281;du, bez umieszczania ich na geometrii i rozwi&#261;zuje problem w wi&#281;kszo&#347;ci przypadk&oacute;w,</li>
<li>skorzystaj z generatora Netgen zamiast Gmsh - Netgen jest mniej wra&#380;liwy na problemy z ujemnymi Jacobianami, ale te&#380; ich nie zg&#322;asza, wi&#281;c mo&#380;na si&#281; o nich dowiedzie&#263; dopiero uruchamiaj&#261;c analiz&#281;,</li>
<li>jeszcze bardziej zmniejsz rozmiar element&oacute;w,</li>
<li>wyeksportuj geometri&#281; i spr&oacute;buj wygenerowa&#263; dla niej siatk&#281; przy pomocy &#347;rodowisk graficznych program&oacute;w Gmsh lub Netgen (NGSolve) b&#261;d&#378; innych niezale&#380;nych preprocessor&oacute;w (jak Salome_Meca) - te programy maj&#261; dodatkowe narz&#281;dzia, kt&oacute;re mog&#261; pom&oacute;c pozby&#263; si&#281; ujemnych Jacobian&oacute;w (np. Gmsh ma tzw. "High-order tools"),</li>
<li>u&#380;yj element&oacute;w pierwszego rz&#281;du - tylko w ostateczno&#347;ci, poniewa&#380; elementy czworo&#347;cienne pierwszego rz&#281;du s&#261; znane z niskiej dok&#322;adno&#347;ci.</li></ul>
<p>Niezale&#380;nie od tych zalece&#324;, nale&#380;y ponownie podkre&#347;li&#263;, &#380;e ujemne Jacobiany s&#261; zwykle win&#261; niechlujnego podej&#347;cia do modelowania i braku przygotowania geometrii do analizy (szczeg&oacute;lnie cz&#281;ste w przypadku modeli STEP pobieranych z r&oacute;&#380;nych stron internetowych). Nawet je&#347;li uda si&#281; w ko&#324;cu wygenerowa&#263; siatk&#281; w takich przypadkach, to wyniki mog&#261; by&#263; kiepskiej jako&#347;ci (zasada <i>&#347;mieci na wej&#347;ciu - &#347;mieci na wyj&#347;ciu</i> wspomniana w pierwszym akapicie). Tak wi&#281;c oczyszczenie i przygotowanie geometrii do symulacji powinno zawsze by&#263; priorytetem.
</p><p><span id="Mesh_convergence_studies"></span>
</p>
<h2><span id="Studia_zbie.C5.BCno.C5.9Bci_siatki"></span><span class="mw-headline" id="Studia_zbie&#380;no&#347;ci_siatki">Studia zbie&#380;no&#347;ci siatki</span></h2>
<p>Studia zbie&#380;no&#347;ci siatki s&#261; zalecane w przypadku wszystkich powa&#380;nych projekt&oacute;w wymagaj&#261;cych dok&#322;adnych wynik&oacute;w. Wynika to z faktu, i&#380; wyniki mog&#261; si&#281; znacznie r&oacute;&#380;ni&#263;, zbli&#380;aj&#261;c si&#281; do poprawnych warto&#347;ci wraz z zag&#281;szczaniem siatki. Powinno si&#281; stosowa&#263; nast&#281;puj&#261;ce podej&#347;cie:
</p>
<ol><li>Po uzyskaniu pierwszych wynik&oacute;w i zanotowaniu ich <i>(zwykle maksymalne napr&#281;&#380;enia von Mises, napr&#281;&#380;enia von Mises w danym miejscu i maksymalne przemieszczenia)</i> nale&#380;y zag&#281;&#347;ci&#263; siatk&#281; <i>(globalnie lub lepiej lokalnie - przy pomocy narz&#281;dzia <a href="../pl/FEM_MeshRegion.html" title="FEM MeshRegion/pl">MES: Obszar siatki</a>)</i> i ponownie uruchomi&#263; analiz&#281;.</li>
<li>Sprawd&#378; wyniki i zanotuj ich nowe warto&#347;ci. Je&#347;li odbiegaj&#261; znacznie od pocz&#261;tkowych warto&#347;ci, ponownie zag&#281;&#347;&#263; siatk&#281; i uruchom analiz&#281;.</li>
<li>Powt&oacute;rz proces je&#347;li wyniki nadal si&#281; znacz&#261;co zmieniaj&#261; <i>(zwykle rosn&#261;)</i> wraz z zag&#281;szczaniem siatki.</li></ol>
<p>Zwykle pomaga utworzenie wykresu z danym wynikiem w funkcji g&#281;sto&#347;ci siatki. W ten spos&oacute;b &#322;atwiej zauwa&#380;y&#263; kiedy wyniki zaczynaj&#261; si&#281; zbiega&#263;. Akceptowalna r&oacute;&#380;nica w wynikach mi&#281;dzy dwoma uruchomieniami to zwykle kilka procent <i>(np. poni&#380;ej 5%)</i>.
</p><p>W niekt&oacute;rych przypadkach zdarza si&#281;, &#380;e maksymalne napr&#281;&#380;enia rosn&#261; w niesko&#324;czono&#347;&#263; niezale&#380;nie od tego, jak g&#281;sta jest siatka. Taki niefizyczny efekt to osobliwo&#347;&#263; napr&#281;&#380;e&#324;. Mo&#380;e mie&#263; kilka powod&oacute;w:
</p>
<ul><li>si&#322;y skupione <i>(punktowe)</i> przy&#322;o&#380;one do modeli bry&#322;owych i pow&#322;okowych,</li>
<li>warunki brzegowe zadane w punktach <i>(pojedynczych w&#281;z&#322;ach)</i>,</li>
<li>ostre naro&#380;niki,</li>
<li>kontakt wyst&#281;puj&#261;cy w naro&#380;niku.</li></ul>
<p>Typowe sposoby radzenia sobie z osobliwo&#347;ciami napr&#281;&#380;e&#324; to:
</p>
<ul><li>zadawanie obci&#261;&#380;e&#324; i warunk&oacute;w brzegowych na ma&#322;e powierzchnie zamiast punkt&oacute;w - zobacz sekcj&#281; o partycjonowaniu powy&#380;ej</li>
<li>dodawania ma&#322;ych zaokr&#261;gle&#324; do ostrych naro&#380;nik&oacute;w <i>(wyj&#261;tek zasady pomijania ma&#322;ych zaokr&#261;gle&#324; podczas upraszczania modeli do analiz)</i>,</li>
<li>dodanie plastyczno&#347;ci do zachowania materia&#322;u aby umo&#380;liwi&#263; redystrybucj&#281; napr&#281;&#380;e&#324; i ograniczy&#263; je do warto&#347;ci, na jakie pozwala definicja plastyczno&#347;ci przy obserwowaniu odpowiedniego poziomu uplastycznienia <i>(odkszta&#322;cenia plastyczne)</i>,</li>
<li>ignorowanie osobliwo&#347;ci i odczytywanie wynik&oacute;w z dala od nich je&#347;li to mo&#380;liwe <i>(w oparciu o regu&#322;&#281; St. Venanta)</i>.</li></ul>
<p><span typeof="mw:File"><a href="../index.php?title=FEM_mesh_convergence.PNG&amp;filetimestamp=20240105102927&amp;.html" class="mw-file-description"><img src="../File/FEM_mesh_convergence.PNG" decoding="async" width="400" height="332" class="mw-file-element" data-file-width="850" data-file-height="706"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Typowe wykresy zbie&#380;no&#347;ci siatki:<br>
- przemieszczenia <i>(<b>zielona krzywa</b>)</i> zbiegaj&#261; si&#281; szybko,<br>
- maksymalne napr&#281;&#380;enia w karbie takim jak otw&oacute;r <i>(<b>niebieska krzywa</b>)</i> potrzebuj&#261; wi&#281;cej iteracji zag&#281;szczania siatki aby si&#281; zbiega&#263;,<br>
- maksymalne napr&#281;&#380;enia w ostrym naro&#380;niku z warunkiem brzegowym utwierdzenia <i>(<b>czerwona krzywa</b>)</i> nie zbiegaj&#261; si&#281; w og&oacute;le - wyst&#281;puje osobliwo&#347;&#263; napr&#281;&#380;e&#324; i potrzebne jest ma&#322;e zaokr&#261;glenie i zamodelowanie po&#322;&#261;czenia w bardziej realistyczny, podatny spos&oacute;b aby unikn&#261;&#263; tego zjawiska.<br></p>
<p><br>
</p>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><span typeof="mw:File"><a href="../index.php?title=Workbench_FEM.svg&amp;filetimestamp=20240405093343&amp;.html" class="mw-file-description"><img src="../File/Workbench_FEM.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../pl/FEM_Workbench.html" title="FEM Workbench/pl">&#346;rodowisko pracy MES</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><a href="../pl/FEM_Analysis.html" title="FEM Analysis/pl">Analiza MES</a></li></ul>
<ul><li><b>Materia&#322;:</b> <a href="../pl/FEM_MaterialSolid.html" title="FEM MaterialSolid/pl">Bry&#322;a</a>, <a href="../pl/FEM_MaterialFluid.html" title="FEM MaterialFluid/pl">Ciecz</a>, <a href="../pl/FEM_MaterialMechanicalNonlinear.html" title="FEM MaterialMechanicalNonlinear/pl">Nieliniowy materia&#322; mechaniczny</a>, <a href="../pl/FEM_MaterialReinforced.html" title="FEM MaterialReinforced/pl">Materia&#322; zbrojony (beton)</a>, <a href="../pl/FEM_MaterialEditor.html" title="FEM MaterialEditor/pl">Edytor materia&#322;u</a></li></ul>
<ul><li><b>Geometria elementu:</b> <a href="../pl/FEM_ElementGeometry1D.html" title="FEM ElementGeometry1D/pl">Geometria elementu</a>, <a href="../pl/FEM_ElementRotation1D.html" title="FEM ElementRotation1D/pl">Obr&oacute;t w ok&oacute;&#322; osi</a>, <a href="../pl/FEM_ElementGeometry2D.html" title="FEM ElementGeometry2D/pl">Geometria elementu 2D</a>, <a href="../pl/FEM_ElementFluid1D.html" title="FEM ElementFluid1D/pl">Element przep&#322;ywu</a></li></ul>
<hr>
<p><b>Wi&#261;zania</b>
</p>
<ul><li><b>Elektromagnetyczne:</b> <a href="../pl/FEM_ConstraintElectrostaticPotential.html" title="FEM ConstraintElectrostaticPotential/pl">Potencja&#322; elektryczny</a>, <a href="../pl/FEM_ConstraintCurrentDensity.html" title="FEM ConstraintCurrentDensity/pl">G&#281;sto&#347;&#263; pr&#261;du</a>, <a href="../pl/FEM_ConstraintMagnetization.html" title="FEM ConstraintMagnetization/pl">Magnetyzacja</a></li></ul>
<ul><li><b>Ciecz:</b> <a href="../pl/FEM_ConstraintInitialFlowVelocity.html" title="FEM ConstraintInitialFlowVelocity/pl">Warunek pocz&#261;tkowy pr&#281;dko&#347;ci przep&#322;ywu</a>, <a href="../pl/FEM_ConstraintInitialPressure.html" title="FEM ConstraintInitialPressure/pl">Ci&#347;nienie pocz&#261;tkowe</a>, <a href="../pl/FEM_ConstraintFlowVelocity.html" title="FEM ConstraintFlowVelocity/pl">Pr&#281;dko&#347;&#263; przep&#322;ywu</a></li></ul>
<ul><li><b>Geometryczne:</b> <a href="../pl/FEM_ConstraintPlaneRotation.html" title="FEM ConstraintPlaneRotation/pl">Obr&oacute;t w p&#322;aszczy&#378;nie</a>, <a href="../pl/FEM_ConstraintSectionPrint.html" title="FEM ConstraintSectionPrint/pl">Zapis wynik&oacute;w z przekroju</a>, <a href="../pl/FEM_ConstraintTransform.html" title="FEM ConstraintTransform/pl">Zdefiniuj odkszta&#322;cenie</a></li></ul>
<ul><li><b>Mechaniczne:</b> <a href="../pl/FEM_ConstraintFixed.html" title="FEM ConstraintFixed/pl">Zdefiniuj przytwierdzenie</a>, <a href="../pl/FEM_ConstraintDisplacement.html" title="FEM ConstraintDisplacement/pl">Zdefiniuj przemieszczenie</a>, <a href="../pl/FEM_ConstraintContact.html" title="FEM ConstraintContact/pl">Zdefiniuj kontakt</a>, <a href="../pl/FEM_ConstraintTie.html" title="FEM ConstraintTie/pl">Zdefiniuj powi&#261;zanie</a>, <a href="../pl/FEM_ConstraintSpring.html" title="FEM ConstraintSpring/pl">Wi&#261;zanie spr&#281;&#380;yny</a>, <a href="../pl/FEM_ConstraintForce.html" title="FEM ConstraintForce/pl">Zdefiniuj si&#322;&#281;</a>, <a href="../pl/FEM_ConstraintPressure.html" title="FEM ConstraintPressure/pl">Zdefiniuj obci&#261;&#380;enie ci&#347;nieniem</a>, <a href="../pl/FEM_ConstraintCentrif.html" title="FEM ConstraintCentrif/pl">Zdefiniuj si&#322;&#281; od&#347;rodkow&#261;</a>, <a href="../pl/FEM_ConstraintSelfWeight.html" title="FEM ConstraintSelfWeight/pl">Zdefiniuj obci&#261;&#380;enie ci&#281;&#380;arem w&#322;asnym</a></li></ul>
<ul><li><b>Termiczne:</b> <a href="../pl/FEM_ConstraintInitialTemperature.html" title="FEM ConstraintInitialTemperature/pl">Warunek pocz&#261;tkowy temperatury</a>, <a href="../pl/FEM_ConstraintHeatflux.html" title="FEM ConstraintHeatflux/pl">Zdefiniuj strumie&#324; ciep&#322;a</a>, <a href="../pl/FEM_ConstraintTemperature.html" title="FEM ConstraintTemperature/pl">Zdefiniuj temperatur&#281;</a>, <a href="../pl/FEM_ConstraintBodyHeatSource.html" title="FEM ConstraintBodyHeatSource/pl">Zdefiniuj obj&#281;to&#347;ciowe &#378;r&oacute;d&#322;o ciep&#322;a</a></li></ul>
<ul><li><b>Zmieniaj&#261;ce wi&#261;zania:</b> <a href="../pl/FEM_ConstantVacuumPermittivity.html" title="FEM ConstantVacuumPermittivity/pl">Zdefiniuj przenikalno&#347;&#263; elektryczn&#261; pr&oacute;&#380;ni</a></li></ul>
<hr>
<ul><li><b>Siatki:</b> <a href="../pl/FEM_MeshNetgenFromShape.html" title="FEM MeshNetgenFromShape/pl">Siatka Netgen</a>, <a href="../pl/FEM_MeshGmshFromShape.html" title="FEM MeshGmshFromShape/pl">Siatka GMSH</a>, <a href="../pl/FEM_MeshBoundaryLayer.html" title="FEM MeshBoundaryLayer/pl">Warstwa graniczna siatki</a>, <a href="../pl/FEM_MeshRegion.html" title="FEM MeshRegion/pl">Obszar siatki</a>, <a href="../pl/FEM_MeshGroup.html" title="FEM MeshGroup/pl">Grupa siatki</a>, <a href="../pl/FEM_CreateNodesSet.html" title="FEM CreateNodesSet/pl">Utw&oacute;rz zestaw w&#281;z&#322;&oacute;w</a>, <a href="../pl/FEM_FemMesh2Mesh.html" title="FEM FemMesh2Mesh/pl">Siatka MES na obiekt &#347;rodowiska Siatka</a></li></ul>
<ul><li><b>Solver:</b> <a href="../pl/FEM_SolverCalculixCcxtools.html" title="FEM SolverCalculixCcxtools/pl">Narz&#281;dzia CalculiX</a>, <a href="../pl/FEM_SolverElmer.html" title="FEM SolverElmer/pl">Elmer</a>, <a href="../pl/FEM_SolverMystran.html" title="FEM SolverMystran/pl">Mystran</a>, <a href="../pl/FEM_SolverZ88.html" title="FEM SolverZ88/pl">Z88</a>; <b>R&oacute;wnania:</b> <a href="../pl/FEM_EquationElasticity.html" title="FEM EquationElasticity/pl">Elastyczno&#347;ci</a>, <a href="../pl/FEM_EquationElectrostatic.html" title="FEM EquationElectrostatic/pl">Elektrostatyczne</a>, <a href="../pl/FEM_EquationElectricforce.html" title="FEM EquationElectricforce/pl">Si&#322;y elektrostatycznej</a>, <a href="../pl/FEM_EquationMagnetodynamic.html" title="FEM EquationMagnetodynamic/pl">Magnetodynamiczne</a>, <a href="../pl/FEM_EquationMagnetodynamic2D.html" title="FEM EquationMagnetodynamic2D/pl">RMagnetodynamiczne 2D</a>, <a href="../pl/FEM_EquationFlow.html" title="FEM EquationFlow/pl">Przep&#322;ywu</a>, <a href="../pl/FEM_EquationFlux.html" title="FEM EquationFlux/pl">Strumienia</a>, <a href="../pl/FEM_EquationHeat.html" title="FEM EquationHeat/pl">Ciep&#322;a</a>; <b>Solver:</b> <a href="../pl/FEM_SolverControl.html" title="FEM SolverControl/pl">Kontrola pracy solvera</a>, <a href="../pl/FEM_SolverRun.html" title="FEM SolverRun/pl">Uruchom solver</a></li></ul>
<ul><li><b>Wyniki:</b> <a href="../pl/FEM_ResultsPurge.html" title="FEM ResultsPurge/pl">Oczyszczanie z wynik&oacute;w</a>, <a href="../pl/FEM_ResultShow.html" title="FEM ResultShow/pl">Prezentacja wynik&oacute;w</a>; <b>Postprocessing:</b> <a href="../pl/FEM_PostApplyChanges.html" title="FEM PostApplyChanges/pl">Zastosuj zmiany</a>, <a href="../pl/FEM_PostPipelineFromResult.html" title="FEM PostPipelineFromResult/pl">Prezentacja graficzna</a>, <a href="../pl/FEM_PostFilterWarp.html" title="FEM PostFilterWarp/pl">Filtr rozpraszaj&#261;cy</a>, <a href="../pl/FEM_PostFilterClipScalar.html" title="FEM PostFilterClipScalar/pl">Skalarny filtr obcinaj&#261;cy</a>, <a href="../pl/FEM_PostFilterCutFunction.html" title="FEM PostFilterCutFunction/pl">Filtr odci&#281;cia funkcji</a>, <a href="../pl/FEM_PostFilterClipRegion.html" title="FEM PostFilterClipRegion/pl">Filtr odci&#281;cia obszaru</a>, <a href="../pl/FEM_PostFilterContours.html" title="FEM PostFilterContours/pl">Filtr kontur&oacute;w</a>, <a href="../pl/FEM_PostFilterDataAlongLine.html" title="FEM PostFilterDataAlongLine/pl">Filtr danych wzd&#322;u&#380; linii</a>, <a href="../pl/FEM_PostFilterLinearizedStresses.html" title="FEM PostFilterLinearizedStresses/pl">Wykres liniowo&#347;ci napr&#281;&#380;e&#324;</a>, <a href="../pl/FEM_PostFilterDataAtPoint.html" title="FEM PostFilterDataAtPoint/pl">Filtr obcinania danych w punkcie</a>, <a href="../pl/FEM_PostCreateFunctions.html" class="mw-redirect" title="FEM PostCreateFunctions/pl">Utw&oacute;rz funkcj&#281;</a>, <a href="../pl/FEM_PostCreateFunctionPlane.html" title="FEM PostCreateFunctionPlane/pl">Filtr funkcji p&#322;aszczyzny</a>, <a href="../pl/FEM_PostCreateFunctionSphere.html" title="FEM PostCreateFunctionSphere/pl">Filtr funkcji sfery</a>, <a href="../pl/FEM_PostCreateFunctionCylinder.html" title="FEM PostCreateFunctionCylinder/pl">Filtr funkcji walca</a>, <a href="../pl/FEM_PostCreateFunctionBox.html" title="FEM PostCreateFunctionBox/pl">Filtr funkcji prostopad&#322;o&#347;cianu</a></li></ul>
<ul><li><b>Narz&#281;dzia:</b> <a href="../pl/FEM_ClippingPlaneAdd.html" title="FEM ClippingPlaneAdd/pl">P&#322;aszczyzna tn&#261;ca</a>, <a href="../pl/FEM_ClippingPlaneRemoveAll.html" title="FEM ClippingPlaneRemoveAll/pl">Usu&#324; p&#322;aszczyzn&#281; tn&#261;ca</a>, <a href="../pl/FEM_Examples.html" title="FEM Examples/pl">Przyk&#322;ady</a>; <a href="../pl/FEM_MeshClear.html" title="FEM MeshClear/pl">Usu&#324; siatk&#281;</a>, <a href="../pl/FEM_MeshDisplayInfo.html" title="FEM MeshDisplayInfo/pl">Informacje o siatce</a></li></ul>
<hr>
<ul><li><b>Dodatkowe:</b> <a href="../pl/FEM_Preferences.html" title="FEM Preferences/pl">Konfiguracja</a>, <a href="../pl/FEM_Install.html" title="FEM Install/pl">Instalacja &#347;rodowiska MES</a>, <a href="../pl/FEM_Mesh.html" title="FEM Mesh/pl">Siatka</a>, <a href="../pl/FEM_Solver.html" title="FEM Solver/pl">FEM Solver</a>, <a href="../pl/FEM_CalculiX.html" title="FEM CalculiX/pl">CalculiX</a>, <a href="../pl/FEM_Concrete.html" title="FEM Concrete/pl">Beton</a>, <a href="../pl/FEM_Element_Types.html" title="FEM Element Types/pl">Rodzaje element&oacute;w</a></li></ul></div>
    </div></div>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><span typeof="mw:File"><a href="../index.php?title=User_hub.png&amp;filetimestamp=20190221145008&amp;.html" class="mw-file-description"><img src="../File/User_hub.png" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../pl/User_hub.html" title="User hub/pl">Centrum u&#380;ytkownika</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b><a href="../pl/Getting_started.html" title="Getting started/pl">Jak zacz&#261;&#263;</a></b></li>
<li><b>Instalacja:</b> <a href="../pl/Download.html" title="Download/pl">Pobieranie programu</a>, <a href="../pl/Installing_on_Windows.html" title="Installing on Windows/pl">Windows</a>, <a href="../pl/Installing_on_Linux.html" title="Installing on Linux/pl">Linux</a>, <a href="../pl/Installing_on_Mac.html" title="Installing on Mac/pl">Mac</a>, <a href="../pl/Installing_additional_components.html" title="Installing additional components/pl">Dodatkowych komponent&oacute;w</a>, <a href="../pl/Compile_on_Docker.html" title="Compile on Docker/pl">Docker</a>, <a href="../pl/AppImage.html" title="AppImage/pl">AppImage</a>, <a href="../pl/Ubuntu_Snap.html" title="Ubuntu Snap/pl">Ubuntu Snap</a></li>
<li><b>Podstawy:</b> <a href="../pl/About_FreeCAD.html" title="About FreeCAD/pl">Informacje na temat FreeCAD</a>, <a href="../pl/Interface.html" title="Interface/pl">Interfejs u&#380;ytkownika</a>, <a href="../pl/Mouse_navigation.html" title="Mouse navigation/pl">Profil nawigacji myszk&#261;</a>, <a href="../pl/Selection_methods.html" title="Selection methods/pl">Metody wyboru</a>, <a href="../pl/Object_name.html" title="Object name/pl">Nazwa obiektu</a>, <a href="../pl/Preferences_Editor.html" title="Preferences Editor/pl">Edytor ustawie&#324;</a>, <a href="../pl/Workbenches.html" title="Workbenches/pl">&#346;rodowiska pracy</a>, <a href="../pl/Document_structure.html" title="Document structure/pl">Struktura dokumentu</a>, <a href="../pl/Property.html" title="Property/pl">W&#322;a&#347;ciwo&#347;ci</a>, <a href="../pl/Help_FreeCAD.html" title="Help FreeCAD/pl">Pom&oacute;&#380; w rozwoju FreeCAD</a>, <a href="../pl/Donate.html" title="Donate/pl">Dotacje</a></li></ul>
<hr>
<ul><li><b>Pomoc:</b> <a href="../pl/Tutorials.html" title="Tutorials/pl">Poradniki</a>, <a href="../pl/Video_tutorials.html" title="Video tutorials/pl">Wideo poradniki</a></li>
<li><b><a href="../pl/Workbenches.html" title="Workbenches/pl">&#346;rodowiska pracy</a>:</b> <a href="../pl/Std_Base.html" title="Std Base/pl">Strona Startowa</a>, <a href="../pl/Assembly_Workbench.html" title="Assembly Workbench/pl">Z&#322;o&#380;enie</a>, <a href="../pl/Arch_Workbench.html" title="Arch Workbench/pl">BIM</a>, <a href="../pl/CAM_Workbench.html" title="CAM Workbench/pl">CAM</a>, <a href="../pl/Draft_Workbench.html" title="Draft Workbench/pl">Rysunek Roboczy</a>, <a href="../pl/FEM_Workbench.html" title="FEM Workbench/pl">MES</a>, <a href="../pl/Inspection_Workbench.html" title="Inspection Workbench/pl">Inspekcja</a>, <a href="../pl/Mesh_Workbench.html" title="Mesh Workbench/pl">Siatka</a>, <a href="../pl/OpenSCAD_Workbench.html" title="OpenSCAD Workbench/pl">OpenSCAD</a>, <a href="../pl/Part_Workbench.html" title="Part Workbench/pl">Cz&#281;&#347;&#263;</a>, <a href="../pl/PartDesign_Workbench.html" title="PartDesign Workbench/pl">Projekt Cz&#281;&#347;ci</a>, <a href="../pl/Points_Workbench.html" title="Points Workbench/pl">Punkty</a>, <a href="../pl/Reverse_Engineering_Workbench.html" title="Reverse Engineering Workbench/pl">In&#380;ynieria Wsteczna</a>, <a href="../pl/Robot_Workbench.html" title="Robot Workbench/pl">Robot</a>, <a href="../pl/Sketcher_Workbench.html" title="Sketcher Workbench/pl">Szkicownik</a>, <a href="../pl/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/pl">Arkusz Kalkulacyjny</a>, <a href="../pl/Surface_Workbench.html" title="Surface Workbench/pl">Powierzchnia 3D</a>, <a href="../pl/TechDraw_Workbench.html" title="TechDraw Workbench/pl">Rysunek Techniczny</a>, <a href="../pl/Testing.html" title="Testing/pl">Test Framework</a></li></ul>
<hr>
<ul><li><b><a href="../pl/Addon.html" title="Addon/pl">Dodatki</a>:</b> <a href="../pl/Std_AddonMgr.html" title="Std AddonMgr/pl">Menad&#380;er dodatk&oacute;w</a>, <a href="../pl/External_workbenches.html" title="External workbenches/pl">Zewn&#281;trzne &#347;rodowiska pracy</a>, <a href="../pl/Scripting_and_macros.html" title="Scripting and macros/pl">Skrypty i makrodefinicje</a></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="../pl/User_hub.html" title="User hub/pl">Centrum u&#380;ytkownika</a>, <a href="../pl/Power_users_hub.html" title="Power users hub/pl">Centrum Power u&#380;ytkownika</a>, <a href="../pl/Developer_hub.html" title="Developer hub/pl">Centrum programisty</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20251001101952
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.119 seconds
Real time usage: 0.141 seconds
Preprocessor visited node count: 566/1000000
Post&#8208;expand include size: 29634/2097152 bytes
Template argument size: 8632/2097152 bytes
Highest expansion depth: 7/100
Expensive parser function count: 2/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1864/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   19.578      1 -total
 20.80%    4.072      1 Template:FEM_Tools_navi/pl
 15.16%    2.968      1 Template:TutorialInfo/pl
 13.55%    2.652      1 Template:FALSE/pl
 12.89%    2.523      2 Template:Navigation_menu_2
 12.49%    2.445     13 Template:Caption
 12.15%    2.378      1 Template:PropertyData
  8.75%    1.713      2 Template:Variable
  7.22%    1.414      2 Template:Code
  6.65%    1.302      1 Template:PropertyView
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:332851-0!canonical and timestamp 20251001101952 and revision id 1653109. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>