<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">FreeCAD Managing Expectations/pl</span></h1><?xml encoding="UTF-8"><div class="mw-parser-output"><div class="mw-pt-languages noprint" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../de/FreeCAD_Managing_Expectations.html" class="mw-pt-progress mw-pt-progress--low" title="FreeCAD MitErwartungenUmgehen (36% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../FreeCAD_Managing_Expectations.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="FreeCAD Managing Expectations (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../fr/FreeCAD_Managing_Expectations.html" class="mw-pt-progress mw-pt-progress--complete" title="FreeCAD - G&eacute;rer les attentes (94% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="pl" dir="ltr">polski</span></li></ul></div>
<div id="itsfree" style="text-align:center;color:black;background:#FDE0A8;margin:1em 7em;padding:0.5em 2em;border:2px solid #FF5706;">Chocia&#380; witamy i zach&#281;camy do rozwoju i uczestnictwa w&#347;r&oacute;d spo&#322;eczno&#347;ci, &#380;&#261;dania, emocjonalne tyrady i dzikie roszczenia s&#261; og&oacute;lnie s&#322;abo odbierane, poniewa&#380; nasza spo&#322;eczno&#347;&#263; sk&#322;ada si&#281; z wielu do&#347;wiadczonych i pe&#322;nych pasji zwolennik&oacute;w FreeCAD, kt&oacute;rzy wielokrotnie s&#322;yszeli podobne o&#347;wiadczenia. Je&#347;li zauwa&#380;ysz brak jakiej&#347; funkcji lub co&#347;, co Ci&#281; denerwuje, gor&#261;co zach&#281;camy do rozwa&#380;enia zaanga&#380;owania si&#281; w sam kod. FreeCAD jest w du&#380;ej mierze rozwijany przez stosunkowo niewielk&#261; grup&#281; utalentowanych ludzi, kt&oacute;rzy maj&#261; prac&#281; dzienn&#261;, rodziny i inne zainteresowania poza programowaniem na &#380;&#261;danie. Je&#347;li masz umiej&#281;tno&#347;ci <i>(Python / C++)</i> i motywacj&#281; do udzia&#322;u, Tw&oacute;j wk&#322;ad mo&#380;e sprawi&#263;, &#380;e FreeCAD b&#281;dzie jeszcze lepszy ni&#380; obecnie. Mo&#380;esz znale&#378;&#263; &#347;ledzone b&#322;&#281;dy / pro&#347;by o funkcje na stronie <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/issues">zg&#322;oszenia</a>.</div>
<div style="clear:right; margin-bottom: .5em; float: right; padding: .5em 0 .8em 1.4em; background: none;"><meta property="mw:PageProp/toc"></div>
<p><span id="Purpose"></span>
</p>
<h2><span class="mw-headline" id="Przeznaczenie">Przeznaczenie</span></h2>
<p>Ta strona wiki jest przeznaczona dla nowych u&#380;ytkownik&oacute;w programu FreeCAD odchodz&#261;cych z innych rozwi&#261;za&#324; CAD / CAM.
</p><p><span id="Opening_statement"></span>
</p>
<h2><span id="S.C5.82owo_wst.C4.99pne"></span><span class="mw-headline" id="S&#322;owo_wst&#281;pne">S&#322;owo wst&#281;pne</span></h2>
<p>Wielu hobbyst&oacute;w, niezale&#380;nych projektant&oacute;w i ma&#322;ych firm cz&#281;sto szuka schronienia przed wysokimi kosztami i ograniczeniami licencyjnymi komercyjnego oprogramowania, a mo&#380;e po prostu wybierasz FreeCAD, poniewa&#380; wierzysz w filozofi&#281; stoj&#261;c&#261; za <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/FOSS">FOSS</a>. W ka&#380;dym z tych przypadk&oacute;w, WITAMY! Jest wielu u&#380;ytkownik&oacute;w, tak jak Ty, kt&oacute;rzy z powodzeniem przeszli na FreeCAD dla swoich osobistych i zawodowych potrzeb. Ta strona wiki jest zaprojektowana aby pom&oacute;c Ci w osi&#261;gni&#281;ciu sukcesu i ustali&#263; realistyczne oczekiwania podczas nurkowania w <i>FreeCAD Way</i>, kt&oacute;ry najprawdopodobniej r&oacute;&#380;ni si&#281; od tego do czego przywyk&#322;e&#347; w innych popularnych programach CAD.
</p><p><span id="What_can_I_expect?"></span>
</p>
<h2><span id="Czego_mog.C4.99_si.C4.99_spodziewa.C4.87.3F"></span><span class="mw-headline" id="Czego_mog&#281;_si&#281;_spodziewa&#263;?">Czego mog&#281; si&#281; spodziewa&#263;?</span></h2>
<p>W swoim rdzeniu FreeCAD jest modelerem parametrycznym. Wykorzystuje koncepcj&#281; &#347;rodowisk pracy, gdzie ka&#380;de &#347;rodowisko jest odpowiedzialne za konkretne zadania i funkcje. Jako taki mo&#380;e by&#263; u&#380;ywany do wielu cel&oacute;w. Jest aktywnie wykorzystywany w produkcji i do&#347;&#263; stabilny. Jednak, jak ka&#380;dy inny program CAD, FreeCAD nie jest w 100% stabilny.
</p><p><br>
W swoim rdzeniu FreeCAD jest pot&#281;&#380;nym modelerem parametrycznym. Wykorzystuje on modu&#322;ow&#261; koncepcj&#281; <i>&#347;rodowisk pracy</i>, gdzie ka&#380;de z nich odpowiada za okre&#347;lone zadania i funkcje. Koncepcja ta jest bardzo elastyczna i mo&#380;e by&#263; z powodzeniem wykorzystywana do wielu cel&oacute;w. FreeCAD jest aktywnie rozwijany, u&#380;ywany w produkcji i do&#347;&#263; stabilny, ale jak ka&#380;dy inny program CAD, nie jest stabilny w 100%.
</p><p>Pochodz&#261;c z innego programu CAD mo&#380;esz uzna&#263; terminologi&#281;, struktur&#281; i organizacj&#281; FreeCADa za nieco obc&#261;. Prawdopodobnie b&#281;dziesz musia&#322; dokona&#263; pewnych dostosowa&#324; w swoich przep&#322;ywach pracy, nauczy&#263; si&#281; funkcjonalnych obej&#347;&#263; lub wykorzysta&#263; nasz pot&#281;&#380;ny ekosystem <a href="../Macros.html" title="Macros">makrodefinicji</a>, ale w wi&#281;kszo&#347;ci przypadk&oacute;w b&#281;dziesz w stanie osi&#261;gn&#261;&#263; to, co chcesz. A je&#347;li potrzebujesz pomocy: mamy bardzo aktywne i responsywne <a rel="nofollow" class="external text" href="https://forum.freecad.org/index.php">forum</a> ch&#281;tne do pomocy. W&#347;r&oacute;d cz&#322;onk&oacute;w forum na pewno s&#261; (byli) u&#380;ytkownicy twojego obecnego programu CAD. Nie wahaj si&#281; wi&#281;c skorzysta&#263; z tych zasob&oacute;w.
</p><p><span id="How_can_I_contribute?"></span>
</p>
<h2><span id="Jak_mog.C4.99_pom.C3.B3c.3F"></span><span class="mw-headline" id="Jak_mog&#281;_pom&oacute;c?">Jak mog&#281; pom&oacute;c?</span></h2>
<p>Jest wiele sposob&oacute;w: mo&#380;esz dokona&#263; <a href="../pl/Donate.html" title="Donate/pl">wp&#322;aty</a>, pom&oacute;c w pytaniach na <a rel="nofollow" class="external text" href="https://forum.freecad.org/index.php">forum</a>, albo napisa&#263; dokumentacj&#281; lub kod. Zobacz <a href="../pl/Help_FreeCAD.html" title="Help FreeCAD/pl">Pomoc FreeCAD</a>.
</p><p><span id="Learning_resources"></span>
</p>
<h2><span class="mw-headline" id="Zasoby_dydaktyczne">Zasoby dydaktyczne</span></h2>
<p><span id="Official"></span>
</p>
<h3><span class="mw-headline" id="Oficjalne">Oficjalne</span></h3>
<ul><li><a href="../pl/Main_Page.html" title="Main Page/pl">To Wiki</a></li>
<li><a rel="nofollow" class="external text" href="https://forum.freecad.org/viewforum.php?f=3">Forum Pomocy</a></li>
<li><a href="../pl/Workarounds.html" title="Workarounds/pl">Obej&#347;cia znanych problem&oacute;w</a></li></ul>
<p><span id="Un-official"></span>
</p>
<h3><span class="mw-headline" id="Nieoficjalne">Nieoficjalne</span></h3>
<p>Nast&#281;puj&#261;ce kana&#322;y YouTube maj&#261; do&#347;&#263; dobrej jako&#347;ci tre&#347;ci skupione wok&oacute;&#322; programu FreeCAD (zaleca si&#281; ignorowanie wszelkich tutoriali opartych na wersji 0.17 lub wcze&#347;niejszej):
</p>
<ul><li><i>MangoJelly Solutions</i> (kilka list odtwarzana dla pocz&#261;tkuj&#261;cych, &#347;rednio-zaawansowanych i zaawansowanych u&#380;ytkownik&oacute;w)</li>
<li><i>Joko EngineeringHelp</i> (filmy dla &#347;rednio-zaawansowanych)</li>
<li><i>Brodie Fairhall</i> (kilka film&oacute;w pomagaj&#261;cych u&#380;ytkownikom Fusion 360 w przej&#347;ciu na FreeCAD)</li>
<li>I wi&#281;cej...</li></ul>
<p><span id="Questions_and_answers"></span>
</p>
<h2><span class="mw-headline" id="Pytania_i_ospowiedzi">Pytania i ospowiedzi</span></h2>
<p><span id='"Can_FreeCAD_do_XYZ?"'></span>
</p>
<h3><span id=".22Czy_FreeCAD_mo.C5.BCe_XYZ.3F.22"></span><span class="mw-headline" id='"Czy_FreeCAD_mo&#380;e_XYZ?"'>"Czy FreeCAD mo&#380;e XYZ?"</span></h3>
<p>FreeCAD ma ju&#380; mo&#380;liwo&#347;&#263; wykonywania nast&#281;puj&#261;cych typ&oacute;w prac:
</p>
<ul><li>Modelowanie parametryczne oparte na splajnie z wykorzystaniem &#347;rodowisk pracy <a href="../pl/Part_Workbench.html" title="Part Workbench/pl">Cz&#281;&#347;&#263;</a>, <a href="../pl/PartDesign_Workbench.html" title="PartDesign Workbench/pl">Projekt Cz&#281;&#347;ci</a> i <a href="../pl/Sketcher_Workbench.html" title="Sketcher Workbench/pl">Szkicownik</a>.</li>
<li>Modelowanie <a href="../pl/Surface_Workbench.html" title="Surface Workbench/pl">Powierzchnii 3D</a> / <a href="../pl/Curves_Workbench.html" title="Curves Workbench/pl">Krzywych</a> z wykorzystaniem NURBS.</li>
<li>Import / modyfikacja <a href="../pl/Mesh_Workbench.html" title="Mesh Workbench/pl">Siatek</a>.</li>
<li>Symulacja z&#322;o&#380;e&#324; <i>(aktywnie rozwijane s&#261; 3 r&oacute;&#380;ne podej&#347;cia, <a href="../pl/A2plus_Workbench.html" title="A2plus Workbench/pl">A2+</a>, <a href="../pl/Assembly3_Workbench.html" title="Assembly3 Workbench/pl">ASM3</a> i <a href="../pl/Assembly4_Workbench.html" title="Assembly4 Workbench/pl">ASM4</a>)</i>.</li>
<li>Projektowanie <a href="../pl/BIM_Workbench.html" title="BIM Workbench/pl">BIM</a>.</li>
<li>Analiza napr&#281;&#380;e&#324; <i>(<a href="../pl/FEM_Workbench.html" title="FEM Workbench/pl">MES</a>)</i>.</li>
<li>Obliczeniowa mechanika p&#322;yn&oacute;w <i>(<a href="../pl/Cfd_Workbench.html" title="Cfd Workbench/pl">CFD</a>)</i>.</li>
<li><a href="../pl/TechDraw_Workbench.html" title="TechDraw Workbench/pl">Rysunek Techniczny</a> / <a href="../pl/Draft_Workbench.html" title="Draft Workbench/pl">Rysunek Roboczy</a>.</li>
<li>Oraz wi&#281;cej <a href="../pl/Workbenches.html" title="Workbenches/pl">podstawowych</a> i <a href="../pl/External_workbenches.html" title="External workbenches/pl">zewn&#281;trznych</a> &#347;rodowisk pracy...</li></ul>
<p><span id='"User_interface_(UI/UX)_is_ugly,_odd,_confusing_or_not_like_XYZ_Software!"'></span>
</p>
<h3><span id=".22Interfejs_u.C5.BCytkownika_.28UI.2FUX.29_jest_brzydki.2C_dziwny.2C_niezrozumia.C5.82y_lub_nie_taki_jak_w_programie_XYZ.21.22"></span><span class="mw-headline" id='"Interfejs_u&#380;ytkownika_(UI/UX)_jest_brzydki,_dziwny,_niezrozumia&#322;y_lub_nie_taki_jak_w_programie_XYZ!"'>"Interfejs u&#380;ytkownika (UI/UX) jest brzydki, dziwny, niezrozumia&#322;y lub nie taki jak w programie XYZ!"</span></h3>
<p>FreeCAD pozwala na <a href="../pl/Interface_Customization.html" title="Interface Customization/pl">rozleg&#322;e dostosowanie</a> interfejsu u&#380;ytkownika. Zdajemy sobie spraw&#281;, &#380;e domy&#347;lne kolory i rozmieszczenie element&oacute;w mo&#380;e nie by&#263; przyjemne dla ka&#380;dego, ale zach&#281;camy do dostosowania go do w&#322;asnych specyficznych potrzeb i organizacji pracy. Je&#347;li uwa&#380;asz, &#380;e uda&#322;o Ci si&#281; wymy&#347;li&#263; mog&#261;cy zdoby&#263; popularno&#347;&#263; uk&#322;ad/temat/pasek narz&#281;dzi itp. zach&#281;camy do skorzystania z niedawno dodanej funkcji <a href="../pl/Preference_Packs.html" title="Preference Packs/pl">Paczki Preferencji</a> i podzielenia si&#281; ni&#261; ze spo&#322;eczno&#347;ci&#261;. By&#263; mo&#380;e Twoje wysi&#322;ki pomog&#261; komu&#347; innemu w przej&#347;ciu na FreeCAD. Oprogramowanie FOSS rozwija si&#281; dzi&#281;ki wk&#322;adom spo&#322;eczno&#347;ci wszelkiego rodzaju i jest to cz&#281;sty temat dyskusji.
</p><p><span id="&quot;Why_doesn't_this_feature_work_like_in_XYZ_software?&quot;"></span>
</p>
<h3><span id=".22Dlaczego_ta_funkcja_nie_dzia.C5.82a_jak_w_programie_XYZ.3F.22"></span><span class="mw-headline" id='"Dlaczego_ta_funkcja_nie_dzia&#322;a_jak_w_programie_XYZ?"'>"Dlaczego ta funkcja nie dzia&#322;a jak w programie XYZ?"</span></h3>
<p>FreeCAD ma rodow&oacute;d rozwojowy si&#281;gaj&#261;cy ponad <a href="../pl/History.html" title="History/pl">20 lat</a>. Funkcje i zachowania s&#261; intensywnie recenzowane, omawiane i oceniane zanim zostan&#261; dodane lub zmienione. Miej otwarty umys&#322;, podczas gdy mo&#380;e to nie by&#263; oczywiste, prawdopodobnie istnieje bardzo dobre uzasadnienie dla takich rzeczy. Nie oznacza to, &#380;e FreeCAD jest doskona&#322;y, ale prosz&#281; we&#378; pod uwag&#281;, &#380;e to do czego przywyk&#322;e&#347; mo&#380;e nie by&#263; jedynym lub najlepszym sposobem na zrobienie czego&#347;.
</p><p><span id="&quot;I_can't_figure_out_the_workflow_of_FreeCAD!&quot;"></span>
</p>
<h3><span id=".22Nie_mog.C4.99_zrozumie.C4.87_organizacji_pracy_w_programie_FreeCAD.21.22"></span><span class="mw-headline" id='"Nie_mog&#281;_zrozumie&#263;_organizacji_pracy_w_programie_FreeCAD!"'>"Nie mog&#281; zrozumie&#263; organizacji pracy w programie FreeCAD!"</span></h3>
<p>FreeCAD ma filozofi&#281; niedyktowania "jak" go u&#380;ywa&#263;. Zamiast tego dostarcza narz&#281;dzia i szeroki wachlarz opcji, kt&oacute;ry "mo&#380;esz" wykorzysta&#263;. Oznacza to dwie rzeczy. Po pierwsze, oprogramowanie nie b&#281;dzie koniecznie "prowadzi&#263;" lub "kierowa&#263;" Ci&#281; w stron&#281; okre&#347;lonego stylu lub organizacji pracy. Po drugie, oznacza to, &#380;e mo&#380;esz eksperymentowa&#263; z narz&#281;dziami i znale&#378;&#263; to, co dzia&#322;a najlepiej dla Ciebie. Nie oznacza to, &#380;e nie ma og&oacute;lnych <a href="../pl/Feature_editing.html" title="Feature editing/pl">"dobrych praktyk"</a> do uwzgl&#281;dnienia podczas u&#380;ywania programu FreeCAD, ale te najlepsze praktyki generalnie dotycz&#261; ka&#380;dego profesjonalnego oprogramowania do projektowania gdy tworzone s&#261; stabilne modele.
</p><p><span id='"What_the_heck_is_with_all_these_workbenches?"'></span>
</p>
<h3><span id=".22O_co_chodzi_z_tymi_wszystkimi_.C5.9Brodowiskami_pracy.3F.22"></span><span class="mw-headline" id='"O_co_chodzi_z_tymi_wszystkimi_&#347;rodowiskami_pracy?"'>"O co chodzi z tymi wszystkimi &#347;rodowiskami pracy?"</span></h3>
<p>Jedn&#261; z pot&#281;&#380;nych cech FreeCAD jest jego modularno&#347;&#263;. Jest to mo&#380;liwe dzi&#281;ki podzieleniu rozwoju narz&#281;dzi na &#347;rodowiska pracy. Kiedy ju&#380; zapoznasz si&#281; z dostarczonymi narz&#281;dziami, mog&#261; one cz&#281;sto dzia&#322;a&#263; synergicznie, aby tworzy&#263; bardzo z&#322;o&#380;one i zaawansowane modele. Doskona&#322;&#261; analogi&#261; jest to, &#380;e FreeCAD ma struktur&#281; podobn&#261; do szafki narz&#281;dziowej mechanika, a ka&#380;dy &#347;rodowisko pracy jest szuflad&#261; z okre&#347;lonymi narz&#281;dziami. Mo&#380;esz u&#380;y&#263; tych narz&#281;dzi do zbudowania samochodu, ale to do mechanika nale&#380;y zrozumienie jak ich u&#380;y&#263; aby osi&#261;gn&#261;&#263; sw&oacute;j cel.
</p><p><span id='"FreeCAD_is_fundamentally_broken,_my_models_blow-up!"'></span>
</p>
<h3><span id=".22FreeCAD_jest_fundamentalnie_zepsuty.2C_moje_modele_si.C4.99_rozwalaj.C4.85.21.22"></span><span class="mw-headline" id='"FreeCAD_jest_fundamentalnie_zepsuty,_moje_modele_si&#281;_rozwalaj&#261;!"'>"FreeCAD jest fundamentalnie zepsuty, moje modele si&#281; rozwalaj&#261;!"</span></h3>
<p>FreeCAD jest zbudowany wok&oacute;&#322; otwartego Kernela Modelowania Geometrycznego nazwanego "<a href="../pl/OpenCASCADE.html" title="OpenCASCADE/pl">OpenCascade Technology</a>" <i>(lub OCC)</i>. Jest to najbardziej bogate w funkcje i dojrza&#322;e dost&#281;pne j&#261;dro modelowania open source. Posiada jednak b&#322;&#281;dy, dziwactwa i ograniczenia. Jeden z nich jest okre&#347;lany <a href="../pl/Topological_naming_problem.html" title="Topological naming problem/pl">"Problemem Nazewnictwa Topologicznego"</a> <i>(lub TNP)</i>. Za ka&#380;dym razem, gdy model jest modyfikowany, wewn&#281;trzne nazwy powierzchni i kraw&#281;dzi s&#261; zmieniane przez kernel, powoduj&#261;c niepo&#380;&#261;dane zachowanie dla wszystkich cech modelu, kt&oacute;re si&#281; do nich odwo&#322;uj&#261;. Obecny cykl rozwoju skupia si&#281; na implementacji algorytmu nazewnictwa zaprojektowanego tak, aby zminimalizowa&#263; ten efekt w wi&#281;kszo&#347;ci przypadk&oacute;w. Nale&#380;y jednak pami&#281;ta&#263;, &#380;e minimalizacja TNP nie jest zamiennikiem dla <a href="../pl/Feature_editing.html" title="Feature editing/pl">dobrych praktyk i technik modelowania</a>.
</p><p><span id="OpenCascade_kernel"></span>
</p>
<h3><span class="mw-headline" id="Kernel_OpenCascade">Kernel OpenCascade</span></h3>
<p>OpenCascade <i>(OCC / OCCT)</i> jest podstawow&#261; zewn&#281;trzn&#261; zale&#380;no&#347;ci&#261; j&#261;dra CAD, od kt&oacute;rej FreeCAD jest ca&#322;kowicie zale&#380;ny. Istnieje wiele otwartych b&#322;&#281;d&oacute;w "upstream", kt&oacute;re spo&#322;eczno&#347;&#263; FreeCAD zidentyfikowa&#322;a i &#347;ledzi w odniesieniu do OCC. &#346;ledzimy je poprzez:
</p>
<ul><li><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/issues?q=is%3Aopen+is%3Aissue+label%3A%223rd+Party%3A+OCC%22">Bugtracker</a></li>
<li><a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=20264">B&#322;&#281;dy OCC w Bugtrackerze <i>(w&#261;tek na forum)</i></a></li></ul>
<p><span id="Additional_links"></span>
</p>
<h2><span id="Odno.C5.9Bniki_internetowe"></span><span class="mw-headline" id="Odno&#347;niki_internetowe">Odno&#347;niki internetowe</span></h2>
<ul><li><a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?f=8&amp;t=43461">Dyskusja: FreeCAD nie jest gotowy na 1.0 (w&#261;tek na forum)</a></li>
<li><a rel="nofollow" class="external text" href="https://www.youtube.com/watch?v=JBmdbipkbrk">Why the GIMP Team Obviously* Hates You (*We Actually Love You. **Mostly)</a> Pat David z prezentacji zespo&#322;u GIMP na SCaLE16x California 2016 r.</li>
<li><a rel="nofollow" class="external text" href="https://vimeo.com/144089061">Earning Your Support Instead of Buying it: A How-to Guide to Open Source Assistance</a> autorstwa <a rel="nofollow" class="external text" href="https://twitter.com/ijturton">Iana Turtona</a> na FOSS4G Seul 2015</li></ul>
<!-- 
NewPP limit report
Cached time: 20250705132155
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc, no&#8208;toc&#8208;conversion]
CPU time usage: 0.041 seconds
Real time usage: 0.056 seconds
Preprocessor visited node count: 109/1000000
Post&#8208;expand include size: 1183/2097152 bytes
Template argument size: 920/2097152 bytes
Highest expansion depth: 3/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 857/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    4.734      1 -total
 53.97%    2.555      1 Template:VeryImportantMessage
 40.64%    1.924      1 Template:TOCright
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:291272-0!canonical and timestamp 20250705132155 and revision id 1602569. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>