<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">History/pl</span></h1><?xml encoding="UTF-8"><div class="mw-parser-output"><div class="mw-pt-languages noprint" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../de/History.html" class="mw-pt-progress mw-pt-progress--complete" title="Geschichte (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../History.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="History (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/History.html" class="mw-pt-progress mw-pt-progress--complete" title="Historia (85% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/History.html" class="mw-pt-progress mw-pt-progress--complete" title="Histoire (93% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/History.html" class="mw-pt-progress mw-pt-progress--complete" title="La storia di FreeCAD (93% translated)" lang="it" dir="ltr">italiano</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="pl" dir="ltr">polski</span></li>
<li><a href="../pt/History.html" class="mw-pt-progress mw-pt-progress--stub" title="History/pt (0% translated)" lang="pt" dir="ltr">portugu&ecirc;s</a></li>
<li><a href="../pt-br/History.html" class="mw-pt-progress mw-pt-progress--high" title="Historia (67% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../ro/History.html" class="mw-pt-progress mw-pt-progress--stub" title="Istorie (12% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><a href="../ru/History.html" class="mw-pt-progress mw-pt-progress--low" title="&#1048;&#1089;&#1090;&#1086;&#1088;&#1080;&#1103; (33% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li>
<li><a href="../zh-cn/History.html" class="mw-pt-progress mw-pt-progress--stub" title="&#21457;&#23637;&#21382;&#21490; (8% translated)" lang="zh-Hans-CN" dir="ltr">&#20013;&#25991;&#65288;&#20013;&#22269;&#22823;&#38470;&#65289;</a></li>
<li><a href="../ja/History.html" class="mw-pt-progress mw-pt-progress--stub" title="&#27508;&#21490; (12% translated)" lang="ja" dir="ltr">&#26085;&#26412;&#35486;</a></li>
<li><a href="../ko/History.html" class="mw-pt-progress mw-pt-progress--stub" title="&#50669;&#49324; (5% translated)" lang="ko" dir="ltr">&#54620;&#44397;&#50612;</a></li></ul></div>
<meta property="mw:PageProp/toc">
<h2><span id="Pocz.C4.85tki"></span><span class="mw-headline" id="Pocz&#261;tki">Pocz&#261;tki</span></h2>
<figure typeof="mw:File/Thumb"><a href="../index.php?title=Screenshot_mesh.jpg&amp;filetimestamp=20090514190409&amp;.html" class="mw-file-description"><img src="../File/Screenshot_mesh.jpg" decoding="async" width="300" height="227"></a><figcaption>Wczesny FreeCAD, wersja nieznana</figcaption></figure>
<figure typeof="mw:File/Thumb"><a href="../index.php?title=Part_BooleanOperations.png&amp;filetimestamp=20090426092531&amp;.html" class="mw-file-description"><img src="../File/Part_BooleanOperations.png" decoding="async" width="300" height="231"></a><figcaption>FreeCAD w wersji 0.7 z 2009 roku</figcaption></figure>
<h2><span id="Jak_to_si.C4.99_wszystko_zacz.C4.99.C5.82o"></span><span class="mw-headline" id="Jak_to_si&#281;_wszystko_zacz&#281;&#322;o">Jak to si&#281; wszystko zacz&#281;&#322;o</span></h2>
<p>Pocz&#261;tki programu FreeCAD si&#281;gaj&#261; stycznia 2001 roku, kiedy <a href="../User;Jriegel.html" title="User:Jriegel">J&uuml;rgen Riegel</a> rozpocz&#261;&#322; prac&#281; nad projektem <b>Cas.CADE</b>. Cas.CADE by&#322; komercyjnym szkieletem programistycznym, kt&oacute;ry zawiera&#322; <a href="../Glossary.html#Geometric_modeling_kernel" title="Glossary">j&#261;dro modelowania geometrycznego</a> <i>(lub j&#261;dro CAD)</i>: zosta&#322; on wydany na licencji open source w 2000 roku i przemianowany na <a href="../pl/OpenCASCADE.html" title="OpenCASCADE/pl">OpenCASCADE</a>. Umo&#380;liwi&#322;o to realizacj&#281; otwartego programu CAD 3D, poniewa&#380; zaprogramowanie j&#261;dra CAD od podstaw wymaga&#322;oby ogromnego nak&#322;adu pracy.
</p><p>Jak m&oacute;wi J&uuml;rgen:
</p>
<blockquote class="templatequote"><p><i>Projekt FreeCAD zosta&#322; rozpocz&#281;ty przeze mnie w styczniu 2001, jako tak zwany GOM (Graphical Object Modeler), z pomys&#322;em u&#380;ycia Qt, Pythona i Cas.CADE, komercyjnego CAD-Kernel, kt&oacute;rego u&#380;ywa&#322;em w projektach Daimlera. Cas.CADE sta&#322; si&#281; open source kr&oacute;tko przed tym, wi&#281;c wydawa&#322;o si&#281;, &#380;e nadszed&#322; w&#322;a&#347;ciwy czas, aby spr&oacute;bowa&#263; poruszy&#263; si&#281; w pustej w&oacute;wczas przestrzeni open source CAD. Mia&#322;em dwuletnie do&#347;wiadczenie z OpenCascade w projekcie o nazwie QSpect, w kt&oacute;rym, pod koniec, by&#322;em g&#322;&oacute;wnym projektantem oprogramowania. Nauczy&#322;em si&#281; wiele o programowaniu 3D i CAD. By&#322;em r&oacute;wnie&#380; pod wp&#322;ywem Catia V5 i jej bardzo specjalnego interfejsu u&#380;ytkownika i programowania... W marcu 2002, w ramach projektu OpenCascade, zarejestrowa&#322;em oprogramowanie jako FreeCAD. Nie mog&#322;em wymy&#347;li&#263; lepszej nazwy, jestem bardzo kiepski w nazewnictwie... W kwietniu 2003, Werner Meyer, jeden z koleg&oacute;w w projekcie QSpect, przeszed&#322; do firmy o nazwie Imetric. Kontakt z Imetric by&#322; bardzo obiecuj&#261;cy, poniewa&#380; poszukiwali oni nowej platformy oprogramowania 3D dla swoich czujnik&oacute;w 3D. W 2005 roku Imetric przekaza&#322; wi&#281;kszo&#347;&#263; swojego modu&#322;u Mesh Module do FreeCAD i spo&#322;eczno&#347;ci Open Source, i od tego czasu u&#380;ywaj&#261; FreeCAD jako podstawy dla swojego oprogramowania systemu czujnik&oacute;w. Od tego czasu Werner Meyer jest bardzo aktywnym deweloperem FreeCAD. W 2005 roku, po roku zmaga&#324;, zdecydowa&#322;em si&#281; pozby&#263; si&#281; szkieletu dokument&oacute;w OpenCascade i zast&#261;pi&#263; go w&#322;asn&#261; implementacj&#261;. Tak wi&#281;c, ostatecznie u&#380;ywamy tylko j&#261;dra CAD OpenCascade, a nie reszty jego frameworka. Rok 2007 by&#322; kolejnym interesuj&#261;cym kamieniem milowym. Przeszli&#347;my na QT4 i, co za tym idzie, na licencj&#281; LGPL. W tym czasie wykonali&#347;my wiele pracy, g&#322;&oacute;wnie Werner</i>.</p><div class="templatequotecite">&mdash;<a href="../User;Jriegel.html" title="User:Jriegel">J&uuml;rgen Riegel</a>,&nbsp;<cite><i><a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?f=8&amp;t=295">Kto stoi za FreeCadem?</a></i></cite></div>
</blockquote>
<p>Projekt zosta&#322; og&#322;oszony publicznie na <a rel="nofollow" class="external text" href="https://dev.opencascade.org/forums">Forum OpenCascade</a> w 2003 roku:
</p>
<blockquote class="templatequote"><p><i>Cze&#347;&#263; wszystkim, nazywam si&#281; Juergen Riegel i dzisiaj chc&#281; og&#322;osi&#263; projekt OpenCasCade, FreeCAD. Jest to Open Source CAx RAD oparty na OpenCasCade, QT i Pythonie. Posiada kilka kluczowych koncepcji, takich jak nagrywanie makr, &#347;rodowiska pracy, mo&#380;liwo&#347;&#263; dzia&#322;ania jako serwer i jako dynamicznie &#322;adowane rozszerzenie aplikacji, i jest zaprojektowany jako niezale&#380;ny od platformy... Mimo, &#380;e jest we wczesnej fazie i nie nadaje si&#281; do u&#380;ytku dla u&#380;ytkownik&oacute;w ani programist&oacute;w - pierwsze wydanie dla u&#380;ytkownik&oacute;w jest planowane na koniec 2003 roku - chcia&#322;bym uzyska&#263; kilka opinii na temat kierunku i projektowania FreeCAD. GUI jest prawie sko&#324;czone i teraz my, m&oacute;j wsp&oacute;&#322;tw&oacute;rca Werner Mayer i ja, zacz&#281;li&#347;my dodawa&#263; pierwsze funkcje CAD. FreeCAD mo&#380;e by&#263; postrzegany jako mechaniczny system CAD og&oacute;lnego przeznaczenia, ale my&#347;l&#281;, &#380;e jego pierwszymi odbiorcami b&#281;d&#261; programi&#347;ci CAx, kt&oacute;rzy potrzebuj&#261; podstaw do w&#322;asnego rozwoju</i>.</p><div class="templatequotecite">&mdash;<a href="../User;Jriegel.html" title="User:Jriegel">J&uuml;rgen Riegel</a>,&nbsp;<cite><i><a rel="nofollow" class="external text" href="https://dev.opencascade.org/content/announcing-freecad-project">Og&#322;oszenie projektu FreeCAD w niedziel&#281;, 08/17/2003 - 19:23</a></i></cite></div>
</blockquote>
<h3><span class="mw-headline" id="Werner_Mayer">Werner Mayer</span></h3>
<p>Werner Mayer do&#322;&#261;czy&#322; do projektu jak tylko zosta&#322; on og&#322;oszony jako projekt open source <i>(przed og&#322;oszeniem projekt by&#322; prywatnym projektem J&uuml;rgena)</i>. Zobacz ten post na forum od Wernera w j&#281;zyku niemieckim: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=13&amp;t=40235&amp;start=10#p342330">https://forum.freecad.org/viewtopic.php?f=13&amp;t=40235&amp;start=10#p342330</a>
</p><p>Z czasem projekt nabra&#322; rozmachu i do&#322;&#261;czyli do niego nowi kluczowi wsp&oacute;&#322;pracownicy.
</p>
<ul><li><b>Pocz&#261;tki Linuksa</b></li></ul>
<blockquote class="templatequote"><p><i>Zabawnym faktem jest to, &#380;e chcia&#322; mie&#263; oprogramowanie CAD typu otwarto&#378;r&oacute;d&#322;owego g&#322;&oacute;wnie dla Linuksa, poniewa&#380; w tamtym czasie nie istnia&#322;o w&#322;a&#347;ciwie nic na t&#281; platform&#281;. Jednak&#380;e, od samego pocz&#261;tku, przez nast&#281;pne 1,5 roku pracowali&#347;my wy&#322;&#261;cznie na Windowsie. Potem pewien czeski go&#347;&#263; przyczyni&#322; si&#281; do tego, &#380;e kod rdzenia zosta&#322; zbudowany dla Linuksa.: <a rel="nofollow" class="external free" href="https://github.com/berndhahnebach/All_FreeCAD/commit/9fd2e27c95ba3dc84778d92e2564cd094793ce2f#diff-480477e89f9b6ddafb30c4383dcdd705">https://github.com/berndhahnebach/All_FreeCAD/commit/9fd2e27c95ba3dc84778d92e2564cd094793ce2f#diff-480477e89f9b6ddafb30c4383dcdd705</a></i>
</p></blockquote>
<blockquote class="templatequote"><p><i>P&oacute;&#322; roku p&oacute;&#378;niej kontynuowa&#322;em tworzenie wersji dla Linuxa: <a rel="nofollow" class="external free" href="https://github.com/berndhahnebach/All_FreeCAD/commit/35b962d7d751dd80f7c7781df60f93bc9a3da992">https://github.com/berndhahnebach/All_FreeCAD/commit/35b962d7d751dd80f7c7781df60f93bc9a3da992</a></i>
</p></blockquote>
<p><b>P:</b> Czy mo&#380;esz podzieli&#263; si&#281; tym, jak min&#281;&#322;o pierwsze 1,5 roku? Czy spotykali&#347;cie si&#281; osobi&#347;cie czy online?
</p>
<blockquote class="templatequote"><p><i>C&oacute;&#380;, w tamtym czasie byli&#347;my kolegami </i>(do 2005 roku)<i>, wi&#281;c mogli&#347;my omawia&#263; sprawy twarz&#261; w twarz. Po tym czasie nadal mieli&#347;my kilka osobistych spotka&#324;, ale wi&#281;kszo&#347;&#263; rzeczy omawiali&#347;my przez e-mail lub telefon.</i>
</p></blockquote>
<blockquote class="templatequote"><p><i>Jako trzeci deweloper do&#322;&#261;czy&#322; <b> </b></i><b>Yorik<i> </i></b><i> pod koniec 2007 roku, ale min&#281;&#322;y kolejne 3 lub 4 lata zanim spo&#322;eczno&#347;&#263; i liczba wsp&oacute;&#322;tw&oacute;rc&oacute;w zacz&#281;&#322;a znacz&#261;co rosn&#261;&#263;.</i>
</p></blockquote>
<p><b>P:</b> Czy dzielili&#347;cie zadania lub pracowali&#347;cie nad konkurencyjnymi implementacjami?
</p>
<blockquote class="templatequote"><p><i>Tak. J&uuml;rgen projektowa&#322; i implementowa&#322; wi&#281;kszo&#347;&#263; logiki aplikacji i dokument&oacute;w, a ja zajmowa&#322;em si&#281; podstawami GUI.</i>
</p></blockquote>
<blockquote class="templatequote"><p><i>Nie by&#322; to jednak proces stopniowy, ale na pocz&#261;tku eksperymentowali&#347;my z wieloma rzeczami. Na przyk&#322;ad w pocz&#261;tkowej wersji korzystali&#347;my ze struktury dokument&oacute;w OCC OCAF i jej przegl&#261;darki, ale po roku lub dw&oacute;ch wpadli&#347;my w &#347;lepy zau&#322;ek, poniewa&#380; dokumentacja dotycz&#261;ca OCC by&#322;a bardzo s&#322;aba i nie mogli&#347;my zmusi&#263; jej do pracy, aby rozszerzy&#263; OCAF o nasze w&#322;asne typy element&oacute;w. Zdecydowali&#347;my si&#281; wi&#281;c wykorzysta&#263; tylko mo&#380;liwo&#347;ci modelowania OCC, ale opracowa&#263; w&#322;asne ramy aplikacji / dokument&oacute;w.</i>
</p></blockquote>
<p><b>P:</b> Czy w tamtym czasie my&#347;la&#322;e&#347;, &#380;e FreeCAD b&#281;dzie w tym miejscu, w kt&oacute;rym jest dzisiaj?
</p>
<blockquote class="templatequote"><p><i>Nie wiedzieli&#347;my, ale mieli&#347;my nadziej&#281;. Oczywi&#347;cie nie mogli&#347;my przewidzie&#263;, jak dok&#322;adnie FreeCAD b&#281;dzie wygl&#261;da&#322; dzisiaj.<br>Najwa&#380;niejszymi decyzjami projektowymi by&#322;o udost&#281;pnienie go na wszystkich g&#322;&oacute;wnych platformach i uczynienie ca&#322;ego SW tak przyst&#281;pnym, jak to tylko mo&#380;liwe, tzn. narzucenie wszystkich wa&#380;nych funkcji Pythona, tak aby </i>(zaawansowani)<i> u&#380;ytkownicy byli w stanie rozszerzy&#263; program FreeCAD o w&#322;asne funkcje. W ten spos&oacute;b mieli&#347;my nadziej&#281; na zdobycie szerokiej rzeszy odbiorc&oacute;w.</i>
</p></blockquote>
<p><i>(Zobacz ten post od Wernera na forum <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?f=8&amp;t=47703#p411612">Re: FreeCAD History</a>)</i>
</p>
<h3><span id="Yorik_do.C5.82.C4.85cza_do_projektu"></span><span class="mw-headline" id="Yorik_do&#322;&#261;cza_do_projektu">Yorik do&#322;&#261;cza do projektu</span></h3>
<p>U&#380;ytkownik <a href="../User;Yorik.html" title="User:Yorik">Yorik van Havre</a> do&#322;&#261;czy&#322; do projektu w 2008 roku i rozpocz&#261;&#322; prac&#281; nad <a href="../pl/Draft_Workbench.html" title="Draft Workbench/pl">Rysunek Roboczy</a>. Do tego momentu nie by&#322;o mo&#380;liwo&#347;ci tworzenia geometrii 2D poprzez <a href="../pl/Glossary.html#GUI" title="Glossary/pl">GUI</a>. Modu&#322; ten zosta&#322; zaprogramowany w ca&#322;o&#347;ci w &#347;rodowisku Python, a nie w C++ <i>(podstawowy j&#281;zyk programowania u&#380;ywany w FreeCAD)</i>. Nowe &#347;rodowisko pracy Rysunek Roboczy udowodni&#322;o, &#380;e integracja Pythona jest sukcesem i mo&#380;e by&#263; u&#380;yta do rozszerzenia lub dostosowania mo&#380;liwo&#347;ci programu FreeCAD. Opr&oacute;cz pracy nad &#347;rodowiskiem Rysunek Roboczy, Yorik pracowa&#322; nad rozszerzeniem dokumentacji programu FreeCAD i sta&#322; si&#281; de facto "dyrektorem artystycznym" FreeCAD, tworz&#261;c wiele ikon dla GUI programu FreeCAD i <a href="../pl/Artwork.html" title="Artwork/pl">definiuj&#261;c jego styl</a>.
</p><p>Wersja 0.7 programu FreeCAD wydana w kwietniu 2009 roku by&#322;a pierwsz&#261;, kt&oacute;ra zawiera&#322;a modu&#322; Rysunek Techniczny. Modu&#322; Cz&#281;&#347;&#263; zapewnia&#322; prosty przep&#322;yw pracy <a href="../pl/Glossary.html#Constructive_Solid_Geometry" title="Glossary/pl">CSG</a> z tworzeniem pierwotnych kszta&#322;t&oacute;w i operacjami logicznymi dost&#281;pnymi poprzez menu Cz&#281;&#347;&#263;. Mo&#380;liwe by&#322;o r&oacute;wnie&#380; wyt&#322;aczanie profili 2D i zaokr&#261;glanie.
</p><p>Wersja 0.8 wydana w lipcu 2009 roku zawiera&#322;a kilka nowych element&oacute;w w module Rysunek Roboczy, w tym nowe narz&#281;dzie Wymiar. Modu&#322; Cz&#281;&#347;&#263; zyska&#322; nowy pasek narz&#281;dziowy wraz z nowymi narz&#281;dziami, Obr&oacute;t i Przekr&oacute;j.
</p><p>Pod koniec 2009 roku, FreeCAD zosta&#322; zaakceptowany jako pakiet Debiana w repozytoriach Debiana. FreeCAD zosta&#322; dodany do repozytori&oacute;w Ubuntu 10.04 w 2010 roku.
</p>
<h3><span class="mw-headline" id="Projekt_jest_kontynuowany">Projekt jest kontynuowany</span></h3>
<p>Wersja 0.10 zosta&#322;a wydana w lipcu 2010 roku i wprowadzi&#322;a &#347;rodowisko pracy <a href="../pl/Sketcher_Workbench.html" title="Sketcher Workbench/pl">Szkicownik</a>, oparte na Sketchsolve, solverze opartym na wi&#261;zaniach do tworzenia geometrii 2D. Pierwsza wersja by&#322;a ograniczona do tworzenia prostok&#261;t&oacute;w i linii.
</p><p>Na pocz&#261;tku 2011 roku, korzystaj&#261;c z okazji, jak&#261; da&#322;a platforma online <a rel="nofollow" class="external text" href="https://launchpad.net">Launchpad</a>, powsta&#322; zesp&oacute;&#322; <a rel="nofollow" class="external text" href="https://launchpad.net/~freecad-maintainers">FreeCAD Maintainers team</a>, aby dostarcza&#263; u&#380;ytkownikom systemu operacyjnego Ubuntu &#347;wie&#380;e stabilne wydania wraz z codziennie budowanymi pakietami programu FreeCAD.
</p><p>Wersja 0.11 zosta&#322;a wydana w maju 2011 i wprowadzi&#322;a nowe narz&#281;dzie do projektowania cz&#281;&#347;ci, kt&oacute;re zawiera&#322;o takie narz&#281;dzia jak Wyci&#261;gni&#281;cie, Kiesze&#324;, Zaokr&#261;glenie i Fazka. &#346;rodowisko robocze Rysunek Roboczy otrzyma&#322;o ulepszenia i nowe narz&#281;dzia, takie jak Linia z&#322;o&#380;ona. &#346;rodowisko robocze Robota zawiera&#322;o wi&#281;cej narz&#281;dzi graficznych.
</p><p>Wersja 0.12 zosta&#322;a wydana w styczniu 2012 i zawiera&#322;a bardziej kompletne &#347;rodowisko pracy Szkicownik. Zawiera&#322;a ca&#322;kowicie przepisany solver, FreeGCS. By&#322; to rezultat miesi&#281;cy pracy g&#322;&oacute;wnych programist&oacute;w FreeCAD wraz z nowicjuszami logari81 <i>(kt&oacute;ry zaprogramowa&#322; solver)</i> i mrlukeparry. Dodano wi&#281;cej narz&#281;dzi do &#347;rodowiska pracy Projekt Cz&#281;&#347;ci.
</p>
<h2><span id="Powi.C4.99kszenie_zespo.C5.82u_deweloper.C3.B3w_rdzenia"></span><span class="mw-headline" id="Powi&#281;kszenie_zespo&#322;u_deweloper&oacute;w_rdzenia">Powi&#281;kszenie zespo&#322;u deweloper&oacute;w rdzenia</span></h2>
<p>W kwietniu 2019 roku zesp&oacute;&#322; core developer&oacute;w zosta&#322; powi&#281;kszony: J&uuml;rgen, Werner i Yorik zostali wsparci przez Abdullaha, Bernda, sliptonic i WandererFan
</p>
<h2><span class="mw-headline" id="Ciekawe_posty_na_forum">Ciekawe posty na forum</span></h2>
<ul><li>o PartDesignNext i innych decyzjach projektowych: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=8&amp;t=34923&amp;start=130#p297074">https://forum.freecad.org/viewtopic.php?f=8&amp;t=34923&amp;start=130#p297074</a></li>
<li>o historii forum: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=8&amp;t=7448&amp;start=200#p287106">https://forum.freecad.org/viewtopic.php?f=8&amp;t=7448&amp;start=200#p287106</a></li>
<li>o historii projektu: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=8&amp;t=47703">https://forum.freecad.org/viewtopic.php?f=8&amp;t=47703</a></li>
<li>o historii kodu: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=10&amp;t=46733&amp;start=10#p405068">https://forum.freecad.org/viewtopic.php?f=10&amp;t=46733&amp;start=10#p405068</a> BTW: pierwsze sprawdzenie kodu mia&#322;o miejsce 18 marca 2002 roku (mo&#380;e to data urodzin?)</li>
<li>o projekcie, kt&oacute;ry ma by&#263; OpenSource: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=13&amp;t=40235&amp;start=10#p342330">https://forum.freecad.org/viewtopic.php?f=13&amp;t=40235&amp;start=10#p342330</a></li>
<li>o historii commit&oacute;w wydania: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=8&amp;t=23695#p184940">https://forum.freecad.org/viewtopic.php?f=8&amp;t=23695#p184940</a></li>
<li>o tym kto stoi za FreeCAD: <a rel="nofollow" class="external free" href="http://forum.freecad.org/viewtopic.php?f=8&amp;t=295">http://forum.freecad.org/viewtopic.php?f=8&amp;t=295</a></li>
<li>o historii MES: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=18&amp;t=48646#p416389">https://forum.freecad.org/viewtopic.php?f=18&amp;t=48646#p416389</a></li>
<li>o historii MES mesher: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=18&amp;t=48733#p417627">https://forum.freecad.org/viewtopic.php?f=18&amp;t=48733#p417627</a></li></ul>
<p><span id="Release_history"></span>
</p>
<h2><span class="mw-headline" id="Historia_wydania">Historia wydania</span></h2>
<h4><span id="Przegl.C4.85d"></span><span class="mw-headline" id="Przegl&#261;d">Przegl&#261;d</span></h4>
<table class="wikitable" style="margin: 0.4em 0 0.5em;">

<tbody><tr>
<th style="background-color: #cccccc;">Version
</th>
<th class="unsortable" style="background-color: #cccccc;">Nazwa wydania
</th>
<th style="background-color: #cccccc; white-space: nowrap;">Data og&#322;oszenia
</th>
<th class="unsortable" style="background-color: #cccccc;">Uwagi
</th>
<th class="unsortable" style="background-color: #cccccc;">Commit wydania
</th>
<th class="unsortable" style="background-color: #cccccc;">Ga&#322;&#261;&#378; wydania
</th></tr>
<tr>
<td style="background-color: #C1E6F5;">1.1
</td>
<td>-
</td>
<td>w rozwoju
</td>
<td><a href="../pl/Release_notes_1.1.html" title="Release notes 1.1/pl">Informacje o wydaniu 1.1</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/main">head main</a>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #D4F4B4;">1.0
</td>
<td>BGBSWW
</td>
<td>2024-11-18
</td>
<td><a href="../pl/Release_notes_1.0.html" title="Release notes 1.0/pl">Informacje o wydaniu 1.0</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-1-0">release commit 1.0</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-1-0">branch bugfixes 1.0</a>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.21
</td>
<td>-
</td>
<td>2023-08-02
</td>
<td><a href="../pl/Release_notes_0.21.html" title="Release notes 0.21/pl">Informacje o wydaniu 0.21</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-21">release commit 0.21</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-21">branch bugfixes 0.21</a>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.20
</td>
<td>-
</td>
<td>2022-06-14
</td>
<td><a href="../Release_notes_0.20.html" title="Release notes 0.20">Informacje o wydaniu 0.20</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-20">release commit 0.20</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-20">branch bugfixes 0.20</a>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.19
</td>
<td>-
</td>
<td>2021-03-20
</td>
<td><a href="../pl/Release_notes_0.19.html" title="Release notes 0.19/pl">Informacje o wydaniu 0.19</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-19">release commit 0.19</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-19">branch bugfixes 0.19</a>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.18
</td>
<td>-
</td>
<td>2019-03-12
</td>
<td><a href="../pl/Release_notes_0.18.html" title="Release notes 0.18/pl">Informacje o wydaniu 0.18</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-18">release commit 0.18</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-18">branch bugfixes 0.18</a>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.17
</td>
<td>Roland
</td>
<td>2018-04-06
</td>
<td><a href="../pl/Release_notes_0.17.html" title="Release notes 0.17/pl">Informacje o wydaniu 0.17</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-17">release commit 0.17</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-17">branch bugfixes 0.17</a>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.16
</td>
<td>-
</td>
<td>2016-04-18
</td>
<td><a href="../pl/Release_notes_0.16.html" title="Release notes 0.16/pl">Informacje o wydaniu 0.16</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-16">release commit 0.16</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-16">branch bugfixes 0.16</a>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.15
</td>
<td>-
</td>
<td>2015-04-08
</td>
<td><a href="../pl/Release_notes_0.15.html" title="Release notes 0.15/pl">Informacje o wydaniu 0.15</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-15">release commit 0.15</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-15">branch bugfixes 0.15</a>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.14
</td>
<td>-
</td>
<td>2014-07-01
</td>
<td><a href="../pl/Release_notes_0.14.html" title="Release notes 0.14/pl">Informacje o wydaniu 0.14</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-14">release commit 0.14</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-14">branch bugfixes 0.14</a>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.13
</td>
<td>-
</td>
<td>2013-01-29
</td>
<td><a href="../pl/Release_notes_0.13.html" title="Release notes 0.13/pl">Informacje o wydaniu 0.13</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-13">release commit 0.13</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-13">branch bugfixes 0.13</a>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.12
</td>
<td>-
</td>
<td>2011-12-20
</td>
<td><a href="../pl/Release_notes_0.12.html" title="Release notes 0.12/pl">Informacje o wydaniu 0.12</a>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.11
</td>
<td>-
</td>
<td>2011-05-03
</td>
<td><a href="../pl/Release_notes_0.11.html" title="Release notes 0.11/pl">Informacje o wydaniu 0.11</a>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.10
</td>
<td>-
</td>
<td>2010-07-24
</td>
<td>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.9
</td>
<td>-
</td>
<td>2010-01-16
</td>
<td>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.8
</td>
<td>-
</td>
<td>2009-07-10
</td>
<td>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.7
</td>
<td>-
</td>
<td>2009-04-24
</td>
<td>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.6
</td>
<td>-
</td>
<td>2007-02-27
</td>
<td>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.5
</td>
<td>-
</td>
<td>2006-10-05
</td>
<td>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.4
</td>
<td>-
</td>
<td>2006-01-15
</td>
<td>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.3
</td>
<td>-
</td>
<td>2005-10-31
</td>
<td>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.2
</td>
<td>-
</td>
<td>2005-08-09
</td>
<td>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.1
</td>
<td>-
</td>
<td>2003-01-27
</td>
<td>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.0.1
</td>
<td>-
</td>
<td>2002-10-29
</td>
<td>Pierwsze wys&#322;anie wersji
</td>
<td>
</td>
<td>
</td></tr></tbody></table>
<p><span id="Legend"></span>
</p>
<h4><span class="mw-headline" id="Legenda">Legenda</span></h4>
<table class="wikitable" style="margin: 0.4em 0 0.5em;">

<tbody><tr>
<th style="background-color: #cccccc;">Kolor
</th>
<th style="background-color: #cccccc;">Typ wersji
</th></tr>
<tr>
<td style="background-color: #C1E6F5;">
</td>
<td>Przysz&#322;e wydanie
</td></tr>
<tr>
<td style="background-color: #D4F4B4;">
</td>
<td><b>Bie&#380;&#261;ca wersja</b>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">
</td>
<td>Stara wersja
</td></tr>
</tbody></table>
<h2><span id="Linki_zewn.C4.99trzne"></span><span class="mw-headline" id="Linki_zewn&#281;trzne">Linki zewn&#281;trzne</span></h2>
<ul><li><a rel="nofollow" class="external text" href="http://sourceforge.net/projects/free-cad/files/">Sekcja plik&oacute;w SourceForge</a></li>
<li><a rel="nofollow" class="external text" href="http://sourceforge.net/projects/free-cad/files/OldFiles/">Sekcja starych plik&oacute;w SourceForge</a></li>
<li><a rel="nofollow" class="external text" href="http://www.opencascade.org/org/forum/thread_6572/?forum=11">Og&#322;oszenie projektu FreeCAD</a> na forum OpenCascade</li></ul>
<!-- 
NewPP limit report
Cached time: 20250705132305
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc, no&#8208;toc&#8208;conversion]
CPU time usage: 0.129 seconds
Real time usage: 0.155 seconds
Preprocessor visited node count: 191/1000000
Post&#8208;expand include size: 6549/2097152 bytes
Template argument size: 5607/2097152 bytes
Highest expansion depth: 5/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 2091/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    3.348      1 -total
 86.23%    2.887      9 Template:Quote
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:254996-0!canonical and timestamp 20250705132305 and revision id 1602579. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>