<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Macro Wiring And Hoses/pl</span></h1><?xml encoding="UTF-8"><div class="mw-parser-output"><div class="mw-pt-languages noprint" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../Macro_Wiring_And_Hoses.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Macro Wiring And Hoses (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../fr/Macro_Wiring_And_Hoses.html" class="mw-pt-progress mw-pt-progress--complete" title="Macro Wiring And Hoses (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/Macro_Wiring_And_Hoses.html" class="mw-pt-progress mw-pt-progress--stub" title="Macro Cablaggio e Tubazioni (5% translated)" lang="it" dir="ltr">italiano</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="pl" dir="ltr">polski</span></li></ul></div>
<table class="fcinfobox wikitable ct" width="100%" style="float: right; width: 230px; margin-left: 10px;">
<tbody><tr>
<td class="ctTitle" style="font-weight: bold; font-size: 125%;">
<p><span typeof="mw:File"><a href="../index.php?title=Text-x-python.png&amp;filetimestamp=20121224162851&amp;.html" class="mw-file-description" title="Generic macro icon. Create your personal icon with the same name of the macro"><img alt="Generic macro icon. Create your personal icon with the same name of the macro" src="../File/Text-x-python.png" decoding="async" width="32" height="32"></a></span><span> </span>
Macro Wiring And Hoses
</p>
</td></tr>
<tr>
<th class="ctOdd">Opis
</th></tr>
<tr>
<td class="ctEven left macro-description">Makra te wspieraj&#261; tworzenie i obs&#322;ug&#281; kabli i rur.<br><br>Autor: Piffpoof<br>
</td></tr>
<tr>
<th class="ctOdd">Autor
</th></tr>
<tr>
<td class="ctEven macro-author"><a href="../User;Piffpoof.html" title="User:Piffpoof">Piffpoof</a>
</td></tr>
<tr>
<th class="ctOdd">Do pobrania
</th></tr>
<tr>
<td class="ctEven macro-download"><i>Nie okre&#347;lono</i>
</td></tr>
<tr>
<th class="ctOdd">Odno&#347;niki
</th></tr>
<tr>
<td class="ctEven macro-Links"><a href="../pl/Macros_recipes.html" title="Macros recipes/pl">Przepisy na makropolecenia</a><br><a href="../pl/How_to_install_macros.html" title="How to install macros/pl">Jak zainstalowa&#263; makrodefinicje</a><br><a href="../pl/Customize_Toolbars.html" title="Customize Toolbars/pl">Dostosowanie pask&oacute;w narz&#281;dzi</a>
</td></tr>
<tr>
<th class="ctOdd">Wersja Makrodefinicji
</th></tr>
<tr>
<td class="ctEven macro-version">1.0
</td></tr>
<tr>
<th class="ctOdd">Data zmian
</th></tr>
<tr>
<td class="ctEven macro-date"><i>Nie okre&#347;lono</i>
</td></tr>
<tr>
<th class="ctOdd">Wersja FreeCAD
</th></tr>
<tr>
<td class="ctEven FreeCAD-version"><i>Nie okre&#347;lono</i>
</td></tr>
<tr>
<th class="ctOdd">Domy&#347;lny skr&oacute;t
</th></tr>
<tr>
<td class="ctEven"><i>Brak</i>
</td></tr>
<tr>
<th class="ctOdd">Zobacz r&oacute;wnie&#380;
</th></tr>
<tr>
<td class="ctEven"><i>-</i>
</td></tr>
<tr>
<th class="ctOdd">
</th></tr>
<tr>
<td class="ctToc"><br><meta property="mw:PageProp/toc">
</td></tr>
</tbody></table>
<p><b>Od <a href="../User;Piffpoof.html" title="User:Piffpoof">User:Piffpoof</a> Uwaga: pewne zmiany pomi&#281;dzy v 0.14 a v 0.15 wp&#322;yn&#281;&#322;y na to makro, co op&oacute;&#378;ni jego wydanie</b>
</p><p>Makra te wspieraj&#261; tworzenie i obs&#322;ug&#281; sieci przewod&oacute;w i rur.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Wiring_And_HosesCompletedHouse.jpg&amp;filetimestamp=20150225164901&amp;.html" class="mw-file-description"><img src="../File/Macro_Wiring_And_HosesCompletedHouse.jpg" decoding="async" width="500" height="418"></a></span>
</p><p><span id="Background"></span>
</p>
<h2><span class="mw-headline" id="Kontekst">Kontekst</span></h2>
<p>Jako cz&#281;&#347;&#263; naszych innych projekt&oacute;w FreeCAD potrzebowali&#347;my sposobu na udokumentowanie okablowania i rur. Ten zestaw makr zosta&#322; stworzony aby sprosta&#263; tej potrzebie. Jest wiele rzeczy, kt&oacute;rych ten system nie robi, ale to co robi, to zapewnia wizualn&#261; reprezentacj&#281; przewod&oacute;w i rur, albo jako odizolowany system, albo z przewodami i rurami w kontek&#347;cie modelu FreeCAD. Zapis wszystkich przewod&oacute;w i rur jest przechowywany w pliku w formacie CSV poza programem FreeCAD. Plik ten mo&#380;e wi&#281;c zosta&#263; wczytany do programu arkusza kalkulacyjnego lub wykorzystany przez inne oprogramowanie.
</p>
<h2><span class="mw-headline" id="Opis">Opis</span></h2>
<p>W ramach projektu dokumentacji odkryli&#347;my, &#380;e potrzebujemy udokumentowa&#263; przewody i rury. Wypr&oacute;bowali&#347;my kilka r&oacute;&#380;nych scenariuszy takich jak tworzenie linii lub cylindr&oacute;w jako cz&#281;&#347;&#263; istniej&#261;cego modelu. Ze wzgl&#281;du na problemy z ich u&#380;ywaniem lub utrzymaniem zdecydowali&#347;my si&#281; zachowa&#263; te informacje w innym formacie i poza programem FreeCAD. W ten spos&oacute;b mog&#322;y by&#263; one tworzone samodzielnie lub w ramach istniej&#261;cego dokumentu. Ta decyzja pozwoli&#322;a u&#380;ytkownikowi pracowa&#263; z okablowaniem i rurami w spos&oacute;b, kt&oacute;ry mu odpowiada&#322;. M&oacute;g&#322; r&oacute;wnie&#380; pracowa&#263; z nimi na r&oacute;&#380;ne sposoby w r&oacute;&#380;nych momentach, gdy zmienia&#322;y si&#281; potrzeby.
</p><p>Pocz&#261;tkowo nie byli&#347;my pewni, jak prowadzi&#263; list&#281; rur i przewod&oacute;w i pr&oacute;bowali&#347;my r&oacute;&#380;nych podej&#347;&#263;. Najprostszym sposobem wydawa&#322;o si&#281; u&#380;ycie formatu pliku CSV, kt&oacute;ry istnieje od dawna. Istnia&#322;y ju&#380; tak&#380;e procedury napisane do zarz&#261;dzania plikami CSV z poziomu Pythona. Niekt&oacute;re z zalet by&#322;y nast&#281;puj&#261;ce:
</p>
<ul><li>czytelny dla cz&#322;owieka,</li>
<li>mo&#380;e by&#263; za&#322;adowany do dowolnego arkusza kalkulacyjnego,</li>
<li>mo&#380;e by&#263; utrzymywany przy u&#380;yciu arkusza kalkulacyjnego lub prostego edytora tekstu,</li>
<li>mo&#380;liwym przysz&#322;ym ulepszeniem by&#322;oby u&#380;ycie go z arkuszem kalkulacyjnym FreeCAD.</li></ul>
<p>Kolejnymi decyzjami by&#322;o "jak" zdefiniowa&#263; takie przebiegi kabli. Poniewa&#380; naszym celem by&#322;a przede wszystkim dokumentacja, wybrali&#347;my prowadzenie odcink&oacute;w linii od punktu do punktu. Kwestie takie jak promie&#324; skr&#281;tu nie s&#261; rozpatrywane. R&oacute;wnie&#380; &#347;rednica kabla nie jest obs&#322;ugiwana. Tabela z przebiegami kabli jest przechowywana w pliku CSV, ale takie rzeczy jak blisko&#347;&#263; kabli <i>(dla kwestii zak&#322;&oacute;ce&#324; elektrycznych)</i> i d&#322;ugo&#347;&#263; trasy nie s&#261; obs&#322;ugiwane <i>(chocia&#380; mo&#380;na by by&#322;o do&#347;&#263; &#322;atwo doda&#263; podstawow&#261; d&#322;ugo&#347;&#263; trasy kabla)</i>.
</p><p>Ten zestaw makr jest w zasadzie "dowodem koncepcji", demonstruje pewne pomys&#322;y i ich wykonalno&#347;&#263;. Naszym g&#322;&oacute;wnym celem by&#322;a dokumentacja, a nie fizyczne zarz&#261;dzanie instalacj&#261;. Zdecydowali&#347;my si&#281; na utrzymanie struktury danych punkt&oacute;w, kt&oacute;re s&#261; punktami, przez kt&oacute;re przebiegaj&#261; przewody i rury. Po drugie utworzyli&#347;my struktur&#281; danych, kt&oacute;ra definiuje kable i rury pod wzgl&#281;dem punkt&oacute;w, przez kt&oacute;re przechodz&#261;. Tak wi&#281;c przew&oacute;d mo&#380;e by&#263; poprowadzony tylko tam, gdzie zosta&#322;y zdefiniowane dla niego punkty.
</p><p>Dla tych dw&oacute;ch struktur danych wybrali&#347;my nast&#281;puj&#261;ce nazwy:
</p>
<ul><li>W&#281;ze&#322; - punkt, przez kt&oacute;ry mo&#380;e przechodzi&#263; kabel lub rura <i>(liczba mnoga to Nexi)</i>. W&#281;z&#322;y s&#261; po prostu punktami w przestrzeni 3D, dla u&#322;atwienia wizualizacji oprogramowanie umieszcza pier&#347;cienie wok&oacute;&#322; lokalizacji, ale s&#322;u&#380;&#261; tylko dla u&#322;atwienia u&#380;ycia. Widoczno&#347;&#263; Pier&#347;cieni mo&#380;e by&#263; wy&#322;&#261;czona lub w&#322;&#261;czona w zale&#380;no&#347;ci od preferencji u&#380;ytkownika.</li>
<li>Przep&#322;ywy - og&oacute;lnie s&#261; to trasy sk&#322;adaj&#261;ce si&#281; z W&#281;z&#322;&oacute;w. Do ka&#380;dego typu przypisany jest kod, domy&#347;lne kody to
<ul><li>W - przewody elektryczne</li>
<li>C - przewody, przeznaczone g&#322;&oacute;wnie dla kabli, ale mog&#261;ce zawiera&#263; wszystko</li>
<li>H - rury do przenoszenia r&oacute;&#380;nych p&#322;yn&oacute;w</li>
<li>G - przewody gazowe</li>
<li>K - trasa kamery, to jest tak naprawd&#281; zarezerwowane dla przysz&#322;ych eksploracji, jak w <a rel="nofollow" class="external text" href="http://forum.freecadweb.org/viewtopic.php?f=24&amp;t=8437">Zwiedzanie uj&#281;ciem widoku</a>.</li></ul></li></ul>
<p><br>
Zar&oacute;wno W&#281;z&#322;y jak i Przep&#322;yw maj&#261; nazwy przypisane przez u&#380;ytkownika, dodatkowo W&#281;z&#322;y maj&#261; wewn&#281;trznie przypisane ID w celu u&#322;atwienia zarz&#261;dzania. B&#281;d&#261;c punktami lub lokalizacjami w przestrzeni W&#281;z&#322;y nie maj&#261; kolor&oacute;w, ale Przep&#322;ywy mog&#261; mie&#263; jeden z 48 zdefiniowanych kolor&oacute;w. Nacisk na kolory wi&#261;&#380;e si&#281; z zamierzonym celem, jakim jest dokumentacja.
</p><p><br>
Og&oacute;lny przebieg pracy jest nast&#281;puj&#261;cy
</p>
<ul><li>zdefiniuj i ustaw W&#281;ze&#322;,</li>
<li>zdefiniuj Przep&#322;yw<i>(y)</i> w odniesieniu do W&#281;z&#322;&oacute;w,</li>
<li>dla cel&oacute;w konserwacyjnych edytuj zar&oacute;wno W&#281;z&#322;y, jak i Przep&#322;ywy albo wizualnie za pomoc&#261; GUI FreeCAD, albo u&#380;ywaj&#261;c podej&#347;cia tabelarycznego i definicji CSV.</li></ul>
<p><br>
Poniewa&#380; plik danych zawieraj&#261;cy definicje W&#281;z&#322;&oacute;w i Przep&#322;ywu jest plikiem tekstowym, mo&#380;e by&#263; obs&#322;ugiwany w dowolnym edytorze tekstu lub przez dowolny inny program, kt&oacute;ry chce uzyska&#263; dost&#281;p do danych.
</p><p><br>
</p>
<h3><span class="mw-headline" id="Tryby_nawigacyjne">Tryby nawigacyjne</span></h3>
<p>Poniewa&#380; du&#380;a cz&#281;&#347;&#263; pracy z tymi makrami polega na manipulowaniu wy&#347;wietlanym modelem w celu umieszczenia i weryfikacji umieszczenia punktu w przestrzeni tr&oacute;jwymiarowej, niezb&#281;dna jest znajomo&#347;&#263; tryb&oacute;w nawigacyjnych programu FreeCAD, kt&oacute;re s&#261; udokumentowane na stronie <a href="../pl/Mouse_navigation.html" title="Mouse navigation/pl">Profil nawigacji myszk&#261;</a>. Umiej&#281;tno&#347;&#263; obracania modelu w przestrzeni tr&oacute;jwymiarowej, a nast&#281;pnie wykonywania operacji na nieruchomym modelu jest niezb&#281;dna.
</p><p><br>
</p>
<h2><span class="mw-headline" id="Instalacja">Instalacja</span></h2>
<p>Kod dla <b>Okablowania i ruroci&#261;g&oacute;w</b> znajduje si&#281; w wielu makrach i bibliotece. Instalacja polega wi&#281;c na skopiowaniu kodu do odpowiedniego katalogu makr i wywo&#322;aniu narz&#281;dzia Build Utility z menu makr, konsoli Pythona lub przycisku na pasku narz&#281;dzi <i>(preferowana metoda)</i>.
</p><p><br>
&lt;more to come&gt;
</p>
<ul><li>zobacz stron&#281; <a href="../pl/How_to_install_macros.html" title="How to install macros/pl">Jak zainstalowa&#263; makrodefinicj&#281;</a>, aby uzyska&#263; informacje, jak zainstalowa&#263; ten kod makra</li>
<li>zobacz stron&#281; <a href="../pl/Customize_Toolbars.html" title="Customize Toolbars/pl">Dostosowanie pask&oacute;w narz&#281;dzi</a>, aby uzyska&#263; informacje, jak zainstalowa&#263; jako przycisk na pasku narz&#281;dzi.</li></ul>
<h2><span id="U.C5.BCycie"></span><span class="mw-headline" id="U&#380;ycie">U&#380;ycie</span></h2>
<p>Istniej&#261; naprawd&#281; dwa r&oacute;&#380;ne podej&#347;cia do pracy z tymi makrodefinicjami: W&#281;z&#322;y i Przep&#322;ywy mog&#261; by&#263; zdefiniowane samodzielnie przy u&#380;yciu wsp&oacute;&#322;rz&#281;dnych przestrzennych, lub mo&#380;na u&#380;y&#263; istniej&#261;cego dokumentu FreeCAD i zdefiniowa&#263; W&#281;z&#322;y i Przep&#322;ywy w kontek&#347;cie tego dokumentu. Nie jest to decyzja typu "albo / albo", ale raczej oba podej&#347;cia mog&#261; by&#263; stosowane, gdy s&#261; najbardziej odpowiednie. Poniewa&#380; definicje W&#281;z&#322;&oacute;w i Przep&#322;yw&oacute;w s&#261; przechowywane w pliku w formacie CSV, kt&oacute;ry jest przechowywany poza programem FreeCAD, obecno&#347;&#263; lub brak dokumentu FreeCAD nie ma wp&#322;ywu na prac&#281; z W&#281;z&#322;ami i Przep&#322;ywami, ale u&#322;atwia j&#261; poprzez zapewnienie kontekstu wizualnego. Dla tego opisu u&#380;ycia w przyk&#322;adzie zostanie u&#380;yty wcze&#347;niej za&#322;adowany dokument FreeCAD jako kontekst, poniewa&#380; &#322;atwiej jest umie&#347;ci&#263; 
</p><p><br>
U&#380;ycie tych makrodefinicji dzieli si&#281; na 3 cz&#281;&#347;ci:
</p>
<ul><li>zdefiniuj W&#281;z&#322;y,</li>
<li>zdefiniuj Przep&#322;ywy,</li>
<li>edycja pliku w formacie CSV w celu zmiany lub dodania Wez&#322;a i Przep&#322;yw&oacute;w</li></ul>
<p><br>
Istniej&#261; alternatywne sposoby wykonania niekt&oacute;rych z przedstawionych poni&#380;ej zada&#324;, o kt&oacute;rych mog&#261; decydowa&#263; osobiste preferencje. Ten przyk&#322;ad dotyczy instalacji elektrycznej i zimnej wody w domu. Tak wygl&#261;da nasz pusty dom
</p><p><br>
<span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Wiring_And_HosesEmptyHouse.jpg&amp;filetimestamp=20150225164838&amp;.html" class="mw-file-description"><img src="../File/Macro_Wiring_And_HosesEmptyHouse.jpg" decoding="async" width="500" height="440"></a></span>
</p><p>i czeka na zainstalowanie zimnej wody i pr&#261;du. Dla wygody wyja&#347;nienia wszystkie elementy elektryczne s&#261; w kolorze &#380;&oacute;&#322;tym, a woda w kolorze niebieskim <i>(opr&oacute;cz 2 zlew&oacute;w)</i>.
</p><p><br>
</p>
<h3><span id="Okre.C5.9Blenie_W.C4.99z.C5.82.C3.B3w"></span><span class="mw-headline" id="Okre&#347;lenie_W&#281;z&#322;&oacute;w">Okre&#347;lenie W&#281;z&#322;&oacute;w</span></h3>
<p>Pierwszym krokiem jest utworzenie punkt&oacute;w w przestrzeni tr&oacute;jwymiarowej <i>(zwanych "W&#281;z&#322;ami")</i>. Punkty te zostan&#261; u&#380;yte w nast&#281;pnym kroku do zdefiniowania przep&#322;ywu. Punkty te tworzymy klikaj&#261;c na <i>(tj. wybieraj&#261;c)</i> powierzchni&#281;, a nast&#281;pnie podaj&#261;c nazw&#281; dla W&#281;z&#322;a. Ten opis dotyczy definiowania punkt&oacute;w W&#281;z&#322;&oacute;w dla przep&#322;ywu wody.
</p><p><br>
</p>
<ol><li>kliknij na ikon&#281; &lt;N&gt;</li>
<li>pojawi si&#281; nast&#281;puj&#261;ce okno dialogowe:</li></ol>
<p>&lt;screenSnapshot Do You Want to Load&gt;.
To jest pytanie, czy chcesz otworzy&#263; i za&#322;adowa&#263; dokument FreeCAD, kt&oacute;ry zawiera model, do kt&oacute;rego chcesz doda&#263; W&#281;ze&#322; i przep&#322;ywy. Nie jest konieczne wczytywanie &#380;adnego, ale dla tego przyk&#322;adu wczytamy nasz pusty dom.
</p>
<ol><li>wybierz powierzchni&#281; klikaj&#261;c na ni&#261;, zostanie ona pod&#347;wietlona w oknie Widoku Drzewa i b&#281;dzie mia&#322;a kolor potwierdzaj&#261;cy zaznaczenie an ekranie.</li>
<li>kliknij na ikon&#281; &lt;N&gt;</li>
<li>pojawi si&#281; nast&#281;puj&#261;ce okno dialogowe z pytaniem o nazw&#281; dla nowego W&#281;z&#322;a:</li></ol>
<p>&lt;nazwa nexusa screenSnapshot&gt;
</p>
<ol><li>W&#281;ze&#322; zostanie teraz zdefiniowany. Zostanie on umieszczony w przestrzeni tr&oacute;jwymiarowej tak, aby znajdowa&#322; si&#281; na linii od wybranej &#347;ciany do obserwatora, tu&#380; obok &#347;ciany, tak aby nie znajdowa&#322; si&#281; wewn&#261;trz obiektu. Chocia&#380; w&#281;ze&#322; mo&#380;e nie by&#263; w idealnym po&#322;o&#380;eniu, zostaw go na razie, poniewa&#380; b&#281;dzie on edytowany w p&oacute;&#378;niejszym kroku. Zostanie wy&#347;wietlony specjalny okr&#261;g <i>(pier&#347;cie&#324;)</i>, kt&oacute;ry jest wy&#347;rodkowany w punkcie w&#281;z&#322;a. Okr&#261;g ten jest jedynie narz&#281;dziem wizualizacji, dzi&#281;ki kt&oacute;remu mo&#380;na zidentyfikowa&#263; po&#322;o&#380;enie punktu. Pier&#347;cienie wizualizacji mog&#261; by&#263; w&#322;&#261;czane/wy&#322;&#261;czane w dowolnym momencie.</li>
<li>zdefiniuj kolejne w&#281;z&#322;y w ten sam spos&oacute;b, nadaj&#261;c ka&#380;demu z nich sensown&#261; nazw&#281;</li>
<li>kliknij na ikon&#281; &lt;N&gt;</li>
<li>pojawi si&#281; nast&#281;puj&#261;ce okno dialogowe:</li></ol>
<p>&lt;screenSnapshot Save to a File&gt;
</p>
<ol><li>odpowiedz Tak, aby zapisa&#263; nowe w&#281;z&#322;y</li></ol>
<p><strong>Uwaga</strong>: w ka&#380;dym momencie mo&#380;esz do&#322;&#261;czy&#263; ju&#380; istniej&#261;cy projekt, aby mie&#263; widoczny og&oacute;lny obraz sytuacji.
</p><p><br>
</p>
<h3><span id="Okre.C5.9Blenie_przep.C5.82yw"></span><span class="mw-headline" id="Okre&#347;lenie_przep&#322;yw">Okre&#347;lenie przep&#322;yw</span></h3>
<p>Po zdefiniowaniu W&#281;z&#322;y mog&#261; by&#263; one u&#380;yte do zdefiniowania przep&#322;ywu. Nasz dom wygl&#261;da teraz tak:
</p><p>&lt; picture of house with nexi but not flows&gt;
</p><p>Posiada W&#281;z&#322;y zdefiniowane dla przep&#322;ywu wody, ale teraz jeszcze nie ma przep&#322;ywu.
</p><p><br>
</p>
<ol><li>kliknij na ikon&#281; &lt;F&gt;.</li></ol>
<p>pojawi si&#281; nast&#281;puj&#261;ce okno dialogowe:
</p><p>&lt;screenSnapshot Select Nexi for Flow&gt;
</p><p><br>
To jest pro&#347;ba o wybranie W&#281;z&#322;&oacute;w w kolejno&#347;ci, w jakiej maj&#261; one tworzy&#263; przep&#322;yw.
</p>
<ol><li>wybierz typ przep&#322;ywu: Przewody, Kanalazacja, Rury, Linie gazowe</li>
<li>u&#380;ywaj&#261;c drugiego okna, wybierz W&#281;z&#322;y w kolejno&#347;ci, w jakiej chcesz je utworzy&#263;</li></ol>
<p>&lt;screenSnapshot Selected Nexi for Flow&gt;
</p><p><br>
</p>
<ol><li>podaj nazw&#281; dla przep&#322;ywu,</li>
<li>wybierz kolor dla przep&#322;ywu,</li>
<li>kliknij przycisk <span style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.4em; padding: 0px 10px 1px 10px; font-weight:normal;">OK</span> lub <span style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.4em; padding: 0px 10px 1px 10px; font-weight:normal;">Anuluj</span>. Je&#347;li pope&#322;nisz b&#322;&#261;d w wyborze W&#281;z&#322;a <i>(albo w kolejno&#347;ci, albo w&#322;&#261;czaj&#261;c niew&#322;a&#347;ciwe W&#281;z&#322;y)</i>, kliknij przycisk <span style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.4em; padding: 0px 10px 1px 10px; font-weight:normal;">Anuluj</span> i rozpocznij ten krok ponownie.</li></ol>
<p>&lt; picture of house with water flow&gt;
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Wiring_And_HosesFlowsOnly.jpg&amp;filetimestamp=20150226104411&amp;.html" class="mw-file-description"><img src="../File/Macro_Wiring_And_HosesFlowsOnly.jpg" decoding="async" width="500" height="358"></a></span>
</p><p><br>
</p>
<h3><span id="Edycja_Nexi_i_przep.C5.82yw.C3.B3w"></span><span class="mw-headline" id="Edycja_Nexi_i_przep&#322;yw&oacute;w">Edycja Nexi i przep&#322;yw&oacute;w</span></h3>
<p>Istniej&#261; 3 r&oacute;&#380;ne sposoby edycji W&#281;z&#322;a. Poniewa&#380; przep&#322;ywy s&#261; zdefiniowane w kategoriach W&#281;z&#322;&oacute;w, modyfikacja W&#281;z&#322;a b&#281;dzie mia&#322;a wp&#322;yw na ka&#380;dy przep&#322;yw, kt&oacute;ry je zawiera. Dla opisowych atrybut&oacute;w przep&#322;ywu, takich jak kolor i nazwa, istnieje jeden spos&oacute;b na edycj&#281;.
</p><p>Do tej pory w tym przyk&#322;adzie wygenerowali&#347;my nast&#281;puj&#261;c&#261; tabel&#281;:
</p><p>&lt;screenSnapshot edit table&gt;
</p><p>&lt;screenSnapshot editing Position for nexus&gt;
</p><p>&lt;screenSnapshot double-click editing of toroid&gt;
</p><p><br>
</p>
<h2><span id="Interfejs_u.C5.BCytkownika"></span><span class="mw-headline" id="Interfejs_u&#380;ytkownika">Interfejs u&#380;ytkownika</span></h2>
<p>Interfejs u&#380;ytkownika jest kombinacj&#261; w&#322;asnych ekran&oacute;w oraz standardowych cz&#281;&#347;ci GUI programu FreeCAD.
</p><p>&lt;snapshot 1 defining Nexi&gt;
</p><p>&lt;snapshot 2 defining flow&gt;
</p><p>&lt;snapshot 3 editing CSV file&gt;
</p><p>&lt;snapshot 4 editing Position&gt;
</p>
<h2><span class="mw-headline" id="Opcje">Opcje</span></h2>
<p>W chwili obecnej nie ma &#380;adnych opcji dotycz&#261;cych przewod&oacute;w i rur.
</p>
<h2><span id="Przyk.C5.82adowe_pliki"></span><span class="mw-headline" id="Przyk&#322;adowe_pliki">Przyk&#322;adowe pliki</span></h2>
<h2><span class="mw-headline" id="Uwagi">Uwagi</span></h2>
<h2><span class="mw-headline" id="Znane_problemy">Znane problemy</span></h2>
<h2><span id="Przysz.C5.82e_mo.C5.BCliwo.C5.9Bci"></span><span class="mw-headline" id="Przysz&#322;e_mo&#380;liwo&#347;ci">Przysz&#322;e mo&#380;liwo&#347;ci</span></h2>
<h2><span id="S.C5.82owniczek"></span><span class="mw-headline" id="S&#322;owniczek">S&#322;owniczek</span></h2>
<h2><span id="Odno.C5.9Bniki_internetowe"></span><span class="mw-headline" id="Odno&#347;niki_internetowe">Odno&#347;niki internetowe</span></h2>
<h2><span class="mw-headline" id="Skrypty">Skrypty</span></h2>
<div style="clear:both"></div>
<!-- 
NewPP limit report
Cached time: 20250622010430
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc, no&#8208;toc&#8208;conversion]
CPU time usage: 0.088 seconds
Real time usage: 0.121 seconds
Preprocessor visited node count: 144/1000000
Post&#8208;expand include size: 2925/2097152 bytes
Template argument size: 166/2097152 bytes
Highest expansion depth: 7/100
Expensive parser function count: 2/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 822/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   20.081      1 -total
 64.72%   12.996      1 Template:Macro/pl
 18.80%    3.776      3 Template:Button
 14.03%    2.818      1 Template:Clear
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:273988-0!canonical and timestamp 20250622010430 and revision id 1595349. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>