<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">PartDesign Bearingholder Tutorial II/pl</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="pl" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-PartDesign+Bearingholder+Tutorial+II&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/PartDesign_Bearingholder_Tutorial_II.html" class="mw-pt-progress mw-pt-progress--complete" title="PartDesign Lagergeh&auml;use Tutorium II (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../PartDesign_Bearingholder_Tutorial_II.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="PartDesign Bearingholder Tutorial II (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../tr/PartDesign_Bearingholder_Tutorial_II.html" class="mw-pt-progress mw-pt-progress--low" title="PartDesign Bearingholder Tutorial II/tr (2% translated)" lang="tr" dir="ltr">T&uuml;rk&ccedil;e</a></li>
<li><a href="../es/PartDesign_Bearingholder_Tutorial_II.html" class="mw-pt-progress mw-pt-progress--med" title="PartDesign Soporte de rodamiento Tutorial II (17% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/PartDesign_Bearingholder_Tutorial_II.html" class="mw-pt-progress mw-pt-progress--complete" title="PartDesign Tutoriel pour la conception d'un support de roulement (II) (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/PartDesign_Bearingholder_Tutorial_II.html" class="mw-pt-progress mw-pt-progress--complete" title="Tutorial per creare un supporto per cuscinetto con PartDesign. Seconda parte. (100% translated)" lang="it" dir="ltr">italiano</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="pl" dir="ltr">polski</span></li>
<li><a href="../pt-br/PartDesign_Bearingholder_Tutorial_II.html" class="mw-pt-progress mw-pt-progress--low" title="Tutorial de Projeto de Mancais de Apoio II (2% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../ro/PartDesign_Bearingholder_Tutorial_II.html" class="mw-pt-progress mw-pt-progress--high" title="PartDesign Bearingholder Tutorial II (90% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><a href="../ru/PartDesign_Bearingholder_Tutorial_II.html" class="mw-pt-progress mw-pt-progress--low" title="PartDesign Bearingholder Tutorial II/ru (7% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li></ul></div>
<table class="fcinfobox wikitable ct" style="width: 230px; float: right; margin-left: 1em">
<tbody><tr>
<td class="ctTitle" style="font-weight: bold; font-size: 125%;"><span typeof="mw:File"><span><img src="../File/Freecad.svg" decoding="async" width="32" height="32" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span> &#262;wiczenie
</td></tr>
<tr>
<th class="ctOdd">Temat
</th></tr>
<tr>
<td class="ctEven">Modelowanie
</td></tr>
<tr>
<th class="ctOdd">Poziom trudno&#347;ci
</th></tr>
<tr>
<td class="ctEven">U&#380;ytkownik zaawansowany
</td></tr>
<tr>
<th class="ctOdd">Czas wykonania
</th></tr>
<tr>
<td class="ctEven">nieokre&#347;lony
</td></tr>
<tr>
<th class="ctOdd">Autorzy
</th></tr>
<tr>
<td class="ctEven">NormandC
</td></tr>
<tr>
<th class="ctOdd">Wersja FreeCAD
</th></tr>
<tr>
<td class="ctEven">0.19.23300 lub nowszy
</td></tr>
<tr>
<th class="ctOdd">Pliki z przyk&#322;adami
</th></tr>
<tr>
<td class="ctEven">brak
</td></tr>
<tr>
<th class="ctOdd">Zobacz r&oacute;wnie&#380;
</th></tr>
<tr>
<td class="ctEven"><i>-</i>
</td></tr>
<tr>
<td class="ctToc"><br><meta property="mw:PageProp/toc">
</td></tr></tbody></table>
<p><span id="Purpose_in_Brief"></span>
</p>
<h2><span id="Kr.C3.B3tko_o_celu"></span><span class="mw-headline" id="Kr&oacute;tko_o_celu">Kr&oacute;tko o celu</span></h2>
<p>Celem tego samouczka jest wprowadzenie Ci&#281; do dw&oacute;ch r&oacute;&#380;nych sposob&oacute;w pracy przy tworzeniu odlewanego elementu z pochyleniami i zaokr&#261;gleniami. W zale&#380;no&#347;ci od tego, z jakimi innymi programami CAD mia&#322;e&#347; do czynienia, jeden z tych sposob&oacute;w mo&#380;e by&#263; Ci ju&#380; znany. Jako przyk&#322;ad praktyczny b&#281;dziemy modelowa&#263; prosty uchwyt &#322;o&#380;yska.
</p><p>To jest druga cz&#281;&#347;&#263; samouczka. B&#281;dzie ona wykorzystywa&#263; to, co mo&#380;na nazwa&#263; podej&#347;ciem 'wielobry&#322;owym' na przyk&#322;adzie (prostszej) g&oacute;rnej cz&#281;&#347;ci uchwytu.
</p><p>Oczywi&#347;cie, aby przej&#347;&#263; przez ten poradnik nale&#380;y aktywowa&#263; &#347;rodowisko pracy Projekt Cz&#281;&#347;ci.
</p><p><span typeof="mw:File"><a href="../index.php?title=HolderTop2-19.jpg&amp;filetimestamp=20130716184057&amp;.html" class="mw-file-description"><img src="../File/HolderTop2-19.jpg" decoding="async" width="400" height="263" class="mw-file-element" data-file-width="1037" data-file-height="683"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Poradnik projektu uchwytu &#322;o&#380;yska - uko&#324;czony uchwyt (g&oacute;rna cz&#281;&#347;&#263;)</p>
<p><span id="Design_data"></span>
</p>
<h2><span class="mw-headline" id="Dane_projektowe">Dane projektowe</span></h2>
<p>Uchwyt powinien by&#263; w stanie pomie&#347;ci&#263; &#322;o&#380;ysko o &#347;rednicy 90 mm i szeroko&#347;ci do 33 mm (np. typ DIN 630 2308, kt&oacute;re ma &#347;rednic&#281; wewn&#281;trzn&#261; 40 mm). &#321;o&#380;ysko wymaga w uchwycie (i na wale) ko&#322;nierza o wysoko&#347;ci co najmniej 4,5 mm. G&oacute;rna cz&#281;&#347;&#263; uchwytu b&#281;dzie przykr&#281;cona do dolnej dwoma &#347;rubami M12. G&#322;owa takiej &#347;ruby wymaga co najmniej 20 mm wolnej przestrzeni. Po obu stronach &#322;o&#380;yska powinna znajdowa&#263; si&#281; rowek umo&#380;liwiaj&#261;cy zamocowanie standardowego pier&#347;cienia uszczelniaj&#261;cego wa&#322; DIN 3760: 38x55x7 lub 40x55x7 po jednej stronie, 50x68x8 po drugiej stronie.
</p><p>Uchwyt b&#281;dzie odlewem piaskowym o minimalnej grubo&#347;ci &#347;cianki 5 mm, k&#261;cie pochylenia 2 stopni oraz minimalnym promieniu zaokr&#261;glenia 3 mm.
</p><p><br clear="all">
</p><p><span id="Setting_up_the_skeleton_geometry"></span>
</p>
<h2><span class="mw-headline" id="Ustawienie_szkieletu_geometrii">Ustawienie szkieletu geometrii</span></h2>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop2-2.png&amp;filetimestamp=20160718193124&amp;.html" class="mw-file-description"><img src="../File/HolderTop2-2.png" decoding="async" width="400" height="149" class="mw-file-element" data-file-width="1260" data-file-height="468"></a><figcaption>Szkic szkieletu geometrii</figcaption></figure>
<p>Utw&oacute;rz nowy element w &#347;rodowisku pracy Projekt Cz&#281;&#347;ci. Zmie&#324; nazw&#281; domy&#347;lnie tworzonej Zawarto&#347;ci na Szkielet. Ta Zawarto&#347;&#263; prawdopodobnie jest ju&#380; aktywowana, co mo&#380;na zobaczy&#263; po niebieskim tle w drzewku funkcji. Utw&oacute;rz nowy szkic na p&#322;aszczy&#378;nie YZ, zawieraj&#261;cy zarys wa&#322;u, &#322;o&#380;yska i pier&#347;cieni uszczelniaj&#261;cych. Po zako&#324;czeniu szkicu utw&oacute;rz z niego cech&#281; obr&oacute;cenia. Ta funkcja szkieletu b&#281;dzie p&oacute;&#378;niej u&#380;ywana jako odniesienie dla rzeczywistej geometrii. Oznacza to, &#380;e je&#347;li b&#281;dziesz chcia&#322; zmieni&#263; jakiekolwiek wymiary, wystarczy dostosowa&#263; wymiary funkcji szkieletu, a reszta elementu zostanie odpowiednio zaktualizowana.
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop2-2-1.jpg&amp;filetimestamp=20130711190937&amp;.html" class="mw-file-description"><img src="../File/HolderTop2-2-1.jpg" decoding="async" width="400" height="260" class="mw-file-element" data-file-width="1058" data-file-height="687"></a><figcaption>Szkielet geometrii</figcaption></figure>
<p><br clear="all">
</p><p><span id="The_main_body"></span>
</p>
<h2><span id="G.C5.82.C3.B3wna_Zawarto.C5.9B.C4.87"></span><span class="mw-headline" id="G&#322;&oacute;wna_Zawarto&#347;&#263;">G&#322;&oacute;wna Zawarto&#347;&#263;</span></h2>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop2-3.jpg&amp;filetimestamp=20130711184543&amp;.html" class="mw-file-description"><img src="../File/HolderTop2-3.jpg" decoding="async" width="400" height="298" class="mw-file-element" data-file-width="1040" data-file-height="774"></a><figcaption>Szkic pierwszego wyci&#261;gni&#281;cia</figcaption></figure>
<p>Utw&oacute;rz now&#261; Zawarto&#347;&#263; i aktywuj j&#261;. Szkic pierwszego wyci&#261;gni&#281;cia pokazano po prawej stronie. Zosta&#322; on umieszczony na p&#322;aszczy&#378;nie datum z odsuni&#281;ciem 5 mm (grubo&#347;&#263; &#347;cianki) od powierzchni szkieletu wyznaczaj&#261;cej stron&#281; jednego z pier&#347;cieni uszczelniaj&#261;cych &#322;o&#380;yska. Poniewa&#380; wszystkie wa&#380;ne wymiary s&#261; pobierane ze szkieletu, s&#261; tylko trzy wymiary: zapas obr&oacute;bkowy (3 mm) u podstawy jako odsuni&#281;cie od p&#322;aszczyzny XY, 5 mm grubo&#347;ci &#347;cianki od &#347;rednicy zewn&#281;trznej szkieletu oraz k&#261;t nachylenia (draft) 2 stopnie. Aby utworzy&#263; wymiar 5 mm, nale&#380;y najpierw wybra&#263; zewn&#281;trzny okr&#261;g (promie&#324; 45 mm) szkieletu geometrii jako geometri&#281; zewn&#281;trzn&#261; w szkicowniku, a nast&#281;pnie wstawi&#263; lini&#281; konstrukcyjn&#261; ograniczon&#261; stycznie do tego okr&#281;gu i pod k&#261;tem dw&oacute;ch stopni.
</p><p>Pewnie zastanawiasz si&#281;, dlaczego na dole ka&#380;dego &#322;uku znajduje si&#281; ten ma&#322;y prosty odcinek. Odcinek ten zapewnia, &#380;e na &#322;ukach b&#281;dzie zachowany k&#261;t pochylenia 2 stopnie. Mo&#380;e si&#281; to wydawa&#263; du&#380;o pracy dla niewielkiej korzy&#347;ci, ale wiele program&oacute;w CAD (a by&#263; mo&#380;e kiedy&#347; r&oacute;wnie&#380; FreeCAD) posiada narz&#281;dzia, kt&oacute;re pod&#347;wietlaj&#261; model bry&#322;owy r&oacute;&#380;nymi kolorami i od razu pokazuj&#261; wszystkie powierzchnie, na kt&oacute;rych k&#261;t nachylenia nie jest prawid&#322;owy. Nie chcesz, aby co&#347; takiego sta&#322;o si&#281; z Twoim modelem, zw&#322;aszcza po dodaniu wielu zaokr&#261;gle&#324;!
<br clear="all">
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop2-4.jpg&amp;filetimestamp=20130711185009&amp;.html" class="mw-file-description"><img src="../File/HolderTop2-4.jpg" decoding="async" width="400" height="279" class="mw-file-element" data-file-width="1117" data-file-height="780"></a><figcaption>Pierwsze wyci&#261;gni&#281;cie</figcaption></figure>
<p>Po uko&#324;czeniu szkicu (co mo&#380;e by&#263; nieco trudne z powodu stycznych linii pod k&#261;tem 2 stopni) utw&oacute;rz z niego wyci&#261;gni&#281;cie rozci&#261;gaj&#261;ce si&#281; do drugiej strony szkieletu geometrii, ponownie z odsuni&#281;ciem 5 mm od powierzchni bocznej. Tym razem nie trzeba tworzy&#263; p&#322;aszczyzny konstrukcyjnej &mdash; tryb "do powierzchni" w oknie dialogowym wyci&#261;gni&#281;cia pozwala wprowadzi&#263; odsuni&#281;cie.
<br clear="all">
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop2-5.jpg&amp;filetimestamp=20130711190315&amp;.html" class="mw-file-description"><img src="../File/HolderTop2-5.jpg" decoding="async" width="400" height="313" class="mw-file-element" data-file-width="899" data-file-height="703"></a><figcaption>Szkic do wyci&#281;cia przez wyci&#261;gni&#281;cie</figcaption></figure>
<p>Nast&#281;pnie usuniemy troch&#281; materia&#322;u na obu ko&#324;cach wyci&#261;gni&#281;cia, poniewa&#380; w przypadku odlew&oacute;w zawsze najlepiej jest, gdy grubo&#347;&#263; &#347;cianki jest mo&#380;liwie jak najbardziej jednolita. Utw&oacute;rz szkic na ka&#380;dej z ko&#324;cowych powierzchni wyci&#261;gni&#281;cia i wymiaruj go z odsuni&#281;ciem 5 mm od ko&#322;a reprezentuj&#261;cego pier&#347;cie&#324; uszczelniaj&#261;cy &#322;o&#380;yska (promie&#324; 27,5 mm po jednej stronie i 34 mm po drugiej). Dla dolnego odcinka linii szkicu utw&oacute;rz kolejn&#261; geometri&#281; zewn&#281;trzn&#261; z wyci&#261;gni&#281;cia i ogranicz do niej szkic. W ten spos&oacute;b szkic ma tylko jeden wymiar, czyli grubo&#347;&#263; &#347;cianki 5 mm (wymiary 150 mm i 75 mm nie s&#261; istotne, dop&oacute;ki s&#261; wystarczaj&#261;co du&#380;e, aby zapewni&#263; wyci&#281;cie ca&#322;ego materia&#322;u). 
<br clear="all">
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop2-6.jpg&amp;filetimestamp=20130711190430&amp;.html" class="mw-file-description"><img src="../File/HolderTop2-6.jpg" decoding="async" width="400" height="277" class="mw-file-element" data-file-width="1063" data-file-height="736"></a><figcaption>Wyci&#261;gni&#281;cie z wyci&#281;ciami w celu uzyskania jednolitej grubo&#347;ci &#347;cianki</figcaption></figure>
<p>U&#380;yj utworzonego szkicu, aby wykona&#263; Kiesze&#324; i przed&#322;u&#380; j&#261; do powierzchni geometrii szkieletu reprezentuj&#261;cej &#322;o&#380;ysko, z odj&#281;ciem 5 mm na grubo&#347;&#263; &#347;cianki. W przypadku drugiej Kieszeni mo&#380;esz skorzysta&#263; z opcji "Duplikuj wybrany obiekt" w menu Edycja, aby skopiowa&#263; ju&#380; wykonany szkic (je&#347;li pojawi si&#281; pytanie, wybierz nie duplikowa&#263; obiekt&oacute;w zale&#380;nych). Nast&#281;pnie wybierz powierzchni&#281;, na kt&oacute;r&#261; chcesz przenie&#347;&#263; szkic, i naka&#380; FreeCAD, aby przypisa&#322; szkic do tej powierzchni (jest to opcja w menu &#347;rodowiska Projekt Cz&#281;&#347;ci). Po utworzeniu drugiej Kieszeni mo&#380;esz obejrze&#263; wynik od spodu, aby sprawdzi&#263;, czy grubo&#347;&#263; &#347;cianki wok&oacute;&#322; konturu geometrii szkieletu wynosi jednolite 5 mm. 
<br clear="all">
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop2-7.jpg&amp;filetimestamp=20130711192218&amp;.html" class="mw-file-description"><img src="../File/HolderTop2-7.jpg" decoding="async" width="400" height="226" class="mw-file-element" data-file-width="1085" data-file-height="614"></a><figcaption>P&#322;aszczyzna neutralna do zastosowania pochylenia</figcaption></figure>
<p>Teraz nadszed&#322; czas na utworzenie pochyle&#324; i zaokr&#261;gle&#324;. Funkcja pochylenia wymaga p&#322;aszczyzny neutralnej, co oznacza, &#380;e geometria przeci&#281;ta przez t&#281; p&#322;aszczyzn&#281; pozostanie na swoim miejscu, podczas gdy reszta powierzchni zostanie pochylona pod zadanym k&#261;tem. U&#380;ycie do tego celu dolnej powierzchni wyci&#261;gni&#281;cia nie jest dobrym pomys&#322;em, poniewa&#380; grubo&#347;&#263; &#347;cianki w g&oacute;rnej cz&#281;&#347;ci uchwytu sta&#322;aby si&#281; mniejsza ni&#380; 5 mm. Dlatego tworzymy p&#322;aszczyzn&#281; datum odsuni&#281;t&#261; o oko&#322;o 35 mm od p&#322;aszczyzny XY. Aktywuj Zawarto&#347;&#263; ze szkieletem i utw&oacute;rz tam p&#322;aszczyzn&#281;, poniewa&#380; b&#281;dziemy jej potrzebowa&#263; tak&#380;e do zastosowania pochylenia do innych obiekt&oacute;w. 
<br clear="all">
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop2-8.jpg&amp;filetimestamp=20130711192240&amp;.html" class="mw-file-description"><img src="../File/HolderTop2-8.jpg" decoding="async" width="400" height="233" class="mw-file-element" data-file-width="1106" data-file-height="644"></a><figcaption>Pierwsza Zawarto&#347;&#263; z zastosowanym pochyleniem i zaokr&#261;gleniami</figcaption></figure>
<p>Obrazek po prawej stronie pokazuje uko&#324;czon&#261; pierwsz&#261; Zawarto&#347;&#263; z zastosowanym pochyleniem i zaokr&#261;gleniami. Zauwa&#380;, &#380;e zewn&#281;trzne (wkl&#281;s&#322;e) kraw&#281;dzie maj&#261; wi&#281;kszy promie&#324; zaokr&#261;glenia wynosz&#261;cy 5 mm, ponownie w celu uzyskania bardziej jednolitej grubo&#347;ci &#347;cianki (wi&#281;cej ni&#380; 5 mm nie jest mo&#380;liwe, poniewa&#380; po obr&oacute;bce wn&#281;trza uchwytu grubo&#347;&#263; &#347;cianki sta&#322;aby si&#281; mniejsza ni&#380; 5 mm). <br clear="all">
</p><p><span id="Adding_the_bodies_for_the_bolts"></span>
</p>
<h2><span id="Dodawanie_zawarto.C5.9Bci_dla_.C5.9Brub"></span><span class="mw-headline" id="Dodawanie_zawarto&#347;ci_dla_&#347;rub">Dodawanie zawarto&#347;ci dla &#347;rub</span></h2>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop2-13.jpg&amp;filetimestamp=20130716175052&amp;.html" class="mw-file-description"><img src="../File/HolderTop2-13.jpg" decoding="async" width="400" height="333" class="mw-file-element" data-file-width="730" data-file-height="607"></a><figcaption>Szkic dla Zawarto&#347;ci dla &#347;rub</figcaption></figure>
<p>&#346;ruby wymagaj&#261; dw&oacute;ch cylindrycznych Zawarto&#347;ci po obu stronach g&#322;&oacute;wnej Zawarto&#347;ci. Najlepiej uwzgl&#281;dni&#263; k&#261;t pochylenia 2 stopni ju&#380; w szkicu. Pr&oacute;bowa&#322;em obr&oacute;ci&#263; cylinder, a potem zastosowa&#263; pochylenie, ale po odbiciu lustrzanym dzia&#322;y si&#281; dziwne rzeczy i nie mog&#322;em doda&#263; zaokr&#261;gle&#324;, poniewa&#380; powierzchnia w jaki&#347; spos&oacute;b si&#281; zniekszta&#322;ci&#322;a.
</p><p>Szkic jest wymiarowany tak, aby o&#347; obrotu znajdowa&#322;a si&#281; w odleg&#322;o&#347;ci 12 mm od &#347;rednicy zewn&#281;trznej Zawarto&#347;ci szkieletu: 7 mm na promie&#324; otworu plus 5 mm na grubo&#347;&#263; &#347;cianki. Dla zachowania pe&#322;nej parametryczno&#347;ci elementu warto doda&#263; do szkieletu p&#322;aszczyzn&#281; oko&#322;o 25 mm nad p&#322;aszczyzn&#261; XY, aby oznaczy&#263; g&oacute;r&#281; cylindr&oacute;w. Poniewa&#380; cz&#281;&#347;&#263; ta b&#281;dzie obrabiana, szkic jest wymiarowany 3 mm powy&#380;ej tej p&#322;aszczyzny.
</p><p><br clear="all">
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop2-14.jpg&amp;filetimestamp=20130715192541&amp;.html" class="mw-file-description"><img src="../File/HolderTop2-14.jpg" decoding="async" width="400" height="244" class="mw-file-element" data-file-width="987" data-file-height="601"></a><figcaption>Zawarto&#347;&#263;dla &#347;rub</figcaption></figure>
<p>Utw&oacute;rz wyci&#261;gni&#281;cie przez obr&oacute;t ze szkicu i zastosuj zaokr&#261;glenie o warto&#347;ci 4 mm na g&oacute;rze. Oznacza to, &#380;e po obr&oacute;bce 3 mm pozostanie niewielki promie&#324;, co pomaga unikn&#261;&#263; ostrej kraw&#281;dzi, przy kt&oacute;rej mo&#380;na by si&#281; skaleczy&#263; podczas dokr&#281;cania &#347;ruby. 
<br clear="all">
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop2-16.jpg&amp;filetimestamp=20130715192912&amp;.html" class="mw-file-description"><img src="../File/HolderTop2-16.jpg" decoding="async" width="400" height="261" class="mw-file-element" data-file-width="868" data-file-height="566"></a><figcaption>G&#322;&oacute;wna Zawarto&#347;&#263; z dwiema Zawarto&#347;ciami dla &#347;rub</figcaption></figure>
<p>Utw&oacute;rz cech&#281; operacji logicznej, aby po&#322;&#261;czy&#263; g&#322;&oacute;wn&#261; Zawarto&#347;&#263; z Zawarto&#347;ci&#261; &#347;rub. Nast&#281;pnie utw&oacute;rz now&#261; Zawarto&#347;&#263; dla drugiej strony. Skopiuj szkic wyci&#261;gni&#281;cia przez obr&oacute;t, przenie&#347; go do tej Zawarto&#347;ci i utw&oacute;rz drug&#261; Zawarto&#347;&#263; dla &#347;rub (odbicie lustrzane Zawarto&#347;ci nie jest jeszcze obs&#322;ugiwane, wi&#281;c wi&#281;kszo&#347;&#263; trzeba zrobi&#263; od nowa). Nast&#281;pnie po&#322;&#261;cz t&#281; drug&#261; Zawarto&#347;&#263; r&oacute;wnie&#380; z g&#322;&oacute;wn&#261; Zawarto&#347;ci&#261;. Na koniec zastosuj du&#380;e zaokr&#261;glenie na kraw&#281;dzi utworzonej przez operacj&#281; logiczn&#261; scalenia. Najwi&#281;ksze, jakie uda&#322;o mi si&#281; uzyska&#263;, to 4 mm. <br clear="all">
</p><p><span id="Hollowing_out_the_main_body"></span>
</p>
<h2><span id="Wydr.C4.85.C5.BCenie_g.C5.82.C3.B3wnej_Zawarto.C5.9Bci"></span><span class="mw-headline" id="Wydr&#261;&#380;enie_g&#322;&oacute;wnej_Zawarto&#347;ci">Wydr&#261;&#380;enie g&#322;&oacute;wnej Zawarto&#347;ci</span></h2>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop2-9.jpg&amp;filetimestamp=20130714182319&amp;.html" class="mw-file-description"><img src="../File/HolderTop2-9.jpg" decoding="async" width="300" height="347" class="mw-file-element" data-file-width="477" data-file-height="551"></a><figcaption>Pierwsze wyci&#261;gni&#281;cie Zawarto&#347;ci wyci&#281;tej wewn&#281;trznej cz&#281;&#347;ci w g&#322;&oacute;wnej Zawarto&#347;ci</figcaption></figure>
<p>Teraz zajmiemy si&#281; wn&#281;trzem uchwytu i wydr&#261;&#380;ymy je, aby zrobi&#263; miejsce na &#322;o&#380;ysko i pier&#347;cienie uszczelniaj&#261;ce. Przy tym oczywi&#347;cie musimy pami&#281;ta&#263; o zapasie obr&oacute;bkowym 3 mm. Poniewa&#380; ten samouczek uczy metody wielobry&#322;owej, utworzymy geometri&#281; wewn&#281;trzn&#261; jako oddzieln&#261; zawarto&#347;&#263;, a nast&#281;pnie wytniemy j&#261; z g&#322;&oacute;wnej Zawarto&#347;ci za pomoc&#261; operacji logicznej.
</p><p>Utw&oacute;rz now&#261; Zawarto&#347;&#263; i aktywuj j&#261;. Najpierw potrzebujemy p&#322;aszczyzny konstrukcyjnej odsuni&#281;tej o 3 mm wewn&#261;trz &#347;ciany szkieletu, kt&oacute;ra pokazuje stron&#281; &#322;o&#380;yska. Nast&#281;pnie skopiuj szkic pierwszego wyci&#261;gni&#281;cia g&#322;&oacute;wnej Zawarto&#347;ci. Zostanie on dodany do g&#322;&oacute;wnej Zawarto&#347;ci, wi&#281;c kliknij go prawym przyciskiem i wybierz opcj&#281; przeniesienia do nowo utworzonej Zawarto&#347;ci (ta opcja jest dost&#281;pna w menu kontekstowym tylko wtedy, gdy aktywne jest &#347;rodowisko Projekt Cz&#281;&#347;ci). Przypisz szkic do p&#322;aszczyzny konstrukcyjnej (je&#347;li szkic obr&oacute;ci si&#281; do g&oacute;ry nogami po przypisaniu, przenie&#347; p&#322;aszczyzn&#281; konstrukcyjn&#261; na drug&#261; stron&#281; &#322;o&#380;yska, obok miejsca, gdzie znajduje si&#281; skopiowany szkic). Teraz zmodyfikuj szkic tak, aby &#347;rednica by&#322;a o 3 mm mniejsza od &#347;rednicy zewn&#281;trznej geometrii szkieletu reprezentuj&#261;cej &#322;o&#380;ysko. Wystarczy usun&#261;&#263; wymiar 5 mm, przesun&#261;&#263; szkic do wn&#281;trza ko&#322;a odniesienia i utworzy&#263; nowy wymiar 3 mm.
<br clear="all">
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop2-10.jpg&amp;filetimestamp=20130714183706&amp;.html" class="mw-file-description"><img src="../File/HolderTop2-10.jpg" decoding="async" width="400" height="218" class="mw-file-element" data-file-width="1013" data-file-height="551"></a><figcaption>Wyci&#281;ta zawarto&#347;&#263; wewn&#261;trz Zawarto&#347;ci szkieletu</figcaption></figure>
<p>Nast&#281;pnie utworzymy dwa kolejne wyci&#261;gni&#281;cia, aby wydr&#261;&#380;y&#263; miejsce na pier&#347;cienie uszczelniaj&#261;ce. Skopiuj szkic pierwszego wyci&#261;gni&#281;cia wyci&#281;tej Zawarto&#347;ci i przypisz go do p&#322;aszczyzny XZ. Edytuj szkic, zast&#281;puj&#261;c zewn&#281;trzne odniesienie &#347;rednic&#261; zewn&#281;trzn&#261; pier&#347;cienia uszczelniaj&#261;cego &#322;o&#380;yska. Wyci&#261;gnij ten szkic do odsuni&#281;cia 3 mm od strony pier&#347;cienia uszczelniaj&#261;cego. Ca&#322;y proces powt&oacute;rz dla pier&#347;cienia uszczelniaj&#261;cego po drugiej stronie.
</p><p>Nast&#281;pnie utworzymy dwa kolejne wyci&#261;gni&#281;cia podobne do ostatnich dw&oacute;ch, aby zapewni&#263; wa&#322;owi luz (np. 3 mm) wewn&#261;trz uchwytu.
<br clear="all">
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop2-11.jpg&amp;filetimestamp=20130714184941&amp;.html" class="mw-file-description"><img src="../File/HolderTop2-11.jpg" decoding="async" width="400" height="200" class="mw-file-element" data-file-width="1055" data-file-height="527"></a><figcaption>Kompletna wyci&#281;ta Zawarto&#347;&#263; (opr&oacute;cz niemo&#380;liwych zaokr&#261;gle&#324;)</figcaption></figure>
<p>Teraz pozosta&#322;o tylko zastosowa&#263; pochylenie do p&#322;askich powierzchni bocznych, u&#380;ywaj&#261;c tej samej p&#322;aszczyzny neutralnej co dla g&#322;&oacute;wnej Zawarto&#347;ci, oraz wykona&#263; zaokr&#261;glenia. Zastosuj og&oacute;lne zaokr&#261;glenie 3 mm do wszystkich kraw&#281;dzi. Zauwa&#380;ysz, &#380;e istnieje kilka kraw&#281;dzi, kt&oacute;rych nie da si&#281; zaokr&#261;gli&#263;... jest to wada u&#380;ywanego przez FreeCAD j&#261;dra geometrycznego.
<br clear="all">
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop2-15.jpg&amp;filetimestamp=20130715192602&amp;.html" class="mw-file-description"><img src="../File/HolderTop2-15.jpg" decoding="async" width="400" height="237" class="mw-file-element" data-file-width="974" data-file-height="576"></a><figcaption>Uko&#324;czona surowa Zawarto&#347;&#263; uchwytu (bez obr&oacute;bki)</figcaption></figure>
<p>Jeste&#347;my gotowi do wydr&#261;&#380;enia g&#322;&oacute;wnej Zawarto&#347;ci. Wybierz j&#261; i utw&oacute;rz now&#261; operacj&#281; logiczn&#261;. Dodaj wyci&#281;t&#261; Zawarto&#347;&#263; do listy i ustaw operacj&#281; na "Wytnij". Na dw&oacute;ch kraw&#281;dziach powsta&#322;ych w wyniku wyci&#281;cia zastosuj zaokr&#261;glenie 3 mm (niekt&oacute;re kraw&#281;dzie nadal pozostan&#261; niemo&#380;liwe do zaokr&#261;glenia). Wynik powinien wygl&#261;da&#263; jak na obrazku po prawej.
</p><p>Surowa cz&#281;&#347;&#263; jest teraz uko&#324;czona. Tak b&#281;dzie wygl&#261;da&#322; uchwyt przed obr&oacute;bk&#261;. Zauwa&#380;, &#380;e poniewa&#380; forma b&#281;dzie sk&#322;ada&#322;a si&#281; z g&oacute;rnej i dolnej cz&#281;&#347;ci, kraw&#281;dzi mi&#281;dzy nimi nie da si&#281; zaokr&#261;gli&#263;. Ponadto, je&#347;li przeka&#380;esz ten model odlewni, pami&#281;taj, aby zaznaczy&#263;, &#380;e wymiary dotycz&#261; stanu po odlewaniu. Odlewnia b&#281;dzie musia&#322;a zastosowa&#263; odpowiedni procent skurczu do modelu (powi&#281;kszaj&#261;c cyfrowy model u&#380;ywany do wykonania formy, tak aby po ostygni&#281;ciu i skurczeniu metalu element mia&#322; w&#322;a&#347;ciwe wymiary).
<br clear="all">
</p><p><span id="Machining"></span>
</p>
<h2><span id="Obr.C3.B3bka_skrawaniem"></span><span class="mw-headline" id="Obr&oacute;bka_skrawaniem">Obr&oacute;bka skrawaniem</span></h2>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop2-17.jpg&amp;filetimestamp=20130716182636&amp;.html" class="mw-file-description"><img src="../File/HolderTop2-17.jpg" decoding="async" width="400" height="472" class="mw-file-element" data-file-width="663" data-file-height="782"></a><figcaption>Szkic do "wiercenia" otwor&oacute;w dla &#347;rub</figcaption></figure>
<p>Aby usun&#261;&#263; materia&#322; potrzebny do obr&oacute;bki wn&#281;trza uchwytu, bardzo wygodnie mo&#380;na u&#380;y&#263; samej Zawarto&#347;ci szkieletu. Je&#347;li nie chcesz tego robi&#263;, bo wtedy szkielet zostaje ukryty gdzie&#347; g&#322;&#281;boko w drzewku, mo&#380;esz r&oacute;wnie&#380; skopiowa&#263; szkic funkcji wyci&#261;gni&#281;cia przez obr&oacute;t szkieletu i odtworzy&#263; wyci&#261;gni&#281;cie przez obr&oacute;t w innej Zawarto&#347;ci. Nie jest to jednak w pe&#322;ni parametryczne, poniewa&#380; skopiowany szkic jest niezale&#380;ny od orygina&#322;u, wi&#281;c przy zmianie wymiaru b&#281;dziesz musia&#322; edytowa&#263; oba. W przysz&#322;o&#347;ci mo&#380;liwe jest wsparcie dla zale&#380;nych kopii funkcji.
</p><p>Dla pozosta&#322;ej obr&oacute;bki utw&oacute;rz now&#261; Zawarto&#347;&#263;. Dolna cz&#281;&#347;&#263; uchwytu b&#281;dzie obrabiana za pomoc&#261; wyci&#261;gni&#281;cia naszkicowanego na p&#322;aszczy&#378;nie XY i rozci&#261;gni&#281;tego w d&oacute;&#322;. Nast&#281;pnie naszkicuj wyci&#261;gni&#281;cie przez obr&oacute;t, aby wykona&#263; otw&oacute;r na &#347;ruby. Szkic nale&#380;y wykona&#263; na p&#322;aszczy&#378;nie XZ i obr&oacute;ci&#263;, tak aby mo&#380;na by&#322;o wybra&#263; &#347;rednic&#281; zewn&#281;trzn&#261; Zawarto&#347;ci szkieletu jako odniesienie zewn&#281;trzne. G&oacute;rna cz&#281;&#347;&#263; szkicu pos&#322;u&#380;y do obr&oacute;bki p&#322;askiego miejsca dla g&#322;owy &#347;ruby. Jest ona wymiarowana tak, aby w uchwycie pozostawi&#263; co najmniej 5 mm grubo&#347;ci &#347;cianki. Je&#347;li to nie zapewnia wystarczaj&#261;cej przestrzeni dla g&#322;owy &#347;ruby, mo&#380;na przesun&#261;&#263; p&#322;aszczyzn&#281; konstrukcyjn&#261; w g&oacute;r&#281;. Oczywi&#347;cie, t&#281; logik&#281; mo&#380;na te&#380; wprowadzi&#263; do szkieletu, co pozostawiono jako &#263;wiczenie dla czytelnika! 
<br clear="all">
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop2-18.jpg&amp;filetimestamp=20130716182656&amp;.html" class="mw-file-description"><img src="../File/HolderTop2-18.jpg" decoding="async" width="400" height="293" class="mw-file-element" data-file-width="985" data-file-height="722"></a><figcaption>Zawarto&#347;&#263; do obr&oacute;bki</figcaption></figure>
<p>Wyci&#261;gni&#281;cie przez obr&oacute;t mo&#380;na odbi&#263; lustrzanie wzgl&#281;dem osi YZ. Obrazek po prawej stronie pokazuje Zawarto&#347;&#263; "do obr&oacute;bki". Oczywi&#347;cie, wi&#281;kszo&#347;&#263; wymiar&oacute;w wyci&#261;gni&#281;&#263; i wyci&#261;gni&#281;&#263; przez obr&oacute;t nie jest istotna, dop&oacute;ki jest wystarczaj&#261;ce nachodzenie na siebie. 
<br clear="all">
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop2-19.jpg&amp;filetimestamp=20130716184057&amp;.html" class="mw-file-description"><img src="../File/HolderTop2-19.jpg" decoding="async" width="400" height="263" class="mw-file-element" data-file-width="1037" data-file-height="683"></a><figcaption>Uko&#324;czony uchwyt po obr&oacute;bce</figcaption></figure>
<p>Na koniec utw&oacute;rz operacj&#281; logiczn&#261;, aby odj&#261;&#263; Zawarto&#347;&#263; do obr&oacute;bki od g&#322;&oacute;wnej Zawarto&#347;ci. Je&#347;li chcesz uzyska&#263; efekt wizualny, mo&#380;esz pokolorowa&#263; obrabiane powierzchnie inaczej ni&#380; reszt&#281; elementu. Jest to r&oacute;wnie&#380; przydatny wizualny wska&#378;nik, pokazuj&#261;cy, czy gdzie&#347; nie zapomnia&#322;e&#347; o obr&oacute;bce. 
<br clear="all">
</p>
<h2><span id="Cz.C4.99.C5.9B.C4.87_pierwsza"></span><span class="mw-headline" id="Cz&#281;&#347;&#263;_pierwsza">Cz&#281;&#347;&#263; pierwsza</span></h2>
<p><a href="../pl/PartDesign_Bearingholder_Tutorial_I.html" title="PartDesign Bearingholder Tutorial I/pl">Poradnik: Projekt cz&#281;&#347;ci, uchwyt &#322;o&#380;yska cze&#347;&#263; 1</a>
</p>
<div style="clear:both"></div>
<!-- 
NewPP limit report
Cached time: 20251220223853
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.069 seconds
Real time usage: 0.096 seconds
Preprocessor visited node count: 110/1000000
Post&#8208;expand include size: 1592/2097152 bytes
Template argument size: 154/2097152 bytes
Highest expansion depth: 4/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 2460/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   13.741      1 -total
 56.48%    7.761      1 Template:Caption
 28.99%    3.984      1 Template:TutorialInfo/pl
 11.35%    1.560      1 Template:Clear
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:182939-0!canonical and timestamp 20251220223853 and revision id 1654653. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>