<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Release notes 0.16/pl</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="pl" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Release+notes+0.16&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/Release_notes_0.16.html" class="mw-pt-progress mw-pt-progress--complete" title="Versionshinweise 0.16 (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Release_notes_0.16.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Release notes 0.16 (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/Release_notes_0.16.html" class="mw-pt-progress mw-pt-progress--low" title="Notas del lanzamiento 0.16 (3% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/Release_notes_0.16.html" class="mw-pt-progress mw-pt-progress--complete" title="Notes de version 0.16 (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/Release_notes_0.16.html" class="mw-pt-progress mw-pt-progress--complete" title="Note di rilascio della versione 0.16 (100% translated)" lang="it" dir="ltr">italiano</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="pl" dir="ltr">polski</span></li>
<li><a href="../pt/Release_notes_0.16.html" class="mw-pt-progress mw-pt-progress--med" title="Notas de lan&ccedil;amento da vers&atilde;o 0.16 (22% translated)" lang="pt" dir="ltr">portugu&ecirc;s</a></li>
<li><a href="../ru/Release_notes_0.16.html" class="mw-pt-progress mw-pt-progress--low" title="&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1103; &#1082; &#1074;&#1099;&#1087;&#1091;&#1089;&#1082;&#1091; 0.16 (3% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li></ul></div>
<p>FreeCAD 0.16 zosta&#322; wydany dnia 18. kwietnia 2016 r., mo&#380;na go pobra&#263; z <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/releases/tag/0.16">GitHub</a>. Przedstawiamy podsumowanie najciekawszych zmian. Kompletn&#261; list&#281; zmian mo&#380;na znale&#378;&#263; w <a rel="nofollow" class="external text" href="http://www.freecadweb.org/tracker/changelog_page.php">Mantis changelog</a>. Starsze wersje mo&#380;na znale&#378;&#263; na stronach: <a href="../pl/Release_notes_0.15.html" title="Release notes 0.15/pl">0.15</a> - <a href="../pl/Release_notes_0.14.html" title="Release notes 0.14/pl">0.14</a> - <a href="../pl/Release_notes_0.13.html" title="Release notes 0.13/pl">0.13</a> - <a href="../pl/Release_notes_0.12.html" title="Release notes 0.12/pl">0.12</a> - <a href="../pl/Release_notes_0.11.html" title="Release notes 0.11/pl">0.11</a><br>
</p><p><span typeof="mw:File"><a href="../index.php?title=Satnogs_Rotator_FreeCAD.jpg&amp;filetimestamp=20160201215017&amp;.html" class="mw-file-description"><img src="../File/Satnogs_Rotator_FreeCAD.jpg" decoding="async" width="1024" height="576" class="mw-file-element" data-file-width="1920" data-file-height="1080"></a></span>
</p>
<center>Rotator Satnoga (<a rel="nofollow" class="external free" href="https://satnogs.org/">https://satnogs.org/</a>)</center>
<meta property="mw:PageProp/toc">
<h2><span id="Najwa.C5.BCniejsze_informacje"></span><span class="mw-headline" id="Najwa&#380;niejsze_informacje">Najwa&#380;niejsze informacje</span></h2>
<p>Wprowadzono <b>obs&#322;ug&#281; wyra&#380;e&#324;</b>, kt&oacute;ra umo&#380;liwia definiowanie zale&#380;no&#347;ci formu&#322; mi&#281;dzy w&#322;a&#347;ciwo&#347;ciami obiekt&oacute;w. Obs&#322;uga wyra&#380;e&#324; to du&#380;y krok naprz&oacute;d w tworzeniu lepszych modeli parametrycznych w FreeCAD. Wyra&#380;enia oferuj&#261; prosty interfejs do tworzenia modeli sterowanych za pomoc&#261; arkuszy kalkulacyjnych.
</p><p><span typeof="mw:File"><a href="../index.php?title=Expressions-demo.png&amp;filetimestamp=20160104174250&amp;.html" class="mw-file-description"><img src="../File/Expressions-demo.png" decoding="async" width="300" height="173" class="mw-file-element" data-file-width="561" data-file-height="323"></a></span>
</p><p>Zachowanie <b>solvera Szkicownika</b> zosta&#322;o znacznie ulepszone. Nie tylko sta&#322; si&#281; szybszy i bardziej stabilny, ale tak&#380;e nie zawiesza si&#281; ju&#380; przy nierozwi&#261;zywalnych szkicach. Dodatkowo automatyczne przeliczanie dokumentu wywo&#322;ywane po ka&#380;dej drobnej zmianie szkicu mo&#380;na teraz wy&#322;&#261;czy&#263;, co umo&#380;liwia p&#322;ynn&#261; edycj&#281; szkic&oacute;w osadzonych w z&#322;o&#380;onych zale&#380;no&#347;ciach.
</p><p><span typeof="mw:File"><a href="../index.php?title=Sketcher-v0.16-demo.png&amp;filetimestamp=20160104175547&amp;.html" class="mw-file-description"><img src="../File/Sketcher-v0.16-demo.png" decoding="async" width="300" height="225" class="mw-file-element" data-file-width="519" data-file-height="389"></a></span>
</p><p>FreeCAD obs&#322;uguje teraz nawigacj&#281; 3D za pomoc&#261; ekranu dotykowego. Umo&#380;liwia to korzystanie z FreeCAD bez myszy na laptopie konwertowalnym z ekranem dotykowym i pi&oacute;rem, z dala od biurka.
</p><p><b>&#346;rodowisko pracy MES</b> zawiera mn&oacute;stwo usprawnie&#324;. Okaza&#322;o si&#281; przydatne do r&oacute;&#380;nych rodzaj&oacute;w analiz mechanicznych.
</p><p><span typeof="mw:File"><a href="../index.php?title=Multiple_material.jpg&amp;filetimestamp=20160115220713&amp;.html" class="mw-file-description"><img src="../File/Multiple_material.jpg" decoding="async" width="700" height="438" class="mw-file-element" data-file-width="1440" data-file-height="900"></a></span>
</p>
<h2><span id="Og.C3.B3lne"></span><span class="mw-headline" id="Og&oacute;lne">Og&oacute;lne</span></h2>
<ul><li>Obs&#322;uga wyra&#380;e&#324;/formu&#322;</li>
<li>Trzy nowe style nawigacji: Nawigacja gestami (z obs&#322;ug&#261; ekranu dotykowego w systemie Windows), Nawigacja Maya i Nawigacja OpenCascade</li>
<li>Personalizacja listy &#347;rodowisk pracy (mo&#380;liwo&#347;&#263; zmiany kolejno&#347;ci oraz ukrywania wybranych &#347;rodowisk)</li>
<li>Narz&#281;dzie do odzyskiwania</li>
<li>Nowe opcje zapisu (Cofnij, zapisz jako kopi&#281;)</li>
<li>Nowa strona startowa</li></ul>
<h2><span id=".C5.9Arodowisko_pracy_Cz.C4.99.C5.9B.C4.87"></span><span class="mw-headline" id="&#346;rodowisko_pracy_Cz&#281;&#347;&#263;">&#346;rodowisko pracy Cz&#281;&#347;&#263;</span></h2>
<ul><li>Nowe narz&#281;dzia do &#322;&#261;czenia obiekt&oacute;w o &#347;ciankowej strukturze (np. rur): <a href="../pl/Part_JoinConnect.html" title="Part JoinConnect/pl">Po&#322;&#261;cz</a>, <a href="../pl/Part_JoinEmbed.html" title="Part JoinEmbed/pl">Osad&#378;</a> oraz <a href="../pl/Part_JoinCutout.html" title="Part JoinCutout/pl">Wyci&#281;cie</a></li>
<li>Nowa funkcja: tworzenie &#347;ciany ze szkicu (parametryczna)</li></ul>
<h2><span id=".C5.9Arodowiska_pracy_Projektowanie_Cz.C4.99.C5.9Bci_i_Szkicownik"></span><span class="mw-headline" id="&#346;rodowiska_pracy_Projektowanie_Cz&#281;&#347;ci_i_Szkicownik">&#346;rodowiska pracy Projektowanie Cz&#281;&#347;ci i Szkicownik</span></h2>
<ul><li>Nowa funkcja: tryb prze&#322;&#261;czania dla <a href="../pl/Sketcher_ToggleDrivingConstraint.html" title="Sketcher ToggleDrivingConstraint/pl">wi&#261;za&#324; steruj&#261;cych/referencyjnych</a></li>
<li>Nowa funkcja: tryb ci&#261;g&#322;ego tworzenia</li>
<li>Nowa funkcja: ograniczenia niesteruj&#261;ce (tzw. ograniczenia zale&#380;ne)</li>
<li>Znaczne przyspieszenie dzia&#322;ania</li>
<li>Zaawansowana kontrola rozwi&#261;zuj&#261;cego</li>
<li>Nowe funkcje: narz&#281;dzia do duplikowania, odbicia lustrzanego i tablicy prostok&#261;tnej</li>
<li>Obs&#322;uga <a href="../pl/Expressions.html" title="Expressions/pl">wyra&#380;e&#324;/formu&#322;</a> w ograniczeniach i w&#322;a&#347;ciwo&#347;ciach</li></ul>
<p><span id="Spreadsheet_Workbench"></span>
</p>
<h2><span id=".C5.9Arodowisko_pracy_Arkusz_Kalkulacyjny"></span><span class="mw-headline" id="&#346;rodowisko_pracy_Arkusz_Kalkulacyjny">&#346;rodowisko pracy Arkusz Kalkulacyjny</span></h2>
<ul><li>Dodane funkcje: round, trunc, ceil, floor.</li></ul>
<p><span id="Draft_Workbench"></span>
</p>
<h2><span id=".C5.9Arodowisko_pracy_Rysunek_Roboczy"></span><span class="mw-headline" id="&#346;rodowisko_pracy_Rysunek_Roboczy">&#346;rodowisko pracy Rysunek Roboczy</span></h2>
<ul><li><b>Nowy importer DXF</b>: &#346;rodowisko pracy Rysunek Roboczy (Draft) zawiera teraz ca&#322;kowicie nowy importer DXF, w pe&#322;ni napisany w C++ i odziedziczony po <a rel="nofollow" class="external text" href="https://github.com/Heeks/heekscad">HeeksCad</a>. Nie wymaga ju&#380; pobierania zewn&#281;trznych komponent&oacute;w, dzia&#322;a znacznie szybciej i umo&#380;liwia wczytywanie znacznie wi&#281;kszych plik&oacute;w DXF. W preferencjach DXF dost&#281;pna jest opcja przywr&oacute;cenia starego importera, je&#347;li zajdzie taka potrzeba.</li>
<li>Nowe <b>narz&#281;dzie <a href="../pl/Draft_Mirror.html" title="Draft Mirror/pl">Lustrzane odbicie</a></b> umo&#380;liwia odbicie obiekt&oacute;w w stylu &#347;rodowiska Rysunek Roboczy.</li>
<li>Dodano wiele <b>szablon&oacute;w DXF</b>, odpowiadaj&#261;cych wbudowanym szablonom SVG, co znacznie poprawia eksport stron rysunkowych do DXF.</li>
<li><a href="../pl/Draft_Rectangle.html" title="Draft Rectangle/pl">Prostok&#261;ty</a>, <a href="../pl/Draft_Wire.html" title="Draft Wire/pl">polilinie i linie</a> mog&#261; by&#263; teraz <b>dzielone</b>, co pozwala na tworzenie wielu nowych kombinacji kszta&#322;t&oacute;w.</li></ul>
<p><br>
<span typeof="mw:File"><a href="../index.php?title=Draft_subdivisions.jpg&amp;filetimestamp=20160106133831&amp;.html" class="mw-file-description"><img src="../File/Draft_subdivisions.jpg" decoding="async" width="1024" height="538" class="mw-file-element" data-file-width="1503" data-file-height="790"></a></span>
</p>
<h2><span id=".C5.9Arodowisko_pracy_Rysunek"></span><span class="mw-headline" id="&#346;rodowisko_pracy_Rysunek">&#346;rodowisko pracy Rysunek</span></h2>
<ul><li>Nowe narz&#281;dzie <b><a href="../pl/Drawing_SpreadsheetView.html" title="Drawing SpreadsheetView/pl">widok arkusza kalkulacyjnego</a></b> umo&#380;liwia umieszczanie zakresu kom&oacute;rek z <a href="../pl/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/pl">arkusza kalkulacyjnego</a> na stronie rysunku.</li></ul>
<p><span typeof="mw:File"><a href="../index.php?title=Drawing_spreadsheetview.jpg&amp;filetimestamp=20160106133510&amp;.html" class="mw-file-description"><img src="../File/Drawing_spreadsheetview.jpg" decoding="async" width="1024" height="421" class="mw-file-element" data-file-width="1919" data-file-height="789"></a></span>
</p>
<h2><span id=".C5.9Arodowisko_pracy_Architektura"></span><span class="mw-headline" id="&#346;rodowisko_pracy_Architektura">&#346;rodowisko pracy Architektura</span></h2>
<ul><li><b><a href="../pl/Arch_SetMaterial.html" title="Arch SetMaterial/pl">Obs&#322;uga materia&#322;&oacute;w</a></b>: Obiekty Arch mog&#261; teraz mie&#263; przypisany <a href="../index.php?title=Material/pl&amp;action=edit&amp;redlink=1.html" class="new" title="Material/pl (page does not exist)">materia&#322;</a>, wykorzystuj&#261;cy wbudowany system materia&#322;&oacute;w FreeCAD. Materia&#322;y te s&#261; wsp&oacute;&#322;dzielone z innymi &#347;rodowiskami pracy i s&#261; w pe&#322;ni obs&#322;ugiwane podczas importu i eksportu IFC.</li>
<li><b><a href="../pl/Arch_SectionPlane.html" title="Arch SectionPlane/pl">P&#322;aszczyzna przekroju</a></b> mo&#380;e teraz przycina&#263; widok 3D, pokazuj&#261;c przekr&oacute;j w czasie rzeczywistym.</li></ul>
<p><span typeof="mw:File"><a href="../index.php?title=Arch_clip_plane.jpg&amp;filetimestamp=20160106132627&amp;.html" class="mw-file-description"><img src="../File/Arch_clip_plane.jpg" decoding="async" width="1024" height="769" class="mw-file-element" data-file-width="1112" data-file-height="835"></a></span>
</p>
<ul><li>Kilka usprawnie&#324; w <b>importerze IFC</b>, takich jak nowe opcje obs&#322;ugi du&#380;ych plik&oacute;w IFC, lepsze wsparcie dla wyci&#261;gni&#281;&#263; (teraz wykrywanych przy imporcie) oraz segment&oacute;w krzywoliniowych, a tak&#380;e obs&#322;uga obiekt&oacute;w adnotacji 2D. Dodano import Analytic IFC. Obecnie wspierany jest import reprezentacji geometrycznych wszystkich obiekt&oacute;w analitycznych.</li>
<li>Lepsze <b>opcje generowania siatki</b> dla format&oacute;w DAE i IFC.</li>
<li>Nowe narz&#281;dzie <a href="../pl/Arch_Schedule.html" title="Arch Schedule/pl">Obmiar</a> umo&#380;liwia tworzenie r&oacute;&#380;nych harmonogram&oacute;w z modelu BIM.</li>
<li><b>Atrybuty IFC</b> mog&#261; by&#263; teraz importowane, edytowane i eksportowane. S&#261; to zasadniczo obiekty arkusza kalkulacyjnego powi&#261;zane z obiektem Arch.</li></ul>
<h2><span id=".C5.9Arodowisko_pracy_MES"></span><span class="mw-headline" id="&#346;rodowisko_pracy_MES">&#346;rodowisko pracy MES</span></h2>
<ul><li><b>GUI</b>: Polecenia MES maj&#261; teraz skr&oacute;ty klawiaturowe. Wprowadzono okno preferencji dla MES. Jednym z ustawie&#324; jest &#347;cie&#380;ka do pliku wykonywalnego CalculiX.</li>
<li><b>GUI kontener analizy</b>: Elementy analizy mo&#380;na teraz przeci&#261;ga&#263; i upuszcza&#263;. Mo&#380;na je przenosi&#263; do i z kontenera analizy. Poniewa&#380; obs&#322;ugiwanych jest wiele analiz, elementy mog&#261; by&#263; przenoszone mi&#281;dzy analizami. W jednej analizie mo&#380;na tworzy&#263; wiele ogranicze&#324;.</li>
<li><b>GUI analiza jednym klikni&#281;ciem</b>: Dodano przycisk do analizy jednym klikni&#281;ciem. Czy&#347;ci wyniki, generuje plik wej&#347;ciowy CalculiX i uruchamia analiz&#281; wybranym solverem. Wykrywa dost&#281;pno&#347;&#263; wielow&#261;tkowo&#347;ci w CalculiX i u&#380;ywa maksymalnej liczby w&#261;tk&oacute;w.</li>
<li><b>Plik wej&#347;ciowy</b>: Wbudowany edytor FreeCAD wspiera edycj&#281; plik&oacute;w wej&#347;ciowych CalculiX (*.inp) wraz z pod&#347;wietlaniem sk&#322;adni.</li>
<li><b>Obiekt siatki Netgen</b>: Przeprojektowano GUI i edytor w&#322;a&#347;ciwo&#347;ci obiektu siatki Netgen. Obs&#322;uguje siatkowanie tetraedr&oacute;w elementami pierwszego i drugiego rz&#281;du oraz mo&#380;liwo&#347;&#263; dostosowania parametr&oacute;w siatki.</li>
<li><b>Obiekty wi&#261;za&#324; si&#322;y i utwierdzenia</b>: Teraz mo&#380;na dodawa&#263; si&#322;y i utwierdzenia na kraw&#281;dziach i wierzcho&#322;kach.</li>
<li><b>Obiekt ograniczenia ci&#347;nienia</b>: Dodano nowy obiekt do obci&#261;&#380;enia ci&#347;nieniem na &#347;cianach. Ci&#347;nienie (obci&#261;&#380;enie na jednostk&#281; powierzchni) jest przekazywane bezpo&#347;rednio do CalculiX, wi&#281;c obci&#261;&#380;enia na w&#281;z&#322;ach nie s&#261; obliczane przez FreeCAD, lecz przez CalculiX.</li>
<li><b>Obiekt ograniczenia przemieszczenia wymuszonego</b>: Dodano nowy obiekt do wymuszonych przemieszcze&#324;. Mo&#380;na go stosowa&#263; na wierzcho&#322;kach, kraw&#281;dziach i powierzchniach. W analizie pow&#322;okowej i belkowej mo&#380;liwe jest r&oacute;wnie&#380; ustalenie stopni swobody obrotowych.</li>
<li><b>Obiekt przekroju belki</b>: Nowy obiekt przekroju belki pozwala definiowa&#263; prostok&#261;tne przekroje poprzeczne dla analizy MES belek. Obs&#322;ugiwane jest wiele przekroj&oacute;w w jednej analizie przez definiowanie kszta&#322;t&oacute;w odniesienia dla ka&#380;dego przekroju.</li>
<li><b>Obiekt grubo&#347;ci pow&#322;oki</b>: Nowy obiekt grubo&#347;ci pow&#322;oki umo&#380;liwia definiowanie grubo&#347;ci p&#322;yt pow&#322;okowych. Podobnie jak w przypadku przekroju belki, mo&#380;liwe jest definiowanie wielu grubo&#347;ci pow&#322;ok w jednej analizie przez definiowanie kszta&#322;t&oacute;w odniesienia.</li>
<li><b>Obiekt materia&#322;u</b>: Obs&#322;ugiwane jest wiele materia&#322;&oacute;w dla siatek kraw&#281;dziowych, pow&#322;okowych i bry&#322;owych. Podobnie jak w przypadku przekroju belki i grubo&#347;ci pow&#322;oki, do korzystania z wielu materia&#322;&oacute;w potrzebna jest odpowiednia siatka MES.</li>
<li><b>Obiekt solvera</b>: Wprowadzono obiekt solvera jako baz&#281; dla obs&#322;ugi wielu solver&oacute;w. Wszystkie w&#322;a&#347;ciwo&#347;ci analizy przeniesiono z analizy do solvera.</li>
<li><b>Analiza cz&#281;stotliwo&#347;ciowa</b>: Mo&#380;liwe jest wykonanie analizy cz&#281;stotliwo&#347;ciowej. Liczb&#281; warto&#347;ci w&#322;asnych lub kszta&#322;t&oacute;w w&#322;asnych do obliczenia mo&#380;na ustawi&#263; w oknie preferencji.</li>
<li><b>Widok</b> Siatki pow&#322;okowe i belkowe MES mo&#380;na wy&#347;wietla&#263; w FreeCAD, a tym samym tak&#380;e wyniki takich analiz.</li>
<li><b>API Pythona</b> Dodano metody do pracy z siatkami MES i wykonywania analiz z poziomu Pythona.</li>
<li><b>Makro GMSH</b> Ciekawym zewn&#281;trznym rozwi&#261;zaniem jest <a href="../pl/Macro_GMSH.html" title="Macro GMSH/pl">Makro GMSH</a>, kt&oacute;re umo&#380;liwia u&#380;ycie GMSH do generowania siatek. Jest to bardzo przydatne dla os&oacute;b, kt&oacute;re nie mog&#261; skompilowa&#263; FreeCAD z Netgen lub chc&#261; siatkowa&#263; siatki pow&#322;okowe b&#261;d&#378; kraw&#281;dziowe.</li>
<li><b>Og&oacute;lne usprawnienia</b> Ze wzgl&#281;du na intensywny rozw&oacute;j, modu&#322; MES doczeka&#322; si&#281; wielu usprawnie&#324; kodu &#378;r&oacute;d&#322;owego.</li></ul>
<p><span id="Path_Workbench"></span>
</p>
<h2><span id=".C5.9Arodowisko_pracy_Path"></span><span class="mw-headline" id="&#346;rodowisko_pracy_Path">&#346;rodowisko pracy Path</span></h2>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Exercise_path_02.jpg&amp;filetimestamp=20160121205256&amp;.html" class="mw-file-description"><img src="../File/Exercise_path_02.jpg" decoding="async" width="804" height="582" class="mw-file-element" data-file-width="804" data-file-height="582"></a></span>
</p><p>Do FreeCAD dodano nowe <a href="../Path_Workbench.html" class="mw-redirect" title="Path Workbench">&#347;rodowisko pracy &#346;cie&#380;ka</a>. To &#347;rodowisko, cho&#263; wci&#261;&#380; w fazie rozwoju, ju&#380; implementuje niekt&oacute;re operacje CAM i pozwala na eksport pe&#322;nych program&oacute;w <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/G-code">kodu G</a> dla r&oacute;&#380;nych maszyn CNC. 
</p><p>W obecnym stanie &#347;rodowisko pracy pozwala na tworzenie profili i kieszeni wok&oacute;&#322; obiekt&oacute;w opartych na  <a href="../pl/Part_Workbench.html" title="Part Workbench/pl">&#347;rodowisku pracy Cz&#281;&#347;&#263;</a>, tworzenie z&#322;o&#380;onych &#347;cie&#380;ek przez &#322;&#261;czenie kilku &#347;cie&#380;ek cz&#261;stkowych, inspekcj&#281; i edycj&#281; zawarto&#347;ci kodu G, zarz&#261;dzanie tabel&#261; narz&#281;dzi oraz wyb&oacute;r r&oacute;&#380;nych skrypt&oacute;w wst&#281;pnego i ko&#324;cowego przetwarzania przy imporcie i eksporcie G-kodu. Dost&#281;pne jest tak&#380;e kompletne <a href="../pl/Path_scripting.html" class="mw-redirect" title="Path scripting/pl">API Pythona</a> do automatyzacji.
</p><p><span id="Additional_Modules"></span>
</p>
<h2><span id="Modu.C5.82y_dodatkowe"></span><span class="mw-headline" id="Modu&#322;y_dodatkowe">Modu&#322;y dodatkowe</span></h2>
<p>Kilka nowych <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD-addons">zewn&#281;trznych &#347;rodowisk pracy</a> zosta&#322;o stworzonych przez cz&#322;onk&oacute;w spo&#322;eczno&#347;ci. &#346;rodowiska te mo&#380;na &#322;atwo do&#322;&#261;czy&#263; do istniej&#261;cej instalacji FreeCAD. W&#347;r&oacute;d nich znajduj&#261; si&#281;:
</p>
<ul><li><a rel="nofollow" class="external text" href="https://github.com/microelly2/Animation">&#346;rodowisko pracy Animacja</a> pozwala tworzy&#263; animacje na podstawie modeli FreeCAD, definiuj&#261;c ruch kamery i eksportuj&#261;c sekwencj&#281; obraz&oacute;w.</li>
<li><a rel="nofollow" class="external text" href="https://github.com/marmni/FreeCAD-Kerkythea">Makro eksporter do Kerkythea</a> umo&#380;liwia eksport dokument&oacute;w FreeCAD do darmowego <a rel="nofollow" class="external text" href="http://www.kerkythea.net/cms/">renderera Kerkythea</a>.</li>
<li>Opracowywane nadal <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?f=22&amp;t=10892%7CPie">Menu</a> jest ju&#380; dost&#281;pne.</li>
<li>Wreszcie, stworzono <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD-addons">repozytorium dodatk&oacute;w</a>, kt&oacute;re gromadzi ciekawe &#347;rodowiska pracy, modu&#322;y i makra rozwijane wok&oacute;&#322; FreeCAD. Repozytorium zawiera instalator, kt&oacute;ry automatycznie instaluje i aktualizuje te dodatki.</li></ul>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_installer_02.jpg&amp;filetimestamp=20151225190104&amp;.html" class="mw-file-description"><img src="../File/Macro_installer_02.jpg" decoding="async" width="404" height="377" class="mw-file-element" data-file-width="404" data-file-height="377"></a></span>
</p>
<!-- 
NewPP limit report
Cached time: 20250729120140
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.060 seconds
Real time usage: 0.087 seconds
Preprocessor visited node count: 76/1000000
Post&#8208;expand include size: 9/2097152 bytes
Template argument size: 0/2097152 bytes
Highest expansion depth: 2/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1754/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    0.000      1 -total
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:258737-0!canonical and timestamp 20250729120140 and revision id 1621662. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>