<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">The FreeCAD source code/pl</span></h1><?xml encoding="UTF-8"><div class="mw-parser-output"><div class="mw-pt-languages noprint" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../de/The_FreeCAD_source_code.html" class="mw-pt-progress mw-pt-progress--complete" title="Der FreeCAD Quellcode (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../The_FreeCAD_source_code.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="The FreeCAD source code (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/The_FreeCAD_source_code.html" class="mw-pt-progress mw-pt-progress--low" title="El c&oacute;digo fuente de FreeCAD (38% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/The_FreeCAD_source_code.html" class="mw-pt-progress mw-pt-progress--complete" title="Code source de FreeCAD (92% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/The_FreeCAD_source_code.html" class="mw-pt-progress mw-pt-progress--complete" title="Il codice sorgente di FreeCAD (92% translated)" lang="it" dir="ltr">italiano</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="pl" dir="ltr">polski</span></li>
<li><a href="../pt-br/The_FreeCAD_source_code.html" class="mw-pt-progress mw-pt-progress--complete" title="O c&oacute;digo-fonte do FreeCAD (92% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../ru/The_FreeCAD_source_code.html" class="mw-pt-progress mw-pt-progress--stub" title="&#1048;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076; FreeCAD (8% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li>
<li><a href="../zh-cn/The_FreeCAD_source_code.html" class="mw-pt-progress mw-pt-progress--med" title="FreeCAD&#30340;&#28304;&#20195;&#30721; (46% translated)" lang="zh-Hans-CN" dir="ltr">&#20013;&#25991;&#65288;&#20013;&#22269;&#22823;&#38470;&#65289;</a></li></ul></div>
<p>Kod &#378;r&oacute;d&#322;owy <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD">FreeCAD</a> jest zarz&#261;dzany za pomoc&#261; git i jest publiczny, otwarty i dost&#281;pny na licencji <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/GNU_Lesser_General_Public_License">LGPL</a>. Mo&#380;e by&#263; kopiowany, pobierany, czytany, analizowany, redystrybuowany i modyfikowany przez ka&#380;dego. Je&#347;li planujesz wprowadzi&#263; modyfikacje, kt&oacute;re chcesz zobaczy&#263; w oficjalnym kodzie, pami&#281;taj, &#380;e Twoje zmiany b&#281;d&#261; musia&#322;y zosta&#263; zatwierdzone przez programist&oacute;w FreeCAD, wi&#281;c dobrze jest najpierw om&oacute;wi&#263; swoje zamiary i pomys&#322;y na <a rel="nofollow" class="external text" href="https://forum.freecad.org">forum</a>, aby unikn&#261;&#263; ryzyka odrzucenia zmian z jakiego&#347; powodu, kt&oacute;rego nie przewidzia&#322;e&#347;.
</p><p>Poni&#380;ej znajduje si&#281; kilka wskaz&oacute;wek i przydatnych informacji, kt&oacute;re naprowadz&#261; Ci&#281; na w&#322;a&#347;ciwe tory, je&#347;li jeste&#347; zainteresowany eksploracj&#261; kodu FreeCAD.
</p>
<ul><li>Kod FreeCAD jest zaprogramowany g&#322;&oacute;wnie w <b>C++</b>, ale w du&#380;ej mierze opiera si&#281; na <b>Pythonie</b>. Bardzo du&#380;a cz&#281;&#347;&#263; jego funkcjonalno&#347;ci zapewnia powi&#261;zane wi&#261;zania Pythona, a cz&#281;&#347;ci&#261; podstawowej filozofii rozwoju FreeCAD jest zawsze oferowanie dost&#281;pu Pythona do ka&#380;dej nowej funkcji zaimplementowanej w C++. Aby to osi&#261;gn&#261;&#263;, CPython (narz&#281;dzia interfejsu C dostarczane przez samego Pythona) i specjalnie <a rel="nofollow" class="external text" href="http://cxx.sourceforge.net/">PyCXX</a> s&#261; intensywnie wykorzystywane w ca&#322;ym FreeCAD. Wiele szablon&oacute;w i niestandardowych narz&#281;dzi jest r&oacute;wnie&#380; dostarczanych w samym kodzie FreeCAD, aby bardzo u&#322;atwi&#263; tworzenie powi&#261;zanych wi&#261;za&#324; Pythona. Niekt&oacute;re bardziej wysokopoziomowe cz&#281;&#347;ci kodu FreeCAD s&#261; w pe&#322;ni zakodowane w Pythonie.</li></ul>
<ul><li>Kod &#378;r&oacute;d&#322;owy FreeCAD jest w pe&#322;ni <i>wieloplatformowy</i> i do&#322;o&#380;ono wszelkich stara&#324;, aby umo&#380;liwi&#263; korzystanie z aplikacji na jak najwi&#281;kszej liczbie platform i konfiguracji oraz nie stawia&#263; obecnych u&#380;ytkownik&oacute;w w trudnych sytuacjach. Dlatego, o ile to mo&#380;liwe, unika si&#281; nowych wersji potrzebnych komponent&oacute;w, kt&oacute;re nie s&#261; powszechnie i &#322;atwo dost&#281;pne na wszystkich platformach, a kompatybilno&#347;&#263; wsteczna <i>(mo&#380;liwo&#347;&#263; otwarcia pliku wyprodukowanego w starej wersji FreeCAD na nowszej wersji)</i> jest wa&#380;nym priorytetem.</li></ul>
<ul><li>Prawie ca&#322;a funkcjonalno&#347;&#263; FreeCAD jest podzielona na dwie r&oacute;&#380;ne cz&#281;&#347;ci, nazwane <b>APP</b> i <b>GUI</b>. Ta separacja jest odzwierciedlona wsz&#281;dzie w strukturze plik&oacute;w kodu &#378;r&oacute;d&#322;owego. Aplikacja zawiera wszystkie funkcje, kt&oacute;re musz&#261; dzia&#322;a&#263; w trybie czysto konsolowym (bez GUI). Poniewa&#380; FreeCAD mo&#380;e by&#263; kompilowany i uruchamiany bez graficznego interfejsu u&#380;ytkownika, kod w aplikacji jest niezale&#380;ny od jakiejkolwiek biblioteki zwi&#261;zanej z GUI. GUI zawiera ca&#322;y kod potrzebny do dzia&#322;ania w trybie GUI i jest zbudowany wok&oacute;&#322; funkcjonalno&#347;ci aplikacji.</li></ul>
<ul><li>Wi&#281;kszo&#347;&#263; funkcjonalno&#347;ci FreeCAD jest zaimplementowana w <i>modu&#322;ach</i>. FreeCAD bez modu&#322;u jest prostym oknem kontenera, kt&oacute;re mo&#380;e po prostu otworzy&#263; i zapisa&#263; plik. Wszystkie narz&#281;dzia geometrii i &#347;rodowiska pracy s&#261; zaimplementowane w modu&#322;ach. Modu&#322;y mog&#261; by&#263; napisane w C++, Pythonie lub &#322;&#261;cz&#261;c to, co najlepsze z tych dw&oacute;ch &#347;wiat&oacute;w. Mog&#261; to by&#263; modu&#322;y hybrydowe C++/Python, w kt&oacute;rych solidna podstawowa funkcjonalno&#347;&#263; jest zaprogramowana w C++, a narz&#281;dzia u&#380;ytkownika ko&#324;cowego s&#261; napisane w Pythonie, co u&#322;atwia ich rozszerzanie i dostosowywanie przez u&#380;ytkownik&oacute;w FreeCAD. Ka&#380;dy modu&#322; zazwyczaj definiuje i tworzy <b>&#347;rodowisko pracy</b> w interfejsie FreeCAD, gdy jest u&#380;ywany w trybie GUI, zwykle o tej samej nazwie, ale nie jest obowi&#261;zkowe, aby modu&#322;y zawiera&#322;y &#347;rodowisko pracy.</li></ul>
<ul><li>Modu&#322;y FreeCAD cz&#281;sto <b>zale&#380;&#261; od innych modu&#322;&oacute;w</b>. Wi&#281;kszo&#347;&#263; modu&#322;&oacute;w wykorzystuj&#261;cych geometri&#281; bry&#322;ow&#261; zale&#380;y od modu&#322;u <b>Cz&#281;&#347;&#263;</b>, kt&oacute;ry jest najbardziej podstawowym modu&#322;em FreeCAD i implementuje wi&#281;kszo&#347;&#263; interfejs&oacute;w z OpenCascade. Chocia&#380; inne modu&#322;y mog&#261; bezpo&#347;rednio korzysta&#263; z funkcjonalno&#347;ci OpenCascade, cz&#281;sto polegaj&#261; na funkcjach wy&#380;szego poziomu dostarczanych przez Cz&#281;&#347;&#263;.</li></ul>
<ul><li>Modu&#322;y s&#261; zawsze <b>inicjowane</b> z Pythona. Nawet je&#347;li s&#261; napisane w ca&#322;o&#347;ci w C++, zawsze zawieraj&#261; minimaln&#261; struktur&#281; Pythona/CPythona.</li></ul>
<ul><li>FreeCAD jest gorliwym zwolennikiem <b>innych bibliotek open-source</b>. Opr&oacute;cz Pythona i Qt, u&#380;ywanych przez rdze&#324; i prawie wszystkie modu&#322;y, dwie ci&#281;&#380;kie biblioteki u&#380;ywane w wi&#281;kszo&#347;ci modu&#322;&oacute;w to <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Open_Cascade_Technology">OpenCascade Technology</a> <i>(OCCT)</i> i <a rel="nofollow" class="external text" href="http://www.coin3d.org/">Coin3D</a>. OpenCascade s&#322;u&#380;y do tworzenia i zarz&#261;dzania ca&#322;&#261; geometri&#261; bry&#322;ow&#261; FreeCAD, podczas gdy coin3D s&#322;u&#380;y do zarz&#261;dzania widokiem 3D. OpenCascade jest u&#380;ywany g&#322;&oacute;wnie w &#347;wiecie aplikacji, a coin3D wy&#322;&#261;cznie w &#347;wiecie GUI. Podstawowe zrozumienie OpenCascade jest niezb&#281;dne do wykonywania wszelkich prac zwi&#261;zanych z geometri&#261; za pomoc&#261; FreeCAD. Bardziej specyficzne modu&#322;y wykorzystuj&#261; bardziej specyficzne biblioteki, a poniewa&#380; zwykle nie ma &#380;adnych ogranicze&#324; w tym zakresie, poza tym, &#380;e biblioteki te musz&#261; by&#263; &#322;atwo dost&#281;pne na wszystkich platformach, lista zale&#380;no&#347;ci pe&#322;nej instalacji FreeCAD ze wszystkimi jego modu&#322;ami mo&#380;e by&#263; do&#347;&#263; du&#380;a.</li></ul>
<ul><li>Obiekty dokumentu FreeCAD, kt&oacute;re s&#261; wszystkimi obiektami zawartymi w dokumencie FreeCAD, s&#261; tym, co pojawia si&#281; w widoku drzewa w GUI i w FreeCAD.ActiveDocument.Objects() w Pythonie. Mog&#261; one mie&#263; lub nie mie&#263; &#380;adnych danych geometrycznych i mog&#261; lub nie mog&#261; pokazywa&#263; niczego w widoku 3D. S&#261; one zawsze podzielone na cz&#281;&#347;ci APP i GUI. Cz&#281;&#347;&#263; Gui nie jest &#322;adowana podczas dzia&#322;ania w trybie konsoli. Standardowe obiekty geometryczne, takie jak te znajduj&#261;ce si&#281; w Part lub PartDesign, maj&#261; swoj&#261; geometri&#281; opart&#261; na OpenCascade zdefiniowan&#261; w ich odpowiedniku App, podczas gdy odpowiednik GUI <i>(zwykle nazywany r&oacute;wnie&#380; "Dostawc&#261; widoku")</i> jest odpowiedzialny za tworzenie reprezentacji coin3D tej geometrii, kt&oacute;ra zostanie wstawiona do g&#322;&oacute;wnego wykresu sceny coin3D widoku 3D.</li></ul>
<ul><li>Podstawowa struktura katalog&oacute;w kodu &#378;r&oacute;d&#322;owego jest zorganizowana w nast&#281;puj&#261;cy spos&oacute;b:
<ul><li><b>App</b>: zawiera aplikacj&#281; trybu konsoli FreeCAD, definiuje podstawowe struktury i klasy bazowe dla obiekt&oacute;w dokument&oacute;w, kt&oacute;re s&#261; u&#380;ywane przez modu&#322;y do budowania w&#322;asnych.</li>
<li><b>Base</b>: zawiera podstawow&#261; funkcjonalno&#347;&#263; powszechnie u&#380;ywan&#261; w FreeCAD: wektory 3D, jednostki, macierze, rozmieszczenia itp.</li>
<li><b>Gui</b>: zawiera aplikacj&#281; FreeCAD w trybie GUI, definiuje widok 3D, zawiera wiele narz&#281;dzi i funkcji do wykorzystania przez &#347;rodowiska robocze do interakcji z interfejsem i widokiem 3D, definiuje klasy bazowe dla dostawc&oacute;w widok&oacute;w.</li>
<li><b>Doc</b>: zawiera g&#322;&oacute;wnie uniwersalny plik pomocy Qt wygenerowany z tej wiki.</li>
<li><b>Mod</b>: zawiera wszystkie modu&#322;y, podzielone na App i Gui <i>(z wyj&#261;tkiem modu&#322;&oacute;w Pythona, kt&oacute;re nie zawsze przestrzegaj&#261; tej zasady)</i>.</li></ul></li></ul>
<h2><span id="Powi.C4.85zane"></span><span class="mw-headline" id="Powi&#261;zane">Powi&#261;zane</span></h2>
<ul><li><a href="../pl/Source_code_management.html" title="Source code management/pl">Zarz&#261;dzanie kodem &#378;r&oacute;d&#322;owym</a></li>
<li><a href="../pl/Power_users_hub.html" title="Power users hub/pl">Centrum Power u&#380;ytkownik&oacute;w</a> zawiera wiele dokumentacji na temat modu&#322;&oacute;w, OpenCascade i Coin3D, g&#322;&oacute;wnie dla programist&oacute;w Pythona. Jednak&#380;e, poniewa&#380; funkcjonalno&#347;&#263; jest podobna, strony te b&#281;d&#261; r&oacute;wnie&#380; interesuj&#261;ce dla programist&oacute;w C++.</li>
<li><a href="../pl/File_Format_FCStd.html" title="File Format FCStd/pl">FCStd</a> - format pliku FreeCAD.</li></ul>
<!-- 
NewPP limit report
Cached time: 20250705154947
Cache expiry: 86400
Reduced expiry: false
Complications: [no&#8208;toc&#8208;conversion]
CPU time usage: 0.042 seconds
Real time usage: 0.095 seconds
Preprocessor visited node count: 8/1000000
Post&#8208;expand include size: 3/2097152 bytes
Template argument size: 0/2097152 bytes
Highest expansion depth: 2/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1763/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    0.000      1 -total
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:275910-0!canonical and timestamp 20250705154947 and revision id 1603772. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>