<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Frequently asked questions/pt-br</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="pt-BR" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Frequently+asked+questions&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/Frequently_asked_questions.html" class="mw-pt-progress mw-pt-progress--high" title="H&auml;ufig gestellte Fragen (92% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Frequently_asked_questions.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Frequently asked questions (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/Frequently_asked_questions.html" class="mw-pt-progress mw-pt-progress--med" title="PREGUNTAS FRECUENTES (57% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/Frequently_asked_questions.html" class="mw-pt-progress mw-pt-progress--complete" title="Foire aux questions (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../hr/Frequently_asked_questions.html" class="mw-pt-progress mw-pt-progress--low" title="Frequently asked questions/hr (1% translated)" lang="hr" dir="ltr">hrvatski</a></li>
<li><a href="../it/Frequently_asked_questions.html" class="mw-pt-progress mw-pt-progress--high" title="Domande frequenti (94% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Frequently_asked_questions.html" class="mw-pt-progress mw-pt-progress--complete" title="Najcz&#281;&#347;ciej zadawane pytania (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--high" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</span></li>
<li><a href="../ru/Frequently_asked_questions.html" class="mw-pt-progress mw-pt-progress--med" title="&#1063;&#1072;&#1089;&#1090;&#1086; &#1079;&#1072;&#1076;&#1072;&#1074;&#1072;&#1077;&#1084;&#1099;&#1077; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099; (45% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li>
<li><a href="../ja/Frequently_asked_questions.html" class="mw-pt-progress mw-pt-progress--low" title="FAQ (1% translated)" lang="ja" dir="ltr">&#26085;&#26412;&#35486;</a></li>
<li><a href="../ko/Frequently_asked_questions.html" class="mw-pt-progress mw-pt-progress--med" title="&#51088;&#51452;&#54616;&#45716; &#51656;&#47928; (42% translated)" lang="ko" dir="ltr">&#54620;&#44397;&#50612;</a></li></ul></div>
<div class="docnav">
    <div><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-left.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span> <a href="../pt-br/Import_Export.html" title="Import Export/pt-br">Importar Exportar</a></div>
    <div><a href="../pt-br/Tutorials.html" title="Tutorials/pt-br">Tutoriais</a>
 <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-right.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span></div>
    <div><a href="../pt-br/Online_Help_Toc.html" title="Online Help Toc/pt-br">Index</a> <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Online_Help_Toc.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span></div>
</div>
<p>Esta p&aacute;gina apresenta respostas para algumas das perguntas mais comuns e que s&atilde;o feitas nos f&oacute;runs do FreeCAD. Se voc&ecirc; tiver algum problema ou alguma d&uacute;vida sobre o FreeCAD, aqui &eacute; o primeiro lugar onde deve procurar por respostas. Se voc&ecirc; n&atilde;o encontrar a resposta aqui, procure tirar sua d&uacute;vida no <a rel="nofollow" class="external text" href="http://forum.freecad.org/viewforum.php?f=3">f&oacute;rum do FreeCAD</a>!
</p><p><span id="Installation"></span>
</p>
<meta property="mw:PageProp/toc">
<h2><span id="Instala.C3.A7.C3.A3o"></span><span class="mw-headline" id="Instala&ccedil;&atilde;o">Instala&ccedil;&atilde;o</span></h2>
<p><span id="What_is_the_easiest_way_to_install_FreeCAD_on_my_system?"></span>
</p>
<h3><span id="Qual_.C3.A9_a_maneira_mais_f.C3.A1cil_de_instalar_o_FreeCAD_no_meu_sistema.3F"></span><span class="mw-headline" id="Qual_&eacute;_a_maneira_mais_f&aacute;cil_de_instalar_o_FreeCAD_no_meu_sistema?">Qual &eacute; a maneira mais f&aacute;cil de instalar o FreeCAD no meu sistema?</span></h3>
<div class="mw-translate-fuzzy">
<p>Se voc&ecirc; estiver no Windows ou Mac OS, a maneira mais simples &eacute; ir &agrave; p&aacute;gina <a href="../Download.html" title="Download">Download</a>, que re&uacute;ne os instaladores prontos para voc&ecirc; baixar. Se voc&ecirc; estiver usando Debian, Fedora ou Ubuntu, entre outras distribui&ccedil;&otilde;es Linux, o FreeCAD est&aacute; inclu&iacute;do nos reposit&oacute;rios de software padr&atilde;o e voc&ecirc; pode simplesmente instal&aacute;-lo com o gerenciador de software. No Ubuntu, a equipe do FreeCAD tamb&eacute;m mant&eacute;m seus pr&oacute;prios <a href="../pt-br/Installing_on_Linux.html#Desenvolvimento_PPA" title="Installing on Linux/pt-br">Reposit&oacute;rios PPA</a>.
Para mais detalhes sobre como instalar o FreeCAD, consulte a p&aacute;gina de instala&ccedil;&atilde;o relacionado ao seu sistema operacional: (<a href="../pt-br/Installing_on_Windows.html" title="Installing on Windows/pt-br">Windows</a>, <a href="../pt-br/Installing_on_Linux.html" title="Installing on Linux/pt-br">Linux</a> ou <a href="../pt-br/Installing_on_Mac.html" title="Installing on Mac/pt-br">Mac</a>).
</p>
</div>
<p><span id="What_are_the_prerequisites_for_running_FreeCAD?"></span>
</p>
<h3><span id="Quais_os_pr.C3.A9-requisitos_para_executar_o_FreeCAD.3F"></span><span class="mw-headline" id="Quais_os_pr&eacute;-requisitos_para_executar_o_FreeCAD?">Quais os pr&eacute;-requisitos para executar o FreeCAD?</span></h3>
<p>Em contraste com a maioria dos softwares CAD 3D, o FreeCAD pode funcionar sem problemas em computadores mais modestos - &eacute; conhecido por funcionar em CPUs Pentium IV e Intel Core2 Solo. Se o seu computador estiver rodando um sistema operacional atual, &eacute; prov&aacute;vel que o FreeCAD seja executado. O &uacute;nico pr&eacute;-requisito &eacute; que sua placa gr&aacute;fica ou chipset deve suportar a tecnologia <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/OpenGL">OpenGL</a>, de prefer&ecirc;ncia da vers&atilde;o 2.0 em dinte. Em caso de problemas, consulte a se&ccedil;&atilde;o <a class="mw-selflink-fragment" href="#Solu%C3%A7%C3%A3o_de_problemas">Solu&ccedil;&atilde;o de problemas</a> desta FAQ.
</p><p><span id="Multithreading"></span>
</p>
<h4><span class="mw-headline" id="Multitarefa">Multitarefa</span></h4>
<div class="mw-translate-fuzzy">
<p>Neste momento, o n&uacute;cleo de modelagem geom&eacute;trica subjacente do FreeCAD (composto pela biblioteca <a rel="nofollow" class="external text" href="http://en.wikipedia.org/wiki/Open_Cascade_Technology">OpenCASCADE Technology</a>) tem suporte parcial para multitarefa. Veja a p&aacute;gina <a href="../pt-br/Multithreading.html" title="Multithreading/pt-br">multithreading</a> para mais detalhes.
</p>
</div>
<p><span id="What_if_I_want_to_compile_FreeCAD_myself?"></span>
</p>
<h3><span id="E_se_eu_quiser_compilar_o_FreeCAD_sozinho.3F"></span><span class="mw-headline" id="E_se_eu_quiser_compilar_o_FreeCAD_sozinho?">E se eu quiser compilar o FreeCAD sozinho?</span></h3>
<p>O c&oacute;digo fonte do FreeCAD est&aacute; sempre dispon&iacute;vel no reposit&oacute;rio de c&oacute;digo-fonte do projeto. Voc&ecirc; pode compilar o FreeCAD por conta pr&oacute;pria, caso queira utilizar os recursos mais recentes em desenvolvimento. Para saber compilar, &eacute; preciso ter um pouco de conhecimento de inform&aacute;tica. Acreditamos, por&eacute;m, que o procedimento simples de realizar. Na p&aacute;gina <a href="../pt-br/Compile_on_Linux.html#obtendo_a_fonte" title="Compile on Linux/pt-br">aqui</a> explicamos como ter acesso ao c&oacute;digo-fonte, e existem instru&ccedil;&otilde;es detalhadas para compilar o c&oacute;digo nas p&aacute;ginas <a href="../pt-br/Compile_on_Windows.html" title="Compile on Windows/pt-br">Compilar para Windows</a>, <a href="../pt-br/Compile_on_Linux.html" title="Compile on Linux/pt-br">Compilar para Linux</a> e <a href="../pt-br/Compile_on_MacOS.html" title="Compile on MacOS/pt-br">Compilar para MacOS</a>.
</p><p><span id="FreeCAD_tells_me_some_module_or_application_is_missing"></span>
</p>
<h3><span id="O_FreeCAD_me_diz_que_algum_m.C3.B3dulo_ou_aplicativo_est.C3.A1_faltando"></span><span class="mw-headline" id="O_FreeCAD_me_diz_que_algum_m&oacute;dulo_ou_aplicativo_est&aacute;_faltando">O FreeCAD me diz que algum m&oacute;dulo ou aplicativo est&aacute; faltando</span></h3>
<p>O FreeCAD depende de v&aacute;rias pe&ccedil;as para oferecer todas as suas funcionalidades. Todos os principais componentes s&atilde;o agrupados dentro das instala&ccedil;&otilde;es do FreeCAD (para Windows ou Mac) ou fornecidos pelo seu gerenciador de pacotes, no caso de distribui&ccedil;&otilde;es Linux. Normalmente, portanto, voc&ecirc; n&atilde;o tem com o que se preocupar.
Se voc&ecirc; instalou o FreeCAD a partir de fontes n&atilde;o-oficiais, ou se voc&ecirc; mesmo compilou o FreeCAD, alguma pe&ccedil;a pode estar faltando. A falta de um componente n&atilde;o compromete o funcionamento do FreeCAD, mas pode causar a indisponibilidade de alguma ferramenta.
</p><p>Alguns componentes utilizados para a importa&ccedil;&atilde;o e exporta&ccedil;&atilde;o de alguns tipos de formatos de arquivo, como Collada ou DWG, n&atilde;o podem fazer parte dos pacotes de instala&ccedil;&atilde;o do FreeCAD. Nestes casos, voc&ecirc; mesmo deve realizar a instala&ccedil;&atilde;o dos componentes. 
</p><p>Todos esses componentes e a maneira apropriada de instal&aacute;-los est&atilde;o listados na p&aacute;gina <a href="../pt-br/Extra_python_modules.html" title="Extra python modules/pt-br">M&oacute;dulos python extras</a>
</p><p><span id="Troubleshooting"></span>
</p>
<h2><span id="Solu.C3.A7.C3.A3o_de_problemas"></span><span class="mw-headline" id="Solu&ccedil;&atilde;o_de_problemas">Solu&ccedil;&atilde;o de problemas</span></h2>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span class="mw-headline" id="Known_OS-specific_issues">Known OS-specific issues</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Find known OS-specific issues in this <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=30573">forum thread</a>
</p>
</div>
<p><span id="FreeCAD_doesn't_start_at_all"></span>
</p>
<h3><span id="O_FreeCAD_n.C3.A3o_inicia_de_forma_alguma"></span><span class="mw-headline" id="O_FreeCAD_n&atilde;o_inicia_de_forma_alguma">O FreeCAD n&atilde;o inicia de forma alguma</span></h3>
<p>Pode haver muitas raz&otilde;es para isso. A mais prov&aacute;vel &eacute; que falte alguma biblioteca. Tente iniciar o FreeCAD a partir de um terminal (digite <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">freecad</span> em um prompt de comando, <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">FreeCAD</span> em alguns sistemas) para ver se alguma mensagem de erro aparece. Leia tamb&eacute;m o restante deste FAQ, pois aqui podem ter mais pistas para detectar a causa do problema. Se nada der certo, procure por aux&iacute;lio no <a rel="nofollow" class="external text" href="http://forum.freecad.org/">forum</a>, certamente haver&aacute; algu&eacute;m que poder&aacute; ajudar.
</p><p>Em alguns Windows mais antigos, como o XP, voc&ecirc; pode receber esta mensagem de erro: <i>A aplica&ccedil;&atilde;o n&atilde;o pode iniciar, porque a configura&ccedil;&atilde;o lado a lado est&aacute; errada. A reinstala&ccedil;&atilde;o do aplicativo pode resolver o problema.</i>
</p><p>Este problema pode ocorrer devido &agrave; falta de bibliotecas de tempo de execu&ccedil;&atilde;o CRT, ou a vers&atilde;o instalada destas bibliotecas &eacute; mais antiga que a vers&atilde;o vinculada &agrave; vers&atilde;o do FreeCAD que voc&ecirc; est&aacute; tentando instalar. Neste caso, ser&aacute; preciso instalar o <i>Microsoft Visual C++ Redistributable Package</i> que voc&ecirc; encontrar&aacute; no site da Microsoft. Veja tamb&eacute;m a <a rel="nofollow" class="external text" href="http://forum.freecad.org/viewtopic.php?f=3&amp;t=1298&amp;p=9961">mensagem no f&oacute;rum</a> que trata do assunto.
</p><p><span id="FreeCAD_starts_normally,_but_not_all_icons_are_displayed,_some_of_them_are_replaced_by_a_black_'X'"></span>
</p>
<h3><span id="FreeCAD_inicia_normalmente.2C_mas_nem_todos_os_.C3.ADcones_s.C3.A3o_exibidos.3B_alguns_s.C3.A3o_substitu.C3.ADdos_por_um_.27X.27_preto"></span><span class="mw-headline" id="FreeCAD_inicia_normalmente,_mas_nem_todos_os_&iacute;cones_s&atilde;o_exibidos;_alguns_s&atilde;o_substitu&iacute;dos_por_um_'X'_preto">FreeCAD inicia normalmente, mas nem todos os &iacute;cones s&atilde;o exibidos; alguns s&atilde;o substitu&iacute;dos por um 'X' preto</span></h3>
<p>Algumas partes do FreeCAD dependem de um m&oacute;dulo Python externo chamado Pivy. Na instala&ccedil;&atilde;o do FreeCAD para Windows, o Pivy est&aacute; inclu&iacute;do. Em sistemas Debian/Ubuntu, o pacote python-pivy &eacute; dispon&iacute;vel, por padr&atilde;o, nos respectivos reposit&oacute;rios. Em outros sistemas, no momento, voc&ecirc; mesmo pode ter que compilar o Pivy. Note que, embora algumas ferramentas n&atilde;o estejam dispon&iacute;veis sem o Pivy instalado, o resto do FreeCAD funciona normalmente.
</p><p><span id="I_have_display_problems,_the_3D_view_doesn't_behave_correctly,_there_is_garbage_when_I_move/rotate_the_view,_etc."></span>
</p>
<h3><span id="Tenho_problemas_de_visualiza.C3.A7.C3.A3o.2C_a_vista_3D_n.C3.A3o_se_comporta_corretamente.2C_h.C3.A1_lixo_quando_movo_ou_rotaciono_a_vista.2C_etc."></span><span class="mw-headline" id="Tenho_problemas_de_visualiza&ccedil;&atilde;o,_a_vista_3D_n&atilde;o_se_comporta_corretamente,_h&aacute;_lixo_quando_movo_ou_rotaciono_a_vista,_etc.">Tenho problemas de visualiza&ccedil;&atilde;o, a vista 3D n&atilde;o se comporta corretamente, h&aacute; lixo quando movo ou rotaciono a vista, etc.</span></h3>
<p>O FreeCAD depende do OpenGL para exibir conte&uacute;dos 3D, e portanto requer que o ambiente OpenGL esteja funcionando corretamente.
Em alguns sistemas, o OpenGL n&atilde;o &eacute; ativado por padr&atilde;o, e voc&ecirc; precisar&aacute; ativ&aacute;-lo no software da sua placa gr&aacute;fica. Se isto n&atilde;o funcionar, talvez seja preciso, instalar ou atualizar os drivers da sua placa de v&iacute;deo.
Este problema acontece com mais frequ&ecirc;ncia em sistemas Linux ou em sistemas virtuais. Se voc&ecirc; estiver em um sistema baseado em Linux, tente os seguintes passos:
</p>
<ul><li>verifique se seu computador possui uma placa gr&aacute;fica com capacidade 3D</li>
<li>digite <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">glxinfo</span> em um terminal e verifique se sa&iacute;da de v&iacute;deo tem a configura&ccedil;&atilde;o Renderiza&ccedil;&atilde;o Direta definida como "sim", e que o fornecedor/renderizador/vers&atilde;o OpenGL corresponde &agrave; vers&atilde;o da sua placa gr&aacute;fica.</li>
<li>instale outro software baseado em OpenGL (<a rel="nofollow" class="external text" href="http://www.blender.org">Blender</a>, por exemplo) e verifique se ele roda e exibe corretamente.</li></ul>
<p><span id="FreeCAD_crashes_on_startup"></span>
</p>
<h3><span id="O_FreeCAD_falha_na_inicializa.C3.A7.C3.A3o"></span><span class="mw-headline" id="O_FreeCAD_falha_na_inicializa&ccedil;&atilde;o">O FreeCAD falha na inicializa&ccedil;&atilde;o</span></h3>
<p>Um crash pode ser um sintoma de um bug mais s&eacute;rio, ou algum problema em sua configura&ccedil;&atilde;o. A maior parte das falhas na inicializa&ccedil;&atilde;o ocorre devido a uma das raz&otilde;es a seguir:
</p><p><span id="OpenGL_drivers_are_not_installed,_or_not_working_properly"></span>
</p>
<h4><span id="Os_drivers_OpenGL_n.C3.A3o_est.C3.A3o_instalados_ou_n.C3.A3o_est.C3.A3o_funcionando_corretamente"></span><span class="mw-headline" id="Os_drivers_OpenGL_n&atilde;o_est&atilde;o_instalados_ou_n&atilde;o_est&atilde;o_funcionando_corretamente">Os drivers OpenGL n&atilde;o est&atilde;o instalados ou n&atilde;o est&atilde;o funcionando corretamente</span></h4>
<p>Esta &eacute; uma causa muito comum. Neste caso, o FreeCAD simplesmente trava na inicializa&ccedil;&atilde;o ou sempre que voc&ecirc; abre uma visualiza&ccedil;&atilde;o 3D (por exemplo, criando um novo documento).
</p><p>Tente descobrir qual &eacute; seu chip gr&aacute;fico ou placa de v&iacute;deo e depois verifique se ele suporta <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/OpenGL">OpenGL</a>. A seguir, verifique se o driver correto est&aacute; instalado, Se n&atilde;o estiver, encontre o driver correto e instale-o. Uma boa maneira de verificar se OpenGL est&aacute; dispon&iacute;vel &eacute; tentar executar outro aplicativo que faz uso de OpenGL, como o <a rel="nofollow" class="external text" href="http://www.blender.org">blender</a>.
</p>
<div class="mw-translate-fuzzy">
<p>Para obter mais informa&ccedil;&otilde;es sobre travamentos do seu FreeCAD, inicie-o utilizando o par&acirc;metro <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">--write-log</span>}. Isto criar&aacute; o arquivo FreeCAD.log, localizado em $HOME/.FreeCAD no Linux e Mac OS X, ou na pasta {<span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">%APPDATA%/FreeCAD</span> em sistemas Windows.
</p>
</div>
<p>Em alguns casos raros, voc&ecirc; pode ter um driver de v&iacute;deo instalado que n&atilde;o &eacute; compat&iacute;vel com sua placa gr&aacute;fica. Tivemos um caso em que o laptop do usu&aacute;rio tinha um chipset Intel on-board, mas alguns drivers ATI estavam instalados. <a rel="nofollow" class="external autonumber" href="http://forum.freecad.org/viewtopic.php?f=13&amp;t=5160&amp;start=10#p41042">[1]</a>
Depois de remover os arquivos da ATI e reinstalar o driver correto, o FreeCAD come&ccedil;ou a funcionar.
</p><p><span id="Some_library,_needed_by_FreeCAD,_is_not_present_on_your_system,_or_wasn't_found_by_FreeCAD"></span>
</p>
<h4><span id="Alguma_biblioteca.2C_necess.C3.A1ria_para_o_FreeCAD.2C_n.C3.A3o_est.C3.A1_presente_em_seu_sistema.2C_ou_n.C3.A3o_foi_encontrada_pelo_FreeCAD"></span><span class="mw-headline" id="Alguma_biblioteca,_necess&aacute;ria_para_o_FreeCAD,_n&atilde;o_est&aacute;_presente_em_seu_sistema,_ou_n&atilde;o_foi_encontrada_pelo_FreeCAD">Alguma biblioteca, necess&aacute;ria para o FreeCAD, n&atilde;o est&aacute; presente em seu sistema, ou n&atilde;o foi encontrada pelo FreeCAD</span></h4>
<p>Pode haver duas possibilidades para este problema: ou falta simplesmente uma biblioteca, ent&atilde;o o FreeCAD se recusar&aacute; a come&ccedil;ar, ou a biblioteca est&aacute; l&aacute;, mas &eacute; uma vers&atilde;o mais antiga do que o FreeCAD espera, ent&atilde;o ocorrer&aacute; um crash quando o FreeCAD tentar usar um recurso ausente daquela biblioteca. Um exemplo comum &eacute; que quando ambos Qt3 e Qt4 s&atilde;o instalados em seu sistema, o FreeCAD pode detectar Qt4, mas se sua instala&ccedil;&atilde;o de Qt n&atilde;o estiver devidamente configurada, algumas pe&ccedil;as de Qt3 ainda podem ser usadas, causando falhas.
</p>
<div class="mw-translate-fuzzy">
<p>Favor rever o procedimento de instala&ccedil;&atilde;o (<a href="../pt-br/Installing_on_Windows.html" title="Installing on Windows/pt-br">Windows</a>, <a href="../pt-br/Installing_on_Linux.html" title="Installing on Linux/pt-br">Linux</a> ou <a href="../pt-br/Installing_on_Mac.html" title="Installing on Mac/pt-br">Mac</a>),  certifique-se de instalar todas as bibliotecas necess&aacute;rias (na maioria dos sistemas linux isso &eacute; feito automaticamente), e verifique qual &eacute; o n&uacute;mero m&iacute;nimo de vers&atilde;o para cada um dos componentes.
</p>
</div>
<p>Se tudo parecer correto, descreva o problema no <a rel="nofollow" class="external text" href="http://forum.freecad.org/">forum</a> ou <a href="../pt-br/Tracker.html" title="Tracker/pt-br">enviar um bug</a>. Se voc&ecirc; estiver em um sistema linux, &eacute; f&aacute;cil fazer um backtrace debug, que fornece informa&ccedil;&otilde;es muito &uacute;teis sobre a falha para os desenvolvedores:
</p>
<ul><li>em um terminal, tipo: <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">gdb freecad</span> (assumindo que o pacote gdb esteja instalado)</li>
<li>dentro de gdb, digite <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">run</span></li>
<li>ap&oacute;s o acidente, digite <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">bt</span> para obter o relat&oacute;rio de erro, que voc&ecirc; pode incluir em seu relat&oacute;rio de erro.</li></ul>
<p><span id="FreeCAD_freezes_after_startup"></span>
</p>
<h3><span id="FreeCAD_congela_ap.C3.B3s_a_inicializa.C3.A7.C3.A3o"></span><span class="mw-headline" id="FreeCAD_congela_ap&oacute;s_a_inicializa&ccedil;&atilde;o">FreeCAD congela ap&oacute;s a inicializa&ccedil;&atilde;o</span></h3>
<p>Ao iniciar o FreeCAD, a GUI aparece quase imediatamente, mas a GUI &eacute; congelada e o processador est&aacute; aproximadamente em 99%. Isto pode acontecer na &aacute;rea de trabalho do KDE quando se utiliza o tema Oxygen. Este &eacute; um bug no tema Oxygen e a escolha de outro tema deve resolver este problema.
</p><p><span id="FreeCAD_crashes_on_creating_a_new_document_or_opening_a_file"></span>
</p>
<h3><span class="mw-headline" id="FreeCAD_trava_ao_criar_um_novo_documento_ou_abrir_um_arquivo">FreeCAD trava ao criar um novo documento ou abrir um arquivo</span></h3>
<p>Se o FreeCAD falhar ao criar uma nova visualiza&ccedil;&atilde;o 3D, tente iniciar o FreeCAD a partir de um terminal. Se uma mensagem de erro aparecer quando o travamento ocorrer, mencionando <span style="font-weight:normal; font-family:monospace, Consolas, Courier New, Courier; border: 1px solid #d8d8d8; padding: 2px 5px 2px 5px;">Assertion Failed</span>, e um nome de componente come&ccedil;ando com "So" (<span style="font-weight:normal; font-family:monospace, Consolas, Courier New, Courier; border: 1px solid #d8d8d8; padding: 2px 5px 2px 5px;">SoBase</span>, <span style="font-weight:normal; font-family:monospace, Consolas, Courier New, Courier; border: 1px solid #d8d8d8; padding: 2px 5px 2px 5px;">SoFieldContainer</span>, etc.), as chances s&atilde;o muito altas, especialmente se voc&ecirc; estiver no Linux, que o FreeCAD esteja tentando usar duas vers&otilde;es diferentes da biblioteca Coin, o que causa o travamento.
Para verificar se esse &eacute; de fato o problema, tente o seguinte:
</p>
<ul><li>Localize o execut&aacute;vel FreeCAD (geralmente em <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">/usr/lib/FreeCAD/bin</span>)</li>
<li>Execute o comando {<span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">ldd FreeCAD</span> a partir de um terminal</li>
<li>Anote a vers&atilde;o da biblioteca libCoin.so que o FreeCAD est&aacute; usando (por exemplo <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">libCoin.so.60</span>)</li>
<li>Localize a biblioteca libSoQt.so (geralmente em <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">/usr/lib</span>})</li>
<li>correr ldd libSoQt.so e verifique se ele se liga &agrave; mesma vers&atilde;o Coin do FreeCAD</li></ul>
<p>Se houver alguma diferen&ccedil;a, o FreeCAD ou o SoQt devem ser recompilados (melhor recompilar aquele que usa a vers&atilde;o mais antiga da Coin). O comportamento normal &eacute; tentar contatar as pessoas respons&aacute;veis pela embalagem do SoQt ou do FreeCAD e gentilmente pedir-lhes que considerem a recompila&ccedil;&atilde;o.
Se voc&ecirc; quiser dar esse passo por si mesmo, e n&atilde;o for poss&iacute;vel recompilar o SoQt porque ele quebra outras aplica&ccedil;&otilde;es em seu sistema, voc&ecirc; pode for&ccedil;ar o FreeCAD a compilar com a vers&atilde;o Coin necess&aacute;ria com <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">./configure --with-coin=DIR</span>. Mas voc&ecirc; tem que ter certeza de que o pacote de desenvolvimento correto desta vers&atilde;o Coin est&aacute; instalado.
</p><p><span id="FreeCAD_crashes_after_Edit_&rarr;_Alignment"></span>
</p>
<h3><span id="FreeCAD_trava_ap.C3.B3s_a_Editar_.E2.86.92_Alinhamento"></span><span class="mw-headline" id="FreeCAD_trava_ap&oacute;s_a_Editar_&rarr;_Alinhamento">FreeCAD trava ap&oacute;s a Editar &rarr; Alinhamento</span></h3>
<p>Uma falha de segmenta&ccedil;&atilde;o acontece em <span style="font-weight:normal; font-family:monospace, Consolas, Courier New, Courier; border: 1px solid #d8d8d8; padding: 2px 5px 2px 5px;">vbo_save_playback_vertex_list()</span>. Isto significa que a implementa&ccedil;&atilde;o do VBO no driver gr&aacute;fico &eacute; ruim. A fim de evitar o cache de chamadas OpenGL voc&ecirc; pode tentar definir a vari&aacute;vel de ambiente <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">IV_SEPARATOR_MAX_CACHES=0</span> e reiniciar o FreeCAD.
</p><p><span id="I_cannot_change_numeric_values_in_FreeCAD's_properties_panels"></span>
</p>
<h3><span id="N.C3.A3o_consigo_alterar_valores_num.C3.A9ricos_nos_pain.C3.A9is_de_propriedades_do_FreeCAD"></span><span class="mw-headline" id="N&atilde;o_consigo_alterar_valores_num&eacute;ricos_nos_pain&eacute;is_de_propriedades_do_FreeCAD">N&atilde;o consigo alterar valores num&eacute;ricos nos pain&eacute;is de propriedades do FreeCAD</span></h3>
<figure class="mw-halign-left" typeof="mw:File"><a href="../index.php?title=Jj62l.png&amp;filetimestamp=20130423090237&amp;.html" class="mw-file-description" title="language options"><img alt="language options" src="../File/Jj62l.png" decoding="async" width="480" height="297" class="mw-file-element" data-file-width="981" data-file-height="607"></a><figcaption>language options</figcaption></figure>
<p>Provavelmente, voc&ecirc; tem uma configura&ccedil;&atilde;o incorreta das configura&ccedil;&otilde;es regionais do Windows. Verifique se voc&ecirc; tem o mesmo s&iacute;mbolo para separador decimal e s&iacute;mbolo de agrupamento de d&iacute;gitos em suas configura&ccedil;&otilde;es regionais. Se o fizer, <a rel="nofollow" class="external text" href="http://forum.freecad.org/viewtopic.php?f=4&amp;t=2655&amp;p=20046#p20041">adapte suas configura&ccedil;&otilde;es de sistema</a> para usar caracteres diferentes para o s&iacute;mbolo de agrupamento de d&iacute;gitos e separador decimal. Note que n&atilde;o &eacute; obrigat&oacute;rio ter ponto como separador decimal. &Eacute; obrigat&oacute;rio o uso de s&iacute;mbolos diferentes nestas duas configura&ccedil;&otilde;es.
</p>
<div style="clear:both"></div>
<p><span id="FreeCAD_was_running_normally,_and_suddenly_it_doesn't_start_anymore"></span>
</p>
<h3><span id="O_FreeCAD_estava_funcionando_normalmente.2C_e_de_repente_n.C3.A3o_inicia_mais"></span><span class="mw-headline" id="O_FreeCAD_estava_funcionando_normalmente,_e_de_repente_n&atilde;o_inicia_mais">O FreeCAD estava funcionando normalmente, e de repente n&atilde;o inicia mais</span></h3>
<p>Isto tamb&eacute;m pode acontecer se voc&ecirc; tivesse uma vers&atilde;o mais antiga do FreeCAD instalada, e voc&ecirc; atualizasse para uma vers&atilde;o mais nova. Nesse processo, os arquivos de configura&ccedil;&atilde;o do FreeCAD podem ter sido corrompidos por alguma raz&atilde;o, e agora o FreeCAD n&atilde;o consegue mais l&ecirc;-los, e n&atilde;o inicia. A solu&ccedil;&atilde;o &eacute; simplesmente apagar estes arquivos de configura&ccedil;&atilde;o, assim o FreeCAD ir&aacute; recri&aacute;-los na primeira execu&ccedil;&atilde;o.
</p>
<div class="mw-translate-fuzzy">
<ul><li>No Windows: Abra o explorador de arquivos, e escreva <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">%APPDATA%\FreeCAD</span> como o caminho do arquivo. Uma vez l&aacute;, apague os arquivos <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">user.cfg</span> e <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">system.cfg</span>.</li>
<li>No Linux: Navegue at&eacute; <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">/home/USERNAME/.FreeCAD</span> e exclua os arquivos <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">user.cfg</span> e <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">system.cfg</span></li>
<li>No Mac: Navegue at&eacute; <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">/UserNAME/Library/Preferences/FreeCAD</span> e apague os arquivos <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">user.cfg</span> e <span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">system.cfg</span></li></ul>
</div>
<p>O FreeCAD deve agora recome&ccedil;ar normalmente com todas as suas configura&ccedil;&otilde;es reiniciadas.
</p><p><br>
</p>
<div class="mw-translate-fuzzy">
<p>H&aacute; um <a href="../Macro_findConfigFiles.html" title="Macro findConfigFiles">Macro findConfigFiles</a> dispon&iacute;vel para ajudar na localiza&ccedil;&atilde;o de seus arquivos de configura&ccedil;&atilde;o.  Ele pode ser instalado usando o Gerenciador de Extens&otilde;es no menu Tools (Ferramentas). <b>Ferramentas &rarr; Gerenciador de Extens&otilde;es &rarr; Macros &rarr; findConfigFiles</b> A macro vai encontrar sua pasta de arquivos de configura&ccedil;&atilde;o, copi&aacute;-la para a &aacute;rea de transfer&ecirc;ncia e (tentar) abrir esse local com seu navegador de arquivos padr&atilde;o.  Ela n&atilde;o faz nenhuma altera&ccedil;&atilde;o em seus arquivos ou configura&ccedil;&otilde;es.
</p>
</div>
<p><span id="Using_FreeCAD"></span>
</p>
<h2><span class="mw-headline" id="Usando_o_FreeCAD">Usando o FreeCAD</span></h2>
<p><span id="Is_FreeCAD_really_free?_Even_for_commercial_use?"></span>
</p>
<h3><span id="O_FreeCAD_.C3.A9_realmente_livre.3F_Mesmo_para_uso_comercial.3F"></span><span class="mw-headline" id="O_FreeCAD_&eacute;_realmente_livre?_Mesmo_para_uso_comercial?">O FreeCAD &eacute; realmente livre? Mesmo para uso comercial?</span></h3>
<div class="mw-translate-fuzzy">
<p>O FreeCAD &eacute; um <a rel="nofollow" class="external text" href="http://en.wikipedia.org/wiki/Open-source_software">software de c&oacute;digo aberto</a>, e &eacute; livre n&atilde;o s&oacute; para uso, pessoal ou comercial, mas tamb&eacute;m para distribuir, modificar, ou mesmo usar em uma aplica&ccedil;&atilde;o de c&oacute;digo fechado. Para resumir, voc&ecirc; est&aacute; livre para fazer (quase) tudo o que quiser com ele. Consulte a p&aacute;gina <a href="../pt-br/License.html" title="License/pt-br">Licen&ccedil;a</a> para obter mais detalhes.
</p>
</div>
<p><span id="How_do_I_rotate_the_3D_view?"></span>
</p>
<h3><span id="Como_fa.C3.A7o_para_girar_a_vista_3D.3F"></span><span class="mw-headline" id="Como_fa&ccedil;o_para_girar_a_vista_3D?">Como fa&ccedil;o para girar a vista 3D?</span></h3>
<div class="mw-translate-fuzzy">
<center>
<ul class="gallery mw-gallery-traditional">
		<li class="gallerybox" style="width: 335px">
			<div class="thumb" style="width: 330px; height: 230px;"><span typeof="mw:File"><a href="../index.php?title=Style_of_navigation.png&amp;filetimestamp=20240425200410&amp;.html" class="mw-file-description" title="A partir do bot&atilde;o direito do mouse"><img alt="A partir do bot&atilde;o direito do mouse" src="../File/Style_of_navigation.png" decoding="async" width="165" height="200" class="mw-file-element" data-file-width="336" data-file-height="407"></a></span></div>
			<div class="gallerytext">A partir do <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">bot&atilde;o direito</span> do mouse</div>
		</li>
		<li class="gallerybox" style="width: 335px">
			<div class="thumb" style="width: 330px; height: 230px;"><span typeof="mw:File"><a href="../index.php?title=Style_of_navigation_menu.png&amp;filetimestamp=20240425201620&amp;.html" class="mw-file-description" title="No menu Editar &rarr; Prefer&ecirc;ncias &rarr;"><img alt="No menu Editar &rarr; Prefer&ecirc;ncias &rarr;" src="../File/Style_of_navigation_menu.png" decoding="async" width="300" height="198" class="mw-file-element" data-file-width="708" data-file-height="467"></a></span></div>
			<div class="gallerytext">No menu <b>Editar &rarr; Prefer&ecirc;ncias &rarr;</b></div>
		</li>
</ul>
</center>
<div style="clear:both"></div>
</div>
<div class="mw-translate-fuzzy">
<p>O FreeCAD oferece v&aacute;rios <a href="../pt-br/Mouse_Model.html" class="mw-redirect" title="Mouse Model/pt-br">modos de navega&ccedil;&atilde;o</a>, que podem ser definidos pela janela de prefer&ecirc;ncias ou clicando com o bot&atilde;o direito do mouse. Para saber mais sobre os modos de navega&ccedil;&atilde;o, consulte a p&aacute;gina <a href="../pt-br/Mouse_Model.html" class="mw-redirect" title="Mouse Model/pt-br">Modelo do mouse</a>Para o modo padr&atilde;o, o "Navega&ccedil;&atilde;o CAD", os comandos s&atilde;o os seguintes,
</p>
</div>
<p><span id="What_can_I_do_with_FreeCAD?_Where_do_I_start?"></span>
</p>
<h3><span id="O_que_eu_posso_fazer_com_o_FreeCAD.3F_Por_onde_eu_come.C3.A7o.3F"></span><span class="mw-headline" id="O_que_eu_posso_fazer_com_o_FreeCAD?_Por_onde_eu_come&ccedil;o?">O que eu posso fazer com o FreeCAD? Por onde eu come&ccedil;o?</span></h3>
<p>V&aacute; para a p&aacute;gina <a href="../pt-br/Getting_started.html" title="Getting started/pt-br">Come&ccedil;ar a usar</a> para uma r&aacute;pida descri&ccedil;&atilde;o das ferramentas que voc&ecirc; pode usar. H&aacute; tamb&eacute;m uma nova se&ccedil;&atilde;o <a href="../pt-br/Tutorials.html" title="Tutorials/pt-br">Tutoriais</a> contendo alguns recursos. A se&ccedil;&atilde;o <a href="../pt-br/User_hub.html" title="User hub/pt-br">Central do Usu&aacute;rio</a> cont&eacute;m informa&ccedil;&otilde;es mais detalhadas sobre as diferentes bancadas de trabalho do FreeCAD. Note que como o FreeCAD &eacute; relativamente novo, sua interface de usu&aacute;rio ainda &eacute; muito nua e n&atilde;o apresenta muitas ferramentas. Mas j&aacute; h&aacute; funcionalidades muito mais avan&ccedil;adas dispon&iacute;veis no <a href="../pt-br/Power_users_hub.html" title="Power users hub/pt-br">Python scripting</a>.
</p><p><span id="Is_there_documentation_for_newcomers?_How_can_I_learn_to_use_FreeCAD?"></span>
</p>
<h3><span id="Existe_documenta.C3.A7.C3.A3o_para_os_rec.C3.A9m-chegados.3F_Como_posso_aprender_a_usar_o_FreeCAD.3F"></span><span class="mw-headline" id="Existe_documenta&ccedil;&atilde;o_para_os_rec&eacute;m-chegados?_Como_posso_aprender_a_usar_o_FreeCAD?">Existe documenta&ccedil;&atilde;o para os rec&eacute;m-chegados? Como posso aprender a usar o FreeCAD?</span></h3>
<p>H&aacute; muita documenta&ccedil;&atilde;o espalhada em diferentes lugares, tanto dentro como fora do site do FreeCAD. Talvez voc&ecirc; queira come&ccedil;ar com a p&aacute;gina <a href="../pt-br/Getting_started.html" title="Getting started/pt-br">Come&ccedil;ar a usar</a>. A se&ccedil;&atilde;o <a href="../pt-br/Tutorials.html" title="Tutorials/pt-br">Tutoriais</a> cont&eacute;m muitas p&aacute;ginas de tutoriais especializados para ajud&aacute;-lo a come&ccedil;ar com as diferentes bancadas de trabalho. O <a href="../pt-br/Manual;Introduction.html" title="Manual:Introduction/pt-br">Manual:Introdu&ccedil;&atilde;o</a> &eacute; um guia geral, completo e orientado ao usu&aacute;rio do FreeCAD. A se&ccedil;&atilde;o <a href="../pt-br/User_hub.html" title="User hub/pt-br">Central do Usu&aacute;rio</a> deste wiki lista todas as p&aacute;ginas destinadas aos usu&aacute;rios finais. Em sites externos como <a rel="nofollow" class="external text" href="https://www.youtube.com/results?search_query=freecad">Youtube</a>, voc&ecirc; tamb&eacute;m encontrar&aacute; uma s&eacute;rie de tutoriais em v&iacute;deo criados pelos usu&aacute;rios. E, por &uacute;ltimo, mas n&atilde;o menos importante, o <a rel="nofollow" class="external text" href="https://forum.freecad.org">forum</a> cont&eacute;m muitas respostas a perguntas feitas por outros rec&eacute;m-chegados.
</p><p><span id="I_want_to_import/export_data_in_format_XYZ_to/from_FreeCAD._How_do_I_do_that?"></span>
</p>
<h3><span id="Eu_quero_importar.2Fexportar_dados_no_formato_XYZ_para.2Fde_FreeCAD._Como_posso_fazer_isso.3F"></span><span class="mw-headline" id="Eu_quero_importar/exportar_dados_no_formato_XYZ_para/de_FreeCAD._Como_posso_fazer_isso?">Eu quero importar/exportar dados no formato XYZ para/de FreeCAD. Como posso fazer isso?</span></h3>
<div class="mw-translate-fuzzy">
<p>Favor consultar a p&aacute;gina <a href="../FreeCAD_Howto_Import_Export.html" title="FreeCAD Howto Import Export">FreeCAD Howto Import Export</a>. Talvez suas perguntas j&aacute; tenham sido respondidas l&aacute;.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span id="Where_can_I_find_workarounds_for_features_that_FreeCAD_currently_does_not_support.3F"></span><span class="mw-headline" id="Where_can_I_find_workarounds_for_features_that_FreeCAD_currently_does_not_support?">Where can I find workarounds for features that FreeCAD currently does not support?</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Please refer to the <a href="../Workarounds.html" title="Workarounds">Workarounds</a> page.
</p>
</div>
<p><span id="Working_with_Part_geometry"></span>
</p>
<h2><span id="Modelando_pe.C3.A7as_a_partir_de_geometrias_simples_.3D"></span><span class="mw-headline" id="Modelando_pe&ccedil;as_a_partir_de_geometrias_simples_=">Modelando pe&ccedil;as a partir de geometrias simples =</span></h2>
<p><span id="How_do_I_extrude_stuff_into_solids?_I_don't_get_the_right_result"></span>
</p>
<h3><span id="Como_crio_s.C3.B3lidos_a_partir_de_extrus.C3.B5es.3F_N.C3.A3o_consigo_o_resultado_pretendido"></span><span class="mw-headline" id="Como_crio_s&oacute;lidos_a_partir_de_extrus&otilde;es?_N&atilde;o_consigo_o_resultado_pretendido">Como crio s&oacute;lidos a partir de extrus&otilde;es? N&atilde;o consigo o resultado pretendido</span></h3>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>The theory is simple: Lines (or wires), when extruded, form faces. Faces, when extruded, form solids.
</p>
</div>
<div class="mw-translate-fuzzy">
<p>A teoria &eacute; simples: As linhas (ou fios), quando extrudidas, formam faces. Faces, quando extrudadas, formam s&oacute;lidos.
Se voc&ecirc; extrudar algo e o resultado n&atilde;o for um s&oacute;lido, ent&atilde;o o algo n&atilde;o era uma face. Se voc&ecirc; tiver linhas e quiser extrudar um s&oacute;lido delas, voc&ecirc; deve primeiro selecionar linhas que formam um per&iacute;metro fechado (selecione v&aacute;rios objetos pressionando <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">Ctrl</span>), junte-as em um fio usando (<a href="../pt-br/Draft_Upgrade.html" title="Draft Upgrade/pt-br">Promomovedor Draft</a>), depois fa&ccedil;a uma face desse fio (<span typeof="mw:File"><a href="../index.php?title=Draft_Upgrade.svg&amp;filetimestamp=20210319102935&amp;.html" class="mw-file-description"><img src="../File/Draft_Upgrade.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> Ferramenta de atualiza&ccedil;&atilde;o novamente). A&iacute; est&aacute;, se tudo correu bem, agora voc&ecirc; pode extrudi-lo para um s&oacute;lido.
</p>
</div>
<p>Agora, pode haver muitas pequenas reviravoltas que fazem com que voc&ecirc; obtenha o resultado errado. A melhor maneira de ter certeza &eacute; verificar o que est&aacute; dentro do objeto que voc&ecirc; est&aacute; extrudindo. O conte&uacute;do dos objetos pode ser facilmente explorado com python. Supondo, por exemplo, que voc&ecirc; tenha um objeto chamado "Wire", voc&ecirc; poderia digitar isto no console Python:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">obj</span> <span class="o">=</span> <span class="n">FreeCAD</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">Wire</span>
<span class="n">shp</span> <span class="o">=</span> <span class="n">obj</span><span class="o">.</span><span class="n">Shape</span>
<span class="nb">print</span> <span class="n">shp</span><span class="o">.</span><span class="n">Faces</span>
<span class="nb">print</span> <span class="n">shp</span><span class="o">.</span><span class="n">Wires</span>
<span class="k">if</span> <span class="n">shp</span><span class="o">.</span><span class="n">Wires</span><span class="p">:</span>
    <span class="k">for</span> <span class="n">w</span> <span class="ow">in</span> <span class="n">shp</span><span class="o">.</span><span class="n">Wires</span><span class="p">:</span>
        <span class="nb">print</span> <span class="n">w</span><span class="o">.</span><span class="n">isClosed</span><span class="p">()</span>
</pre></div>
<p>O c&oacute;digo acima recupera a forma de um objeto, mostra as faces e as linhas deste objeto se houver e se essas estiverem fechadas. Se voc&ecirc; n&atilde;o tiver nenhuma face, voc&ecirc; n&atilde;o ter&aacute; um s&oacute;lido. Se n&atilde;o houver linhas fechadas, elas n&atilde;o se tornar&atilde;o uma face. Se voc&ecirc; estiver interessado, voc&ecirc; pode encontrar mais informa&ccedil;&otilde;es sobre o que voc&ecirc; pode verificar com Python na p&aacute;gina <a href="../pt-br/Topological_data_scripting.html" title="Topological data scripting/pt-br">Scripts para cria&ccedil;&atilde;o topol&oacute;gica</a>. Se voc&ecirc; n&atilde;o puder unir v&aacute;rias linhas em um fio, a causa prov&aacute;vel &eacute; que seus extremos n&atilde;o se encontram, deve haver pequenos espa&ccedil;os entre eles (alguns deles). Aqui, receio, minha experi&ecirc;ncia me diz que a maneira mais r&aacute;pida seria redesenhar a linha sobre ela.
</p><p><span id="My_boolean_operations_fail,_or_give_weird_results"></span>
</p>
<h3><span id="Minhas_opera.C3.A7.C3.B5es_booleanas_falham.2C_ou_d.C3.A3o_resultados_estranhos"></span><span class="mw-headline" id="Minhas_opera&ccedil;&otilde;es_booleanas_falham,_ou_d&atilde;o_resultados_estranhos">Minhas opera&ccedil;&otilde;es booleanas falham, ou d&atilde;o resultados estranhos</span></h3>
<div class="mw-translate-fuzzy">
<p>O n&uacute;cleo de modelagem geom&eacute;trica <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Open_CASCADE_Technology">Open CASCADE</a> usado no FreeCAD para a geometria da Pe&ccedil;a, embora provavelmente o melhor n&uacute;cleo de geometria de c&oacute;digo aberto dispon&iacute;vel, tem suas falhas e limita&ccedil;&otilde;es. De fato, as opera&ccedil;&otilde;es booleanas (fus&atilde;o, subtra&ccedil;&atilde;o, interse&ccedil;&atilde;o) n&atilde;o s&atilde;o suas melhores caracter&iacute;sticas, e muitas vezes d&atilde;o resultados estranhos. Esta &eacute; uma limita&ccedil;&atilde;o atual que n&atilde;o temos como resolver de uma s&oacute; vez, portanto seu melhor caminho &eacute; tentar obter o resultado desejado modelando de outra forma. Por exemplo, problemas com primitivos como o cilindro podem muitas vezes ser resolvidos usando um c&iacute;rculo extrudado em seu lugar. Superf&iacute;cies coplanares entre as pe&ccedil;as podem causar problemas, bem como tang&ecirc;ncia de superf&iacute;cie. Como regra geral, se uma forma n&atilde;o funcionar, tente remodel&aacute;-la de maneira diferente. Em 99% dos casos no final, voc&ecirc; conseguir&aacute; obter o resultado desejado.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>To understand boolean operations better, see these articles:
</p>
<ul><li><a rel="nofollow" class="external free" href="https://wiki.mcneel.com/rhino/booleanfaq">https://wiki.mcneel.com/rhino/booleanfaq</a></li>
<li><a rel="nofollow" class="external free" href="https://dev.opencascade.org/doc/overview/html/specification__boolean_operations.html#autotoc_md293">https://dev.opencascade.org/doc/overview/html/specification__boolean_operations.html#autotoc_md293</a></li></ul>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span id="When_I_export_.28or_view.29_my_model.2C_the_holes_are_filled_in"></span><span class="mw-headline" id="When_I_export_(or_view)_my_model,_the_holes_are_filled_in">When I export (or view) my model, the holes are filled in</span></h3>
</div>
<div class="mw-translate-fuzzy">
<h3><span id="Quando_eu_exporto_.28ou_visualizo.29_meu_modelo.2C_os_furos_s.C3.A3o_preenchidos"></span><span class="mw-headline" id="Quando_eu_exporto_(ou_visualizo)_meu_modelo,_os_furos_s&atilde;o_preenchidos">Quando eu exporto (ou visualizo) meu modelo, os furos s&atilde;o preenchidos</span></h3>
<p>N&atilde;o usar <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">Crtl</span> + <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">A</span> (Selecionar tudo) para exportar tudo da &aacute;rvore hier&aacute;rquica.  Se o modelo for de um &uacute;nico item, tente selecionar apenas o item mais novo (geralmente o &uacute;ltimo) na &aacute;rvore hier&aacute;rquica.
</p>
</div>
<div class="mw-translate-fuzzy">
<p>Ao criarmos um modelo no <a href="../PartDesign_Workbench.html" title="PartDesign Workbench">PartDesign Workbench</a>, cada recurso toma a forma do &uacute;ltimo e adiciona ou remove algo, criando depend&ecirc;ncias lineares de recurso para recurso &agrave; medida que o modelo &eacute; criado.  Portanto, uma caracter&iacute;stica "Corte" n&atilde;o &eacute; apenas o furo cortado em si, mas a pe&ccedil;a inteira com o corte. &Eacute; por isso que o usu&aacute;rio normalmente deveria ter apenas o item mais novo (fun&ccedil;&atilde;o) na &aacute;rvore do modelo vis&iacute;vel, pois caso contr&aacute;rio as fases do modelo se sobrep&otilde;em, e os furos s&atilde;o preenchidos pelas caracter&iacute;sticas do modelo anterior.
</p>
</div>
<div class="mw-translate-fuzzy">
<p>Para ativar ou desativar a visibilidade de um objeto, selecione-o na &aacute;rvore hier&aacute;rquica e pressione <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">spacebar</span> em seu teclado.  Normalmente tudo, exceto o &uacute;ltimo item na &aacute;rvore hier&aacute;rquica, deve estar cinza e, portanto, n&atilde;o vis&iacute;vel na visualiza&ccedil;&atilde;o 3D.
</p>
</div>
<p><span id="My_parametric_objects_break_when_I_modify_their_base_sketches"></span>
</p>
<h3><span id="Meus_objetos_param.C3.A9tricos_quebram_quando_modifico_seus_esbo.C3.A7os_de_base"></span><span class="mw-headline" id="Meus_objetos_param&eacute;tricos_quebram_quando_modifico_seus_esbo&ccedil;os_de_base">Meus objetos param&eacute;tricos quebram quando modifico seus esbo&ccedil;os de base</span></h3>
<div class="mw-translate-fuzzy">
<p>Voc&ecirc; encontrou o (in)fame problema da topon&iacute;mia. Este &eacute; atualmente um grande problema no FreeCAD para os rec&eacute;m-chegados. Ela est&aacute; presente em toda parte no FreeCAD, mas &eacute; mais importante quando se utilizam <a href="../pt-br/Sketcher_Workbench.html" title="Sketcher Workbench/pt-br">sketches</a>(esbo&ccedil;os). A explica&ccedil;&atilde;o &eacute; simples: ao recalcular um esbo&ccedil;o, as entidades geom&eacute;tricas (bordas, faces ...) s&atilde;o reconstru&iacute;das em uma ordem diferente, dependendo da prioridade das restri&ccedil;&otilde;es. Eles recebem ent&atilde;o um nome diferente (Edge1, Edge2, Face1, Face2 ...). A maioria das opera&ccedil;&otilde;es subsequentes depende desses nomes para identificar o subcomponente em que est&atilde;o trabalhando. Portanto, quando o esbo&ccedil;o &eacute; reconstru&iacute;do, as fun&ccedil;&otilde;es baseadas em tais subcomponentes podem mudar repentinamente sua geometria b&aacute;sica e dar um resultado incorreto.
</p>
</div>
<div class="mw-translate-fuzzy">
<p>Este &eacute; um problema muito dif&iacute;cil de ser superado (o <a href="../index.php?title=Topological_Naming_Project/pt-br&amp;action=edit&amp;redlink=1.html" class="new" title="Topological Naming Project/pt-br (page does not exist)">Projeto de Nomenclatura Topol&oacute;gica</a> visa resolv&ecirc;-lo). Entretanto, h&aacute; muitas solu&ccedil;&otilde;es dispon&iacute;veis para mitigar o problema, e os usu&aacute;rios mais avan&ccedil;ados geralmente conseguem evit&aacute;-lo completamente. Um par de estrat&eacute;gias s&atilde;o:
</p>
</div>
<ul><li>Saiba que os sketches(esbo&ccedil;os) s&atilde;o altamente sens&iacute;veis ao problema. A refer&ecirc;ncia a uma borda espec&iacute;fica de um esbo&ccedil;o, ou a uma face de um objeto constru&iacute;da sobre um sketches(esbo&ccedil;os), como um <a href="../pt-br/PartDesign_Pad.html" title="PartDesign Pad/pt-br">PartDesign Pad(Protrus&atilde;o)</a>, &eacute; perigosa, a menos que voc&ecirc; esteja bastante confiante de que estes sketches(esbo&ccedil;os)n&atilde;o mudar&atilde;o com o tempo ou que o sketch(esbo&ccedil;o)seja muito simples. Um bloco constru&iacute;do sobre um simples sketch(esbo&ccedil;o)retangular, por exemplo, provavelmente ser&aacute; seguro, pois, gerar&aacute; apenas uma face, portanto n&atilde;o h&aacute; problema de ordem.</li>
<li>Preferir outros tipos de objetos como <a href="../pt-br/Part_Workbench.html" title="Part Workbench/pt-br">Part</a> ou <a href="../pt-br/Draft_Workbench.html" title="Draft Workbench/pt-br">Draft</a> quando poss&iacute;vel. Estes objetos s&atilde;o sempre constru&iacute;dos da mesma maneira, portanto, seus componentes geom&eacute;tricos geralmente seguem a mesma ordem cada vez que s&atilde;o reconstru&iacute;dos. Eles s&atilde;o muito menos suscet&iacute;veis a problemas de topon&iacute;mia.</li>
<li>Para anexar outros objetos &agrave;s faces da geometria baseada em esbo&ccedil;os, use antes o <a href="../pt-br/PartDesign_Plane.html" title="PartDesign Plane/pt-br">plano de refer&ecirc;ncia</a>. Estes "objetos de ajuda" invis&iacute;veis n&atilde;o dependem da geometria do esbo&ccedil;o, portanto, permanecem est&aacute;veis ao longo do tempo.</li></ul>
<p><span id="Contributing_to_FreeCAD"></span>
</p>
<h2><span class="mw-headline" id="Contribuindo_para_o_FreeCAD">Contribuindo para o FreeCAD</span></h2>
<p><span id="FreeCAD_is_such_a_great_program!_How_can_I_help?"></span>
</p>
<h3><span id="O_FreeCAD_.C3.A9_um_programa_t.C3.A3o_bom.21_Como_posso_ajudar.3F"></span><span class="mw-headline" id="O_FreeCAD_&eacute;_um_programa_t&atilde;o_bom!_Como_posso_ajudar?">O FreeCAD &eacute; um programa t&atilde;o bom! Como posso ajudar?</span></h3>
<p>H&aacute; muitas maneiras diferentes de ajudar, mesmo que voc&ecirc; n&atilde;o seja um programador. Aqui est&atilde;o algumas coisas que voc&ecirc; pode fazer:
</p>
<ul><li>Dar algum feedback para os desenvolvedores do FreeCAD: &Eacute; sempre &uacute;til saber o que as pessoas pensam, o que elas acharam bom, o que elas sentem falta, etc. Deixe uma nota no <a rel="nofollow" class="external text" href="http://forum.freecad.org/">forum</a> dando sua opini&atilde;o ou fa&ccedil;a um pedido no nosso <a rel="nofollow" class="external text" href="https://tracker.freecad.org/main_page.php">rastreador de problemas</a>!</li>
<li>Ajuda para escrever a documenta&ccedil;&atilde;o: A documenta&ccedil;&atilde;o que temos aqui neste site &eacute;, &agrave;s vezes, muito limitada. Se voc&ecirc; descobriu algo que n&atilde;o est&aacute; bem documentado, acrescente seu conhecimento l&aacute;!</li>
<li>Ajude os outros rec&eacute;m-chegados: Fique no f&oacute;rum e ajude as novas pessoas a resolver quest&otilde;es b&aacute;sicas, como instalar, como inserir um cubo, etc.</li>
<li><a href="../pt-br/Help_FreeCAD.html#Traduza_a_documenta%C3%A7%C3%A3o" title="Help FreeCAD/pt-br">Traduza a documenta&ccedil;&atilde;o</a> para seu pr&oacute;prio idioma</li>
<li><a href="../pt-br/Help_FreeCAD.html#Traduza_o_FreeCAD" title="Help FreeCAD/pt-br">Traduza o FreeCAD</a> para seu pr&oacute;prio idioma</li>
<li>Escreva <a href="../pt-br/Tutorials.html" title="Tutorials/pt-br">Tutoriais</a>, ou grave tutoriais em v&iacute;deo: Os tutoriais s&atilde;o uma maneira muito f&aacute;cil para os rec&eacute;m-chegados conhecerem um novo programa. Se voc&ecirc; fez algumas coisas legais, por que n&atilde;o mostrar a outras pessoas como fazer?</li>
<li>Contribuir com bens e exemplos: Ainda nos faltam bons arquivos de exemplos no FreeCAD. Se voc&ecirc; criou algo bom, compartilhe conosco!</li>
<li><a href="../pt-br/Tracker.html" title="Tracker/pt-br">Enviar bugs</a>: &Eacute; muito importante ter todos os bugs poss&iacute;veis corrigidos. Se voc&ecirc; encontrar um, relate o mais claramente poss&iacute;vel, para que possamos entender exatamente o que est&aacute; acontecendo.</li>
<li>Tente fazer um pouco de c&oacute;digo Python: Voc&ecirc; nunca programou antes, mas quer tentar? Python &eacute; f&aacute;cil. Leia nossa <a href="../pt-br/Introduction_to_Python.html" title="Introduction to Python/pt-br">introdu&ccedil;&atilde;o &agrave; Python</a>, mas cuidado, voc&ecirc; pode ficar viciado rapidamente!</li>
<li>Veja a p&aacute;gina <a href="../pt-br/Help_FreeCAD.html" title="Help FreeCAD/pt-br">Ajude o FreeCAD</a> para mais detalhes sobre como contribuir.</li></ul>
<p><span id="How_can_I_get_edit_permission_on_the_wiki?"></span>
</p>
<h3><span id="Como_posso_obter_permiss.C3.A3o_para_editar_a_wiki.3F"></span><span class="mw-headline" id="Como_posso_obter_permiss&atilde;o_para_editar_a_wiki?">Como posso obter permiss&atilde;o para editar a wiki?</span></h3>
<p>Consulte o par&aacute;grafo <a href="../pt-br/Help_FreeCAD.html#Trabalhe_na_documenta%C3%A7%C3%A3o" title="Help FreeCAD/pt-br">Trabalhe na documenta&ccedil;&atilde;o</a> para obter mais detalhes sobre como contribuir.
</p><p><span id="Does_FreeCAD_participate_in_Google_Summer_of_Code?"></span>
</p>
<h3><span id="O_FreeCAD_participa_do_Google_Summer_of_Code.3F"></span><span class="mw-headline" id="O_FreeCAD_participa_do_Google_Summer_of_Code?">O FreeCAD participa do Google Summer of Code?</span></h3>
<p>Sim. Desde 2016, o FreeCAD participa do Google Summer of Code. Veja <a href="../Google_Summer_of_Code_2020.html" title="Google Summer of Code 2020">Google Summer of Code 2020</a> para informa&ccedil;&otilde;es sobre as edi&ccedil;&otilde;es passadas, e <a rel="nofollow" class="external text" href="http://forum.freecad.org/viewtopic.php?f=8&amp;t=13838">Google Summer Of Code 2016</a> no f&oacute;rum para o an&uacute;ncio original.
</p><p><span id="I_want_to_start_translating_the_wiki_in_my_own_language._What_do_I_do?"></span>
</p>
<h3><span id="Quero_come.C3.A7ar_a_traduzir_o_wiki_para_meu_pr.C3.B3prio_idioma._O_que_eu_fa.C3.A7o.3F"></span><span class="mw-headline" id="Quero_come&ccedil;ar_a_traduzir_o_wiki_para_meu_pr&oacute;prio_idioma._O_que_eu_fa&ccedil;o?">Quero come&ccedil;ar a traduzir o wiki para meu pr&oacute;prio idioma. O que eu fa&ccedil;o?</span></h3>
<p>Este wiki est&aacute; hospedando um monte de conte&uacute;dos. O material mais atualizado e interessante est&aacute; reunido no <a href="../pt-br/Online_Help_Toc.html" title="Online Help Toc/pt-br">manual</a>. 
</p><p>Consulte o par&aacute;grafo <a href="../pt-br/Help_FreeCAD.html#Traduza_a_documenta%C3%A7%C3%A3o" title="Help FreeCAD/pt-br">Traduza a documenta&ccedil;&atilde;o</a> para obter mais detalhes sobre como traduzir o wiki.
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span id="Can_I_buy_swag.3F"></span><span class="mw-headline" id="Can_I_buy_swag?">Can I buy swag?</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>FreeCAD doesn't offer swag you can order to support the project. But you can create your own. See our <a href="../Swag.html" title="Swag">Swag</a> page for instructions.
</p>
</div>
<p><span id="Licensing,_copying_and_reuse"></span>
</p>
<h2><span id="Licenciamento.2C_c.C3.B3pia_e_reutiliza.C3.A7.C3.A3o"></span><span class="mw-headline" id="Licenciamento,_c&oacute;pia_e_reutiliza&ccedil;&atilde;o">Licenciamento, c&oacute;pia e reutiliza&ccedil;&atilde;o</span></h2>
<p><span id="Do_I_have_to_pay_something_to_use_FreeCAD?"></span>
</p>
<h3><span id="Tenho_que_pagar_alguma_coisa_para_usar_o_FreeCAD.3F"></span><span class="mw-headline" id="Tenho_que_pagar_alguma_coisa_para_usar_o_FreeCAD?">Tenho que pagar alguma coisa para usar o FreeCAD?</span></h3>
<p>O FreeCAD &eacute; totalmente gratuito para usar, baixar, redistribuir ou modificar. Ele &eacute; um <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Open_source">software open-source</a>, publicado sob os termos da <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/GNU_Lesser_General_Public_License">GNU Lesser General Public License 2.1</a>, que garante a voc&ecirc; essas liberdades e, ainda mais importante, garante que essas liberdades nunca lhe ser&atilde;o tiradas.
</p><p><span id="Can_I_reuse_any_part_of_the_FreeCAD_artwork_or_pieces_of_the_website?"></span>
</p>
<h3><span id="Posso_reutilizar_qualquer_parte_da_arte_do_FreeCAD_ou_pe.C3.A7as_do_site.3F"></span><span class="mw-headline" id="Posso_reutilizar_qualquer_parte_da_arte_do_FreeCAD_ou_pe&ccedil;as_do_site?">Posso reutilizar qualquer parte da arte do FreeCAD ou pe&ccedil;as do site?</span></h3>
<p>Claro. Todas as obras de arte (&iacute;cones, banners, etc.) do FreeCAD s&atilde;o licenciadas LGPL, assim como o c&oacute;digo do FreeCAD. Sirva-se na p&aacute;gina <a href="../pt-br/Artwork.html" title="Artwork/pt-br">Objetos gr&aacute;ficos</a>. O site &eacute; um site MediaWiki padr&atilde;o, todos os elementos gr&aacute;ficos podem ser reutilizados livremente, e se voc&ecirc; estiver curioso sobre como ajustar o software MediaWiki como n&oacute;s fizemos, procure as p&aacute;ginas comuns especiais de css e js.
</p><p><span id="Can_I_reuse_pieces_of_FreeCAD_in_another_application?"></span>
</p>
<h3><span id="Posso_reutilizar_pe.C3.A7as_do_FreeCAD_em_outra_aplica.C3.A7.C3.A3o.3F"></span><span class="mw-headline" id="Posso_reutilizar_pe&ccedil;as_do_FreeCAD_em_outra_aplica&ccedil;&atilde;o?">Posso reutilizar pe&ccedil;as do FreeCAD em outra aplica&ccedil;&atilde;o?</span></h3>
<div class="mw-translate-fuzzy">
<p>Sim, voc&ecirc; pode usar as partes principais do FreeCAD em outras aplica&ccedil;&otilde;es, desde que voc&ecirc; cumpra com os termos da LGPL. Bibliotecas de terceiros, <a href="../pt-br/External_workbenches.html" title="External workbenches/pt-br">bancadas de trabalho externas</a>, e <a href="../pt-br/Macros.html" title="Macros/pt-br">macros</a> podem estar sujeitas a seus pr&oacute;prios termos de licen&ccedil;a, portanto, favor consultar seus autores. Mais detalhes na p&aacute;gina <a href="../pt-br/License.html" title="License/pt-br">Licen&ccedil;a</a>.
</p>
</div>
<p><br>
</p>
<div class="docnav">
    <div><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-left.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span> <a href="../pt-br/Import_Export.html" title="Import Export/pt-br">Importar Exportar</a></div>
    <div><a href="../pt-br/Tutorials.html" title="Tutorials/pt-br">Tutoriais</a>
 <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-right.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span></div>
    <div><a href="../pt-br/Online_Help_Toc.html" title="Online Help Toc/pt-br">Index</a> <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Online_Help_Toc.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span></div>
</div>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><span typeof="mw:File"><a href="../index.php?title=User_hub.png&amp;filetimestamp=20190221145008&amp;.html" class="mw-file-description"><img src="../File/User_hub.png" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../pt-br/User_hub.html" title="User hub/pt-br">User documentation</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b><a href="../pt-br/Getting_started.html" title="Getting started/pt-br">Getting started</a></b></li>
<li><b>Installation:</b> <a href="../pt-br/Download.html" title="Download/pt-br">Download</a>, <a href="../pt-br/Installing_on_Windows.html" title="Installing on Windows/pt-br">Windows</a>, <a href="../pt-br/Installing_on_Linux.html" title="Installing on Linux/pt-br">Linux</a>, <a href="../pt-br/Installing_on_Mac.html" title="Installing on Mac/pt-br">Mac</a>, <a href="../pt-br/Installing_additional_components.html" title="Installing additional components/pt-br">Additional components</a>, <a href="../pt-br/Compile_on_Docker.html" title="Compile on Docker/pt-br">Docker</a>, <a href="../pt-br/AppImage.html" title="AppImage/pt-br">AppImage</a>, <a href="../pt-br/Ubuntu_Snap.html" title="Ubuntu Snap/pt-br">Ubuntu Snap</a></li>
<li><b>Basics:</b> <a href="../pt-br/About_FreeCAD.html" title="About FreeCAD/pt-br">About FreeCAD</a>, <a href="../pt-br/Interface.html" title="Interface/pt-br">Interface</a>, <a href="../pt-br/Mouse_navigation.html" title="Mouse navigation/pt-br">Mouse navigation</a>, <a href="../pt-br/Selection_methods.html" title="Selection methods/pt-br">Selection methods</a>, <a href="../pt-br/Object_name.html" title="Object name/pt-br">Object name</a>, <a href="../pt-br/Preferences_Editor.html" title="Preferences Editor/pt-br">Preferences</a>, <a href="../pt-br/Workbenches.html" title="Workbenches/pt-br">Workbenches</a>, <a href="../pt-br/Document_structure.html" title="Document structure/pt-br">Document structure</a>, <a href="../pt-br/Property.html" title="Property/pt-br">Properties</a>, <a href="../pt-br/Help_FreeCAD.html" title="Help FreeCAD/pt-br">Help FreeCAD</a>, <a href="../pt-br/Donate.html" title="Donate/pt-br">Donate</a></li></ul>
<hr>
<ul><li><b>Help:</b> <a href="../pt-br/Tutorials.html" title="Tutorials/pt-br">Tutorials</a>, <a href="../pt-br/Video_tutorials.html" title="Video tutorials/pt-br">Video tutorials</a></li>
<li><b><a href="../pt-br/Workbenches.html" title="Workbenches/pt-br">Workbenches</a>:</b> <a href="../pt-br/Std_Base.html" title="Std Base/pt-br">Std Base</a>, <a href="../pt-br/Assembly_Workbench.html" title="Assembly Workbench/pt-br">Assembly</a>, <a href="../pt-br/BIM_Workbench.html" title="BIM Workbench/pt-br">BIM</a>, <a href="../pt-br/CAM_Workbench.html" title="CAM Workbench/pt-br">CAM</a>, <a href="../pt-br/Draft_Workbench.html" title="Draft Workbench/pt-br">Draft</a>, <a href="../pt-br/FEM_Workbench.html" title="FEM Workbench/pt-br">FEM</a>, <a href="../pt-br/Inspection_Workbench.html" title="Inspection Workbench/pt-br">Inspection</a>, <a href="../pt-br/Material_Workbench.html" title="Material Workbench/pt-br">Material</a>, <a href="../pt-br/Mesh_Workbench.html" title="Mesh Workbench/pt-br">Mesh</a>, <a href="../pt-br/OpenSCAD_Workbench.html" title="OpenSCAD Workbench/pt-br">OpenSCAD</a>, <a href="../pt-br/Part_Workbench.html" title="Part Workbench/pt-br">Part</a>, <a href="../pt-br/PartDesign_Workbench.html" title="PartDesign Workbench/pt-br">PartDesign</a>, <a href="../pt-br/Points_Workbench.html" title="Points Workbench/pt-br">Points</a>, <a href="../pt-br/Reverse_Engineering_Workbench.html" title="Reverse Engineering Workbench/pt-br">Reverse Engineering</a>, <a href="../pt-br/Robot_Workbench.html" title="Robot Workbench/pt-br">Robot</a>, <a href="../pt-br/Sketcher_Workbench.html" title="Sketcher Workbench/pt-br">Sketcher</a>, <a href="../pt-br/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/pt-br">Spreadsheet</a>, <a href="../pt-br/Surface_Workbench.html" title="Surface Workbench/pt-br">Surface</a>, <a href="../pt-br/TechDraw_Workbench.html" title="TechDraw Workbench/pt-br">TechDraw</a>, <a href="../pt-br/Testing.html" title="Testing/pt-br">Test Framework</a></li></ul>
<hr>
<ul><li><b><a href="../pt-br/Addon.html" title="Addon/pt-br">Addons</a>:</b> <a href="../pt-br/Std_AddonMgr.html" title="Std AddonMgr/pt-br">Addon Manager</a>, <a href="../pt-br/External_workbenches.html" title="External workbenches/pt-br">External workbenches</a>, <a href="../pt-br/Scripting_and_macros.html" title="Scripting and macros/pt-br">Scripting and macros</a></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="../pt-br/User_hub.html" title="User hub/pt-br">User hub</a>, <a href="../pt-br/Power_users_hub.html" title="Power users hub/pt-br">Power users hub</a>, <a href="../pt-br/Developer_hub.html" title="Developer hub/pt-br">Developer hub</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20251009170156
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.158 seconds
Real time usage: 0.227 seconds
Preprocessor visited node count: 658/1000000
Post&#8208;expand include size: 12554/2097152 bytes
Template argument size: 3191/2097152 bytes
Highest expansion depth: 5/100
Expensive parser function count: 1/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 5565/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   53.053      1 -total
 16.05%    8.517      1 Template:Userdocnavi/pt-br
  9.08%    4.820     10 Template:SystemInput
  6.35%    3.367      1 Template:Navigation_menu_2
  5.76%    3.058      4 Template:SystemOutput
  4.48%    2.375      2 Template:Docnav
  4.18%    2.216      5 Template:KEY
  3.76%    1.997      1 Template:Code
  3.34%    1.770     13 Template:FileName
  3.25%    1.723      2 Template:Clear
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:246810-0!canonical and timestamp 20251009170156 and revision id 1659218. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>