<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">History/pt-br</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="pt-BR" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-History&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/History.html" class="mw-pt-progress mw-pt-progress--complete" title="Geschichte (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../History.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="History (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/History.html" class="mw-pt-progress mw-pt-progress--high" title="Historia (92% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/History.html" class="mw-pt-progress mw-pt-progress--complete" title="Histoire (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/History.html" class="mw-pt-progress mw-pt-progress--complete" title="La storia di FreeCAD (100% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/History.html" class="mw-pt-progress mw-pt-progress--complete" title="Historia (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt/History.html" class="mw-pt-progress mw-pt-progress--low" title="History/pt (0% translated)" lang="pt" dir="ltr">portugu&ecirc;s</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--high" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</span></li>
<li><a href="../ro/History.html" class="mw-pt-progress mw-pt-progress--med" title="Istorie (15% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><a href="../ru/History.html" class="mw-pt-progress mw-pt-progress--med" title="&#1048;&#1089;&#1090;&#1086;&#1088;&#1080;&#1103; (35% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li>
<li><a href="../zh-cn/History.html" class="mw-pt-progress mw-pt-progress--low" title="&#21457;&#23637;&#21382;&#21490; (10% translated)" lang="zh-Hans-CN" dir="ltr">&#20013;&#25991;&#65288;&#20013;&#22269;&#22823;&#38470;&#65289;</a></li>
<li><a href="../ja/History.html" class="mw-pt-progress mw-pt-progress--low" title="&#27508;&#21490; (12% translated)" lang="ja" dir="ltr">&#26085;&#26412;&#35486;</a></li>
<li><a href="../ko/History.html" class="mw-pt-progress mw-pt-progress--low" title="&#50669;&#49324; (7% translated)" lang="ko" dir="ltr">&#54620;&#44397;&#50612;</a></li></ul></div>
<meta property="mw:PageProp/toc">
<h2><span id="Hist.C3.B3ria"></span><span class="mw-headline" id="Hist&oacute;ria">Hist&oacute;ria</span></h2>
<figure typeof="mw:File/Thumb"><a href="../index.php?title=Screenshot_mesh.jpg&amp;filetimestamp=20090514190409&amp;.html" class="mw-file-description"><img src="../File/Screenshot_mesh.jpg" decoding="async" width="300" height="227" class="mw-file-element" data-file-width="634" data-file-height="480"></a><figcaption>FreeCAD antigo, vers&atilde;o desconhecida.</figcaption></figure>
<figure typeof="mw:File/Thumb"><a href="../index.php?title=Part_BooleanOperations.png&amp;filetimestamp=20090426092531&amp;.html" class="mw-file-description"><img src="../File/Part_BooleanOperations.png" decoding="async" width="300" height="231" class="mw-file-element" data-file-width="1036" data-file-height="796"></a><figcaption>FreeCAD vers&atilde;o 0.7 de 2009.</figcaption></figure>
<h3><span id="Como_tudo_come.C3.A7ou"></span><span class="mw-headline" id="Como_tudo_come&ccedil;ou">Como tudo come&ccedil;ou</span></h3>
<p>O FreeCAD come&ccedil;ou em janeiro de 2001, quando <a href="../index.php?title=Usu%C3%A1rio;Jriegel&amp;action=edit&amp;redlink=1.html" class="new" title="Usu&aacute;rio:Jriegel (page does not exist)">J&uuml;rgen Riegel</a> come&ccedil;ou a trabalhar no projeto Cas.CADE, este era uma estrutura de desenvolvimento de software comercial que inclu&iacute;a um <a href="../pt-br/Glossary.html#Geometric_modeling_kernel" title="Glossary/pt-br">kernel de modelagem geom&eacute;trica</a> (ou kernel CAD): que foi lan&ccedil;ado sob uma licen&ccedil;a de c&oacute;digo aberto em 2000 e renomeado como <a href="../pt-br/OpenCASCADE.html" title="OpenCASCADE/pt-br">OpenCASCADE</a>. Isso tornou poss&iacute;vel a realiza&ccedil;&atilde;o de um programa CAD 3D de c&oacute;digo aberto, pois ter que programar um kernel CAD do zero exigiria uma quantidade enorme de trabalho.
</p><p>Nas palavras do pr&oacute;prio J&uuml;rgen:
</p>
<blockquote class="templatequote"><p><i>O projeto FreeCAD foi iniciado por mim em janeiro de 2001, como um GOM (Graphical Object Modeler), com a ideia de usar Qt, Python e Cas.CADE, um CAD-Kernel comercial da &eacute;poca Eu usei nos projetos da Daimler. O Cas.CADE tornou-se um c&oacute;digo aberto pouco tempo antes, ent&atilde;o parecia o momento certo para tentar uma mudan&ccedil;a para a falta de CAD de c&oacute;digo aberto que avia naquela &eacute;poca. Tive uma experi&ecirc;ncia de dois anos com o OpenCascade em um projeto chamado QSpect no qual, ao final, fui o principal designer de software. Aprendi muito sobre programa&ccedil;&atilde;o 3D e CAD. Tamb&eacute;m fui influenciado pelo Catia V5 e sua interface de usu&aacute;rio e programa&ccedil;&atilde;o muito especial&hellip; Em 17 de mar&ccedil;o de 2002, dentro do Projeto OpenCascade, registrei o software como FreeCAD. N&atilde;o consegui pensar em um nome melhor, sou p&eacute;ssimo com nomes... Em abril de 2003, Werner Meyer, um colega de faculdade do projeto QSpect, mudou para uma empresa chamada Imetric. O contato com a Imetric resultou muito promissor, pois buscavam uma nova plataforma de software 3D para seus sensores 3D. Em 2005, a Imetric doou a maior parte de seu M&oacute;dulo de malha ao FreeCAD e &agrave; comunidade Open Source e, desde ent&atilde;o, eles usaram o FreeCAD como base para seu software de sistema de sensores. Desde ent&atilde;o, Werner Meyer &eacute; um desenvolvedor muito ativo do FreeCAD. Em 2005, ap&oacute;s um ano de luta, decidi retirar o framework de documentos OpenCascade e substitu&iacute;-lo por uma implementa&ccedil;&atilde;o pr&oacute;pria. Ent&atilde;o, no final, usamos apenas o kernel CAD do OpenCascade e n&atilde;o o restante de seu Framework. 2007 foi outro marco interessante. Mudamos para QT4 e, portanto, para LGPL. Nessa &eacute;poca a gente fazia muito trabalho, principalmente Werner</i>.</p><div class="templatequotecite">&mdash;<a href="../User;Jriegel.html" title="User:Jriegel">J&uuml;rgen Riegel</a>,&nbsp;<cite><i><a rel="nofollow" class="external text" href="http://forum.freecad.org/viewtopic.php?f=8&amp;t=295">Quem est&aacute; por tr&aacute;s do FreeCad?</a></i></cite></div>
</blockquote>
<p>O projeto foi anunciado ao p&uacute;blico em geral no <a rel="nofollow" class="external text" href="https://dev.opencascade.org/forums">Forum OpenCascade</a> em 2003:
</p>
<blockquote class="templatequote"><p><i>Ol&aacute; a todos, meu nome &eacute; Juergen Riegel e hoje quero anunciar um projeto OpenCasCade, o FreeCAD. Ele &eacute; um CAx RAD de c&oacute;digo aberto baseado no OpenCasCade, QT e Python. Ele apresenta alguns conceitos importantes, como grava&ccedil;&atilde;o de macros, workbenches, capacidade de ser executado como servidor e como extens&atilde;o de aplicativos carreg&aacute;veis dinamicamente, e foi projetado para ser independente de plataforma... Embora esteja em um est&aacute;gio inicial e n&atilde;o possa ser usado por usu&aacute;rios nem desenvolvedores - a primeira vers&atilde;o para usu&aacute;rios est&aacute; planejada para o final de 2003 -, eu gostaria de receber algum feedback sobre a dire&ccedil;&atilde;o e o design do FreeCAD. A GUI est&aacute; quase conclu&iacute;da e agora n&oacute;s, meu co-desenvolvedor Werner Mayer e eu, come&ccedil;amos a adicionar as primeiras fun&ccedil;&otilde;es de CAD. O FreeCAD pode ser visto como um sistema CAD mec&acirc;nico de uso geral, mas seu primeiro p&uacute;blico, creio eu, ser&atilde;o os desenvolvedores de CAx que precisam de base para seu pr&oacute;prio desenvolvimento</i>.</p><div class="templatequotecite">&mdash;<a href="../User;Jriegel.html" title="User:Jriegel">J&uuml;rgen Riegel</a>,&nbsp;<cite><i><a rel="nofollow" class="external text" href="https://dev.opencascade.org/content/announcing-freecad-project">Announcing FreeCAD Project on Sun, 08/17/2003 - 19:23</a></i></cite></div>
</blockquote>
<h3><span class="mw-headline" id="Werner_Mayer">Werner Mayer</span></h3>
<p>Werner Mayer juntou-se ao projeto assim que ele foi anunciado como um projeto de c&oacute;digo aberto (antes do an&uacute;ncio, o projeto era um projeto particular de J&uuml;rgen). Veja esta postagem de Werner no f&oacute;rum em alem&atilde;o: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=13&amp;t=40235&amp;start=10#p342330">https://forum.freecad.org/viewtopic.php?f=13&amp;t=40235&amp;start=10#p342330</a>
</p><p>Com o tempo, o projeto ganhou for&ccedil;a e viu a adi&ccedil;&atilde;o de novos colaboradores importantes na comunidade.
</p>
<ul><li><b>iniciando no Linux</b></li></ul>
<blockquote class="templatequote"><p><i>Um fato engra&ccedil;ado &eacute; que ele queria ter um software CAD de c&oacute;digo aberto principalmente para Linux porque naquela &eacute;poca n&atilde;o existia nada para esta plataforma. No entanto, desde o in&iacute;cio, desenvolvemos exclusivamente no Windows nos primeiros um anos e meio. Ent&atilde;o um cara tcheco fez uma contribui&ccedil;&atilde;o fazendo o c&oacute;digo da compila&ccedil;&atilde;o principal no Linux: <a rel="nofollow" class="external free" href="https://github.com/berndhahnebach/All_FreeCAD/commit/9fd2e27c95ba3dc84778d92e2564cd094793ce2f#diff-480477e89f9b6ddafb30c4383dcdd705">https://github.com/berndhahnebach/All_FreeCAD/commit/9fd2e27c95ba3dc84778d92e2564cd094793ce2f#diff-480477e89f9b6ddafb30c4383dcdd705</a></i>
</p></blockquote>
<blockquote class="templatequote"><p><i>Meio ano depois, continuei a compila&ccedil;&atilde;o do Linux: <a rel="nofollow" class="external free" href="https://github.com/berndhahnebach/All_FreeCAD/commit/35b962d7d751dd80f7c7781df60f93bc9a3da992">https://github.com/berndhahnebach/All_FreeCAD/commit/35b962d7d751dd80f7c7781df60f93bc9a3da992</a></i>
</p></blockquote>
<p><b>P:</b> Voc&ecirc; poderia compartilhar como foi esse primeiro ano e meio? Voc&ecirc;s se encontraram pessoalmente ou online?
</p>
<blockquote class="templatequote"><p><i>Bem, naquela &eacute;poca &eacute;ramos colegas (at&eacute; 2005), ent&atilde;o pod&iacute;amos discutir as coisas pessoalmente. Depois disso, ainda t&iacute;nhamos algumas reuni&otilde;es pessoais, mas discut&iacute;amos a maioria das coisas por e-mail ou telefone.</i>
</p></blockquote>
<blockquote class="templatequote"><p><i>Como terceiro desenvolvedor principal, Yorik entrou por volta do final de 2007, mas levou mais 3 ou 4 anos at&eacute; que a comunidade e o n&uacute;mero de colaboradores come&ccedil;assem a crescer significativamente</i>
</p></blockquote><p>.
</p><p><b>P:</b> Voc&ecirc;s dividiram as tarefas ou trabalharam em implementa&ccedil;&otilde;es concorrentes?
</p>
<blockquote class="templatequote"><p><i>Sim,J&uuml;rgen estava projetando e implementando a maior parte da l&oacute;gica do aplicativo e do documento, e eu estava fazendo o b&aacute;sico da GUI.</i>
</p></blockquote>
<blockquote class="templatequote"><p><i>No entanto, este n&atilde;o foi um processo gradual, mas experimentamos muitas coisas no in&iacute;cio. Por exemplo, na vers&atilde;o inicial, usamos a estrutura de documentos OCC OCAF e seu visualizador, mas depois de um ou dois anos chegamos a um beco sem sa&iacute;da porque a documenta&ccedil;&atilde;o sobre OCC era muito pobre e n&atilde;o conseguimos faz&ecirc;-la funcionar para estender o OCAF com o nosso pr&oacute;prio tipos de recursos. Portanto, decidimos usar apenas as capacidades de modelagem do OCC, mas desenvolver nossa pr&oacute;pria estrutura de aplicativo/documento.</i>
</p></blockquote>
<p><b>P:</b> Naquela &eacute;poca, voc&ecirc; achava que o FreeCAD estaria onde est&aacute; hoje?
</p>
<blockquote class="templatequote"><p><i>N&atilde;o sab&iacute;amos, mas esper&aacute;vamos. &Eacute; claro que n&atilde;o poder&iacute;amos prever exatamente como o FreeCAD se parecer&aacute; hoje.<br>As decis&otilde;es de design mais importantes foram disponibiliz&aacute;-lo em todas as principais plataformas e tornar todo o SW o mais acess&iacute;vel poss&iacute;vel, ou seja, impor todas as fun&ccedil;&otilde;es importantes ao Python para que que os usu&aacute;rios (poderosos) possam estender o FreeCAD com fun&ccedil;&otilde;es pr&oacute;prias. Dessa forma, esper&aacute;vamos obter um p&uacute;blico amplo.</i>
</p></blockquote>
<p>(Veja esta postagem do Werner no f&oacute;rum <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?f=8&amp;t=47703#p411612">Re: FreeCAD History</a>)
</p>
<h3><span class="mw-headline" id="Yorik_se_junta_ao_projeto">Yorik se junta ao projeto</span></h3>
<p><a href="../User;Yorik.html" title="User:Yorik">Yorik van Havre</a> juntou-se ao projeto em 2008 e come&ccedil;ou a trabalhar no <a href="../pt-br/Draft_Workbench.html" title="Draft Workbench/pt-br">m&oacute;dulo Draft</a>. Antes disso, n&atilde;o havia como criar geometria 2D atrav&eacute;s da <a href="../pt-br/Glossary.html#GUI" title="Glossary/pt-br">GUI</a>. Este m&oacute;dulo foi totalmente programado em Python e n&atilde;o em C++ (a linguagem de programa&ccedil;&atilde;o central usada no FreeCAD). A nova bancada de trabalfo Draft provou que a integra&ccedil;&atilde;o do Python foi um sucesso e pode ser usado para estender ou customizar os recursos do FreeCAD. Al&eacute;m de seu trabalho no m&oacute;dulo Draft, Yorik trabalhou na expans&atilde;o da documenta&ccedil;&atilde;o do FreeCAD e tornou-se o "diretor de arte" de fato do FreeCAD, criando muitos &iacute;cones para a GUI do FreeCAD e <a href="../pt-br/Artwork.html" title="Artwork/pt-br">definindo seu estilo</a>.
</p><p>A vers&atilde;o 0.7 do FreeCAD lan&ccedil;ada em abril de 2009 foi a primeira a incluir o m&oacute;dulo Draft. O m&oacute;dulo Part forneceu um fluxo de trabalho <a href="../pt-br/Glossary.html#Constructive_Solid_Geometry" title="Glossary/pt-br">CSG</a> simples com a cria&ccedil;&atilde;o de formas primitivas e opera&ccedil;&otilde;es booleanas acess&iacute;veis atrav&eacute;s do menu Part. A extrus&atilde;o de perfis 2D e filetes tamb&eacute;m foi poss&iacute;vel.
</p><p>A vers&atilde;o 0.8 lan&ccedil;ada em julho de 2009 teve mais algum trabalho no m&oacute;dulo Draft, incluindo uma nova ferramenta Dimension. O m&oacute;dulo Part se beneficiou de uma nova barra de ferramentas junto com novas ferramentas, Revolver e Se&ccedil;&atilde;o.
</p><p>No final de 2009, o FreeCAD foi aceito como um pacote Debian nos reposit&oacute;rios Debian. O FreeCAD foi adicionado aos reposit&oacute;rios do Ubuntu 10.04 em 2010.
</p>
<h3><span class="mw-headline" id="O_projeto_continua">O projeto continua</span></h3>
<p>A vers&atilde;o 0.10 foi lan&ccedil;ada em julho de 2010 e introduziu a <a href="../Sketcher_Workbench.html" title="Sketcher Workbench">bancada de trabalho Sketcher</a>, baseado no Sketchsolve, um solucionador baseado em restri&ccedil;&otilde;es para criar geometria 2D. A primeira vers&atilde;o limitava-se &agrave; cria&ccedil;&atilde;o de ret&acirc;ngulos e linhas.
</p><p>No in&iacute;cio de 2011, aproveitando a oportunidade oferecida pela plataforma on-line <a rel="nofollow" class="external text" href="https://launchpad.net">Launchpad</a>, foi criada a equipe <a rel="nofollow" class="external text" href="https://launchpad.net/~freecad-maintainers">FreeCAD Maintainers</a> para fornecer novas vers&otilde;es est&aacute;veis e pacotes de compila&ccedil;&atilde;o di&aacute;ria do FreeCAD aos usu&aacute;rios do sistema operacional Ubuntu.
</p><p>A vers&atilde;o 0.11 foi lan&ccedil;ada em maio de 2011 e introduziu a nova bancada de trabalho PartDesign, que inclu&iacute;a ferramentas como Protrus&atilde;o,  Cavidade, Filete e  Chanfro. A bancada de trabalho Draft recebeu aprimoramentos e novas ferramentas, como o BSpline. A bancada de trabalho Robot apresentou mais ferramentas de GUI.
</p><p>A vers&atilde;o 0.12 foi lan&ccedil;ada em janeiro de 2012 e apresentava um bancada de trabalho Sketcher mais completo. Ela inclu&iacute;a um solucionador totalmente reescrito, o FreeGCS. Foi o resultado de meses de trabalho dos principais desenvolvedores do FreeCAD, juntamente com os novatos logari81 (que programou o solver) e mrlukeparry. Mais ferramentas foram adicionadas ao workbench do PartDesign.
</p>
<h3><span id="Amplia.C3.A7.C3.A3o_da_equipe_principal_de_desenvolvedores"></span><span class="mw-headline" id="Amplia&ccedil;&atilde;o_da_equipe_principal_de_desenvolvedores">Amplia&ccedil;&atilde;o da equipe principal de desenvolvedores</span></h3>
<p>Em abril de 2019, a equipe de desenvolvedores principais foi expandida: J&uuml;rgen, Werner e Yorik se juntaram a Abdullah, Bernd, sliptonic e WandererFan
</p>
<h2><span id="Postagens_interessantes_no_f.C3.B3rum"></span><span class="mw-headline" id="Postagens_interessantes_no_f&oacute;rum">Postagens interessantes no f&oacute;rum</span></h2>
<ul><li>sobre PartDesignNext e outras decis&otilde;es de design: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=8&amp;t=34923&amp;start=130#p297074">https://forum.freecad.org/viewtopic.php?f=8&amp;t=34923&amp;start=130#p297074</a></li>
<li>sobre a hist&oacute;ria do F&oacute;rum: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=8&amp;t=7448&amp;start=200#p287106">https://forum.freecad.org/viewtopic.php?f=8&amp;t=7448&amp;start=200#p287106</a></li>
<li>sobre o hist&oacute;rico do projeto: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=8&amp;t=47703">https://forum.freecad.org/viewtopic.php?f=8&amp;t=47703</a></li>
<li>sobre o hist&oacute;rico do c&oacute;digo: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=10&amp;t=46733&amp;start=10#p405068">https://forum.freecad.org/viewtopic.php?f=10&amp;t=46733&amp;start=10#p405068</a> BTW: o check-in inicial do c&oacute;digo foi em 18 de mar&ccedil;o de 2002 (pode ser o anivers&aacute;rio?)</li>
<li>sobre o projeto para ser OpenSource: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=13&amp;t=40235&amp;start=10#p342330">https://forum.freecad.org/viewtopic.php?f=13&amp;t=40235&amp;start=10#p342330</a></li>
<li>sobre o hist&oacute;rico de confirma&ccedil;&atilde;o de lan&ccedil;amento: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=8&amp;t=23695#p184940">https://forum.freecad.org/viewtopic.php?f=8&amp;t=23695#p184940</a></li>
<li>sobre Quem est&aacute; por tr&aacute;s do FreeCAD: <a rel="nofollow" class="external free" href="http://forum.freecad.org/viewtopic.php?f=8&amp;t=295">http://forum.freecad.org/viewtopic.php?f=8&amp;t=295</a></li>
<li>sobre a hist&oacute;ria do FEM: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=18&amp;t=48646#p416389">https://forum.freecad.org/viewtopic.php?f=18&amp;t=48646#p416389</a></li>
<li>sobre a hist&oacute;ria do mesher FEM: <a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?f=18&amp;t=48733#p417627">https://forum.freecad.org/viewtopic.php?f=18&amp;t=48733#p417627</a></li></ul>
<p><span id="Release_history"></span>
</p>
<h2><span id="Hist.C3.B3rico_de_lan.C3.A7amento"></span><span class="mw-headline" id="Hist&oacute;rico_de_lan&ccedil;amento">Hist&oacute;rico de lan&ccedil;amento</span></h2>
<h4><span id="Vis.C3.A3o_geral"></span><span class="mw-headline" id="Vis&atilde;o_geral">Vis&atilde;o geral</span></h4>
<table class="wikitable" style="margin: 0.4em 0 0.5em;">

<tbody><tr>
<th style="background-color: #cccccc;">Vers&atilde;o
</th>
<th class="unsortable" style="background-color: #cccccc;">Nome da vers&atilde;o
</th>
<th style="background-color: #cccccc; white-space: nowrap;">Data de lan&ccedil;amento
</th>
<th class="unsortable" style="background-color: #cccccc;">Notas de lan&ccedil;amento
</th>
<th class="unsortable" style="background-color: #cccccc;">Release commit
</th>
<th class="unsortable" style="background-color: #cccccc;">Release branch
<div lang="en" dir="ltr" class="mw-content-ltr">
</div></th></tr>
<tr>
<td style="background-color: #C1E6F5;">1.1
</td>
<td>-
</td>
<td>in development
</td>
<td><a href="../Release_notes_1.1.html" title="Release notes 1.1">Release notes 1.1</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/main">head main</a>
</td>
<td>

<div lang="en" dir="ltr" class="mw-content-ltr">
</div></td></tr>
<tr>
<td style="background-color: #D4F4B4;">1.0
</td>
<td>BGBSWW
</td>
<td>2024-11-18
</td>
<td><a href="../Release_notes_1.0.html" title="Release notes 1.0">Release notes 1.0</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-1-0">release commit 1.0</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-1-0">branch bugfixes 1.0</a>

<div class="mw-translate-fuzzy">
</div></td></tr>
<tr>
<td style="background-color: #C1E6F5;">0.21
</td>
<td>-
</td>
<td>em desenvolvimento
</td>
<td><a href="../Release_notes_0.21.html" title="Release notes 0.21">Notas da vers&atilde;o 0.21</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/master">head master</a>
</td>
<td>

<div class="mw-translate-fuzzy">
</div></td></tr>
<tr>
<td style="background-color: #D4F4B4;">0.20
</td>
<td>-
</td>
<td>2022-06-14
</td>
<td><a href="../Release_notes_0.20.html" title="Release notes 0.20">Notas da vers&atilde;o 0.20</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-20">release commit 0.20</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-20">branch bugfixes 0.20</a>

</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.19
</td>
<td>-
</td>
<td>2021-03-20
</td>
<td><a href="../Release_notes_0.19.html" title="Release notes 0.19">Notas de lan&ccedil;amento 0.19</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-19">release commit 0.19</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-19">branch bugfixes 0.19</a>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.18
</td>
<td>-
</td>
<td>2019-03-12
</td>
<td><a href="../Release_notes_0.18.html" title="Release notes 0.18">Notas de lan&ccedil;amento 0.18</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-18">release commit 0.18</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-18">branch bugfixes 0.18</a>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.17
</td>
<td>Roland
</td>
<td>2018-04-06
</td>
<td><a href="../Release_notes_0.17.html" title="Release notes 0.17">Notas de lan&ccedil;amento 0.17</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-17">release commit 0.17</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-17">branch bugfixes 0.17</a>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.16
</td>
<td>-
</td>
<td>2016-04-18
</td>
<td><a href="../Release_notes_0.16.html" title="Release notes 0.16">Notas de lan&ccedil;amento 0.16</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-16">release commit 0.16</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-16">branch bugfixes 0.16</a>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.15
</td>
<td>-
</td>
<td>2015-04-08
</td>
<td><a href="../Release_notes_0.15.html" title="Release notes 0.15">Notas de lan&ccedil;amento 0.15</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-15">release commit 0.15</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-15">branch bugfixes 0.15</a>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.14
</td>
<td>-
</td>
<td>2014-07-01
</td>
<td><a href="../Release_notes_0.14.html" title="Release notes 0.14">Notas de lan&ccedil;amento 0.14</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-14">release commit 0.14</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-14">branch bugfixes 0.14</a>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.13
</td>
<td>-
</td>
<td>2013-01-29
</td>
<td><a href="../Release_notes_0.13.html" title="Release notes 0.13">Notas de lan&ccedil;amento 0.13</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/commits/releases/FreeCAD-0-13">release commit 0.13</a>
</td>
<td><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/tree/releases/FreeCAD-0-13">branch bugfixes 0.13</a>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.12
</td>
<td>-
</td>
<td>2011-12-20
</td>
<td><a href="../Release_notes_0.12.html" title="Release notes 0.12">Notas de lan&ccedil;amento 0.12</a>
</td>
<td>
</td>
<td>
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.11
</td>
<td>-
</td>
<td>2011-05-03
</td>
<td><a href="../Release_notes_0.11.html" title="Release notes 0.11">Notas de lan&ccedil;amento 0.11</a>
</td>
<td>
</td>
<td>
<div lang="en" dir="ltr" class="mw-content-ltr">
</div></td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.10
</td>
<td>-
</td>
<td>2010-07-24
</td>
<td>
</td>
<td>
</td>
<td>

<div lang="en" dir="ltr" class="mw-content-ltr">
</div></td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.9
</td>
<td>-
</td>
<td>2010-01-16
</td>
<td>
</td>
<td>
</td>
<td>

<div lang="en" dir="ltr" class="mw-content-ltr">
</div></td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.8
</td>
<td>-
</td>
<td>2009-07-10
</td>
<td>
</td>
<td>
</td>
<td>

<div lang="en" dir="ltr" class="mw-content-ltr">
</div></td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.7
</td>
<td>-
</td>
<td>2009-04-24
</td>
<td>
</td>
<td>
</td>
<td>

<div lang="en" dir="ltr" class="mw-content-ltr">
</div></td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.6
</td>
<td>-
</td>
<td>2007-02-27
</td>
<td>
</td>
<td>
</td>
<td>

<div lang="en" dir="ltr" class="mw-content-ltr">
</div></td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.5
</td>
<td>-
</td>
<td>2006-10-05
</td>
<td>
</td>
<td>
</td>
<td>

<div lang="en" dir="ltr" class="mw-content-ltr">
</div></td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.4
</td>
<td>-
</td>
<td>2006-01-15
</td>
<td>
</td>
<td>
</td>
<td>

<div lang="en" dir="ltr" class="mw-content-ltr">
</div></td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.3
</td>
<td>-
</td>
<td>2005-10-31
</td>
<td>
</td>
<td>
</td>
<td>

<div lang="en" dir="ltr" class="mw-content-ltr">
</div></td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.2
</td>
<td>-
</td>
<td>2005-08-09
</td>
<td>
</td>
<td>
</td>
<td>

<div lang="en" dir="ltr" class="mw-content-ltr">
</div></td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.1
</td>
<td>-
</td>
<td>2003-01-27
</td>
<td>
</td>
<td>
</td>
<td>

</td></tr>
<tr>
<td style="background-color: #FDB3AB;">0.0.1
</td>
<td>-
</td>
<td>2002-10-29
</td>
<td>Inicio de vercionamento
</td>
<td>
</td>
<td>
<div lang="en" dir="ltr" class="mw-content-ltr">
</div></td></tr></tbody></table>

<p><span id="Legend"></span>
</p>
<h4><span class="mw-headline" id="Legenda">Legenda</span></h4>
<div class="mw-translate-fuzzy">
<table class="wikitable" style="margin: 0.4em 0 0.5em;">

<tbody><tr>
<th style="background-color: #cccccc;">Cor
</th>
<th style="background-color: #cccccc;">Tipo de vers&atilde;o
</th></tr>
<tr>
<td style="background-color: #C1E6F5;">
</td>
<td>Lan&ccedil;amento futuro
</td></tr>
<tr>
<td style="background-color: #FED1A0;">
</td>
<td>Vers&atilde;o pr&eacute;via mais recente
</td></tr>
<tr>
<td style="background-color: #D4F4B4;">
</td>
<td><b>Vers&atilde;o mais recente</b>
</td></tr>
<tr>
<td style="background-color: #FEF8C6;">
</td>
<td>Vers&atilde;o antiga, mas ainda compat&iacute;vel
</td></tr>
<tr>
<td style="background-color: #FDB3AB;">
</td>
<td>Vers&atilde;o mais antiga
</td></tr>
</tbody></table>
</div>
<p>== Links externos
</p>
<ul><li><a rel="nofollow" class="external text" href="http://sourceforge.net/projects/free-cad/files/">se&ccedil;&atilde;o Arquivos do SourceForge</a></li></ul>
<ul><li><a rel="nofollow" class="external text" href="http://sourceforge.net/projects/free-cad/files/OldFiles/">se&ccedil;&atilde;o Arquivos antigos do SourceForge</a>.</li></ul>
<ul><li><a rel="nofollow" class="external text" href="http://www.opencascade.org/org/forum/thread_6572/?forum=11">Anunciando o Projeto FreeCAD</a> no f&oacute;rum OpenCascade</li></ul>
<!-- 
NewPP limit report
Cached time: 20251009170740
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.083 seconds
Real time usage: 0.134 seconds
Preprocessor visited node count: 204/1000000
Post&#8208;expand include size: 6395/2097152 bytes
Template argument size: 5446/2097152 bytes
Highest expansion depth: 5/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 2293/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    5.445      1 -total
 90.92%    4.951      9 Template:Quote
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:245160-0!canonical and timestamp 20251009170740 and revision id 1659343. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>