<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">The FreeCAD source code/pt-br</span></h1><?xml encoding="UTF-8"><div class="mw-parser-output"><div class="mw-pt-languages noprint" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../de/The_FreeCAD_source_code.html" class="mw-pt-progress mw-pt-progress--complete" title="Der FreeCAD Quellcode (92% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../The_FreeCAD_source_code.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="The FreeCAD source code (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/The_FreeCAD_source_code.html" class="mw-pt-progress mw-pt-progress--low" title="El c&oacute;digo fuente de FreeCAD (38% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/The_FreeCAD_source_code.html" class="mw-pt-progress mw-pt-progress--complete" title="Code source de FreeCAD (92% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/The_FreeCAD_source_code.html" class="mw-pt-progress mw-pt-progress--complete" title="Il codice sorgente di FreeCAD (92% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/The_FreeCAD_source_code.html" class="mw-pt-progress mw-pt-progress--complete" title="Kod &#378;r&oacute;d&#322;owy FreeCAD (92% translated)" lang="pl" dir="ltr">polski</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</span></li>
<li><a href="../ru/The_FreeCAD_source_code.html" class="mw-pt-progress mw-pt-progress--stub" title="&#1048;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076; FreeCAD (8% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li>
<li><a href="../zh-cn/The_FreeCAD_source_code.html" class="mw-pt-progress mw-pt-progress--med" title="FreeCAD&#30340;&#28304;&#20195;&#30721; (46% translated)" lang="zh-Hans-CN" dir="ltr">&#20013;&#25991;&#65288;&#20013;&#22269;&#22823;&#38470;&#65289;</a></li></ul></div>
<div class="mw-translate-fuzzy">
<p>O  <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD">FreeCAD source code</a> &eacute; gerenciado com git e &eacute; p&uacute;blico, aberto e dispon&iacute;vel sob a licen&ccedil;a <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/GNU_Lesser_General_Public_License">LGPL</a>. Pode ser copiado, baixado, lido, analisado, redistribu&iacute;do e modificado por qualquer pessoa. Se voc&ecirc; planeja fazer modifica&ccedil;&otilde;es que deseja ver inclu&iacute;das no pr&oacute;prio c&oacute;digo oficial, lembre-se de que suas altera&ccedil;&otilde;es precisar&atilde;o ser aprovadas pelos desenvolvedores do FreeCAD, por isso &eacute; aconselh&aacute;vel discutir primeiro suas inten&ccedil;&otilde;es em [http: // forum.freecadweb.org forum] para evitar o risco de ter suas altera&ccedil;&otilde;es rejeitadas por algum motivo que voc&ecirc; n&atilde;o previu.
</p>
</div>
<p>Abaixo est&atilde;o algumas dicas e informa&ccedil;&otilde;es &uacute;teis para colocar voc&ecirc; nos trilhos, caso esteja interessado em explorar o c&oacute;digo do FreeCAD.
</p>
<ul><li>O c&oacute;digo do FreeCAD &eacute; principalmente programado em <b>C++</b>, mas depende significativamente do <b>Python</b>. Uma grande parte de sua funcionalidade &eacute; fornecida atrav&eacute;s de liga&ccedil;&otilde;es Python associadas, e faz parte da filosofia central do desenvolvimento do FreeCAD sempre oferecer acesso via Python a qualquer novo recurso implementado em C++. Para alcan&ccedil;ar isso, o CPython (as ferramentas de interface C fornecidas pelo pr&oacute;prio Python) e especialmente o <a rel="nofollow" class="external text" href="http://cxx.sourceforge.net/">PyCXX</a> s&atilde;o amplamente utilizados em todo o FreeCAD. Al&eacute;m disso, muitos modelos e ferramentas personalizadas s&atilde;o fornecidos no pr&oacute;prio c&oacute;digo do FreeCAD para facilitar a cria&ccedil;&atilde;o de liga&ccedil;&otilde;es Python associadas. Algumas partes mais de alto n&iacute;vel do c&oacute;digo do FreeCAD s&atilde;o totalmente codificadas em Python.</li></ul>
<ul><li>O c&oacute;digo fonte do FreeCAD &eacute; completamente <b>multiplataforma</b>, e &eacute; dedicado um grande cuidado para garantir que a aplica&ccedil;&atilde;o possa ser utilizada em tantas plataformas e configura&ccedil;&otilde;es quanto poss&iacute;vel, sem causar dificuldades aos usu&aacute;rios existentes. Portanto, sempre que poss&iacute;vel, s&atilde;o evitadas novas vers&otilde;es de componentes necess&aacute;rios at&eacute; que estejam amplamente dispon&iacute;veis em todas as plataformas, e a compatibilidade com vers&otilde;es anteriores (a capacidade de abrir um arquivo criado com uma vers&atilde;o antiga do FreeCAD em uma vers&atilde;o mais recente) &eacute; uma prioridade importante.</li></ul>
<ul><li>Quase todas as funcionalidades do FreeCAD s&atilde;o divididas em duas partes distintas, denominadas <b>App</b> e <b>Gui</b>. Essa divis&atilde;o &eacute; refletida em toda a estrutura de arquivos do c&oacute;digo-fonte. O m&oacute;dulo App cont&eacute;m todas as funcionalidades que precisam ser executadas no modo de console puro (sem GUI). Como o FreeCAD pode ser compilado e executado sem sua Interface Gr&aacute;fica do Usu&aacute;rio, o c&oacute;digo no m&oacute;dulo App &eacute; independente de qualquer biblioteca relacionada &agrave; GUI. J&aacute; o m&oacute;dulo Gui cont&eacute;m todo o c&oacute;digo necess&aacute;rio para ser executado no modo GUI e &eacute; constru&iacute;do em torno da funcionalidade do m&oacute;dulo App.</li></ul>
<ul><li>A maioria das funcionalidades do FreeCAD &eacute; implementada em <b>M&oacute;dulos</b>. O FreeCAD sem seus m&oacute;dulos &eacute; apenas uma janela cont&ecirc;iner simples que pode abrir e salvar arquivos. Todas as ferramentas de geometria e bancadas de trabalho s&atilde;o implementadas nos M&oacute;dulos. Esses m&oacute;dulos podem ser escritos em C++, em Python ou combinando o melhor dos dois mundos. Eles podem ser m&oacute;dulos h&iacute;bridos C++/Python, nos quais a funcionalidade central s&oacute;lida &eacute; programada em C++ e as ferramentas para o usu&aacute;rio final s&atilde;o escritas em Python, tornando-as mais f&aacute;ceis de estender e adaptar pelos usu&aacute;rios do FreeCAD. Cada m&oacute;dulo geralmente define e cria uma <b>Bancada de Trabalho</b> na interface do FreeCAD, quando usado no modo GUI, geralmente com o mesmo nome, mas n&atilde;o &eacute; obrigat&oacute;rio que os m&oacute;dulos contenham uma bancada de trabalho.</li></ul>
<ul><li>Os m&oacute;dulos do FreeCAD frequentemente <b>dependem de outros m&oacute;dulos</b>. A maioria dos m&oacute;dulos que utilizam geometria s&oacute;lida dependem do m&oacute;dulo <b>Part</b>, que &eacute; o mais fundamental do FreeCAD e implementa a maior parte da interface com o OpenCascade. Embora outros m&oacute;dulos possam usar diretamente a funcionalidade do OpenCascade, geralmente eles contam com fun&ccedil;&otilde;es de n&iacute;vel mais alto fornecidas pelo Part.</li></ul>
<ul><li>Os m&oacute;dulos s&atilde;o sempre <b>inicializados</b> a partir do Python. Mesmo que sejam escritos inteiramente em C++, eles sempre incluem uma estrutura m&iacute;nima do Python/CPython.</li></ul>
<ul><li>O FreeCAD &eacute; um &aacute;vido usu&aacute;rio de <b>outras bibliotecas de c&oacute;digo aberto</b>. Al&eacute;m do Python e do Qt, usados pelo n&uacute;cleo e por quase todos os m&oacute;dulos, as duas bibliotecas principais utilizadas em grande parte dos m&oacute;dulos s&atilde;o <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Open_Cascade_Technology">OpenCascade Technology</a> (OCCT) e <a rel="nofollow" class="external text" href="http://www.coin3d.org/">Coin3D</a>. O OpenCascade &eacute; utilizado para criar e gerenciar toda a geometria s&oacute;lida do FreeCAD, enquanto o Coin3D &eacute; usado para gerenciar a visualiza&ccedil;&atilde;o 3D. O OpenCascade &eacute; predominantemente utilizado no mundo do App, enquanto o Coin3D &eacute; exclusivamente usado no mundo do Gui. Uma compreens&atilde;o b&aacute;sica do OpenCascade &eacute; fundamental para realizar qualquer trabalho relacionado &agrave; geometria com o FreeCAD. M&oacute;dulos mais espec&iacute;ficos fazem uso de bibliotecas mais espec&iacute;ficas, e como geralmente n&atilde;o h&aacute; restri&ccedil;&otilde;es neste ponto al&eacute;m de garantir que estas bibliotecas estejam facilmente dispon&iacute;veis em todas as plataformas, a lista de depend&ecirc;ncias de uma instala&ccedil;&atilde;o completa do FreeCAD com todos os seus m&oacute;dulos pode ser bastante extensa.</li></ul>
<ul><li>Os <b>objetos de documento</b> do FreeCAD, que s&atilde;o todos os objetos contidos em um documento do FreeCAD, s&atilde;o aqueles que aparecem na Visualiza&ccedil;&atilde;o de &Aacute;rvore na GUI e em FreeCAD.ActiveDocument.Objects() em Python. Eles podem ou n&atilde;o ter dados geom&eacute;tricos e podem ou n&atilde;o mostrar algo na visualiza&ccedil;&atilde;o 3D. Eles est&atilde;o sempre divididos em partes App e Gui. A parte Gui n&atilde;o &eacute; carregada durante a execu&ccedil;&atilde;o no modo console. Objetos geom&eacute;tricos padr&atilde;o, como os encontrados em Part ou PartDesign, t&ecirc;m sua geometria baseada no OpenCascade definida em sua contraparte App, enquanto a contraparte Gui (tamb&eacute;m geralmente chamada de "Provedor de Visualiza&ccedil;&atilde;o") &eacute; respons&aacute;vel por criar uma representa&ccedil;&atilde;o em Coin3D dessa geometria, que ser&aacute; inserida no gr&aacute;fico de cena principal em 3D da visualiza&ccedil;&atilde;o.</li></ul>
<ul><li>A estrutura b&aacute;sica de diret&oacute;rios do c&oacute;digo-fonte &eacute; organizada da seguinte forma:
<ul><li><b>App</b>: cont&eacute;m a aplica&ccedil;&atilde;o do FreeCAD no modo console, define estruturas b&aacute;sicas e classes base para objetos de documento, que s&atilde;o usados pelos m&oacute;dulos para construir os seus pr&oacute;prios.</li>
<li><b>Base</b>: cont&eacute;m funcionalidades essenciais comumente utilizadas em todo o FreeCAD: vetores 3D, unidades, matrizes, posicionamentos, etc.</li>
<li><b>Gui</b>: cont&eacute;m a aplica&ccedil;&atilde;o do FreeCAD no modo GUI, define a visualiza&ccedil;&atilde;o 3D, inclui muitas ferramentas e fun&ccedil;&otilde;es para serem utilizadas pelas bancadas de trabalho para interagir com a interface e com a visualiza&ccedil;&atilde;o 3D, e define classes base para provedores de visualiza&ccedil;&atilde;o.</li>
<li><b>Doc</b>: cont&eacute;m principalmente um arquivo de ajuda Qt completo gerado a partir deste wiki.</li>
<li><b>Mod</b>: cont&eacute;m todos os m&oacute;dulos, que s&atilde;o separados em App e Gui (exceto os m&oacute;dulos Python, que nem sempre seguem essa regra t&atilde;o claramente).</li></ul></li></ul>
<h3><span class="mw-headline" id="Relacionado">Relacionado</span></h3>
<ul><li><a href="../Source_code_management.html" title="Source code management">Gerenciamento de c&oacute;digo-fonte</a></li>
<li>O <a href="../index.php?title=Hub_de_usu%C3%A1rios_avan%C3%A7ados&amp;action=edit&amp;redlink=1.html" class="new" title="Hub de usu&aacute;rios avan&ccedil;ados (page does not exist)">Hub de usu&aacute;rios avan&ccedil;ados</a> cont&eacute;m muita documenta&ccedil;&atilde;o sobre m&oacute;dulos, OpenCascade e Coin3D, principalmente para o programador Python. No entanto, como a funcionalidade &eacute; semelhante, estas p&aacute;ginas tamb&eacute;m ser&atilde;o de interesse para o programador C++.</li>
<li><a href="../File_Format_FCStd.html" title="File Format FCStd">FCStd</a> - o formato de arquivo FreeCAD</li></ul>
<!-- 
NewPP limit report
Cached time: 20250705145532
Cache expiry: 86400
Reduced expiry: false
Complications: [no&#8208;toc&#8208;conversion]
CPU time usage: 0.024 seconds
Real time usage: 0.058 seconds
Preprocessor visited node count: 9/1000000
Post&#8208;expand include size: 6/2097152 bytes
Template argument size: 0/2097152 bytes
Highest expansion depth: 2/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1756/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    0.000      1 -total
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:151309-0!canonical and timestamp 20250705145532 and revision id 1603480. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>