<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Document structure/bg</span></h1><?xml encoding="UTF-8"><div class="mw-parser-output"><div class="mw-pt-languages noprint" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../id/Document_structure.html" class="mw-pt-progress mw-pt-progress--stub" title="Document structure (6% translated)" lang="id" dir="ltr">Bahasa Indonesia</a></li>
<li><a href="../de/Document_structure.html" class="mw-pt-progress mw-pt-progress--complete" title="Dokumentstruktur (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Document_structure.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Document structure (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../tr/Document_structure.html" class="mw-pt-progress mw-pt-progress--high" title="Belge yap&#305;s&#305; (72% translated)" lang="tr" dir="ltr">T&uuml;rk&ccedil;e</a></li>
<li><a href="../es/Document_structure.html" class="mw-pt-progress mw-pt-progress--high" title="Estructura del documento (61% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/Document_structure.html" class="mw-pt-progress mw-pt-progress--complete" title="Structure d'un document (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../hr/Document_structure.html" class="mw-pt-progress mw-pt-progress--stub" title="FreeCAD-Dokument (6% translated)" lang="hr" dir="ltr">hrvatski</a></li>
<li><a href="../it/Document_structure.html" class="mw-pt-progress mw-pt-progress--complete" title="Struttura del documento (100% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Document_structure.html" class="mw-pt-progress mw-pt-progress--complete" title="Struktura dokumentu (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt/Document_structure.html" class="mw-pt-progress mw-pt-progress--med" title="Estrutura do documento (56% translated)" lang="pt" dir="ltr">portugu&ecirc;s</a></li>
<li><a href="../pt-br/Document_structure.html" class="mw-pt-progress mw-pt-progress--complete" title="Estrutura do documento (100% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../ro/Document_structure.html" class="mw-pt-progress mw-pt-progress--high" title="Structura unui document/fi&#537;ier &icirc;n FreeCAD (72% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><a href="../sv/Document_structure.html" class="mw-pt-progress mw-pt-progress--high" title="Document structure (61% translated)" lang="sv" dir="ltr">svenska</a></li>
<li><a href="../cs/Document_structure.html" class="mw-pt-progress mw-pt-progress--high" title="Struktura dokumentu (61% translated)" lang="cs" dir="ltr">&#269;e&scaron;tina</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--med" lang="bg" dir="ltr">&#1073;&#1098;&#1083;&#1075;&#1072;&#1088;&#1089;&#1082;&#1080;</span></li>
<li><a href="../ru/Document_structure.html" class="mw-pt-progress mw-pt-progress--complete" title="&#1057;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; (100% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li>
<li><a href="../uk/Document_structure.html" class="mw-pt-progress mw-pt-progress--stub" title="Document structure (6% translated)" lang="uk" dir="ltr">&#1091;&#1082;&#1088;&#1072;&#1111;&#1085;&#1089;&#1100;&#1082;&#1072;</a></li>
<li><a href="../zh/Document_structure.html" class="mw-pt-progress mw-pt-progress--high" title="&#25991;&#26723;&#32467;&#26500; (72% translated)" lang="zh" dir="ltr">&#20013;&#25991;</a></li>
<li><a href="../zh-cn/Document_structure.html" class="mw-pt-progress mw-pt-progress--high" title="&#25991;&#26723;&#32467;&#26500; (61% translated)" lang="zh-Hans-CN" dir="ltr">&#20013;&#25991;&#65288;&#20013;&#22269;&#22823;&#38470;&#65289;</a></li>
<li><a href="../ja/Document_structure.html" class="mw-pt-progress mw-pt-progress--stub" title="FreeCAD&#12501;&#12449;&#12452;&#12523;&#12398;&#27083;&#36896; (17% translated)" lang="ja" dir="ltr">&#26085;&#26412;&#35486;</a></li>
<li><a href="../ko/Document_structure.html" class="mw-pt-progress mw-pt-progress--med" title="&#47928;&#49436; &#44396;&#51312; (56% translated)" lang="ko" dir="ltr">&#54620;&#44397;&#50612;</a></li></ul></div>
<div class="docnav" style="background-color: #ececef; border: 1px solid #a2a9b1; padding: 2px 10px; margin: 10px 0; line-height: 1; clear: both; overflow: hidden;">
    <div style="margin: 4px 0; float: left;"><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-left.svg" decoding="async" width="16" height="16"></span></span> <a href="../Navigation_Cube.html" title="Navigation Cube">Navigation Cube</a></div>
    <div style="margin: 4px 0; float: right;"><a href="../Property_editor.html" title="Property editor">Property editor</a>
 <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-right.svg" decoding="async" width="16" height="16"></span></span></div>
    <div style="text-align:center"><a href="../bg/Online_Help_Toc.html" title="Online Help Toc/bg">Index</a> <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Online_Help_Toc.svg" decoding="async" width="24" height="24"></span></span></div>
</div>
<div style="clear:right; margin-bottom: .5em; float: right; padding: .5em 0 .8em 1.4em; background: none;"><div id="toc" class="toc" role="navigation" aria-labelledby="mw-toc-heading"><input type="checkbox" role="button" id="toctogglecheckbox" class="toctogglecheckbox" style="display:none"><div class="toctitle" lang="en" dir="ltr"><h2 id="mw-toc-heading">Contents</h2><span class="toctogglespan"><label class="toctogglelabel" for="toctogglecheckbox"></label></span></div>
<ul>
<li class="toclevel-1 tocsection-1"><a href="#Application_and_User_Interface"><span class="tocnumber">1</span> <span class="toctext">Application and User Interface</span></a></li>
<li class="toclevel-1 tocsection-2"><a href="#%D0%A1%D0%BA%D1%80%D0%BF%D0%B8%D1%82%D0%B8%D1%80%D0%B0%D0%BD%D0%B5"><span class="tocnumber">2</span> <span class="toctext">&#1057;&#1082;&#1088;&#1087;&#1080;&#1090;&#1080;&#1088;&#1072;&#1085;&#1077;</span></a></li>
</ul>
</div>
</div>
<figure class="mw-default-size mw-halign-left" typeof="mw:File"><a href="../File/Screenshot_treeview.jpg" class="mw-file-description"><img src="../File/Screenshot_treeview.jpg" decoding="async" width="350" height="438"></a><figcaption></figcaption></figure>
<p>&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1098;&#1090; &#1074; FreeCAD &#1089;&#1077; &#1089;&#1098;&#1089;&#1090;&#1086;&#1080; &#1086;&#1090; &#1074;&#1089;&#1080;&#1095;&#1082;&#1080; &#1086;&#1073;&#1077;&#1082;&#1090;&#1080; &#1074;&#1098;&#1074; &#1074;&#1072;&#1096;&#1072;&#1090;&#1072; &#1089;&#1094;&#1077;&#1085;&#1072;. &#1052;&#1086;&#1078;&#1077; &#1076;&#1072; &#1089;&#1098;&#1076;&#1098;&#1088;&#1078;&#1072; &#1075;&#1088;&#1091;&#1087;&#1080; &#1086;&#1090; &#1086;&#1073;&#1077;&#1082;&#1090;&#1080; (&#1089;&#1072;&#1084;&#1072;&#1090;&#1072; &#1075;&#1088;&#1091;&#1087;&#1072; &#1084;&#1086;&#1078;&#1077; &#1076;&#1072; &#1089;&#1077; &#1090;&#1088;&#1077;&#1090;&#1080;&#1088;&#1072; &#1082;&#1072;&#1090;&#1086; &#1086;&#1073;&#1077;&#1082;&#1090;). &#1045;&#1076;&#1080;&#1085; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; &#1084;&#1086;&#1078;&#1077; &#1076;&#1072; &#1089;&#1098;&#1076;&#1098;&#1088;&#1078;&#1072; &#1077;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086; &#1086;&#1073;&#1077;&#1082;&#1090;&#1080; &#1086;&#1090; &#1074;&#1089;&#1077;&#1082;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077;&#1085; &#1087;&#1083;&#1086;&#1090;. &#1052;&#1086;&#1078;&#1077; &#1076;&#1072; &#1089;&#1084;&#1077;&#1085;&#1103;&#1090;&#1077; &#1084;&#1077;&#1078;&#1076;&#1091; &#1088;&#1072;&#1073;&#1086;&#1090;&#1085;&#1080;&#1090;&#1077; &#1087;&#1083;&#1086;&#1090;&#1086;&#1074;&#1077; &#1082;&#1086;&#1083;&#1082;&#1086;&#1090;&#1086; &#1095;&#1077;&#1089;&#1090;&#1086; &#1078;&#1077;&#1083;&#1072;&#1077;&#1090;&#1077; &#1076;&#1086;&#1082;&#1072;&#1090;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1080;&#1090;&#1077; &#1074;&#1098;&#1088;&#1093;&#1091; &#1077;&#1076;&#1080;&#1085; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;. &#1062;&#1077;&#1083;&#1080;&#1103; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; (&#1089;&#1098;&#1089; &#1074;&#1089;&#1080;&#1095;&#1082;&#1080; &#1089;&#1098;&#1079;&#1076;&#1072;&#1076;&#1077;&#1085;&#1080; &#1086;&#1073;&#1077;&#1082;&#1090;&#1080;) &#1089;&#1077; &#1079;&#1072;&#1087;&#1072;&#1079;&#1074;&#1072; &#1074;&#1098;&#1088;&#1093;&#1091; &#1090;&#1074;&#1098;&#1088;&#1076;&#1080;&#1103; &#1076;&#1080;&#1089;&#1082; &#1074;&#1089;&#1077;&#1082;&#1080; &#1087;&#1098;&#1090; &#1082;&#1086;&#1075;&#1072;&#1090;&#1086; &#1085;&#1072;&#1090;&#1080;&#1089;&#1085;&#1077;&#1090;&#1077; Save. &#1052;&#1086;&#1078;&#1077; &#1076;&#1072; &#1086;&#1090;&#1074;&#1086;&#1088;&#1080;&#1090;&#1077; &#1085;&#1103;&#1082;&#1086;&#1083;&#1082;&#1086; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &#1077;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086; &#1074; FreeCAD, &#1082;&#1072;&#1082;&#1090;&#1086; &#1080; &#1076;&#1072; &#1086;&#1090;&#1074;&#1086;&#1088;&#1080;&#1090;&#1077; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1080; &#1080;&#1079;&#1075;&#1083;&#1077;&#1076;&#1080; &#1082;&#1098;&#1084; &#1089;&#1098;&#1097;&#1080;&#1103; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;.
</p>
<div class="mw-translate-fuzzy">
<p>&#1042; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1098;&#1090; &#1086;&#1073;&#1077;&#1082;&#1090;&#1080;&#1090;&#1077; &#1084;&#1086;&#1078;&#1077; &#1076;&#1072; &#1089;&#1077; &#1089;&#1098;&#1073;&#1080;&#1088;&#1072;&#1090; &#1074; &#1075;&#1088;&#1091;&#1087;&#1080;, &#1082;&#1072;&#1090;&#1086; &#1074;&#1089;&#1077;&#1082;&#1080; &#1086;&#1073;&#1077;&#1082;&#1090; (&#1080; &#1074;&#1089;&#1103;&#1082;&#1072; &#1075;&#1088;&#1091;&#1087;&#1072;) &#1080;&#1084;&#1072;&#1090; &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1085;&#1086; &#1080;&#1084;&#1077;. &#1058;&#1098;&#1081; &#1082;&#1072;&#1090;&#1086; &#1074;&#1089;&#1103;&#1082;&#1072; &#1075;&#1088;&#1091;&#1087;&#1072; &#1089;&#1072;&#1084;&#1072; &#1087;&#1086; &#1089;&#1077;&#1073;&#1077; &#1089;&#1080; &#1089;&#1098;&#1097;&#1086; &#1077; &#1086;&#1073;&#1077;&#1082;&#1090;, &#1084;&#1086;&#1078;&#1077; &#1076;&#1072; &#1073;&#1098;&#1076;&#1077; &#1089;&#1083;&#1086;&#1078;&#1077;&#1085;&#1072; &#1074; &#1076;&#1088;&#1091;&#1075;&#1072; &#1075;&#1088;&#1091;&#1087;&#1072;. &#1058;&#1072;&#1082;&#1072; &#1075;&#1088;&#1091;&#1087;&#1080;&#1090;&#1077; &#1080; &#1086;&#1073;&#1077;&#1082;&#1090;&#1080;&#1090;&#1077; &#1086;&#1073;&#1088;&#1072;&#1079;&#1091;&#1074;&#1072;&#1090; &#1076;&#1098;&#1088;&#1074;&#1086;. &#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;&#1090;&#1086; &#1085;&#1072; &#1075;&#1088;&#1091;&#1087;&#1080;, &#1086;&#1073;&#1077;&#1082;&#1090;&#1080; &#1080; &#1090;&#1077;&#1093;&#1085;&#1080;&#1090;&#1077; &#1080;&#1084;&#1077;&#1085;&#1072; &#1089;&#1077; &#1080;&#1079;&#1074;&#1098;&#1088;&#1096;&#1074;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086; &#1074; &#1087;&#1088;&#1086;&#1079;&#1086;&#1088;&#1077;&#1094;&#1072; Tree view (&#1087;&#1088;&#1086;&#1079;&#1086;&#1088;&#1077;&#1094;&#1072; &#1089;&#1098;&#1076;&#1098;&#1088;&#1078;&#1072;&#1097; &#1076;&#1098;&#1088;&#1074;&#1086;&#1090;&#1086; &#1085;&#1072; &#1086;&#1073;&#1077;&#1082;&#1090;&#1080;&#1090;&#1077;). &#1057;&#1098;&#1097;&#1086; &#1084;&#1086;&#1078;&#1077; &#1076;&#1072; &#1089;&#1077; &#1080;&#1079;&#1074;&#1098;&#1088;&#1096;&#1074;&#1072; &#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1086;&#1090; python.. &#1042; &#1087;&#1088;&#1086;&#1079;&#1086;&#1088;&#1077;&#1094;&#1098;&#1090; Tree view &#1084;&#1086;&#1078;&#1077; &#1076;&#1072; &#1089;&#1098;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1077; &#1075;&#1088;&#1091;&#1087;&#1080;, &#1076;&#1072; &#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1077; &#1086;&#1073;&#1077;&#1082;&#1090;&#1080; &#1084;&#1077;&#1078;&#1076;&#1091; &#1075;&#1088;&#1091;&#1087;&#1080;, &#1076;&#1072; &#1080;&#1079;&#1090;&#1088;&#1080;&#1074;&#1072;&#1090;&#1077; &#1086;&#1073;&#1077;&#1082;&#1090;&#1080; &#1080;&#1083;&#1080; &#1075;&#1088;&#1091;&#1087;&#1080; (&#1085;&#1072;&#1090;&#1080;&#1089;&#1085;&#1077;&#1090;&#1077; &#1076;&#1077;&#1089;&#1085;&#1080;&#1103; &#1073;&#1091;&#1090;&#1086;&#1085; &#1074;&#1098;&#1088;&#1093;&#1091; &#1086;&#1073;&#1077;&#1082;&#1090;&#1072;/&#1075;&#1088;&#1091;&#1087;&#1072;&#1090;&#1072; &#1080; &#1080;&#1079;&#1073;&#1077;&#1088;&#1077;&#1090;&#1077; Delete &#1086;&#1090; &#1087;&#1086;&#1103;&#1074;&#1080;&#1083;&#1086;&#1090;&#1086; &#1089;&#1077; &#1084;&#1077;&#1085;&#1102;) &#1080; &#1076;&#1072; &#1087;&#1088;&#1086;&#1084;&#1077;&#1085;&#1103;&#1090;&#1077; &#1080;&#1084;&#1077;&#1090;&#1086; &#1085;&#1072; &#1086;&#1073;&#1077;&#1082;&#1090;/&#1075;&#1088;&#1091;&#1087;&#1072; (&#1085;&#1072;&#1090;&#1080;&#1089;&#1085;&#1077;&#1090;&#1077; 2 &#1087;&#1098;&#1090;&#1080; &#1083;&#1077;&#1074;&#1080;&#1103; &#1073;&#1091;&#1090;&#1086;&#1085; &#1085;&#1072; &#1084;&#1080;&#1096;&#1082;&#1072;&#1090;&#1072; &#1074;&#1098;&#1088;&#1093;&#1091; &#1086;&#1073;&#1077;&#1082;&#1090;&#1072;). &#1042; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090; &#1086;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1085;&#1080;&#1103; &#1087;&#1083;&#1086;&#1090; &#1080;&#1079;&#1073;&#1088;&#1072;&#1085; &#1074; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;&#1072;, &#1084;&#1086;&#1078;&#1077; &#1076;&#1072; &#1080;&#1084;&#1072;&#1090;&#1077; &#1076;&#1086;&#1089;&#1090;&#1098;&#1087; &#1080; &#1076;&#1086; &#1076;&#1088;&#1091;&#1075;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1074; &#1087;&#1088;&#1086;&#1079;&#1086;&#1088;&#1077;&#1094;&#1072;.
</p>
</div>
<div class="mw-translate-fuzzy">
<p>&#1054;&#1073;&#1077;&#1082;&#1090;&#1080;&#1090;&#1077; &#1074; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &#1080;&#1084;&#1072;&#1090; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1080; &#1090;&#1080;&#1087;&#1086;&#1074;&#1077;. &#1042;&#1089;&#1077;&#1082;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077;&#1085; &#1087;&#1083;&#1086;&#1090; &#1084;&#1086;&#1078;&#1077; &#1076;&#1072; &#1089;&#1098;&#1079;&#1076;&#1072;&#1074;&#1072; &#1086;&#1073;&#1077;&#1082;&#1090;&#1080; &#1086;&#1090; &#1089;&#1074;&#1086;&#1080;&#1090;&#1077; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1080; &#1090;&#1080;&#1087;&#1086;&#1074;&#1077;. &#1053;&#1072;&#1096;&#1088;&#1080;&#1084;&#1077;&#1088; <a href="../Mesh_Workbench.html" title="Mesh Workbench">Mesh Workbench</a> &#1089;&#1098;&#1079;&#1076;&#1072;&#1074;&#1072; mesh &#1086;&#1073;&#1077;&#1082;&#1090;&#1080; (3D &#1087;&#1086;&#1074;&#1098;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1080; &#1080;&#1079;&#1075;&#1088;&#1072;&#1076;&#1077;&#1085;&#1080; &#1086;&#1090; &#1090;&#1088;&#1080;&#1098;&#1075;&#1098;&#1083;&#1085;&#1080;&#1094;&#1080;) , <a href="../Part_Workbench.html" title="Part Workbench">Part Workbench</a> &#1089;&#1098;&#1079;&#1076;&#1072;&#1074;&#1072; Part &#1086;&#1073;&#1082;&#1077;&#1090;&#1080; (&#1077;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1080; &#1080;&#1079;&#1075;&#1088;&#1072;&#1076;&#1077;&#1085;&#1080; &#1086;&#1090; &#1087;&#1086;-&#1087;&#1088;&#1086;&#1089;&#1090;&#1080; &#1092;&#1086;&#1088;&#1084;&#1080;), <a href="../Draft_Workbench.html" title="Draft Workbench">Draft Workbench</a> &#1089;&#1098;&#1097;&#1086; &#1089;&#1098;&#1079;&#1072;&#1076;&#1072;&#1074;&#1072; Part &#1086;&#1073;&#1077;&#1082;&#1090;&#1080;, &#1080; &#1090;.&#1085;.
</p>
</div>
<p>&#1044;&#1086;&#1088;&#1080; &#1076;&#1072; &#1080;&#1084;&#1072; &#1085;&#1103;&#1082;&#1086;&#1083;&#1082;&#1086; &#1077;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086; &#1086;&#1090;&#1074;&#1086;&#1088;&#1077;&#1085;&#1080; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1080; &#1074; FreeCAD, &#1089;&#1072;&#1084;&#1086; &#1077;&#1076;&#1080;&#1085; &#1086;&#1090; &#1090;&#1103;&#1093; &#1084;&#1086;&#1078;&#1077; &#1076;&#1072; &#1073;&#1098;&#1076;&#1077; &#1072;&#1082;&#1090;&#1080;&#1074;&#1077;&#1085; &#1074; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;. &#1040;&#1082;&#1090;&#1080;&#1074;&#1085;&#1080;&#1103; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; &#1077; &#1090;&#1086;&#1079;&#1080; &#1095;&#1080;&#1080;&#1090;&#1086; &#1086;&#1073;&#1077;&#1082;&#1090;&#1080; &#1089;&#1077; &#1074;&#1080;&#1078;&#1076;&#1072;&#1090; &#1074; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;&#1072; &#1074; &#1087;&#1088;&#1086;&#1079;&#1086;&#1088;&#1077;&#1094;&#1072; 3D view.
</p>
<h2><span class="mw-headline" id="Application_and_User_Interface">Application and User Interface</span></h2>
<div class="mw-translate-fuzzy">
<p>&#1042; FreeCAD, &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1080;&#1090;&#1077;&#1083;&#1089;&#1082;&#1080;&#1103; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;(Gui) &#1077; &#1086;&#1090;&#1076;&#1077;&#1083;&#1077;&#1085; &#1084;&#1086;&#1076;&#1091;&#1083; &#1086;&#1090; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1090;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1072; (App). &#1057;&#1098;&#1097;&#1086;&#1090;&#1086; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1086; &#1074;&#1072;&#1078;&#1080; &#1080; &#1079;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1080;&#1090;&#1077;. &#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &#1089;&#1077; &#1089;&#1098;&#1089;&#1090;&#1086;&#1080; &#1086;&#1090; 2 &#1095;&#1072;&#1089;&#1090;&#1080;: Application &#1095;&#1072;&#1089;&#1090;&#1090;&#1072;,&#1082;&#1086;&#1103;&#1090;&#1086; &#1089;&#1098;&#1076;&#1098;&#1088;&#1078;&#1072; &#1085;&#1072;&#1096;&#1080;&#1090;&#1077; &#1086;&#1073;&#1077;&#1082;&#1090;&#1080; (&#1074;&#1080;&#1076;&#1080;&#1084;&#1072; &#1074; Tree View) &#1080; View &#1095;&#1072;&#1089;&#1090;&#1090;&#1072;, &#1082;&#1086;&#1103;&#1090;&#1086; &#1089;&#1098;&#1076;&#1098;&#1088;&#1078;&#1072; &#1088;&#1077;&#1087;&#1088;&#1077;&#1079;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103;&#1090;&#1072; &#1085;&#1072; &#1077;&#1082;&#1088;&#1072;&#1085;&#1072; &#1085;&#1072; &#1074;&#1072;&#1096;&#1080;&#1090;&#1077; &#1086;&#1073;&#1077;&#1082;&#1090;&#1080; (&#1074;&#1080;&#1076;&#1080;&#1084;&#1072; &#1074; 3D View &#1087;&#1088;&#1086;&#1079;&#1086;&#1088;&#1077;&#1094;&#1072;).
</p>
</div> 
<div class="mw-translate-fuzzy">
<p>&#1044;&#1077;&#1092;&#1080;&#1085;&#1080;&#1094;&#1080;&#1080;&#1090;&#1077; &#1085;&#1072; &#1074;&#1072;&#1096;&#1080;&#1090;&#1077; &#1086;&#1073;&#1077;&#1082;&#1090;&#1080; &#1089;&#1072; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080; &#1085;&#1072; 2 &#1095;&#1072;&#1089;&#1090;&#1080;. &#1058;&#1077;&#1093;&#1085;&#1080;&#1090;&#1077; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1074;&#1085;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1080; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1092;&#1086;&#1088;&#1084;&#1072; - &#1076;&#1072;&#1083;&#1080; &#1077; &#1082;&#1091;&#1073;? &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1090;&#1077;? &#1080; &#1090;.&#1085;.) &#1089;&#1077; &#1085;&#1072;&#1084;&#1080;&#1088;&#1072;&#1090; &#1074; Application &#1095;&#1072;&#1089;&#1090;&#1090;&#1072; &#1085;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;, &#1076;&#1086;&#1082;&#1072;&#1090;&#1086; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1085;&#1086;&#1090;&#1086; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; (&#1089; &#1082;&#1072;&#1082;&#1098;&#1074; &#1094;&#1074;&#1103;&#1090; &#1083;&#1080;&#1085;&#1080;&#1080; &#1077; &#1085;&#1072;&#1088;&#1080;&#1089;&#1091;&#1074;&#1072;&#1085; &#1086;&#1073;&#1077;&#1082;&#1090;&#1072;? &#1057; &#1082;&#1072;&#1082;&#1098;&#1074; &#1094;&#1074;&#1103;&#1090; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;?) &#1089;&#1077; &#1085;&#1072;&#1084;&#1080;&#1088;&#1072; &#1074; View &#1095;&#1072;&#1089;&#1090;&#1090;&#1072; &#1085;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;. &#1058;&#1086;&#1074;&#1072; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1077; &#1089; &#1094;&#1077;&#1083; &#1076;&#1072; &#1084;&#1086;&#1078;&#1077; &#1076;&#1072; &#1089;&#1077; &#1080;&#1079;&#1087;&#1086;&#1083;&#1079;&#1074;&#1072; FreeCAD &#1080; &#1089;&#1098;&#1089; &#1080; &#1073;&#1077;&#1079; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1085; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; FreeCAD &#1084;&#1086;&#1078;&#1077; &#1076;&#1072; &#1089;&#1077; &#1074;&#1085;&#1077;&#1076;&#1088;&#1103;&#1074;&#1072; &#1074; &#1076;&#1088;&#1091;&#1075;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1080;, &#1082;&#1098;&#1076;&#1077;&#1090;&#1086; &#1076;&#1072; &#1084;&#1072;&#1085;&#1080;&#1087;&#1091;&#1083;&#1080;&#1088;&#1072; &#1086;&#1073;&#1077;&#1082;&#1090;&#1080; &#1076;&#1086;&#1088;&#1080; &#1080; &#1076;&#1072; &#1085;&#1077; &#1088;&#1080;&#1089;&#1091;&#1074;&#1072; &#1085;&#1080;&#1097;&#1086; &#1085;&#1072; &#1077;&#1082;&#1088;&#1072;&#1085;&#1072;.
</p>
</div>
<p>&#1042;&#1098;&#1074; &#1074;&#1072;&#1096;&#1080;&#1103; &#1086;&#1090;&#1074;&#1086;&#1088;&#1077;&#1085; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;, &#1074; View &#1095;&#1072;&#1089;&#1090;&#1090;&#1072; &#1080;&#1084;&#1072;&#1090;&#1077; 3D &#1080;&#1079;&#1075;&#1083;&#1077;&#1076;&#1080; &#1082;&#1098;&#1084; &#1074;&#1072;&#1096;&#1080;&#1090;&#1077; &#1086;&#1073;&#1077;&#1082;&#1090;&#1080;. &#1042; &#1077;&#1076;&#1080;&#1085; &#1080; &#1089;&#1098;&#1097;&#1080; &#1072;&#1082;&#1090;&#1080;&#1074;&#1077;&#1085; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; &#1084;&#1086;&#1078;&#1077; &#1076;&#1072; &#1086;&#1090;&#1074;&#1086;&#1088;&#1080;&#1090;&#1077; &#1085;&#1103;&#1082;&#1086;&#1083;&#1082;&#1086; &#1080;&#1079;&#1075;&#1083;&#1077;&#1076;&#1080; &#1077;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;, &#1090;&#1072;&#1082;&#1072; &#1095;&#1077; &#1076;&#1072; &#1088;&#1072;&#1079;&#1075;&#1083;&#1077;&#1076;&#1072;&#1090;&#1077; &#1074;&#1072;&#1096;&#1080;&#1103; &#1086;&#1073;&#1077;&#1082;&#1090; &#1086;&#1090; &#1085;&#1103;&#1082;&#1086;&#1083;&#1082;&#1086; &#1075;&#1083;&#1077;&#1076;&#1085;&#1080; &#1090;&#1086;&#1095;&#1082;&#1080;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1084;&#1086;&#1078;&#1077; &#1076;&#1072; &#1086;&#1090;&#1074;&#1086;&#1088;&#1080;&#1090;&#1077; &#1087;&#1086;&#1075;&#1083;&#1077;&#1076; &#1086;&#1090;&#1075;&#1086;&#1088;&#1077; &#1080; &#1086;&#1090;&#1087;&#1088;&#1077;&#1076; &#1082;&#1098;&#1084; &#1074;&#1072;&#1096;&#1080;&#1103; &#1086;&#1073;&#1077;&#1082;&#1090; &#1077;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;? &#1058;&#1086;&#1075;&#1072;&#1074;&#1072; &#1074; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &#1074;&#1080; &#1097;&#1077; &#1080;&#1084;&#1072; 2 &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1080; &#1087;&#1086;&#1075;&#1083;&#1077;&#1076;&#1072;. &#1052;&#1086;&#1078;&#1077; &#1076;&#1072; &#1086;&#1090;&#1074;&#1072;&#1088;&#1103;&#1090;&#1077; &#1080; &#1079;&#1072;&#1090;&#1074;&#1072;&#1088;&#1103;&#1090;&#1077; &#1085;&#1086;&#1074;&#1080; &#1087;&#1086;&#1075;&#1083;&#1077;&#1076;&#1080; &#1086;&#1090; &#1084;&#1077;&#1085;&#1102;&#1090;&#1086; View &#1080;&#1083;&#1080; &#1082;&#1072;&#1090;&#1086; &#1085;&#1072;&#1090;&#1080;&#1089;&#1085;&#1077;&#1090;&#1077; &#1076;&#1077;&#1089;&#1085;&#1080;&#1103; &#1073;&#1091;&#1090;&#1086;&#1085; &#1074;&#1098;&#1088;&#1093;&#1091; &#1090;&#1072;&#1073;-&#1072; view.
</p><p><span id="Scripting"></span>
</p>
<h2><span id=".D0.A1.D0.BA.D1.80.D0.BF.D0.B8.D1.82.D0.B8.D1.80.D0.B0.D0.BD.D0.B5"></span><span class="mw-headline" id="&#1057;&#1082;&#1088;&#1087;&#1080;&#1090;&#1080;&#1088;&#1072;&#1085;&#1077;">&#1057;&#1082;&#1088;&#1087;&#1080;&#1090;&#1080;&#1088;&#1072;&#1085;&#1077;</span></h2>
<div class="mw-translate-fuzzy">
<p>&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; &#1084;&#1086;&#1078;&#1077; &#1083;&#1077;&#1089;&#1085;&#1086; &#1076;&#1072; &#1089;&#1077; &#1089;&#1098;&#1079;&#1076;&#1072;&#1074;&#1072; &#1080; &#1084;&#1072;&#1085;&#1080;&#1087;&#1091;&#1083;&#1080;&#1088;&#1072; &#1086;&#1090; &#1080;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1077;&#1090;&#1072;&#1090;&#1086;&#1088;&#1098;&#1090; &#1085;&#1072;  python. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;:
</p>
</div>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">FreeCAD</span><span class="o">.</span><span class="n">ActiveDocument</span>
</pre></div>
<p>&#1065;&#1077; &#1074;&#1098;&#1088;&#1085;&#1077; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1080;&#1103; &#1074; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;.
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">FreeCAD</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">Blob</span>
</pre></div>
<p>&#1065;&#1077; &#1074;&#1098;&#1088;&#1085;&#1077; &#1086;&#1073;&#1077;&#1082;&#1090; &#1085;&#1072;&#1088;&#1077;&#1095;&#1077;&#1085; "Blob" &#1074;&#1098;&#1090;&#1088;&#1077; &#1074; &#1074;&#1072;&#1096;&#1080;&#1103; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;.
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">FreeCADGui</span><span class="o">.</span><span class="n">ActiveDocument</span>
</pre></div>
<p>&#1065;&#1077; &#1074;&#1098;&#1088;&#1085;&#1077; &#1086;&#1090;&#1074;&#1086;&#1088;&#1077;&#1085;&#1080;&#1103; 3D &#1087;&#1086;&#1075;&#1083;&#1077;&#1076; &#1089;&#1074;&#1098;&#1088;&#1079;&#1072;&#1085; &#1089; &#1074;&#1072;&#1096;&#1080;&#1103; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;.
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">FreeCADGui</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">Blob</span>
</pre></div>
<p>&#1065;&#1077; &#1074;&#1098;&#1088;&#1085;&#1077; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1085;&#1072;&#1090;&#1072; &#1088;&#1077;&#1087;&#1088;&#1077;&#1079;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1085;&#1072; &#1086;&#1073;&#1082;&#1077;&#1090;&#1072; Blob &#1074; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;.
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="n">FreeCADGui</span><span class="o">.</span><span class="n">ActiveDocument</span><span class="o">.</span><span class="n">ActiveView</span>
</pre></div>
<p>&#1065;&#1077; &#1074;&#1098;&#1088;&#1085;&#1077; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1080;&#1103; &#1080;&#1079;&#1075;&#1083;&#1077;&#1076; &#1074; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;&#1072;.
</p><p><br>
</p>
<div class="mw-translate-fuzzy">
<div class="docnav" style="background-color: #ececef; border: 1px solid #a2a9b1; padding: 2px 10px; margin: 10px 0; line-height: 1; clear: both; overflow: hidden;">
    <div style="margin: 4px 0; float: left;"><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-left.svg" decoding="async" width="16" height="16"></span></span> Mouse Model/bg</div>
    <div style="margin: 4px 0; float: right;">Preferences Editor/bg <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-right.svg" decoding="async" width="16" height="16"></span></span></div>
    <div style="text-align:center"><a href="../bg/Online_Help_Toc.html" title="Online Help Toc/bg">Index</a> <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Online_Help_Toc.svg" decoding="async" width="24" height="24"></span></span></div>
</div>
</div>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: #fefefe;"><span typeof="mw:File"><a href="../File/User_hub.png" class="mw-file-description"><img src="../File/User_hub.png" decoding="async" width="24" height="24"></a></span> <a href="../bg/User_hub.html" title="User hub/bg">User documentation</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid #aaaaaa; text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: #fefefe;">
<ul><li><b><a href="../bg/Getting_started.html" title="Getting started/bg">Getting started</a></b></li>
<li><b>Installation:</b> <a href="../bg/Download.html" title="Download/bg">Download</a>, <a href="../bg/Installing_on_Windows.html" title="Installing on Windows/bg">Windows</a>, <a href="../bg/Installing_on_Linux.html" title="Installing on Linux/bg">Linux</a>, <a href="../bg/Installing_on_Mac.html" title="Installing on Mac/bg">Mac</a>, <a href="../bg/Installing_additional_components.html" title="Installing additional components/bg">Additional components</a>, <a href="../index.php?title=Compile_on_Docker/bg&amp;action=edit&amp;redlink=1.html" class="new" title="Compile on Docker/bg (page does not exist)">Docker</a>, <a href="../index.php?title=AppImage/bg&amp;action=edit&amp;redlink=1.html" class="new" title="AppImage/bg (page does not exist)">AppImage</a>, <a href="../index.php?title=Ubuntu_Snap/bg&amp;action=edit&amp;redlink=1.html" class="new" title="Ubuntu Snap/bg (page does not exist)">Ubuntu Snap</a></li>
<li><b>Basics:</b> <a href="../bg/About_FreeCAD.html" title="About FreeCAD/bg">About FreeCAD</a>, <a href="../index.php?title=Interface/bg&amp;action=edit&amp;redlink=1.html" class="new" title="Interface/bg (page does not exist)">Interface</a>, <a href="../bg/Mouse_navigation.html" title="Mouse navigation/bg">Mouse navigation</a>, <a href="../index.php?title=Selection_methods/bg&amp;action=edit&amp;redlink=1.html" class="new" title="Selection methods/bg (page does not exist)">Selection methods</a>, <a href="../index.php?title=Object_name/bg&amp;action=edit&amp;redlink=1.html" class="new" title="Object name/bg (page does not exist)">Object name</a>, <a href="../bg/Preferences_Editor.html" title="Preferences Editor/bg">Preferences</a>, <a href="../bg/Workbenches.html" title="Workbenches/bg">Workbenches</a>, <a class="mw-selflink selflink">Document structure</a>, <a href="../index.php?title=Property/bg&amp;action=edit&amp;redlink=1.html" class="new" title="Property/bg (page does not exist)">Properties</a>, <a href="../bg/Help_FreeCAD.html" title="Help FreeCAD/bg">Help FreeCAD</a>, <a href="../index.php?title=Donate/bg&amp;action=edit&amp;redlink=1.html" class="new" title="Donate/bg (page does not exist)">Donate</a></li></ul>
<hr>
<ul><li><b>Help:</b> <a href="../bg/Tutorials.html" title="Tutorials/bg">Tutorials</a>, <a href="../index.php?title=Video_tutorials/bg&amp;action=edit&amp;redlink=1.html" class="new" title="Video tutorials/bg (page does not exist)">Video tutorials</a></li>
<li><b><a href="../bg/Workbenches.html" title="Workbenches/bg">Workbenches</a>:</b> <a href="../index.php?title=Std_Base/bg&amp;action=edit&amp;redlink=1.html" class="new" title="Std Base/bg (page does not exist)">Std Base</a>, <a href="../index.php?title=Assembly_Workbench/bg&amp;action=edit&amp;redlink=1.html" class="new" title="Assembly Workbench/bg (page does not exist)">Assembly</a>, <a href="../index.php?title=BIM_Workbench/bg&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Workbench/bg (page does not exist)">BIM</a>, <a href="../index.php?title=CAM_Workbench/bg&amp;action=edit&amp;redlink=1.html" class="new" title="CAM Workbench/bg (page does not exist)">CAM</a>, <a href="../bg/Draft_Workbench.html" title="Draft Workbench/bg">Draft</a>, <a href="../index.php?title=FEM_Workbench/bg&amp;action=edit&amp;redlink=1.html" class="new" title="FEM Workbench/bg (page does not exist)">FEM</a>, <a href="../index.php?title=Inspection_Workbench/bg&amp;action=edit&amp;redlink=1.html" class="new" title="Inspection Workbench/bg (page does not exist)">Inspection</a>, <a href="../index.php?title=Material_Workbench/bg&amp;action=edit&amp;redlink=1.html" class="new" title="Material Workbench/bg (page does not exist)">Material</a>, <a href="../bg/Mesh_Workbench.html" title="Mesh Workbench/bg">Mesh</a>, <a href="../index.php?title=OpenSCAD_Workbench/bg&amp;action=edit&amp;redlink=1.html" class="new" title="OpenSCAD Workbench/bg (page does not exist)">OpenSCAD</a>, <a href="../index.php?title=Part_Workbench/bg&amp;action=edit&amp;redlink=1.html" class="new" title="Part Workbench/bg (page does not exist)">Part</a>, <a href="../bg/PartDesign_Workbench.html" title="PartDesign Workbench/bg">PartDesign</a>, <a href="../index.php?title=Points_Workbench/bg&amp;action=edit&amp;redlink=1.html" class="new" title="Points Workbench/bg (page does not exist)">Points</a>, <a href="../index.php?title=Reverse_Engineering_Workbench/bg&amp;action=edit&amp;redlink=1.html" class="new" title="Reverse Engineering Workbench/bg (page does not exist)">Reverse Engineering</a>, <a href="../bg/Robot_Workbench.html" title="Robot Workbench/bg">Robot</a>, <a href="../bg/Sketcher_Workbench.html" title="Sketcher Workbench/bg">Sketcher</a>, <a href="../bg/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/bg">Spreadsheet</a>, <a href="../bg/Surface_Workbench.html" title="Surface Workbench/bg">Surface</a>, <a href="../bg/TechDraw_Workbench.html" title="TechDraw Workbench/bg">TechDraw</a>, <a href="../index.php?title=Testing/bg&amp;action=edit&amp;redlink=1.html" class="new" title="Testing/bg (page does not exist)">Test Framework</a></li></ul>
<hr>
<ul><li><b><a href="../index.php?title=Addon/bg&amp;action=edit&amp;redlink=1.html" class="new" title="Addon/bg (page does not exist)">Addons</a>:</b> <a href="../index.php?title=Std_AddonMgr/bg&amp;action=edit&amp;redlink=1.html" class="new" title="Std AddonMgr/bg (page does not exist)">Addon Manager</a>, <a href="../index.php?title=External_workbenches/bg&amp;action=edit&amp;redlink=1.html" class="new" title="External workbenches/bg (page does not exist)">External workbenches</a>, <a href="../index.php?title=Scripting_and_macros/bg&amp;action=edit&amp;redlink=1.html" class="new" title="Scripting and macros/bg (page does not exist)">Scripting and macros</a></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="../bg/User_hub.html" title="User hub/bg">User hub</a>, <a href="../index.php?title=Power_users_hub/bg&amp;action=edit&amp;redlink=1.html" class="new" title="Power users hub/bg (page does not exist)">Power users hub</a>, <a href="../index.php?title=Developer_hub/bg&amp;action=edit&amp;redlink=1.html" class="new" title="Developer hub/bg (page does not exist)">Developer hub</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20250123160934
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc, no&#8208;toc&#8208;conversion]
CPU time usage: 0.106 seconds
Real time usage: 0.117 seconds
Preprocessor visited node count: 201/1000000
Post&#8208;expand include size: 7665/2097152 bytes
Template argument size: 2259/2097152 bytes
Highest expansion depth: 5/100
Expensive parser function count: 5/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 5120/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    8.868      1 -total
 40.63%    3.603      1 Template:Userdocnavi/bg
 27.46%    2.435      5 Template:Code
 17.12%    1.518      2 Template:Docnav
 16.64%    1.476      1 Template:Navigation_menu_2
  9.16%    0.812      1 Template:TOCright
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:77785-0!canonical and timestamp 20250123160934 and revision id 1536771. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>