<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Books/ko</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="ko" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Books&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/Books.html" class="mw-pt-progress mw-pt-progress--high" title="B&uuml;cher (77% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Books.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Books (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../fr/Books.html" class="mw-pt-progress mw-pt-progress--high" title="Livres (77% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../it/Books.html" class="mw-pt-progress mw-pt-progress--high" title="Libri (77% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Books.html" class="mw-pt-progress mw-pt-progress--high" title="Ksi&#261;&#380;ki o FreeCAD (77% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../ru/Books.html" class="mw-pt-progress mw-pt-progress--low" title="&#1050;&#1085;&#1080;&#1075;&#1080; (4% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--high" lang="ko" dir="ltr">&#54620;&#44397;&#50612;</span></li></ul></div>
<p>&#51060; &#54168;&#51060;&#51648;&#50640;&#45716; &#50864;&#47532;&#44032; &#50508;&#44256; &#51080;&#45716; FreeCAD&#50640; &#44288;&#54620; &#52293;&#51060; &#45208;&#50676;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<meta property="mw:PageProp/toc">
<h2><span id="FreeCAD_Beginner.E2.80.99s_Handbook"></span><span class="mw-headline" id="FreeCAD_Beginner&rsquo;s_Handbook">FreeCAD Beginner&rsquo;s Handbook</span></h2>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>By Aleksander Sadowski, published December 2025, paperback
</p>
</div>
<figure class="mw-default-size" typeof="mw:File/Thumb"><a href="../File/Freecad-beginners-handbook-book-cover.jpg" class="mw-file-description"><img alt="FreeCAD Beginners Handbook cover" src="../File/Freecad-beginners-handbook-book-cover.jpg" decoding="async" width="300" height="431" class="mw-file-element" data-file-width="1000" data-file-height="1436"></a><figcaption></figcaption></figure>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Learn 3D design with FreeCAD through real-world examples and hands-on projects.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>Discover the world of 3D design with FreeCAD, the free and open-source CAD software used by engineers, designers, and makers worldwide. This full-color, practical guide takes you step by step through a reliable modeling workflow, showing you how to create real-world products and inventions, and even complete a complex project like designing a Mars Rover from scratch to solidify your knowledge.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<ul><li>Gain the confidence to develop your own inventions, from initial idea to finished, 3D-printable product.</li>
<li>Learn the fundamentals of solid 3D modeling and how to apply them effectively in FreeCAD.</li>
<li>Create individual 3D parts using Part Design and Sketcher, then digitally assemble them to verify their function.</li>
<li>Prepare and export models for 3D printing using slicer software, ensuring your designs are ready for production.</li>
<li>Complete projects that teach real-world applications of 3D design, including practical gadgets and a Mars Rover project to consolidate your skills.</li></ul>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>By the end of this book, you will be able to design your own innovative gadgets, explore real-world engineering solutions, and confidently prepare models for 3D printing. The included Mars Rover project provides a challenging yet rewarding opportunity to apply all the techniques learned in a single, cohesive design.
</p>
</div>
<p><b><a rel="nofollow" class="external free" href="https://www.amazon.de/FreeCAD-Beginners-Handbook-Aleksander-Sadowski/dp/B0G9HXYYGX">https://www.amazon.de/FreeCAD-Beginners-Handbook-Aleksander-Sadowski/dp/B0G9HXYYGX</a></b>
</p>
<div style="clear:both"></div>
<h2><span class="mw-headline" id="FreeCAD_for_Makers">FreeCAD for Makers</span></h2>
<p>Jo Hinchliffe &#51200;&#51089;, 2022&#45380; 9&#50900; &#52636;&#54032;, &#47924;&#47308; eBook
</p>
<figure class="mw-default-size" typeof="mw:File/Thumb"><a href="../index.php?title=Freecad_book_concretedog.png&amp;filetimestamp=20220921094257&amp;.html" class="mw-file-description"><img src="../File/Freecad_book_concretedog.png" decoding="async" width="300" height="394" class="mw-file-element" data-file-width="500" data-file-height="657"></a><figcaption></figcaption></figure>
<p>FreeCAD&#45716; &#47924;&#47308; &#49548;&#54532;&#53944;&#50920;&#50612; 3D &#49444;&#44228; &#54532;&#47196;&#44536;&#47016; &#51473; 1&#50948;&#51060;&#47728;, &#51060; PDF &#44032;&#51060;&#46300;&#44032; &#49884;&#51089;&#54616;&#44592;&#50640; &#44032;&#51109; &#51339;&#51008; &#48169;&#48277;&#51077;&#45768;&#45796;. &#49440;&#51012; &#44555;&#44256; 3D&#47196; &#47564;&#46300;&#45716; &#44592;&#48376;&#48512;&#53552; &#54028;&#46972;&#47700;&#53944;&#47533; &#49444;&#44228;, &#49324;&#51652;&#50640;&#49436; &#44061;&#52404; &#44032;&#51256;&#50724;&#44592;, &#54032;&#44552; &#49444;&#44228;&#50640; &#51060;&#47476;&#44592;&#44620;&#51648; &#50756;&#51204; &#52488;&#48372;&#51088;&#48512;&#53552; &#44256;&#44553; &#49324;&#50857;&#51088;&#44620;&#51648; &#50504;&#45236;&#54633;&#45768;&#45796;.
</p><p>FreeCAD&#45716; &#47924;&#47308; &#49548;&#54532;&#53944;&#50920;&#50612;&#51060;&#44592; &#46412;&#47928;&#50640; &#49324;&#50857;&#51088;&#45716; &#51088;&#49888;&#51032; &#54596;&#50836;&#50640; &#47582;&#44172; &#49548;&#54532;&#53944;&#50920;&#50612;&#50640; &#54869;&#51109; &#44592;&#45733;&#51012; &#52628;&#44032;&#54616;&#50668; &#51089;&#49457;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51089;&#50629;&#45824;(&#50892;&#53356;&#48292;&#52824;)&#46972;&#44256; &#50508;&#47140;&#51652; &#51060;&#47084;&#54620; &#52628;&#44032; &#44592;&#45733;&#51008; PCB &#49444;&#44228;, &#54028;&#51060;&#54532;, &#47785;&#51116; &#54532;&#47112;&#51076;, &#44148;&#52629; &#49444;&#44228; &#46321; &#45796;&#50577;&#54620; &#50857;&#46020;&#47484; &#54252;&#44292;&#54633;&#45768;&#45796;. &#49892;&#51228; &#49324;&#50857; &#49324;&#47168; &#47785;&#47197;&#51008; &#44228;&#49549;&#54644;&#49436; &#45720;&#50612;&#45208;&#44256; &#51080;&#49845;&#45768;&#45796;.
</p><p><b><a rel="nofollow" class="external free" href="https://hackspace.raspberrypi.com/books/freecad">https://hackspace.raspberrypi.com/books/freecad</a></b>
</p>
<div style="clear:both"></div>
<h2><span class="mw-headline" id="FreeCAD_for_architectural_drawing">FreeCAD for architectural drawing</span></h2>
<p>Allan Brito &#51200;, 2020&#45380; 8&#50900; &#52636;&#54032;, &#51204;&#51088;&#52293;/&#47928;&#44256;&#48376;
</p>
<figure class="mw-default-size" typeof="mw:File/Thumb"><a href="../index.php?title=Freecad_book_allanbrito.png&amp;filetimestamp=20220921094742&amp;.html" class="mw-file-description"><img src="../File/Freecad_book_allanbrito.png" decoding="async" width="300" height="427" class="mw-file-element" data-file-width="427" data-file-height="608"></a><figcaption></figcaption></figure>
<p>&#47924;&#47308; &#50724;&#54536; &#49548;&#49828; &#49548;&#54532;&#53944;&#50920;&#50612;&#47484; &#49324;&#50857;&#54616;&#50668; CAD &#44288;&#47144; &#54532;&#47196;&#51229;&#53944;&#50640; &#52280;&#50668;&#54616;&#44256; &#49910;&#51004;&#49901;&#45768;&#44620;? &#44148;&#52629;, &#50644;&#51648;&#45768;&#50612;&#47553; &#46321;&#51012; &#50948;&#54620; &#44592;&#49696; &#46020;&#47732;&#44284; 3D &#47784;&#45944;&#51012; &#47784;&#46160; &#47564;&#46308; &#49688; &#51080;&#45716; FreeCAD&#50752; &#44536; &#45440;&#46972;&#50868; &#50741;&#49496;&#51012; &#47564;&#45208;&#48372;&#49464;&#50836;.
</p><p>&#51060; &#52293;&#50640;&#49436;&#45716; FreeCAD&#47484; &#49324;&#50857;&#54616;&#50668; &#44148;&#52629;&#50640; &#45824;&#54620; &#51204;&#53685;&#51201;&#51064; &#44592;&#49696; &#46020;&#47732;&#51012; &#47564;&#46300;&#45716; &#48169;&#48277;&#51012; &#48176;&#50881;&#45768;&#45796;. &#54532;&#47196;&#51229;&#53944; &#44060;&#48156;&#51032; &#50696;&#47196; FreeCAD&#47484; &#49324;&#50857;&#54616;&#50668; &#50756;&#51204;&#54620; &#44592;&#45733;&#51012; &#44054;&#52632; &#54217;&#47732;&#46020;&#47484; &#44536;&#47532;&#45716; &#48169;&#48277;&#51012; &#48176;&#50864;&#44172; &#46121;&#45768;&#45796;. &#50864;&#47532;&#45716; &#44032;&#44396;, &#52824;&#49688;&#49440;, &#53581;&#49828;&#53944; &#51452;&#49437; &#46321;&#44284; &#44057;&#51008; &#44148;&#52629; &#46020;&#47732;&#51032; &#47784;&#46304; &#51204;&#53685;&#51201;&#51064; &#50836;&#49548;&#47484; &#54644;&#45817; &#54217;&#47732;&#46020;&#50640; &#52628;&#44032;&#54624; &#44163;&#51077;&#45768;&#45796;.
</p><p>&#47560;&#51648;&#47561; &#51109;&#50640;&#49436;&#45716; &#51060; &#54217;&#47732;&#46020; &#49444;&#44228;&#47484; DXF &#54805;&#49885;&#51060;&#45208; PDF&#47196; &#45236;&#48372;&#45244; &#49688; &#51080;&#49845;&#45768;&#45796;. FreeCAD&#51032; &#53596;&#54540;&#47551;&#50640;&#49436; &#51228;&#47785; &#48660;&#47197;&#51060; &#54252;&#54632;&#46108; &#51064;&#49604;&#50857; &#54168;&#51060;&#51648; &#47112;&#51060;&#50500;&#50883;&#50640; &#54217;&#47732;&#46020;&#47484; &#52628;&#44032;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.
</p><p>&#52376;&#51020;&#48512;&#53552; &#49884;&#51089;&#54616;&#48064;&#47196; FreeCAD&#50640; &#45824;&#54620; &#51060;&#51204; &#44221;&#54744;&#51060; &#54596;&#50836;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;. &#49324;&#50857;&#51088; &#51064;&#53552;&#54168;&#51060;&#49828; &#44592;&#52488;&#48512;&#53552; &#54217;&#47732;&#46020; &#51089;&#49457;&#44620;&#51648;!
</p><p><b><a rel="nofollow" class="external free" href="https://www.blender3darchitect.com/freecad-for-architectural-drawing/">https://www.blender3darchitect.com/freecad-for-architectural-drawing/</a></b>
</p>
<div style="clear:both"></div>
<h2><span class="mw-headline" id="FreeCAD_for_Inventors">FreeCAD for Inventors</span></h2>
<p>&#51089;&#49457;&#51088;: Brad Collette, 2018&#45380; 9&#50900; &#52636;&#54032;, &#51204;&#51088;&#52293;/&#47928;&#44256;&#48376;
</p>
<figure class="mw-default-size" typeof="mw:File/Thumb"><a href="../index.php?title=Freecad_book_inventors.jpg&amp;filetimestamp=20220921100311&amp;.html" class="mw-file-description"><img src="../File/Freecad_book_inventors.jpg" decoding="async" width="300" height="455" class="mw-file-element" data-file-width="413" data-file-height="626"></a><figcaption></figcaption></figure>
<p>&#51060; &#52293;&#51008; &#52488;&#48372;&#51088;&#50752; &#51473;&#44553; &#49324;&#50857;&#51088;&#50640;&#44172; FreeCAD&#50640;&#49436; &#44032;&#51109; &#51088;&#51452; &#49324;&#50857;&#46104;&#45716; &#46020;&#44396;&#50752; &#44592;&#49696;&#51012; &#49548;&#44060;&#54633;&#45768;&#45796;. 1&#48512;&#50640;&#49436;&#45716; &#49352;&#47196;&#50868; &#49324;&#50857;&#51088;&#50640;&#44172; FreeCAD &#44060;&#45392;&#44284; &#49324;&#50857;&#51088; &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#49548;&#44060;&#54633;&#45768;&#45796;. 2&#48512;&#50640;&#49436;&#45716; &#47751; &#44032;&#51648; &#50696;&#51228;&#47484; &#53685;&#54644; &#45796;&#50577;&#54620; &#47784;&#45944;&#47553; &#44592;&#49696;&#51012; &#44032;&#47476;&#52841;&#45768;&#45796;. 3&#48512;&#50640;&#49436;&#45716; &#50696;&#51228;&#47484; &#49324;&#50857;&#54616;&#50668; &#44592;&#49696; &#46020;&#47732;, CNC &#44592;&#44228;&#50857; Gcode, &#44305;&#49440; &#52628;&#51201; &#51060;&#48120;&#51648; &#46321;&#51012; &#49373;&#49457;&#54616;&#45716; FreeCAD&#51032; &#44592;&#45733;&#51012; &#49332;&#54196;&#48389;&#45768;&#45796;.
</p><p><b><a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?t=30959">https://forum.freecad.org/viewtopic.php?t=30959</a></b>
</p>
<div style="clear:both"></div>
<h2><span class="mw-headline" id="FreeCAD_How-to">FreeCAD How-to</span></h2>
<p>&#51089;&#49457;&#51088;: Daniel Falck, Brad Collette, 2012&#45380; 9&#50900; &#52636;&#54032;, &#51204;&#51088;&#52293;/&#47928;&#44256;&#48376;
</p>
<figure class="mw-default-size" typeof="mw:File/Thumb"><a href="../index.php?title=Freecad_book_howto.jpg&amp;filetimestamp=20220921095336&amp;.html" class="mw-file-description"><img src="../File/Freecad_book_howto.jpg" decoding="async" width="300" height="370" class="mw-file-element" data-file-width="405" data-file-height="500"></a><figcaption></figcaption></figure>
<p>FreeCAD&#45716; CAD &#44060;&#48156;&#51012; &#50948;&#54620; &#48276;&#50857; &#54540;&#47019;&#54268;&#51077;&#45768;&#45796;. &#45796;&#50577;&#54620; &#47928;&#51228;&#47484; &#54644;&#44208;&#54616;&#44592; &#50948;&#54644; &#45796;&#50577;&#54620; &#51089;&#50629;&#45824;&#47484; &#49324;&#50857;&#54616;&#46020;&#47197; &#54869;&#51109;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#50644;&#51648;&#45768;&#50612;&#47553; &#52964;&#48036;&#45768;&#54000;&#47484; &#44200;&#45285;&#54620; FreeCAD&#45716; &#54869;&#51109;&#51012; &#50948;&#54644; &#44396;&#52629;&#46108; &#50724;&#54536; &#49548;&#49828; &#49444;&#44228; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51077;&#45768;&#45796;. &#44053;&#47141;&#54620; &#49828;&#53356;&#47549;&#54021; &#50616;&#50612;&#51064; Python&#51008; FreeCAD&#51032; DNA&#50640; &#44618;&#49689;&#51060; &#51088;&#47532;&#51105;&#44256; &#51080;&#51004;&#47728; &#49324;&#50857;&#51088;&#50640;&#44172; &#51204;&#47168; &#50630;&#45716; &#51088;&#46041;&#54868; &#48143; &#48156;&#47749; &#44592;&#45733;&#51012; &#51228;&#44277;&#54633;&#45768;&#45796;
</p><p>"FreeCAD [How-to]"&#45716; FreeCAD&#51032; &#51452;&#50836; &#51089;&#50629;&#45824;&#50752; &#46356;&#51088;&#51064; &#52384;&#54617;&#51012; &#44036;&#45800;&#54616;&#44256; &#48736;&#47476;&#44172; &#50504;&#45236;&#54633;&#45768;&#45796;. &#46021;&#51088;&#45716; &#50668;&#47084; &#47784;&#45944;&#47553; &#44592;&#49696;&#50640; &#45824;&#54620; &#49892;&#49845; &#49548;&#44060;&#47484; &#48155;&#44256; Python&#51060; &#47588;&#53356;&#47196; &#51088;&#46041;&#54868; &#48143; &#49444;&#44228;&#47484; &#44032;&#45733;&#54616;&#44172; &#47564;&#46300;&#45716; &#48169;&#48277;&#51012; &#48176;&#50864;&#44172; &#46121;&#45768;&#45796;.
</p><p>FreeCAD&#47484; &#49324;&#50857;&#54616;&#47732; &#49324;&#50857;&#51088;&#45716; &#45796;&#50577;&#54620; &#48169;&#49885;&#51004;&#47196; &#46356;&#51088;&#51064;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. 2D &#46356;&#51088;&#51064;&#51012; &#49440;&#44284; &#50896;&#51004;&#47196; &#44536;&#47532;&#45716; &#44163;&#48512;&#53552; &#44592;&#48376; &#49556;&#47532;&#46300;&#47484; &#48373;&#51105;&#54620; 3D &#47784;&#50577;&#51004;&#47196; &#44208;&#54633;&#54616;&#45716; &#44163;&#44620;&#51648;. Python&#51004;&#47196; &#51089;&#49457;&#54620; &#53076;&#46300;&#47196; &#44061;&#52404;&#47484; &#49373;&#49457;&#54616;&#44144;&#45208; &#49688;&#51221;&#54624; &#49688;&#46020; &#51080;&#49845;&#45768;&#45796;. FreeCAD&#47484; &#49324;&#50857;&#54616;&#47732; &#44256;&#44553; &#49324;&#50857;&#51088;&#44032; &#49352;&#47196;&#50868; &#45824;&#54868; &#49345;&#51088;, &#54056;&#45328; &#48143; &#49828;&#53356;&#47549;&#53944;&#47484; &#49324;&#50857;&#54616;&#50668; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#51088;&#52404;&#47484; &#54869;&#51109;&#54624; &#49688;&#46020; &#51080;&#49845;&#45768;&#45796;.&#51060; &#52293;&#51008; &#51204;&#53685;&#51201;&#51064; GUI &#47784;&#46300;&#50640;&#49436; FreeCAD&#47484; &#49324;&#50857;&#54616;&#50668; &#49884;&#51089;&#54616;&#45716; &#48169;&#48277;&#51012; &#48372;&#50668;&#51460; &#49104;&#47564; &#50500;&#45768;&#46972; &#44053;&#47141;&#54620; &#49828;&#53356;&#47549;&#54021; &#50616;&#50612;&#47484; &#54876;&#50857;&#54616;&#50668; &#45908; &#47566;&#51008; &#49457;&#45733;&#51012; &#48156;&#55064;&#54616;&#45716; &#48169;&#48277;&#46020; &#50508;&#47140;&#51469;&#45768;&#45796;.
</p><p><b><a rel="nofollow" class="external free" href="https://www.packtpub.com/product/freecad/9781849518864">https://www.packtpub.com/product/freecad/9781849518864</a></b>
</p>
<div style="clear:both"></div>
<!-- 
NewPP limit report
Cached time: 20251226205010
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.028 seconds
Real time usage: 0.038 seconds
Preprocessor visited node count: 48/1000000
Post&#8208;expand include size: 150/2097152 bytes
Template argument size: 0/2097152 bytes
Highest expansion depth: 2/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1352/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    1.811      1 -total
 87.40%    1.583      5 Template:Clear
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:348274-0!canonical and timestamp 20251226205010 and revision id 1720499. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>