<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Books/fr</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="fr" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Books&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/Books.html" class="mw-pt-progress mw-pt-progress--complete" title="B&uuml;cher (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Books.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Books (100% translated)" lang="en" dir="ltr">English</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--high" lang="fr" dir="ltr">fran&ccedil;ais</span></li>
<li><a href="../it/Books.html" class="mw-pt-progress mw-pt-progress--high" title="Libri (77% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Books.html" class="mw-pt-progress mw-pt-progress--complete" title="Ksi&#261;&#380;ki o FreeCAD (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../ru/Books.html" class="mw-pt-progress mw-pt-progress--low" title="&#1050;&#1085;&#1080;&#1075;&#1080; (4% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li>
<li><a href="../ko/Books.html" class="mw-pt-progress mw-pt-progress--high" title="&#52293; (77% translated)" lang="ko" dir="ltr">&#54620;&#44397;&#50612;</a></li></ul></div>
<p>Cette page liste les livres sur FreeCAD que nous connaissons&nbsp;:
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<meta property="mw:PageProp/toc">
<h2><span id="FreeCAD_Beginner.E2.80.99s_Handbook"></span><span class="mw-headline" id="FreeCAD_Beginner&rsquo;s_Handbook">FreeCAD Beginner&rsquo;s Handbook</span></h2>
</div>
<p>Par Aleksander Sadowski, publi&eacute; en d&eacute;cembre 2025, livre broch&eacute;
</p>
<figure class="mw-default-size" typeof="mw:File/Thumb"><a href="../File/Freecad-beginners-handbook-book-cover.jpg" class="mw-file-description"><img alt="FreeCAD Beginners Handbook cover" src="../File/Freecad-beginners-handbook-book-cover.jpg" decoding="async" width="300" height="431" class="mw-file-element" data-file-width="1000" data-file-height="1436"></a><figcaption></figcaption></figure>
<p>Apprenez la conception 3D avec FreeCAD &agrave; travers des exemples concrets et des projets pratiques.
</p><p>D&eacute;couvrez l'univers de la conception 3D avec FreeCAD, le logiciel de CAO gratuit et open source utilis&eacute; par les ing&eacute;nieurs, les concepteurs et les fabricants du monde entier. Ce guide pratique en couleurs vous accompagne pas &agrave; pas &agrave; travers un processus de mod&eacute;lisation fiable, vous montrant comment cr&eacute;er des produits et des inventions concrets, et m&ecirc;me mener &agrave; bien un projet complexe tel que la conception d'un rover martien &agrave; partir de z&eacute;ro afin de consolider vos connaissances.
</p>
<ul><li>Gagnez en confiance pour d&eacute;velopper vos propres inventions, de l'id&eacute;e initiale au produit fini imprimable en 3D.</li>
<li>Apprenez les principes fondamentaux de la mod&eacute;lisation 3D solide et comment les appliquer efficacement dans FreeCAD.</li>
<li>Cr&eacute;ez des pi&egrave;ces 3D &agrave; l'aide de PartDesign et Sketcher, puis assemblez-les num&eacute;riquement pour v&eacute;rifier leur fonctionnement.</li>
<li>Pr&eacute;parez et exportez des mod&egrave;les pour l'impression 3D &agrave; l'aide d'un logiciel de d&eacute;coupage, en vous assurant que vos conceptions sont pr&ecirc;tes pour la production.</li>
<li>R&eacute;alisez des projets qui enseignent les applications concr&egrave;tes de la conception 3D, notamment des gadgets pratiques et un projet de rover martien pour consolider vos comp&eacute;tences.</li></ul>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>By the end of this book, you will be able to design your own innovative gadgets, explore real-world engineering solutions, and confidently prepare models for 3D printing. The included Mars Rover project provides a challenging yet rewarding opportunity to apply all the techniques learned in a single, cohesive design.
</p>
</div>
<p><b><a rel="nofollow" class="external free" href="https://www.amazon.de/FreeCAD-Beginners-Handbook-Aleksander-Sadowski/dp/B0G9HXYYGX">https://www.amazon.de/FreeCAD-Beginners-Handbook-Aleksander-Sadowski/dp/B0G9HXYYGX</a></b>
</p>
<div style="clear:both"></div>
<p><span id="FreeCAD_for_Makers"></span>
</p>
<h2><span class="mw-headline" id="FreeCAD_pour_makers">FreeCAD pour makers</span></h2>
<p>Par Jo Hinchliffe, publi&eacute; en septembre 2022, ebook gratuit
</p>
<figure class="mw-default-size" typeof="mw:File/Thumb"><a href="../index.php?title=Freecad_book_concretedog.png&amp;filetimestamp=20220921094257&amp;.html" class="mw-file-description"><img src="../File/Freecad_book_concretedog.png" decoding="async" width="300" height="394" class="mw-file-element" data-file-width="500" data-file-height="657"></a><figcaption></figcaption></figure>
<p>FreeCAD est le logiciel gratuit num&eacute;ro un de la conception 3D, et ce guide PDF est le meilleur moyen de s'y mettre. Nous vous emm&egrave;nerons du d&eacute;butant absolu &agrave; l'utilisateur avanc&eacute;, en passant par les bases du dessin d'une ligne et sa transformation en 3D, jusqu'&agrave; la conception param&eacute;trique, l'importation d'objets &agrave; partir de photos, la conception de t&ocirc;les, et bien plus encore.
</p><p>FreeCAD &eacute;tant un logiciel libre, ses utilisateurs peuvent le compl&eacute;ter, en &eacute;crivant des extensions du logiciel pour r&eacute;pondre &agrave; leurs besoins. Ces extensions, connues sous le nom d'ateliers, couvrent un large &eacute;ventail d'utilisations, notamment la conception de circuits imprim&eacute;s, les tuyaux, la charpente en bois, la conception architecturale... la liste des cas d'utilisation pratique est longue. Ainsi, quel que soit l'objet que vous souhaitez construire, vous trouverez un atelier FreeCAD pour le r&eacute;aliser.
</p><p><b><a rel="nofollow" class="external free" href="https://hackspace.raspberrypi.com/books/freecad">https://hackspace.raspberrypi.com/books/freecad</a></b>
</p>
<div style="clear:both"></div>
<p><span id="FreeCAD_for_architectural_drawing"></span>
</p>
<h2><span class="mw-headline" id="FreeCAD_pour_le_dessin_architectural">FreeCAD pour le dessin architectural</span></h2>
<p>Par Allan Brito, publi&eacute; en ao&ucirc;t 2020, ebook/livre broch&eacute;.
</p>
<figure class="mw-default-size" typeof="mw:File/Thumb"><a href="../index.php?title=Freecad_book_allanbrito.png&amp;filetimestamp=20220921094742&amp;.html" class="mw-file-description"><img src="../File/Freecad_book_allanbrito.png" decoding="async" width="300" height="427" class="mw-file-element" data-file-width="427" data-file-height="608"></a><figcaption></figcaption></figure>
<p>Vous voulez commencer &agrave; utiliser un logiciel libre et gratuit pour travailler sur vos projets de CAO&nbsp;? D&eacute;couvrez FreeCAD et son incroyable &eacute;ventail d'options pour cr&eacute;er &agrave; la fois des dessins techniques et des mod&egrave;les 3D pour l'architecture, l'ing&eacute;nierie, etc.
</p><p>Dans ce livre, vous apprendrez &agrave; utiliser FreeCAD pour cr&eacute;er des dessins techniques traditionnels pour l'architecture. &Agrave; titre d'exemple de d&eacute;veloppement de projet, vous apprendrez &agrave; dessiner un plan d'&eacute;tage complet &agrave; l'aide de FreeCAD. Nous ajouterons &agrave; ce plan d'&eacute;tage tous les &eacute;l&eacute;ments traditionnels d'un dessin d'architecture comme les meubles, les lignes de cote, les annotations de texte, et bien plus encore.
</p><p>Dans les derniers chapitres, nous pourrons prendre ce plan d'&eacute;tage et l'exporter au format DXF ou au format PDF. Vous serez en mesure d'ajouter le plan d'&eacute;tage &agrave; la mise en page pour l'impression, avec un cartouche &agrave; partir d'un mod&egrave;le dans FreeCAD.
</p><p>Vous n'avez pas besoin d'avoir une exp&eacute;rience pr&eacute;alable de FreeCAD, puisque nous allons commencer par le d&eacute;but. Des bases de l'interface utilisateur au dessin d'un plan d'&eacute;tage&nbsp;!
</p><p><b><a rel="nofollow" class="external free" href="https://www.blender3darchitect.com/freecad-for-architectural-drawing/">https://www.blender3darchitect.com/freecad-for-architectural-drawing/</a></b>
</p>
<div style="clear:both"></div>
<p><span id="FreeCAD_for_Inventors"></span>
</p>
<h2><span class="mw-headline" id="FreeCAD_pour_les_inventeurs">FreeCAD pour les inventeurs</span></h2>
<p>Par Brad Collette, publi&eacute; en septembre 2018, ebook/livre broch&eacute;.
</p>
<figure class="mw-default-size" typeof="mw:File/Thumb"><a href="../index.php?title=Freecad_book_inventors.jpg&amp;filetimestamp=20220921100311&amp;.html" class="mw-file-description"><img src="../File/Freecad_book_inventors.jpg" decoding="async" width="300" height="455" class="mw-file-element" data-file-width="413" data-file-height="626"></a><figcaption></figcaption></figure>
<p>Ce livre pr&eacute;sente aux utilisateurs novices et interm&eacute;diaires les outils et techniques les plus fr&eacute;quemment utilis&eacute;s dans FreeCAD. La premi&egrave;re partie pr&eacute;sente aux nouveaux utilisateurs les concepts de FreeCAD et l'interface utilisateur. La deuxi&egrave;me partie enseigne diverses techniques de mod&eacute;lisation &agrave; l'aide de quelques exemples. La troisi&egrave;me partie utilise les exemples pour explorer la capacit&eacute; de FreeCAD &agrave; g&eacute;n&eacute;rer&nbsp;: des dessins techniques, du Gcode pour les machines &agrave; commande num&eacute;rique, des images &agrave; suivi de rayon et plus encore.
</p><p><b><a rel="nofollow" class="external free" href="https://forum.freecad.org/viewtopic.php?t=30959">https://forum.freecad.org/viewtopic.php?t=30959</a></b>
</p>
<div style="clear:both"></div>
<p><span id="FreeCAD_How-to"></span>
</p>
<h2><span class="mw-headline" id="FreeCAD_comment_faire">FreeCAD comment faire</span></h2>
<p>Par Daniel Falck, Brad Collette, publi&eacute; en septembre 2012, ebook/livre broch&eacute;.
</p>
<figure class="mw-default-size" typeof="mw:File/Thumb"><a href="../index.php?title=Freecad_book_howto.jpg&amp;filetimestamp=20220921095336&amp;.html" class="mw-file-description"><img src="../File/Freecad_book_howto.jpg" decoding="async" width="300" height="370" class="mw-file-element" data-file-width="405" data-file-height="500"></a><figcaption></figcaption></figure>
<p>FreeCAD est une plate-forme polyvalente pour le d&eacute;veloppement de la CAO. Elle peut &ecirc;tre &eacute;tendue pour utiliser diff&eacute;rents ateliers afin de r&eacute;soudre diff&eacute;rents probl&egrave;mes. Destin&eacute; &agrave; la communaut&eacute; des ing&eacute;nieurs, FreeCAD est une application de conception open source con&ccedil;ue pour &ecirc;tre &eacute;tendue. Python, le puissant langage de script, est profond&eacute;ment ancr&eacute; dans l'ADN de FreeCAD et donne aux utilisateurs une puissance sans pr&eacute;c&eacute;dent pour automatiser et inventer.
</p><p>"FreeCAD [How-to]" est une rapide pr&eacute;sentation et simple des principaux ateliers et de la philosophie de conception de FreeCAD. Le lecteur aura une introduction pratique &agrave; plusieurs techniques de mod&eacute;lisation et apprendra comment Python rend possible l'automatisation et la conception macro.
</p><p>FreeCAD permet aux utilisateurs de concevoir de nombreuses fa&ccedil;ons, du dessin 2D sous forme de lignes et de cercles &agrave; la combinaison de solides primitifs en formes 3D complexes. Les objets peuvent m&ecirc;me &ecirc;tre cr&eacute;&eacute;s ou modifi&eacute;s par un code &eacute;crit en Python. FreeCAD permet m&ecirc;me aux utilisateurs exp&eacute;riment&eacute;s d'&eacute;tendre l'application elle-m&ecirc;me avec de nouvelles bo&icirc;tes de dialogue, de nouveaux panneaux et de nouveaux scripts. Ce livre ne vous montrera pas seulement comment commencer &agrave; utiliser FreeCAD en mode GUI traditionnel, mais vous apprendra &agrave; exploiter son puissant langage de script pour plus de puissance.
</p><p><b><a rel="nofollow" class="external free" href="https://www.packtpub.com/product/freecad/9781849518864">https://www.packtpub.com/product/freecad/9781849518864</a></b>
</p>
<div style="clear:both"></div>
<!-- 
NewPP limit report
Cached time: 20251228155615
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.038 seconds
Real time usage: 0.053 seconds
Preprocessor visited node count: 48/1000000
Post&#8208;expand include size: 150/2097152 bytes
Template argument size: 0/2097152 bytes
Highest expansion depth: 2/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1359/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    2.299      1 -total
 85.43%    1.964      5 Template:Clear
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:298400-0!canonical and timestamp 20251228155615 and revision id 1721775. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>