<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">DXF/fr</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="fr" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-DXF&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/DXF.html" class="mw-pt-progress mw-pt-progress--complete" title="DXF (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../DXF.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="DXF (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/DXF.html" class="mw-pt-progress mw-pt-progress--low" title="DXF (7% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="fr" dir="ltr">fran&ccedil;ais</span></li>
<li><a href="../it/DXF.html" class="mw-pt-progress mw-pt-progress--med" title="DXF (47% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/DXF.html" class="mw-pt-progress mw-pt-progress--complete" title="DXF (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt-br/DXF.html" class="mw-pt-progress mw-pt-progress--low" title="DXF (5% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../ru/DXF.html" class="mw-pt-progress mw-pt-progress--med" title="DXF (40% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li>
<li><a href="../ko/DXF.html" class="mw-pt-progress mw-pt-progress--med" title="DXF (16% translated)" lang="ko" dir="ltr">&#54620;&#44397;&#50612;</a></li></ul></div>
<div style="clear:right; margin-bottom: .5em; float: right; padding: .5em 0 .8em 1.4em; background: none;"><meta property="mw:PageProp/toc"></div>
<p><span id="Background_history"></span>
</p>
<h2><span class="mw-headline" id="Historique">Historique</span></h2>
<p>Le Drawing Exchange Format (DXF) est un format de donn&eacute;es CAO propri&eacute;taire d&eacute;velopp&eacute; par Autodesk pour permettre l'&eacute;change de fichiers entre son produit phare AutoCAD et d'autres logiciels. Il existe un certain nombre de bonnes biblioth&egrave;ques logicielles pour lire/&eacute;crire le format DXF.
</p><p>Il existe de nombreuses versions du format DXF. Vous entendrez parler de certaines versions cl&eacute;s, comme la R12 (de 1992) ou la R14 (de 1997, qui comportait des splines). Les versions ult&eacute;rieures du format DXF comportent des &eacute;l&eacute;ments 3D mais ceux-ci sont rarement utilis&eacute;s ou mis en &oelig;uvre. La fa&ccedil;on dont vous utilisez DXF pour partager des donn&eacute;es CAO entre programmes d&eacute;pend principalement des limitations et des bogues des lecteurs/importateurs et des r&eacute;dacteurs/exportateurs correspondants. Ceux-ci sont rarement bien document&eacute;s et peuvent &ecirc;tre une grande source de frustration.
</p><p>Si vous &eacute;ditez des fichiers DXF et que vous souhaitez qu'ils restent quasiment identiques lorsque vous les enregistrez, nous vous recommandons d'utiliser <a rel="nofollow" class="external text" href="https://fr.wikipedia.org/wiki/LibreCAD">LibreCAD</a> ou <a rel="nofollow" class="external text" href="https://fr.wikipedia.org/wiki/QCad">QCad</a> car les structures de donn&eacute;es internes de ces programmes sont compatibles avec les objets du fichier DXF.
</p><p>Dans FreeCAD, les lecteurs DXF doivent traduire la g&eacute;om&eacute;trie (par exemple, les formes des splines) du fichier DXF dans les repr&eacute;sentations internes sp&eacute;cifiques de l'atelier.
</p><p><span id="Methods_for_importing_DXF_to_FreeCAD"></span>
</p>
<h2><span id="M.C3.A9thodes_d.27importation_du_fichier_DXF_dans_FreeCAD"></span><span class="mw-headline" id="M&eacute;thodes_d'importation_du_fichier_DXF_dans_FreeCAD">M&eacute;thodes d'importation du fichier DXF dans FreeCAD</span></h2>
<p>Si vous avez l&rsquo;intention de v&eacute;rifier fr&eacute;quemment les param&egrave;tres, nous vous recommandons d&rsquo;aller dans Edition &rarr; Pr&eacute;f&eacute;rences &rarr; Importer-Exporter &rarr; DXF et de cocher la case "[ ] Afficher cette bo&icirc;te de dialogue lors de l&rsquo;importation et de l&rsquo;exportation".
</p><p>Vous trouverez plus d'informations sur les pages <a href="../fr/Draft_DXF.html" title="Draft DXF/fr">Draft DXF</a> et <a href="../fr/FreeCAD_and_DXF_Import.html" title="FreeCAD and DXF Import/fr">FreeCAD et Importation DXF</a>.
</p><p>Si vous utilisez la g&eacute;om&eacute;trie import&eacute;e pour cr&eacute;er des formes 3D dans l'atelier PartDesign, essayez <a href="../fr/Sketcher_ValidateSketch.html" title="Sketcher ValidateSketch/fr">Sketcher Valider une esquisse</a> apr&egrave;s avoir import&eacute; le fichier DXF dans une esquisse.
</p><p><span id="C++_DXF_importer"></span>
</p>
<h3><span id="Importateur_DXF_en_C.2B.2B"></span><span class="mw-headline" id="Importateur_DXF_en_C++">Importateur DXF en C++</span></h3>
<p>Cette impl&eacute;mentation est rapide, mais elle ignore certaines fonctions qu'elle ne reconna&icirc;t pas, comme les splines de DXF. Elle ne peut pas &eacute;galement importer la g&eacute;om&eacute;trie dans l'atelier Draft que sous forme d'entr&eacute;es individuelles dans l'arborescence du mod&egrave;le. Les couleurs de ces entr&eacute;es peuvent &ecirc;tre lues &agrave; partir du fichier si vous cochez cette option. Pour plus d'informations, voir <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?f=3&amp;t=32493">ce post dans le forum</a>.
</p><p><span id="Python_DXF_importer"></span>
</p>
<h3><span class="mw-headline" id="Importateur_DXF_en_Python">Importateur DXF en Python</span></h3>
<p>Cet importateur doit &ecirc;tre t&eacute;l&eacute;charg&eacute; et install&eacute; avant de pouvoir &ecirc;tre utilis&eacute;. Utilisez l'option "[ ] Autoriser FreeCAD &agrave; t&eacute;l&eacute;charger et &agrave; mettre &agrave; jour automatiquement les biblioth&egrave;ques DXF".
</p><p>Cet importateur dispose de plus de fonctions (telles que l'impl&eacute;mentation de splines) et a la possibilit&eacute; de charger les formes DXF dans l'atelier Sketcher. Cependant, il faut savoir que tous les &eacute;l&eacute;ments de l'esquisse appara&icirc;tront individuellement une deuxi&egrave;me fois dans l'arborescence du mod&egrave;le, ce qui peut pr&ecirc;ter &agrave; confusion. Vous pouvez supprimer tous chacun de ces objets et conserver uniquement l'esquisse (qui appara&icirc;t comme deuxi&egrave;me entr&eacute;e dans la liste des nouveaux &eacute;l&eacute;ments).
</p><p>Malheureusement, l'atelier Sketcher n'impl&eacute;mente pas les couleurs. Toute la g&eacute;om&eacute;trie appara&icirc;tra donc au m&ecirc;me niveau, ce qui pose probl&egrave;me si le fichier contient de nombreuses lignes de construction. Une solution consiste &agrave; ouvrir votre dessin dans LibreCAD et &agrave; supprimer toute la g&eacute;om&eacute;trie que vous ne souhaitez pas afficher avant d'enregistrer un fichier contenant exactement la g&eacute;om&eacute;trie que vous souhaitez charger.
</p>
<h3><span class="mw-headline" id="Macros">Macros</span></h3>
<p>Gardez un &oelig;il sur le forum de FreeCAD ou sur la <a href="../fr/Macros_recipes.html" title="Macros recipes/fr">Liste des macros</a> pour des impl&eacute;mentations alternatives d'importation et de nettoyage DXF au fur et &agrave; mesure de leur d&eacute;veloppement.
</p><p><span id="Saving_DXF"></span>
</p>
<h2><span class="mw-headline" id="Sauvegarder_au_format_DXF">Sauvegarder au format DXF</span></h2>
<p>Outre les options du menu Edition &rarr; Pr&eacute;f&eacute;rences, l'<a href="../fr/TechDraw_Workbench.html" title="TechDraw Workbench/fr">atelier TechDraw</a> peut &eacute;galement exporter des pages de dessin au format DXF &agrave; l&rsquo;aide de la fonction <a href="../fr/TechDraw_ExportPageDXF.html" title="TechDraw ExportPageDXF/fr">TechDraw Exporter au format DXF</a>.
</p><p><br>
<span id="DXF_terms_and_definitions"></span>
</p>
<h2><span id="Termes_et_d.C3.A9finitions_DXF"></span><span class="mw-headline" id="Termes_et_d&eacute;finitions_DXF">Termes et d&eacute;finitions DXF</span></h2>
<p><span id="Anonymous_blocks"></span>
</p>
<h3><span class="mw-headline" id="Blocs_anonymes">Blocs anonymes</span></h3>
<p>Lorsque l'on parle de fichiers DXF, plusieurs termes sont utilis&eacute;s pour d&eacute;crire les blocs qui sont g&eacute;n&eacute;r&eacute;s automatiquement par le logiciel de CAO plut&ocirc;t que par l'utilisateur. 
</p>
<ul><li><b>Bloc anonyme</b> (ou <b>bloc "ast&eacute;risque"</b>)&nbsp;: terme technique d&eacute;fini par la norme DXF. Il d&eacute;signe tout bloc dont le nom commence par un ast&eacute;risque (<code>*</code>). C'est le terme g&eacute;n&eacute;rique.</li></ul>
<ul><li><b>Bloc syst&egrave;me</b>&nbsp;: ce terme d&eacute;crit le <i>but</i> de la plupart des blocs anonymes. Ils ne sont g&eacute;n&eacute;ralement pas cr&eacute;&eacute;s directement par un utilisateur. Au lieu de cela, l'application de CAO (par exemple, AutoCAD) les g&eacute;n&egrave;re automatiquement pour repr&eacute;senter des objets complexes compos&eacute;s d'entit&eacute;s g&eacute;om&eacute;triques plus simples, telles que des hachures et des cotes.</li></ul>
<ul><li><b>Bloc cach&eacute;</b>&nbsp;: ce terme d&eacute;crit le comportement typique des blocs anonymes dans l'interface utilisateur d'un programme de CAO. Parce qu'ils sont g&eacute;n&eacute;r&eacute;s par le syst&egrave;me et ne sont pas destin&eacute;s &agrave; &ecirc;tre manipul&eacute;s directement par l'utilisateur, ils sont g&eacute;n&eacute;ralement cach&eacute;s dans la liste des blocs qu'un utilisateur peut ins&eacute;rer.</li></ul>
<p>En r&eacute;sum&eacute;, "bloc anonyme" est le nom technique, "bloc syst&egrave;me" d&eacute;crit sa fonction et "bloc cach&eacute;" d&eacute;crit son comportement typique dans l'interface utilisateur. Pour des raisons pratiques dans le contexte de l'importateur DXF de FreeCAD, ils se r&eacute;f&egrave;rent tous &agrave; la m&ecirc;me cat&eacute;gorie de blocs.
</p><p><span id="Classes_of_anonymous_blocks"></span>
</p>
<h4><span class="mw-headline" id="Classes_de_blocs_anonymes">Classes de blocs anonymes</span></h4>
<p>Les blocs anonymes sont class&eacute;s en fonction du caract&egrave;re qui suit l'ast&eacute;risque initial. Ce pr&eacute;fixe indique l'objectif sp&eacute;cifique du bloc. Les cat&eacute;gories les plus courantes sont les suivantes&nbsp;:
</p>
<ul><li><code>*D...</code> (cotes)&nbsp;: bloc repr&eacute;sentant les composants graphiques d'une entit&eacute; dimensionnelle (lignes, pointes de fl&egrave;ches, etc.).</li>
<li><code>*X...</code> (hachures)&nbsp;: bloc repr&eacute;sentant la g&eacute;om&eacute;trie qui constitue un motif de hachures.</li>
<li><code>*P...</code> (pr&eacute;sentations de l'espace papier)&nbsp;: bloc qui contient toutes les entit&eacute;s qui existent sur une pr&eacute;sentation sp&eacute;cifique de l'espace papier. Le mod&egrave;le principal se trouve g&eacute;n&eacute;ralement dans un bloc nomm&eacute; <code>*Model_Space</code> et chaque pr&eacute;sentation est sont nomm&eacute;e <code>*Paper_Space</code>, <code>*Paper_Space0</code>, <code>*Paper_Space1</code>, et ainsi de suite.</li>
<li><code>*U...</code> (blocs dynamiques)&nbsp;: blocs complexes utilis&eacute;s pour la fonctionnalit&eacute; de blocs dynamiques d'AutoCAD.</li>
<li><code>*E...</code>, <code>*T...</code>, etc.&nbsp;: d'autres pr&eacute;fixes existent pour des objets sp&eacute;cialis&eacute;s tels que les pointes de fl&egrave;ches associatives et les tableaux.</li></ul>
<p><span id="BLOCKs_and_INSERTs"></span>
</p>
<h3><span class="mw-headline" id="BLOCKs_et_INSERTs">BLOCKs et INSERTs</span></h3>
<p><span id="The_BLOCK_entity"></span>
</p>
<h4><span id="L.27entit.C3.A9_BLOCK"></span><span class="mw-headline" id="L'entit&eacute;_BLOCK">L'entit&eacute; BLOCK</span></h4>
<p>Un <code>BLOCK</code> est une collection nomm&eacute;e d'entit&eacute;s g&eacute;om&eacute;triques (lignes, arcs, polylignes, etc.) qui sont regroup&eacute;es pour former une d&eacute;finition d'objet unique. Il peut &ecirc;tre consid&eacute;r&eacute; comme un mod&egrave;le.
</p><p>Un <code>BLOCK</code>&nbsp;:
</p>
<ul><li><b>Nom du bloc &nbsp;:</b> chaque bloc cr&eacute;&eacute; par l'utilisateur a un nom unique (par exemple, &laquo;&nbsp;CHAIR-01&nbsp;&raquo;, &laquo;&nbsp;BOULON-M8&nbsp;&raquo;). Ce nom est utilis&eacute; pour r&eacute;f&eacute;rencer le bloc.</li>
<li><b>Point de base &nbsp;:</b> il s'agit du point d'origine (0,0,0) dans le syst&egrave;me de coordonn&eacute;es interne du bloc. Lorsque le bloc est ins&eacute;r&eacute;, ce point de base est align&eacute; sur les coordonn&eacute;es d'insertion sp&eacute;cifi&eacute;es.</li>
<li><b>N'est pas visible par lui-m&ecirc;me&nbsp;:</b> la d&eacute;finition de <code>BLOCK</code> est stock&eacute;e dans une section de type biblioth&egrave;que du fichier DXF (la section <code>BLOCKS</code>). La g&eacute;om&eacute;trie du bloc n'appara&icirc;t pas dans le dessin final tant qu'une instance de ce bloc n'est pas cr&eacute;&eacute;e.</li></ul>
<p><span id="The_INSERT_entity"></span>
</p>
<h4><span id="L.27entit.C3.A9_INSERT"></span><span class="mw-headline" id="L'entit&eacute;_INSERT">L'entit&eacute; INSERT</span></h4>
<p>Une entit&eacute; <code>INSERT</code> est ce qui place une copie, ou une instance, de la g&eacute;om&eacute;trie d'un <code>BLOCK</code> dans l'espace mod&egrave;le ou l'espace papier du dessin. Il s'agit d'une entit&eacute; tr&egrave;s l&eacute;g&egrave;re car elle ne contient pas la g&eacute;om&eacute;trie elle-m&ecirc;me&nbsp;; elle contient uniquement une r&eacute;f&eacute;rence &agrave; une d&eacute;finition de <code>BLOCK</code> et des instructions sur la mani&egrave;re de la placer et de la transformer.
</p><p>Un <code>INSERT</code>&nbsp;:
</p>
<ul><li><b>Nom du bloc&nbsp;:</b> sp&eacute;cifie quelle d&eacute;finition de <code>BLOCK</code> utiliser (par exemple, &laquo;&nbsp;Je suis une instance du bloc &ldquo;CHAIR-01&rdquo;&nbsp;&raquo;).</li>
<li><b>Point d'insertion&nbsp;:</b> coordonn&eacute;e (X, Y, Z) dans le dessin o&ugrave; le point de base du bloc doit &ecirc;tre plac&eacute;.</li>
<li><b>A des transformations&nbsp;:</b> chaque instance peut &ecirc;tre transform&eacute;e ind&eacute;pendamment sans affecter la d&eacute;finition originale du bloc. Ces transformations comprennent&nbsp;:
<ul><li><b>Facteur d'&eacute;chelle&nbsp;:</b> l'instance peut &ecirc;tre mise &agrave; l'&eacute;chelle diff&eacute;remment dans les directions X, Y et Z.</li>
<li><b>Rotation&nbsp;:</b> l'objet peut &ecirc;tre tourn&eacute;e autour de son point d'insertion.</li></ul></li></ul>
<p><span id="BLOCK_placement_strategies"></span>
</p>
<h4><span id="Strat.C3.A9gies_de_placement_des_BLOCKs"></span><span class="mw-headline" id="Strat&eacute;gies_de_placement_des_BLOCKs">Strat&eacute;gies de placement des BLOCKs</span></h4>
<p>Un fichier DXF s&eacute;pare la <b>d&eacute;finition</b> d'un composant de son <b>placement</b>.
</p>
<ul><li>Un <code>BLOCK</code> est le mod&egrave;le ou le plan. Il contient la g&eacute;om&eacute;trie qui constitue un composant, comme une chaise ou une fen&ecirc;tre. Ces d&eacute;finitions sont stock&eacute;es dans la section <code>BLOCKS</code> du fichier et ne sont pas directement visibles dans le dessin final.</li>
<li>Un <code>INSERT</code> est l'instruction de placer un <code>BLOCK</code> dans le dessin &agrave; une position, une orientation et une &eacute;chelle sp&eacute;cifiques. Ce sont les instances visibles du bloc et se trouvent dans la section <code>ENTITIES</code>.</li></ul>
<p>Il existe deux principales mani&egrave;res d'utilisation des blocks et des inserts&nbsp;:
</p>
<ol><li><b>Flux de travail des mod&egrave;les et des instances</b>&nbsp;: une seule d&eacute;finition <code>BLOCK</code> est cr&eacute;&eacute;e, et plusieurs entit&eacute;s <code>INSERT</code> sont utilis&eacute;es pour placer des instances de cette d&eacute;finition dans le dessin. Il s'agit d'une m&eacute;thode efficace pour traiter les &eacute;l&eacute;ments r&eacute;p&eacute;titifs. Par exemple, la g&eacute;om&eacute;trie d'une chaise est d&eacute;finie une fois dans un <code>BLOCK</code> puis r&eacute;f&eacute;renc&eacute;e plusieurs fois par des entit&eacute;s <code>INSERT</code>.</li>
<li><b>Flux de travail des objets composites&nbsp;:</b> un <code>BLOCK</code> est cr&eacute;&eacute; &agrave; partir d'une g&eacute;om&eacute;trie existante simplement pour regrouper ces objets en une seule unit&eacute; que l'on peut s&eacute;lectionner. Dans ce cas, la d&eacute;finition de <code>BLOCK</code> est utilis&eacute;e par une seule entit&eacute; <code>INSERT</code>.</li></ol>
<p>L'importateur DXF doit pouvoir faire la distinction entre ces deux cas d'utilisation pour repr&eacute;senter correctement l'intention du dessin original, soit en cr&eacute;ant de nombreuses instances li&eacute;es &agrave; un seul objet de base (mod&egrave;le), soit en cr&eacute;ant un seul objet visible (mod&egrave;le d'objets group&eacute;s).
</p><p><br>
</p>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><span typeof="mw:File"><a href="../index.php?title=User_hub.png&amp;filetimestamp=20190221145008&amp;.html" class="mw-file-description"><img src="../File/User_hub.png" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../fr/User_hub.html" title="User hub/fr">Hub utilisateurs</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b><a href="../fr/Getting_started.html" title="Getting started/fr">D&eacute;marrer avec FreeCAD</a></b></li>
<li><b>Installation&nbsp;:</b> <a href="../fr/Download.html" title="Download/fr">T&eacute;l&eacute;chargements</a>, <a href="../fr/Installing_on_Windows.html" title="Installing on Windows/fr">Windows</a>, <a href="../fr/Installing_on_Linux.html" title="Installing on Linux/fr">Linux</a>, <a href="../fr/Installing_on_Mac.html" title="Installing on Mac/fr">Mac</a>, <a href="../fr/Installing_additional_components.html" title="Installing additional components/fr">Logiciels suppl&eacute;mentaires</a>, <a href="../fr/Compile_on_Docker.html" title="Compile on Docker/fr">Docker</a>, <a href="../fr/AppImage.html" title="AppImage/fr">AppImage</a>, <a href="../fr/Ubuntu_Snap.html" title="Ubuntu Snap/fr">Ubuntu Snap</a></li>
<li><b>Bases&nbsp;:</b> <a href="../fr/About_FreeCAD.html" title="About FreeCAD/fr">&Agrave; propos de FreeCAD</a>, <a href="../fr/Interface.html" title="Interface/fr">Interface</a>, <a href="../fr/Mouse_navigation.html" title="Mouse navigation/fr">Navigation par la souris</a>, <a href="../fr/Selection_methods.html" title="Selection methods/fr">M&eacute;thodes de s&eacute;lection</a>, <a href="../fr/Object_name.html" title="Object name/fr">Objet name</a>, <a href="../fr/Preferences_Editor.html" title="Preferences Editor/fr">Pr&eacute;f&eacute;rences</a>, <a href="../fr/Workbenches.html" title="Workbenches/fr">Ateliers</a>, <a href="../fr/Document_structure.html" title="Document structure/fr">Structure du document</a>, <a href="../fr/Property.html" title="Property/fr">Propri&eacute;t&eacute;s</a>, <a href="../fr/Help_FreeCAD.html" title="Help FreeCAD/fr">Contribuer &agrave; FreeCAD</a>, <a href="../fr/Donate.html" title="Donate/fr">Faire un don</a></li></ul>
<hr>
<ul><li><b>Aide&nbsp;:</b> <a href="../fr/Tutorials.html" title="Tutorials/fr">Tutoriels</a>, <a href="../fr/Video_tutorials.html" title="Video tutorials/fr">Tutoriels vid&eacute;o</a></li>
<li><b><a href="../fr/Workbenches.html" title="Workbenches/fr">Ateliers</a>&nbsp;:</b> <a href="../fr/Std_Base.html" title="Std Base/fr">Std Base</a>, <a href="../fr/Assembly_Workbench.html" title="Assembly Workbench/fr">Assembly</a>, <a href="../fr/BIM_Workbench.html" title="BIM Workbench/fr">BIM</a>, <a href="../fr/CAM_Workbench.html" title="CAM Workbench/fr">CAM</a>, <a href="../fr/Draft_Workbench.html" title="Draft Workbench/fr">Draft</a>, <a href="../fr/FEM_Workbench.html" title="FEM Workbench/fr">FEM</a>, <a href="../fr/Inspection_Workbench.html" title="Inspection Workbench/fr">Inspection</a>, <a href="../fr/Material_Workbench.html" title="Material Workbench/fr">Material</a>, <a href="../fr/Mesh_Workbench.html" title="Mesh Workbench/fr">Mesh</a>, <a href="../fr/OpenSCAD_Workbench.html" title="OpenSCAD Workbench/fr">OpenSCAD</a>, <a href="../fr/Part_Workbench.html" title="Part Workbench/fr">Part</a>, <a href="../fr/PartDesign_Workbench.html" title="PartDesign Workbench/fr">PartDesign</a>, <a href="../fr/Points_Workbench.html" title="Points Workbench/fr">Points</a>, <a href="../fr/Reverse_Engineering_Workbench.html" title="Reverse Engineering Workbench/fr">Reverse Engineering</a>, <a href="../fr/Robot_Workbench.html" title="Robot Workbench/fr">Robot</a>, <a href="../fr/Sketcher_Workbench.html" title="Sketcher Workbench/fr">Sketcher</a>, <a href="../fr/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/fr">Spreadsheet</a>, <a href="../fr/Surface_Workbench.html" title="Surface Workbench/fr">Surface</a>, <a href="../fr/TechDraw_Workbench.html" title="TechDraw Workbench/fr">TechDraw</a>, <a href="../fr/Testing.html" title="Testing/fr">Test</a></li></ul>
<hr>
<ul><li><b><a href="../fr/Addon.html" title="Addon/fr">Addons</a>&nbsp;:</b> <a href="../fr/Std_AddonMgr.html" title="Std AddonMgr/fr">Gestionnaire des extensions</a>, <a href="../fr/External_workbenches.html" title="External workbenches/fr">Ateliers externes</a>, <a href="../fr/Scripting_and_macros.html" title="Scripting and macros/fr">Scripts et macros</a></li></ul>
<hr>
<ul><li><b>Hubs&nbsp;:</b> <a href="../fr/User_hub.html" title="User hub/fr">Hub utilisateurs</a>, <a href="../fr/Power_users_hub.html" title="Power users hub/fr">Hub utilisateurs exp&eacute;riment&eacute;s</a>, <a href="../fr/Developer_hub.html" title="Developer hub/fr">Hub D&eacute;veloppeurs</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20260228114034
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.046 seconds
Real time usage: 0.071 seconds
Preprocessor visited node count: 304/1000000
Post&#8208;expand include size: 6572/2097152 bytes
Template argument size: 2189/2097152 bytes
Highest expansion depth: 5/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1597/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   15.072      1 -total
 45.71%    6.890      1 Template:Userdocnavi/fr
 23.01%    3.468      1 Template:Navigation_menu_2
 21.26%    3.204     32 Template:Incode
 20.44%    3.080      1 Template:TOCright
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:128548-0!canonical and timestamp 20260228114034 and revision id 1760752. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>