<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Feature editing/fr</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="fr" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Feature+editing&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/Feature_editing.html" class="mw-pt-progress mw-pt-progress--complete" title="Formelemente bearbeiten (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Feature_editing.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Feature editing (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../tr/Feature_editing.html" class="mw-pt-progress mw-pt-progress--low" title="Feature editing/tr (3% translated)" lang="tr" dir="ltr">T&uuml;rk&ccedil;e</a></li>
<li><a href="../es/Feature_editing.html" class="mw-pt-progress mw-pt-progress--med" title="Edici&oacute;n de operaciones (28% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="fr" dir="ltr">fran&ccedil;ais</span></li>
<li><a href="../hr/Feature_editing.html" class="mw-pt-progress mw-pt-progress--low" title="Ure&#273;ivanje osobina (10% translated)" lang="hr" dir="ltr">hrvatski</a></li>
<li><a href="../it/Feature_editing.html" class="mw-pt-progress mw-pt-progress--complete" title="Editazione delle funzioni (100% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Feature_editing.html" class="mw-pt-progress mw-pt-progress--complete" title="Edycja cech (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt-br/Feature_editing.html" class="mw-pt-progress mw-pt-progress--low" title="Edi&ccedil;&atilde;o de recursos (7% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../ro/Feature_editing.html" class="mw-pt-progress mw-pt-progress--med" title="Feature editing/ro (21% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><a href="../sk/Feature_editing.html" class="mw-pt-progress mw-pt-progress--low" title="&Uacute;prava prvkov (7% translated)" lang="sk" dir="ltr">sloven&#269;ina</a></li>
<li><a href="../cs/Feature_editing.html" class="mw-pt-progress mw-pt-progress--low" title="&Uacute;pravy prvk&#367; (14% translated)" lang="cs" dir="ltr">&#269;e&scaron;tina</a></li>
<li><a href="../ru/Feature_editing.html" class="mw-pt-progress mw-pt-progress--med" title="&#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1084; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1093; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; (45% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li>
<li><a href="../ja/Feature_editing.html" class="mw-pt-progress mw-pt-progress--med" title="&#29305;&#24500;&#12398;&#32232;&#38598; (17% translated)" lang="ja" dir="ltr">&#26085;&#26412;&#35486;</a></li>
<li><a href="../ko/Feature_editing.html" class="mw-pt-progress mw-pt-progress--high" title="&#53945;&#51669; &#54200;&#51665;&#54616;&#44592; (97% translated)" lang="ko" dir="ltr">&#54620;&#44397;&#50612;</a></li></ul></div>
<div style="clear:right; margin-bottom: .5em; float: right; padding: .5em 0 .8em 1.4em; background: none;"><meta property="mw:PageProp/toc"></div>
<h2><span class="mw-headline" id="Introduction">Introduction</span></h2>
<p>Cette page explique le processus d'&eacute;dition des fonctionnalit&eacute;s de <span typeof="mw:File"><a href="../index.php?title=Workbench_PartDesign.svg&amp;filetimestamp=20240405092932&amp;.html" class="mw-file-description"><img src="../File/Workbench_PartDesign.svg" decoding="async" width="32" height="32" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../fr/PartDesign_Workbench.html" title="PartDesign Workbench/fr">l'atelier PartDesign</a>.
</p><p><span id="Body"></span>
</p>
<h2><span class="mw-headline" id="Corps">Corps</span></h2>
<p>Pour travailler avec PartDesign, il faut d'abord cr&eacute;er un <span typeof="mw:File"><a href="../index.php?title=PartDesign_Body.svg&amp;filetimestamp=20191125185840&amp;.html" class="mw-file-description"><img src="../File/PartDesign_Body.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../fr/PartDesign_Body.html" title="PartDesign Body/fr">Corps</a>. Le corps est un conteneur destin&eacute; &agrave; contenir un seul solide contigu. Lorsqu'un corps est cr&eacute;&eacute;, un objet Origine, un syst&egrave;me de coordonn&eacute;es local compos&eacute; de plans de r&eacute;f&eacute;rence standard (XY, XZ, YZ) et d'axes (X, Y, Z), est automatiquement ajout&eacute;. Le solide est ensuite construit en ajoutant des fonctions. Chaque <a href="../fr/PartDesign_Feature.html" title="PartDesign Feature/fr">fonction</a> est cumulative et s'ajoute ou se soustrait au r&eacute;sultat de la fonction pr&eacute;c&eacute;dente.
</p><p><span typeof="mw:File"><a href="../index.php?title=PartDesign_Feature_example.png&amp;filetimestamp=20191224005754&amp;.html" class="mw-file-description"><img src="../File/PartDesign_Feature_example.png" decoding="async" width="400" height="207" class="mw-file-element" data-file-width="702" data-file-height="363"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">L'&eacute;dition de fonctions en pratique. De gauche &agrave; droite&nbsp;:<br>
Corps avec une fonction <a href="../fr/PartDesign_AdditiveBox.html" title="PartDesign AdditiveBox/fr">pav&eacute; droit</a>.<br>
Corps avec un pav&eacute; droit et une fonction <a href="../fr/PartDesign_Chamfer.html" title="PartDesign Chamfer/fr">chanfrein</a>.<br>
Corps avec un pav&eacute; droit, un chanfrein et une fonction <a href="../fr/PartDesign_Pocket.html" title="PartDesign Pocket/fr">cavit&eacute;</a>.</p>
<p>Un document peut contenir plusieurs corps, mais un seul peut &ecirc;tre actif. Les nouvelles fonctionnalit&eacute;s sont ajout&eacute;es au corps actif. Un corps peut &ecirc;tre activ&eacute; ou d&eacute;sactiv&eacute; en double-cliquant dessus dans la <a href="../fr/Tree_view.html" class="mw-redirect" title="Tree view/fr">vue en arborescence</a>. Le corps activ&eacute; est mis en &eacute;vidence dans la vue en arborescence.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=PartDesign_Body_tree.png&amp;filetimestamp=20191214042252&amp;.html" class="mw-file-description"><img src="../File/PartDesign_Body_tree.png" decoding="async" width="251" height="315" class="mw-file-element" data-file-width="251" data-file-height="315"></a></span>
</p><p><span id="What_is_a_contiguous_solid?"></span>
</p>
<h3><span id="Qu.27est-ce_qu.27un_solide_contigu_.3F"></span><span class="mw-headline" id="Qu'est-ce_qu'un_solide_contigu_?">Qu'est-ce qu'un solide contigu&nbsp;?</span></h3>
<p>Un solide contigu est un objet tel qu'une pi&egrave;ce coul&eacute;e ou usin&eacute;e &agrave; partir d'un seul bloc de m&eacute;tal. Si l'objet comporte des clous, des vis ou de la colle, il ne s'agit pas d'un solide contigu. En pratique, une chaise en bois serait compos&eacute;e de plusieurs corps, un pour chacun de ses sous-composants (pieds, lattes, si&egrave;ge, etc.).
</p><p>Dans la version 1.0 de FreeCAD, une propri&eacute;t&eacute; exp&eacute;rimentale a &eacute;t&eacute; introduite qui permet au corps d'avoir des solides non contigus. Cette propri&eacute;t&eacute; peut &eacute;galement &ecirc;tre d&eacute;finie dans les <a href="../fr/PartDesign_Preferences.html#G%C3%A9n%C3%A9ral" title="PartDesign Preferences/fr">pr&eacute;f&eacute;rences</a> comme valeur par d&eacute;faut pour les corps nouvellement cr&eacute;&eacute;s. Ceci n'est pas destin&eacute; &agrave; &ecirc;tre utilis&eacute; pour construire, comme dans l'exemple, une chaise dans un corps. Il s'agit d'autoriser les fonctions qui peuvent g&eacute;n&eacute;rer des solides discontinus qui seront rendus contigus par des fonctions ult&eacute;rieures.
</p><p>Lorsqu'un mod&egrave;le n&eacute;cessite plusieurs corps, comme la chaise en bois, le <span typeof="mw:File"><a href="../index.php?title=Std_Part.svg&amp;filetimestamp=20240411203637&amp;.html" class="mw-file-description"><img src="../File/Std_Part.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../fr/Std_Part.html" title="Std Part/fr">Part Conteneur</a> &agrave; usage g&eacute;n&eacute;ral peut &ecirc;tre utilis&eacute; pour les regrouper et d&eacute;placer l'ensemble en tant qu'unit&eacute;.
</p><p><span id="Body_visibility_management"></span>
</p>
<h3><span id="Gestion_de_la_visibilit.C3.A9_du_corps"></span><span class="mw-headline" id="Gestion_de_la_visibilit&eacute;_du_corps">Gestion de la visibilit&eacute; du corps</span></h3>
<p>Par d&eacute;faut, un corps expose &agrave; l'ext&eacute;rieur par d&eacute;faut la fonction la plus r&eacute;cente. Cette fonction est la fonction r&eacute;sultante du corps. La pointe marque &eacute;galement l'endroit o&ugrave; de nouvelles caract&eacute;ristiques sont ajout&eacute;es. Il est possible de red&eacute;finir temporairement la fonction r&eacute;sultante en une fonction situ&eacute;e au milieu du corps afin d'y ins&eacute;rer de nouveaux objets (fonctions, esquisses ou g&eacute;om&eacute;trie de r&eacute;f&eacute;rence). Lorsqu'une nouvelle fonction est ajout&eacute;e au corps, la visibilit&eacute; de la pr&eacute;c&eacute;dente fonction est d&eacute;sactiv&eacute;e et la nouvelle fonction devient la fonction r&eacute;sultante.
</p><p>Il ne peut y avoir qu'une seule fonction visible &agrave; la fois. Il est possible de <a href="../fr/Std_ToggleVisibility.html" title="Std ToggleVisibility/fr">basculer la visibilit&eacute;</a> de n'importe quelle fonction du corps, en la s&eacute;lectionnant dans l'arborescence et en appuyant sur la <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">barre d'espace</span>, ce qui permet de revenir en arri&egrave;re dans l'historique du corps. Notez que la modification de la visibilit&eacute; des fonctions ne modifie pas la fonction r&eacute;sultante du corps.
</p><p><span id="Moving_and_Reordering_Objects"></span>
</p>
<h3><span id="D.C3.A9placer_et_r.C3.A9ordonner_des_objets"></span><span class="mw-headline" id="D&eacute;placer_et_r&eacute;ordonner_des_objets">D&eacute;placer et r&eacute;ordonner des objets</span></h3>
<p>Les fonctions d'un corps peuvent &ecirc;tre r&eacute;organis&eacute;es ou d&eacute;plac&eacute;es vers un autre corps. S&eacute;lectionnez la fonction et cliquez avec le bouton droit de la souris pour obtenir un menu contextuel proposant les deux options. L'op&eacute;ration peut &ecirc;tre emp&ecirc;ch&eacute;e si l'objet a des d&eacute;pendances dans le corps source, par exemple s'il est attach&eacute; &agrave; une face. Pour d&eacute;placer une esquisse vers un autre corps, elle ne doit pas contenir de liens vers une g&eacute;om&eacute;trie externe.
</p><p><span typeof="mw:File"><a href="../index.php?title=PartDesign_workflow.svg&amp;filetimestamp=20241127160520&amp;.html" class="mw-file-description"><img src="../File/PartDesign_workflow.svg" decoding="async" width="400" height="400" class="mw-file-element" data-file-width="424" data-file-height="424"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Repr&eacute;sentation sch&eacute;matique du flux de travail de PartDesign</p>
<p><span id="Datum_geometry"></span>
</p>
<h2><span id="G.C3.A9om.C3.A9tries_de_r.C3.A9f.C3.A9rence"></span><span class="mw-headline" id="G&eacute;om&eacute;tries_de_r&eacute;f&eacute;rence">G&eacute;om&eacute;tries de r&eacute;f&eacute;rence</span></h2>
<p>Les g&eacute;om&eacute;tries de r&eacute;f&eacute;rence consistent en des plans personnalis&eacute;s, des droites, des points ou des formes li&eacute;es de l'ext&eacute;rieur du corps. Elles peuvent &ecirc;tre cr&eacute;&eacute;es afin de servir de r&eacute;f&eacute;rence &agrave; des esquisses et des fonctions. Il y a plusieurs options d'<a href="../fr/Part_EditAttachment.html" title="Part EditAttachment/fr">ancrage</a> aux objets de r&eacute;f&eacute;rence.
</p><p>Dans FreeCAD, les plans de r&eacute;f&eacute;rence sont utiles si vous placez des esquisses dans des orientations non standard, c'est-&agrave;-dire sur des plans d&eacute;cal&eacute;s ou pivot&eacute;s autour des trois axes principaux. Mais comme les esquisses peuvent &eacute;galement &ecirc;tre plac&eacute;es dans des orientations non standard et qu'elles disposent des m&ecirc;mes options d'ancrage que les plans de r&eacute;f&eacute;rence, il n'est souvent pas n&eacute;cessaire de les utiliser. Les plans de r&eacute;f&eacute;rence sont plus utiles si plusieurs esquisses ont la m&ecirc;me orientation non standard. L'ajustement de l'orientation du plan de r&eacute;f&eacute;rence entra&icirc;ne l'ajustement de toutes les esquisses associ&eacute;es et des fonctions cr&eacute;&eacute;es &agrave; partir de ces esquisses.
</p><p>Bien que la version 1.0 de FreeCAD dispose d&eacute;j&agrave; d'un code permettant d'att&eacute;nuer le <a href="../fr/Topological_naming_problem.html" title="Topological naming problem/fr">probl&egrave;me de d&eacute;nomination topologique</a>, la meilleure pratique consiste toujours &agrave; ancrer les esquisses et les plans de r&eacute;f&eacute;rence aux plans de base de l'origine du corps chaque fois que cela est possible. La r&eacute;f&eacute;rence &agrave; une g&eacute;om&eacute;trie g&eacute;n&eacute;r&eacute;e (g&eacute;om&eacute;trie r&eacute;sultant d'une op&eacute;ration sur une fonction, par exemple une protrusion ou une cavit&eacute;) peut n&eacute;anmoins donner lieu &agrave; des mod&egrave;les moins stables. Voir <a href="#Conseils_pour_la_cr%C3%A9ation_de_mod%C3%A8les_robustes">Conseils pour la cr&eacute;ation de mod&egrave;les robustes</a> ci-dessous.
</p><p><span id="Advice_for_creating_stable_models"></span>
</p>
<h2><span id="Conseils_pour_la_cr.C3.A9ation_de_mod.C3.A8les_robustes"></span><span class="mw-headline" id="Conseils_pour_la_cr&eacute;ation_de_mod&egrave;les_robustes">Conseils pour la cr&eacute;ation de mod&egrave;les robustes</span></h2>
<p>Le principe de conception param&eacute;trique sous-tend que quand les valeurs de certains param&egrave;tres sont chang&eacute;es, les &eacute;tapes subs&eacute;quentes seront automatiquement mises &agrave; jour selon ces nouvelles valeurs. Toutefois, quand des changements importants sont apport&eacute;s, le mod&egrave;le peut casser en raison du probl&egrave;me de <a href="../fr/Topological_naming_problem.html" title="Topological naming problem/fr">probl&egrave;me de nommage topologique</a> qui est toujours non r&eacute;solu dans FreeCAD. La casse peut &ecirc;tre minimis&eacute;e si vous respectez les principes de conception suivants&nbsp;:
</p>
<ul><li>&Eacute;vitez d'ancrer des esquisses et des g&eacute;om&eacute;tries de r&eacute;f&eacute;rence personnalis&eacute;es &agrave; la g&eacute;om&eacute;trie g&eacute;n&eacute;r&eacute;e, c'est-&agrave;-dire &agrave; toute face, ar&ecirc;te ou sommet du solide du mod&egrave;le. Ancrez-les plut&ocirc;t aux plans/axes standard de l'origine du corps. Les esquisses ancr&eacute;es &agrave; des plans/axes standard ou &agrave; des g&eacute;om&eacute;tries de r&eacute;f&eacute;rence ancr&eacute;es &agrave; des plans/axes standard ne seront pas r&eacute;ancr&eacute;es de mani&egrave;re inattendue &agrave; une r&eacute;f&eacute;rence diff&eacute;rente. Utilisez des d&eacute;calages d'ancrage si n&eacute;cessaire.</li>
<li>Utilisez une &laquo;&nbsp;esquisse principale&nbsp;&raquo;. L'esquisse principale &eacute;tant r&eacute;alis&eacute;e avant le reste du mod&egrave;le, elle ne peut faire r&eacute;f&eacute;rence qu'aux plans/axes standard.
<ul><li>L'esquisse principale doit &ecirc;tre aussi simple que possible et contenir les &eacute;l&eacute;ments g&eacute;om&eacute;triques de base de votre mod&egrave;le.</li>
<li>Les &eacute;l&eacute;ments de l'esquisse principale peuvent &ecirc;tre r&eacute;f&eacute;renc&eacute;s lors de la mod&eacute;lisation des &eacute;l&eacute;ments suivants.</li>
<li>L'esquisse principale peut &ecirc;tre la premi&egrave;re esquisse du corps ou &ecirc;tre compl&egrave;tement en dehors du corps. Dans le premier cas, elle peut &ecirc;tre r&eacute;f&eacute;renc&eacute;e directement en tant que g&eacute;om&eacute;trie externe, dans le second, elle peut &ecirc;tre r&eacute;f&eacute;renc&eacute;e via une <span typeof="mw:File"><a href="../index.php?title=PartDesign_ShapeBinder.svg&amp;filetimestamp=20170324054939&amp;.html" class="mw-file-description"><img src="../File/PartDesign_ShapeBinder.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../fr/PartDesign_ShapeBinder.html" title="PartDesign ShapeBinder/fr">forme li&eacute;e</a> ou une <span typeof="mw:File"><a href="../index.php?title=PartDesign_SubShapeBinder.svg&amp;filetimestamp=20191125191133&amp;.html" class="mw-file-description"><img src="../File/PartDesign_SubShapeBinder.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../fr/PartDesign_SubShapeBinder.html" title="PartDesign SubShapeBinder/fr">sous forme li&eacute;e</a>.</li></ul></li>
<li>Ne cr&eacute;ez pas de (sous) forme li&eacute;e &agrave; partir de la g&eacute;om&eacute;trie g&eacute;n&eacute;r&eacute;e. Gardez &agrave; l'esprit que les (sous) formes li&eacute;es peuvent poser probl&egrave;me si la g&eacute;om&eacute;trie est supprim&eacute;e de l'esquisse sur laquelle elle est bas&eacute;e.</li>
<li>Essayez toujours de r&eacute;f&eacute;rencer d'abord une esquisse ou une g&eacute;om&eacute;trie d'esquisse plut&ocirc;t qu'une g&eacute;om&eacute;trie g&eacute;n&eacute;r&eacute;e. Si vous devez in&eacute;vitablement r&eacute;f&eacute;rencer une g&eacute;om&eacute;trie g&eacute;n&eacute;r&eacute;e, utilisez la premi&egrave;re fonction o&ugrave; se trouve l'&eacute;l&eacute;ment &agrave; r&eacute;f&eacute;rencer. Les modifications apport&eacute;es aux &eacute;tapes ult&eacute;rieures n'endommageront pas votre mod&egrave;le.</li>
<li>Utilisez les finitions, tels que les cong&eacute;s et les chanfreins, le plus tard possible dans l'arbre des fonctions.</li></ul>
<p><span id="Tutorials"></span>
</p>
<h2><span class="mw-headline" id="Tutoriels">Tutoriels</span></h2>
<p>La page des <a href="../fr/Tutorials.html" title="Tutorials/fr">tutoriels</a> fournit quelques exemples d'utilisation de la m&eacute;thode d'&eacute;dition des fonctions de l'<span typeof="mw:File"><a href="../index.php?title=Workbench_PartDesign.svg&amp;filetimestamp=20240405092932&amp;.html" class="mw-file-description"><img src="../File/Workbench_PartDesign.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../fr/PartDesign_Workbench.html" title="PartDesign Workbench/fr">atelier PartDesign</a>.
</p>
<ul><li><a href="../fr/Creating_a_simple_part_with_PartDesign.html" title="Creating a simple part with PartDesign/fr">PartDesign Tutoriel pour cr&eacute;er une pi&egrave;ce simple</a></li>
<li><a href="../fr/Basic_Part_Design_Tutorial_019.html" title="Basic Part Design Tutorial 019/fr">PartDesign Tutoriel d'introduction V0.19</a></li>
<li><a href="../fr/Basic_Attachment_Tutorial.html" title="Basic Attachment Tutorial/fr">Tutoriel La base de l'ancrage</a></li></ul>
<p><span id="Related"></span>
</p>
<h2><span class="mw-headline" id="En_relation">En relation</span></h2>
<ul><li><a href="../fr/Constructive_solid_geometry.html" title="Constructive solid geometry/fr">G&eacute;om&eacute;trie Solide Constructive</a></li></ul>
<p><br>
</p>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><a href="../fr/PartDesign_Workbench.html" title="PartDesign Workbench/fr">PartDesign</a> <span typeof="mw:File"><a href="../index.php?title=Workbench_PartDesign.svg&amp;filetimestamp=20240405092932&amp;.html" class="mw-file-description"><img src="../File/Workbench_PartDesign.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b>Outils d'aide&nbsp;:</b> <a href="../fr/PartDesign_Body.html" title="PartDesign Body/fr">Cr&eacute;er un corps</a>, <a href="../fr/PartDesign_NewSketch.html" title="PartDesign NewSketch/fr">Cr&eacute;er une esquisse</a>, <a href="../fr/Sketcher_MapSketch.html" title="Sketcher MapSketch/fr">Ancrer une esquisse</a>, <a href="../fr/Sketcher_EditSketch.html" title="Sketcher EditSketch/fr">&Eacute;diter une esquisse</a>, <a href="../fr/Sketcher_ValidateSketch.html" title="Sketcher ValidateSketch/fr">Valider une esquisse</a>, <a href="../fr/Part_CheckGeometry.html" title="Part CheckGeometry/fr">V&eacute;rifier la g&eacute;om&eacute;trie</a>,  <a href="../fr/PartDesign_SubShapeBinder.html" title="PartDesign SubShapeBinder/fr">Cr&eacute;er une sous forme li&eacute;e</a>, <a href="../fr/PartDesign_Clone.html" title="PartDesign Clone/fr">Cr&eacute;er un clone</a></li></ul>
<hr>
<ul><li><b>Outils de mod&eacute;lisation&nbsp;:</b>
<ul><li><b>Outils additifs&nbsp;:</b> <a href="../fr/PartDesign_Pad.html" title="PartDesign Pad/fr">Protrusion</a>, <a href="../fr/PartDesign_Revolution.html" title="PartDesign Revolution/fr">R&eacute;volution</a>, <a href="../fr/PartDesign_AdditiveLoft.html" title="PartDesign AdditiveLoft/fr">Lissage additif</a>, <a href="../fr/PartDesign_AdditivePipe.html" title="PartDesign AdditivePipe/fr">Balayage additif</a>, <a href="../fr/PartDesign_AdditiveHelix.html" title="PartDesign AdditiveHelix/fr">H&eacute;lice additive</a>, <a href="../fr/PartDesign_AdditiveBox.html" title="PartDesign AdditiveBox/fr">Cube additif</a>, <a href="../fr/PartDesign_AdditiveCylinder.html" title="PartDesign AdditiveCylinder/fr">Cylindre additif</a>, <a href="../fr/PartDesign_AdditiveSphere.html" title="PartDesign AdditiveSphere/fr">Sph&egrave;re additive</a>, <a href="../fr/PartDesign_AdditiveCone.html" title="PartDesign AdditiveCone/fr">C&ocirc;ne additif</a>, <a href="../fr/PartDesign_AdditiveEllipsoid.html" title="PartDesign AdditiveEllipsoid/fr">Ellipso&iuml;de additif</a>, <a href="../fr/PartDesign_AdditiveTorus.html" title="PartDesign AdditiveTorus/fr">Tore additif</a>, <a href="../fr/PartDesign_AdditivePrism.html" title="PartDesign AdditivePrism/fr">Prisme additif</a>, <a href="../fr/PartDesign_AdditiveWedge.html" title="PartDesign AdditiveWedge/fr">Pyramide tronqu&eacute;e additive</a></li>
<li><b>Outils soustractifs&nbsp;:</b> <a href="../fr/PartDesign_Pocket.html" title="PartDesign Pocket/fr">Cavit&eacute;</a>, <a href="../fr/PartDesign_Hole.html" title="PartDesign Hole/fr">Per&ccedil;age</a>, <a href="../fr/PartDesign_Groove.html" title="PartDesign Groove/fr">Rainure</a>, <a href="../fr/PartDesign_SubtractiveLoft.html" title="PartDesign SubtractiveLoft/fr">Lissage soustractif</a>, <a href="../fr/PartDesign_SubtractivePipe.html" title="PartDesign SubtractivePipe/fr">Balayage soustractif</a>, <a href="../fr/PartDesign_SubtractiveHelix.html" title="PartDesign SubtractiveHelix/fr">H&eacute;lice soustractive</a>, <a href="../fr/PartDesign_SubtractiveBox.html" title="PartDesign SubtractiveBox/fr">Cube soustractif</a>, <a href="../fr/PartDesign_SubtractiveCylinder.html" title="PartDesign SubtractiveCylinder/fr">Cylindre soustractif</a>, <a href="../fr/PartDesign_SubtractiveSphere.html" title="PartDesign SubtractiveSphere/fr">Sph&egrave;re soustractive</a>, <a href="../fr/PartDesign_SubtractiveCone.html" title="PartDesign SubtractiveCone/fr">C&ocirc;ne soustractif</a>, <a href="../fr/PartDesign_SubtractiveEllipsoid.html" title="PartDesign SubtractiveEllipsoid/fr">Ellipso&iuml;de soustractif</a>, <a href="../fr/PartDesign_SubtractiveTorus.html" title="PartDesign SubtractiveTorus/fr">Tore soustractif</a>, &lrm;<a href="../fr/PartDesign_SubtractivePrism.html" title="PartDesign SubtractivePrism/fr">Prisme soustractif</a>, <a href="../fr/PartDesign_SubtractiveWedge.html" title="PartDesign SubtractiveWedge/fr">Pyramide tronqu&eacute;e soustractive</a></li>
<li><b>Bool&eacute;en&nbsp;:</b> <a href="../fr/PartDesign_Boolean.html" title="PartDesign Boolean/fr">Op&eacute;rations bool&eacute;ennes</a></li></ul></li></ul>
<hr>
<ul><li><b>Fonctions d'habillage&nbsp;:</b> <a href="../fr/PartDesign_Fillet.html" title="PartDesign Fillet/fr">Cong&eacute;</a>, <a href="../fr/PartDesign_Chamfer.html" title="PartDesign Chamfer/fr">Chanfrein</a>, <a href="../fr/PartDesign_Draft.html" title="PartDesign Draft/fr">D&eacute;pouille</a>, <a href="../fr/PartDesign_Thickness.html" title="PartDesign Thickness/fr">&Eacute;videment</a></li>
<li><b>Outils de transformation&nbsp;:</b> <a href="../fr/PartDesign_Mirrored.html" title="PartDesign Mirrored/fr">Sym&eacute;trie</a>, <a href="../fr/PartDesign_LinearPattern.html" title="PartDesign LinearPattern/fr">R&eacute;p&eacute;tition lin&eacute;aire</a>, <a href="../fr/PartDesign_PolarPattern.html" title="PartDesign PolarPattern/fr">R&eacute;p&eacute;tition circulaire</a>, <a href="../fr/PartDesign_MultiTransform.html" title="PartDesign MultiTransform/fr">Transformation multiple</a>, <a href="../fr/PartDesign_Scaled.html" title="PartDesign Scaled/fr">Mise &agrave; l'&eacute;chelle</a></li></ul>
<hr>
<ul><li><b>Outils additionnels&nbsp;:</b> <a href="../fr/PartDesign_ShapeBinder.html" title="PartDesign ShapeBinder/fr">Cr&eacute;er une forme li&eacute;e</a>, <a href="../fr/PartDesign_InvoluteGear.html" title="PartDesign InvoluteGear/fr">Roue dent&eacute;e &agrave; d&eacute;veloppante</a>, <a href="../fr/PartDesign_Sprocket.html" title="PartDesign Sprocket/fr">Pignon</a>, <a href="../fr/PartDesign_WizardShaft.html" title="PartDesign WizardShaft/fr">Conception d'arbre</a>,</li>
<li><b>Menu contextuel&nbsp;:</b> <a href="../index.php?title=PartDesign_Suppressed/fr&amp;action=edit&amp;redlink=1.html" class="new" title="PartDesign Suppressed/fr (page does not exist)">Suppressed</a>, <a href="../fr/PartDesign_MoveTip.html" title="PartDesign MoveTip/fr">D&eacute;signer comme fonction r&eacute;sultante</a>, <a href="../fr/PartDesign_MoveFeature.html" title="PartDesign MoveFeature/fr">D&eacute;placer l'objet</a>, <a href="../fr/PartDesign_MoveFeatureInTree.html" title="PartDesign MoveFeatureInTree/fr">D&eacute;placer apr&egrave;s une autre fonction</a></li>
<li><b>Pr&eacute;f&eacute;rences&nbsp;:</b> <a href="../fr/PartDesign_Preferences.html" title="PartDesign Preferences/fr">Pr&eacute;f&eacute;rences</a>, <a href="../fr/Fine-tuning.html" title="Fine-tuning/fr">R&eacute;glage fin</a></li></ul></div>
    </div></div>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><span typeof="mw:File"><a href="../index.php?title=User_hub.png&amp;filetimestamp=20190221145008&amp;.html" class="mw-file-description"><img src="../File/User_hub.png" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../fr/User_hub.html" title="User hub/fr">Hub utilisateurs</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b><a href="../fr/Getting_started.html" title="Getting started/fr">D&eacute;marrer avec FreeCAD</a></b></li>
<li><b>Installation&nbsp;:</b> <a href="../fr/Download.html" title="Download/fr">T&eacute;l&eacute;chargements</a>, <a href="../fr/Installing_on_Windows.html" title="Installing on Windows/fr">Windows</a>, <a href="../fr/Installing_on_Linux.html" title="Installing on Linux/fr">Linux</a>, <a href="../fr/Installing_on_Mac.html" title="Installing on Mac/fr">Mac</a>, <a href="../fr/Installing_additional_components.html" title="Installing additional components/fr">Logiciels suppl&eacute;mentaires</a>, <a href="../fr/Compile_on_Docker.html" title="Compile on Docker/fr">Docker</a>, <a href="../fr/AppImage.html" title="AppImage/fr">AppImage</a>, <a href="../fr/Ubuntu_Snap.html" title="Ubuntu Snap/fr">Ubuntu Snap</a></li>
<li><b>Bases&nbsp;:</b> <a href="../fr/About_FreeCAD.html" title="About FreeCAD/fr">&Agrave; propos de FreeCAD</a>, <a href="../fr/Interface.html" title="Interface/fr">Interface</a>, <a href="../fr/Mouse_navigation.html" title="Mouse navigation/fr">Navigation par la souris</a>, <a href="../fr/Selection_methods.html" title="Selection methods/fr">M&eacute;thodes de s&eacute;lection</a>, <a href="../fr/Object_name.html" title="Object name/fr">Objet name</a>, <a href="../fr/Preferences_Editor.html" title="Preferences Editor/fr">Pr&eacute;f&eacute;rences</a>, <a href="../fr/Workbenches.html" title="Workbenches/fr">Ateliers</a>, <a href="../fr/Document_structure.html" title="Document structure/fr">Structure du document</a>, <a href="../fr/Property.html" title="Property/fr">Propri&eacute;t&eacute;s</a>, <a href="../fr/Help_FreeCAD.html" title="Help FreeCAD/fr">Contribuer &agrave; FreeCAD</a>, <a href="../fr/Donate.html" title="Donate/fr">Faire un don</a></li></ul>
<hr>
<ul><li><b>Aide&nbsp;:</b> <a href="../fr/Tutorials.html" title="Tutorials/fr">Tutoriels</a>, <a href="../fr/Video_tutorials.html" title="Video tutorials/fr">Tutoriels vid&eacute;o</a></li>
<li><b><a href="../fr/Workbenches.html" title="Workbenches/fr">Ateliers</a>&nbsp;:</b> <a href="../fr/Std_Base.html" title="Std Base/fr">Std Base</a>, <a href="../fr/Assembly_Workbench.html" title="Assembly Workbench/fr">Assembly</a>, <a href="../fr/BIM_Workbench.html" title="BIM Workbench/fr">BIM</a>, <a href="../fr/CAM_Workbench.html" title="CAM Workbench/fr">CAM</a>, <a href="../fr/Draft_Workbench.html" title="Draft Workbench/fr">Draft</a>, <a href="../fr/FEM_Workbench.html" title="FEM Workbench/fr">FEM</a>, <a href="../fr/Inspection_Workbench.html" title="Inspection Workbench/fr">Inspection</a>, <a href="../fr/Material_Workbench.html" title="Material Workbench/fr">Material</a>, <a href="../fr/Mesh_Workbench.html" title="Mesh Workbench/fr">Mesh</a>, <a href="../fr/OpenSCAD_Workbench.html" title="OpenSCAD Workbench/fr">OpenSCAD</a>, <a href="../fr/Part_Workbench.html" title="Part Workbench/fr">Part</a>, <a href="../fr/PartDesign_Workbench.html" title="PartDesign Workbench/fr">PartDesign</a>, <a href="../fr/Points_Workbench.html" title="Points Workbench/fr">Points</a>, <a href="../fr/Reverse_Engineering_Workbench.html" title="Reverse Engineering Workbench/fr">Reverse Engineering</a>, <a href="../fr/Robot_Workbench.html" title="Robot Workbench/fr">Robot</a>, <a href="../fr/Sketcher_Workbench.html" title="Sketcher Workbench/fr">Sketcher</a>, <a href="../fr/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/fr">Spreadsheet</a>, <a href="../fr/Surface_Workbench.html" title="Surface Workbench/fr">Surface</a>, <a href="../fr/TechDraw_Workbench.html" title="TechDraw Workbench/fr">TechDraw</a>, <a href="../fr/Testing.html" title="Testing/fr">Test</a></li></ul>
<hr>
<ul><li><b><a href="../fr/Addon.html" title="Addon/fr">Addons</a>&nbsp;:</b> <a href="../fr/Std_AddonMgr.html" title="Std AddonMgr/fr">Gestionnaire des extensions</a>, <a href="../fr/External_workbenches.html" title="External workbenches/fr">Ateliers externes</a>, <a href="../fr/Scripting_and_macros.html" title="Scripting and macros/fr">Scripts et macros</a></li></ul>
<hr>
<ul><li><b>Hubs&nbsp;:</b> <a href="../fr/User_hub.html" title="User hub/fr">Hub utilisateurs</a>, <a href="../fr/Power_users_hub.html" title="Power users hub/fr">Hub utilisateurs exp&eacute;riment&eacute;s</a>, <a href="../fr/Developer_hub.html" title="Developer hub/fr">Hub D&eacute;veloppeurs</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20260225192447
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.068 seconds
Real time usage: 0.185 seconds
Preprocessor visited node count: 236/1000000
Post&#8208;expand include size: 16250/2097152 bytes
Template argument size: 5459/2097152 bytes
Highest expansion depth: 5/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 2863/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   19.704      1 -total
 30.05%    5.920      1 Template:PartDesign_Tools_navi/fr
 22.73%    4.479      2 Template:Caption
 19.01%    3.745      1 Template:Userdocnavi/fr
 18.23%    3.591      2 Template:Navigation_menu_2
 17.97%    3.541      1 Template:KEY
  6.70%    1.320      1 Template:TOCright
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:120063-0!canonical and timestamp 20260225192447 and revision id 1760245. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>