<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Feature editing/fr</span></h1><?xml encoding="UTF-8"><div class="mw-parser-output"><div class="mw-pt-languages noprint" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="wiki/de//Feature_editing.html" class="mw-pt-progress mw-pt-progress--complete" title="Formelemente bearbeiten (86% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="wiki//Feature_editing.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Feature editing (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="wiki/tr//Feature_editing.html" class="mw-pt-progress mw-pt-progress--stub" title="Feature editing/tr (3% translated)" lang="tr" dir="ltr">T&uuml;rk&ccedil;e</a></li>
<li><a href="wiki/es//Feature_editing.html" class="mw-pt-progress mw-pt-progress--low" title="Edici&oacute;n de operaciones (28% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--med" lang="fr" dir="ltr">fran&ccedil;ais</span></li>
<li><a href="wiki/hr//Feature_editing.html" class="mw-pt-progress mw-pt-progress--stub" title="Ure&#273;ivanje osobina (10% translated)" lang="hr" dir="ltr">hrvatski</a></li>
<li><a href="wiki/it//Feature_editing.html" class="mw-pt-progress mw-pt-progress--low" title="Editazione delle funzioni (34% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="wiki/pl//Feature_editing.html" class="mw-pt-progress mw-pt-progress--low" title="Edycja cech (38% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="wiki/pt-br//Feature_editing.html" class="mw-pt-progress mw-pt-progress--stub" title="Edi&ccedil;&atilde;o de recursos (7% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="wiki/ro//Feature_editing.html" class="mw-pt-progress mw-pt-progress--low" title="Feature editing/ro (21% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><a href="wiki/sk//Feature_editing.html" class="mw-pt-progress mw-pt-progress--stub" title="&Uacute;prava prvkov (7% translated)" lang="sk" dir="ltr">sloven&#269;ina</a></li>
<li><a href="wiki/ru//Feature_editing.html" class="mw-pt-progress mw-pt-progress--low" title="&#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1084; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1093; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; (28% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li>
<li><a href="wiki/ko//Feature_editing.html" class="mw-pt-progress mw-pt-progress--low" title="&#53945;&#51669; &#54200;&#51665;&#54616;&#44592; (34% translated)" lang="ko" dir="ltr">&#54620;&#44397;&#50612;</a></li></ul></div>
<div style="clear:right; margin-bottom: .5em; float: right; padding: .5em 0 .8em 1.4em; background: none;"><div id="toc" class="toc" role="navigation" aria-labelledby="mw-toc-heading"><input type="checkbox" role="button" id="toctogglecheckbox" class="toctogglecheckbox" style="display:none"><div class="toctitle" lang="en" dir="ltr"><h2 id="mw-toc-heading">Contents</h2><span class="toctogglespan"><label class="toctogglelabel" for="toctogglecheckbox"></label></span></div>
<ul>
<li class="toclevel-1 tocsection-1"><a href="#Introduction"><span class="tocnumber">1</span> <span class="toctext">Introduction</span></a></li>
<li class="toclevel-1 tocsection-2"><a href="#Corps"><span class="tocnumber">2</span> <span class="toctext">Corps</span></a>
<ul>
<li class="toclevel-2 tocsection-3"><a href="#What_is_a_contiguous_solid?"><span class="tocnumber">2.1</span> <span class="toctext">What is a contiguous solid?</span></a></li>
<li class="toclevel-2 tocsection-4"><a href="#Gestion_de_la_visibilit%C3%A9_du_corps"><span class="tocnumber">2.2</span> <span class="toctext">Gestion de la visibilit&eacute; du corps</span></a></li>
<li class="toclevel-2 tocsection-5"><a href="#D%C3%A9placer_et_r%C3%A9ordonner_des_objets"><span class="tocnumber">2.3</span> <span class="toctext">D&eacute;placer et r&eacute;ordonner des objets</span></a></li>
</ul>
</li>
<li class="toclevel-1 tocsection-6"><a href="#G%C3%A9om%C3%A9tries_de_r%C3%A9f%C3%A9rence"><span class="tocnumber">3</span> <span class="toctext">G&eacute;om&eacute;tries de r&eacute;f&eacute;rence</span></a></li>
<li class="toclevel-1 tocsection-7"><a href="#Conseils_pour_la_cr%C3%A9ation_de_mod%C3%A8les_robustes"><span class="tocnumber">4</span> <span class="toctext">Conseils pour la cr&eacute;ation de mod&egrave;les robustes</span></a></li>
<li class="toclevel-1 tocsection-8"><a href="#Tutoriels"><span class="tocnumber">5</span> <span class="toctext">Tutoriels</span></a></li>
<li class="toclevel-1 tocsection-9"><a href="#En_relation"><span class="tocnumber">6</span> <span class="toctext">En relation</span></a></li>
</ul>
</div>
</div>
<h2><span class="mw-headline" id="Introduction">Introduction</span></h2>
<p>Cette page explique le processus d'&eacute;dition des fonctionnalit&eacute;s de <span typeof="mw:File"><a href="../File/Workbench_PartDesign.svg" class="mw-file-description"><img src="../File/Workbench_PartDesign.svg" decoding="async" width="32" height="32"></a></span> <a href="wiki/fr//PartDesign_Workbench.html" title="PartDesign Workbench/fr">l'atelier PartDesign</a>.
</p><p><span id="Body"></span>
</p>
<h2><span class="mw-headline" id="Corps">Corps</span></h2>
<p>Pour travailler avec PartDesign, il faut d'abord cr&eacute;er un <span typeof="mw:File"><a href="../File/PartDesign_Body.svg" class="mw-file-description"><img src="../File/PartDesign_Body.svg" decoding="async" width="16" height="16"></a></span> <a href="wiki/fr//PartDesign_Body.html" title="PartDesign Body/fr">Corps</a>. Le corps est un conteneur destin&eacute; &agrave; contenir un seul solide contigu. Lorsqu'un corps est cr&eacute;&eacute;, un objet Origine, un syst&egrave;me de coordonn&eacute;es local compos&eacute; de plans de r&eacute;f&eacute;rence standard (XY, XZ, YZ) et d'axes (X, Y, Z), est automatiquement ajout&eacute;. Le solide est ensuite construit en ajoutant des fonctions. Chaque <a href="wiki/fr//PartDesign_Feature.html" title="PartDesign Feature/fr">fonction</a> est cumulative et s'ajoute ou se soustrait au r&eacute;sultat de la fonction pr&eacute;c&eacute;dente.
</p><p><span typeof="mw:File"><a href="../File/PartDesign_Feature_example.png" class="mw-file-description"><img src="../File/PartDesign_Feature_example.png" decoding="async" width="400" height="207" srcset="/images/thumb/e/e0/PartDesign_Feature_example.png/600px-PartDesign_Feature_example.png 1.5x, /images/e/e0/PartDesign_Feature_example.png 2x"></a></span>
</p>
<p style="text-align:left; font-style:italic; width:800px; margin-left:1em; margin-right:1em;">Feature editing in practice. From left to right:<br>
Body with a <a href="wiki//PartDesign_AdditiveBox.html" title="PartDesign AdditiveBox">box</a> feature.<br>
Body with a box and a <a href="wiki//PartDesign_Chamfer.html" title="PartDesign Chamfer">chamfer</a> feature.<br>
Body with a box, a chamfer and a <a href="wiki//PartDesign_Pocket.html" title="PartDesign Pocket">pocket</a> feature.</p>
<div class="mw-translate-fuzzy">
<p>Un seul corps peut &ecirc;tre actif dans un document. Le corps actif recevra les fonctions nouvellement cr&eacute;&eacute;es. Un corps peut &ecirc;tre activ&eacute; ou d&eacute;sactiv&eacute; par un double-clic sur son &eacute;tiquette dans l'arborescence Mod&egrave;le. Le corps actif est surlign&eacute; en bleu p&acirc;le. &Agrave; partir de la version 0.18, la couleur de surlignage peut &ecirc;tre d&eacute;finie dans les pr&eacute;f&eacute;rences d'Affichage, sous l'onglet Couleurs, Conteneur actif.
</p>
</div>
<p><span class="mw-default-size" typeof="mw:File"><a href="../File/PartDesign_Body_tree.png" class="mw-file-description"><img src="../File/PartDesign_Body_tree.png" decoding="async" width="251" height="315"></a></span>
</p>
<h3><span id="What_is_a_contiguous_solid.3F"></span><span class="mw-headline" id="What_is_a_contiguous_solid?">What is a contiguous solid?</span></h3>
<div class="mw-translate-fuzzy">
<p><b>Qu'est-ce qu'un solide unique contigu&nbsp;?</b> Il s'agit d'un objet comme une pi&egrave;ce coul&eacute;e ou usin&eacute;e &agrave; partir d'un bloc de m&eacute;tal. Si l'objet contient des clous, des vis, de la colle ou de la soudure, ce n'est pas un solide unique contigu. Par exemple, une chaise en bois sera faite de plusieurs corps, avec un corps pour chacune de ses composantes (pieds, lattes, si&egrave;ge, etc.).
</p>
</div>
<p>In FreeCAD version 1.0 an experimental property was introduced that allows the Body to have non-contiguous solids. This can also be set in the <a href="wiki//PartDesign_Preferences.html#General" title="PartDesign Preferences">Preferences</a> as default for newly created Bodies. This is not intended to be used to build, as in the example, a chair in one Body. It is meant to allow features that may produce disconnected solids that will be made contiguous by later features.
</p>
<div class="mw-translate-fuzzy">
<p>Lorsqu'un mod&egrave;le n&eacute;cessite plusieurs corps, comme la chaise de l'exemple pr&eacute;c&eacute;dent, <span typeof="mw:File"><a href="../File/Std_Part.svg" class="mw-file-description"><img src="../File/Std_Part.svg" decoding="async" width="24" height="24"></a></span> <a href="wiki/fr//Std_Part.html" title="Std Part/fr">le Part Conteneur</a> d'usage g&eacute;n&eacute;ral peut &ecirc;tre utilis&eacute; pour les grouper et les d&eacute;placer comme un tout.
</p>
</div>
<p><span id="Body_visibility_management"></span>
</p>
<h3><span id="Gestion_de_la_visibilit.C3.A9_du_corps"></span><span class="mw-headline" id="Gestion_de_la_visibilit&eacute;_du_corps">Gestion de la visibilit&eacute; du corps</span></h3>
<div class="mw-translate-fuzzy">
<p>Un corps expose &agrave; l'ext&eacute;rieur par d&eacute;faut la fonction la plus r&eacute;cente. Cette fonction est d&eacute;finie par d&eacute;faut comme la fonction r&eacute;sultante. On peut utiliser l'analogie de <i>la pointe de l'iceberg</i>&nbsp;: seule la fonction r&eacute;sultante est visible hors de l'eau, le reste de l'iceberg (les autres fonctions) sont cach&eacute;es. Lorsqu'une nouvelle fonction est ajout&eacute;e au corps, la fonction pr&eacute;c&eacute;dente est automatiquement masqu&eacute;e, et la nouvelle fonction devient la fonction r&eacute;sultante.
</p>
</div>
<div class="mw-translate-fuzzy">
<p>Il ne peut y avoir qu'une seule <a href="wiki/fr//Std_ToggleVisibility.html" title="Std ToggleVisibility/fr">fonction visible</a> &agrave; la fois. Il est possible de basculer la visibilit&eacute; de toute fonction dans le corps, en la s&eacute;lectionnant dans l'arborescence Mod&egrave;le et en appuyant sur la <span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px;">barre espace</span>, ce qui a l'effet de remonter dans l'historique du corps.
</p>
</div>
<p><span id="Moving_and_Reordering_Objects"></span>
</p>
<h3><span id="D.C3.A9placer_et_r.C3.A9ordonner_des_objets"></span><span class="mw-headline" id="D&eacute;placer_et_r&eacute;ordonner_des_objets">D&eacute;placer et r&eacute;ordonner des objets</span></h3>
<div class="mw-translate-fuzzy">
<p>Il est possible de red&eacute;finir temporairement la fonction r&eacute;sultante sur une fonction au milieu de l'arborescence du Corps pour ins&eacute;rer de nouveaux objets (fonctions, esquisses ou g&eacute;om&eacute;trie de r&eacute;f&eacute;rence). Il est &eacute;galement possible de r&eacute;ordonner les objets sous un Corps, ou les d&eacute;placer dans un autre Corps. S&eacute;lectionnez l'objet et faites un clic droit pour faire appara&icirc;tre le menu contextuel qui propose les deux options. L'op&eacute;ration pourrait &eacute;chouer si l'objet a des d&eacute;pendances au Corps source, comme &ecirc;tre attach&eacute; &agrave; une face. Pour d&eacute;placer une esquisse vers un autre Corps, celle-ci ne devrait pas contenir de liens &agrave; des g&eacute;om&eacute;tries externes.
</p>
</div>
<p><span typeof="mw:File"><a href="../File/PartDesign_workflow.svg" class="mw-file-description"><img src="../File/PartDesign_workflow.svg" decoding="async" width="400" height="400"></a></span>
</p>
<p style="text-align:left; font-style:italic; width:800px; margin-left:1em; margin-right:1em;">Schematic representation of the PartDesign workflow.</p>
<p><span id="Datum_geometry"></span>
</p>
<h2><span id="G.C3.A9om.C3.A9tries_de_r.C3.A9f.C3.A9rence"></span><span class="mw-headline" id="G&eacute;om&eacute;tries_de_r&eacute;f&eacute;rence">G&eacute;om&eacute;tries de r&eacute;f&eacute;rence</span></h2>
<div class="mw-translate-fuzzy">
<p>Les g&eacute;om&eacute;tries de r&eacute;f&eacute;rence consistent en des plans personnalis&eacute;s, des droites, des points ou des formes li&eacute;es de l'ext&eacute;rieur du corps. Elles peuvent &ecirc;tre cr&eacute;&eacute;es afin de servir de r&eacute;f&eacute;rence &agrave; des esquisses et des fonctions. Il y a une multitude de possibilit&eacute;s d'ancrage aux g&eacute;om&eacute;tries de r&eacute;f&eacute;rence.
</p>
</div>
<div class="mw-translate-fuzzy">
<p>Dans FreeCAD, les plans de r&eacute;f&eacute;rence ont du sens si vous placez des esquisses (et une protrusion, des cavit&eacute;s, etc.) dans des orientations non standard, c'est-&agrave;-dire dans des plans d&eacute;cal&eacute;s ou pivot&eacute;s autour des trois axes principaux. &Eacute;tant donn&eacute; que les esquisses peuvent &eacute;galement &ecirc;tre plac&eacute;es dans des orientations non standard de la m&ecirc;me mani&egrave;re que les plans de r&eacute;f&eacute;rence, il n'est souvent pas n&eacute;cessaire d'utiliser des plans de r&eacute;f&eacute;rence.
</p>
</div>
<div class="mw-translate-fuzzy">
<p>Les esquisses et les plans de r&eacute;f&eacute;rence doivent &ecirc;tre attach&eacute;s aux plans de base. Le r&eacute;f&eacute;rencement de la g&eacute;om&eacute;trie g&eacute;n&eacute;r&eacute;e (g&eacute;om&eacute;trie qui est le r&eacute;sultat d'une op&eacute;ration de cr&eacute;ation d'entit&eacute;, par exemple une protrusion ou une poche) doit &ecirc;tre &eacute;vit&eacute; car les faces et les ar&ecirc;tes sont renomm&eacute;es et renum&eacute;rot&eacute;es et les r&eacute;f&eacute;rences ne font plus r&eacute;f&eacute;rence &agrave; la m&ecirc;me chose. Ceci est appel&eacute; instabilit&eacute; topologique et est d&ucirc; &agrave; la fa&ccedil;on dont FreeCAD utilise certaines biblioth&egrave;ques g&eacute;om&eacute;triques externes. Esp&eacute;rons que cela sera am&eacute;lior&eacute; &agrave; l'avenir. (Voir les conseils pour cr&eacute;er des mod&egrave;les stables ci-dessous).
</p>
</div>
<p><span id="Advice_for_creating_stable_models"></span>
</p>
<h2><span id="Conseils_pour_la_cr.C3.A9ation_de_mod.C3.A8les_robustes"></span><span class="mw-headline" id="Conseils_pour_la_cr&eacute;ation_de_mod&egrave;les_robustes">Conseils pour la cr&eacute;ation de mod&egrave;les robustes</span></h2>
<div class="mw-translate-fuzzy">
<p>Le principe de conception param&eacute;trique sous-tend que quand les valeurs de certains param&egrave;tres sont chang&eacute;es, les &eacute;tapes subs&eacute;quentes seront automatiquement mises &agrave; jour selon ces nouvelles valeurs. Toutefois, quand des changements importants sont apport&eacute;s, le mod&egrave;le peut casser en raison du probl&egrave;me de <a href="wiki/fr//Topological_naming_problem.html" title="Topological naming problem/fr">probl&egrave;me de nommage topologique</a> qui est toujours non r&eacute;solu dans FreeCAD. Les brisures peuvent &ecirc;tre minimis&eacute;es en suivant les principes de conception suivants&nbsp;:
</p>
</div>
<div class="mw-translate-fuzzy">
<ul><li>&Eacute;vitez de joindre des esquisses et des objets de r&eacute;f&eacute;rence &agrave; la g&eacute;om&eacute;trie g&eacute;n&eacute;r&eacute;e du mod&egrave;le. (La g&eacute;om&eacute;trie g&eacute;n&eacute;r&eacute;e est toute face ou ar&ecirc;te cr&eacute;&eacute;e &agrave; la suite d'un tampon, d'une poche, etc.)</li>
<li>Placez vos esquisses sur des plans de coordonn&eacute;es standard ou sur des plans de r&eacute;f&eacute;rence personnalis&eacute;s attach&eacute;s &agrave; des plans standard.
<ul><li>Les esquisses attach&eacute;es &agrave; des plans/axes de coordonn&eacute;es de base ou &agrave; des plans de r&eacute;f&eacute;rence attach&eacute;s &agrave; des plans/axes de coordonn&eacute;es ne seront pas rattach&eacute;es de mani&egrave;re inattendue &agrave; une r&eacute;f&eacute;rence diff&eacute;rente.</li></ul></li>
<li>Lors de la cr&eacute;ation de la g&eacute;om&eacute;trie de r&eacute;f&eacute;rence, ne l'attachez pas &agrave; la g&eacute;om&eacute;trie g&eacute;n&eacute;r&eacute;e
<ul><li>Attachez-le &agrave; des plans/axes standard et / ou des esquisses ou des objets de r&eacute;f&eacute;rence qui utilisent des d&eacute;calages d'ancrage aux plans/axes standard.</li>
<li>Une esquisse principale doit &ecirc;tre aussi simple que possible, contenant des &eacute;l&eacute;ments g&eacute;om&eacute;triques de base de votre mod&egrave;le.</li>
<li>Les &eacute;l&eacute;ments de l'esquisse principale peuvent &ecirc;tre r&eacute;f&eacute;renc&eacute;s lors de la mod&eacute;lisation d'entit&eacute;s ult&eacute;rieures.</li>
<li>Une esquisse principale peut &ecirc;tre la premi&egrave;re esquisse dans le corps ou compl&egrave;tement &agrave; l'ext&eacute;rieur du corps</li>
<li>Une esquisse principale peut &ecirc;tre r&eacute;f&eacute;renc&eacute;e en tant que g&eacute;om&eacute;trie externe ou via un ShapeBinder.</li></ul></li>
<li>Ne cr&eacute;ez pas de ShapeBinders &agrave; partir de la g&eacute;om&eacute;trie g&eacute;n&eacute;r&eacute;e.</li>
<li>Gardez &agrave; l'esprit que les ShapeBinders peuvent &ecirc;tre un probl&egrave;me lorsque la g&eacute;om&eacute;trie est supprim&eacute;e de l'esquisse sur laquelle elle est bas&eacute;e.</li>
<li>Si vous devez in&eacute;vitablement r&eacute;f&eacute;rencer une fonction interm&eacute;diaire, par ex. le r&eacute;sultat d'une op&eacute;ration d'&eacute;paisseur.
<ul><li>Utilisez la premi&egrave;re r&eacute;f&eacute;rence possible dans la liste des entit&eacute;s suivantes o&ugrave; l'&eacute;l&eacute;ment g&eacute;om&eacute;trique r&eacute;f&eacute;renc&eacute; appara&icirc;t.</li>
<li>Si vous prenez une fonctionnalit&eacute; initiale comme r&eacute;f&eacute;rence, toutes les modifications apport&eacute;es aux &eacute;tapes interm&eacute;diaires ne casseront pas votre mod&egrave;le.</li>
<li>Essayez de r&eacute;f&eacute;rencer une esquisse ou une g&eacute;om&eacute;trie d'esquisse plut&ocirc;t qu'une g&eacute;om&eacute;trie g&eacute;n&eacute;r&eacute;e.</li></ul></li>
<li>Utilisez des <i>finitions</i>, comme des filets et des chanfreins, aussi tard que possible dans l'arbre des fonctionnalit&eacute;s</li>
<li>Notez que l'utilisation de feuilles de calcul, de donn&eacute;es dynamiques, d'esquisses principales etc... produisent g&eacute;n&eacute;ralement des mod&egrave;les plus param&eacute;triques et permettent d'&eacute;viter le probl&egrave;me de d&eacute;nomination topologique.</li></ul>
</div>
<p><span id="Tutorials"></span>
</p>
<h2><span class="mw-headline" id="Tutoriels">Tutoriels</span></h2>
<div class="mw-translate-fuzzy">
<p>La page des <a href="wiki/fr//Tutorials.html" title="Tutorials/fr">tutoriels</a> fournit des exemples d'utilisation de la m&eacute;thode par l'<a class="mw-selflink selflink">&eacute;dition de fonctions</a> de l'<span typeof="mw:File"><a href="../File/Workbench_PartDesign.svg" class="mw-file-description"><img src="../File/Workbench_PartDesign.svg" decoding="async" width="24" height="24"></a></span> <a href="wiki/fr//PartDesign_Workbench.html" title="PartDesign Workbench/fr">atelier PartDesign</a>.
</p>
<ul><li><a href="wiki/fr//Creating_a_simple_part_with_PartDesign.html" title="Creating a simple part with PartDesign/fr">PartDesign Tutoriel pour cr&eacute;er une pi&egrave;ce simple</a></li>
<li><a href="wiki/fr//Basic_Part_Design_Tutorial_019.html" title="Basic Part Design Tutorial 019/fr">PartDesign Tutoriel d'introduction V0.19</a></li>
<li><a href="wiki/fr//Basic_Attachment_Tutorial.html" title="Basic Attachment Tutorial/fr">Tutoriel La base de l'ancrage</a></li></ul>
</div>
<p><span id="Related"></span>
</p>
<h2><span class="mw-headline" id="En_relation">En relation</span></h2>
<ul><li><a href="wiki/fr//Constructive_solid_geometry.html" title="Constructive solid geometry/fr">G&eacute;om&eacute;trie Solide Constructive</a></li></ul>
<p><br>
</p>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: #fefefe;"><a href="wiki/fr//PartDesign_Workbench.html" title="PartDesign Workbench/fr">PartDesign</a> <span typeof="mw:File"><a href="../File/Workbench_PartDesign.svg" class="mw-file-description"><img src="../File/Workbench_PartDesign.svg" decoding="async" width="24" height="24"></a></span>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid #aaaaaa; text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: #fefefe;">
<ul><li><b>Outils structure&nbsp;:</b> <a href="wiki/fr//Std_Part.html" title="Std Part/fr">Part</a>, <a href="wiki/fr//Std_Group.html" title="Std Group/fr">Groupe</a></li>
<li><b>Outils d'aide&nbsp;:</b> <a href="wiki/fr//PartDesign_Body.html" title="PartDesign Body/fr">Cr&eacute;er un corps</a>, <a href="wiki/fr//PartDesign_NewSketch.html" title="PartDesign NewSketch/fr">Cr&eacute;er une esquisse</a>, <a href="wiki/fr//Sketcher_EditSketch.html" title="Sketcher EditSketch/fr">&Eacute;diter une esquisse</a>, <a href="wiki/fr//Sketcher_MapSketch.html" title="Sketcher MapSketch/fr">Plaquer une esquisse sur une face</a></li></ul>
<hr>
<ul><li><b>Outils de mod&eacute;lisation</b>
<ul><li><b>Outils de r&eacute;f&eacute;rence&nbsp;:</b> <a href="wiki/fr//PartDesign_Point.html" title="PartDesign Point/fr">Cr&eacute;er un point de r&eacute;f&eacute;rence</a>, <a href="wiki/fr//PartDesign_Line.html" title="PartDesign Line/fr">Cr&eacute;er une ligne de r&eacute;f&eacute;rence</a>, <a href="wiki/fr//PartDesign_Plane.html" title="PartDesign Plane/fr">Cr&eacute;er un plan de r&eacute;f&eacute;rence</a>, <a href="wiki/fr//PartDesign_CoordinateSystem.html" title="PartDesign CoordinateSystem/fr">Cr&eacute;er un syst&egrave;me de coordonn&eacute;es local</a>, <a href="wiki/fr//PartDesign_ShapeBinder.html" title="PartDesign ShapeBinder/fr">Cr&eacute;er une forme li&eacute;e</a>, <a href="wiki/fr//PartDesign_SubShapeBinder.html" title="PartDesign SubShapeBinder/fr">Cr&eacute;er une forme li&eacute;e du sous-objet(s)</a>, <a href="wiki/fr//PartDesign_Clone.html" title="PartDesign Clone/fr">Cr&eacute;er un clone</a></li>
<li><b>Outils additifs&nbsp;:</b> <a href="wiki/fr//PartDesign_Pad.html" title="PartDesign Pad/fr">Protrusion</a>, <a href="wiki/fr//PartDesign_Revolution.html" title="PartDesign Revolution/fr">R&eacute;volution</a>, <a href="wiki/fr//PartDesign_AdditiveLoft.html" title="PartDesign AdditiveLoft/fr">Lissage additif</a>, <a href="wiki/fr//PartDesign_AdditivePipe.html" title="PartDesign AdditivePipe/fr">Balayage additif</a>, <a href="wiki/fr//PartDesign_AdditiveHelix.html" title="PartDesign AdditiveHelix/fr">H&eacute;lice additive</a>, <a href="wiki/fr//PartDesign_AdditiveBox.html" title="PartDesign AdditiveBox/fr">Cube additif</a>, <a href="wiki/fr//PartDesign_AdditiveCylinder.html" title="PartDesign AdditiveCylinder/fr">Cylindre additif</a>, <a href="wiki/fr//PartDesign_AdditiveSphere.html" title="PartDesign AdditiveSphere/fr">Sph&egrave;re additive</a>, <a href="wiki/fr//PartDesign_AdditiveCone.html" title="PartDesign AdditiveCone/fr">C&ocirc;ne additif</a>, <a href="wiki/fr//PartDesign_AdditiveEllipsoid.html" title="PartDesign AdditiveEllipsoid/fr">Ellipso&iuml;de additif</a>, <a href="wiki/fr//PartDesign_AdditiveTorus.html" title="PartDesign AdditiveTorus/fr">Tore additif</a>, <a href="wiki/fr//PartDesign_AdditivePrism.html" title="PartDesign AdditivePrism/fr">Prisme additif</a>, <a href="wiki/fr//PartDesign_AdditiveWedge.html" title="PartDesign AdditiveWedge/fr">Pyramide tronqu&eacute;e additive</a></li>
<li><b>Outils soustractifs&nbsp;:</b> <a href="wiki/fr//PartDesign_Pocket.html" title="PartDesign Pocket/fr">Cavit&eacute;</a>, <a href="wiki/fr//PartDesign_Hole.html" title="PartDesign Hole/fr">Per&ccedil;age</a>, <a href="wiki/fr//PartDesign_Groove.html" title="PartDesign Groove/fr">Rainure</a>, <a href="wiki/fr//PartDesign_SubtractiveLoft.html" title="PartDesign SubtractiveLoft/fr">Lissage soustractif</a>, <a href="wiki/fr//PartDesign_SubtractivePipe.html" title="PartDesign SubtractivePipe/fr">Balayage soustractif</a>, <a href="wiki/fr//PartDesign_SubtractiveHelix.html" title="PartDesign SubtractiveHelix/fr">H&eacute;lice soustractive</a>, <a href="wiki/fr//PartDesign_SubtractiveBox.html" title="PartDesign SubtractiveBox/fr">Cube soustractif</a>, <a href="wiki/fr//PartDesign_SubtractiveCylinder.html" title="PartDesign SubtractiveCylinder/fr">Cylindre soustractif</a>, <a href="wiki/fr//PartDesign_SubtractiveSphere.html" title="PartDesign SubtractiveSphere/fr">Sph&egrave;re soustractive</a>, <a href="wiki/fr//PartDesign_SubtractiveCone.html" title="PartDesign SubtractiveCone/fr">C&ocirc;ne soustractif</a>, <a href="wiki/fr//PartDesign_SubtractiveEllipsoid.html" title="PartDesign SubtractiveEllipsoid/fr">Ellipso&iuml;de soustractif</a>, <a href="wiki/fr//PartDesign_SubtractiveTorus.html" title="PartDesign SubtractiveTorus/fr">Tore soustractif</a>, &lrm;<a href="wiki/fr//PartDesign_SubtractivePrism.html" title="PartDesign SubtractivePrism/fr">Prisme soustractif</a>, <a href="wiki/fr//PartDesign_SubtractiveWedge.html" title="PartDesign SubtractiveWedge/fr">Pyramide tronqu&eacute;e soustractive</a></li></ul></li></ul>
<hr>
<ul><li><b>Outils de transformation&nbsp;:</b> <a href="wiki/fr//PartDesign_Mirrored.html" title="PartDesign Mirrored/fr">Sym&eacute;trie</a>, <a href="wiki/fr//PartDesign_LinearPattern.html" title="PartDesign LinearPattern/fr">R&eacute;p&eacute;tition lin&eacute;aire</a>, <a href="wiki/fr//PartDesign_PolarPattern.html" title="PartDesign PolarPattern/fr">R&eacute;p&eacute;tition circulaire</a>, <a href="wiki/fr//PartDesign_MultiTransform.html" title="PartDesign MultiTransform/fr">Transformation multiple</a>, <a href="wiki/fr//PartDesign_Scaled.html" title="PartDesign Scaled/fr">Mise &agrave; l'&eacute;chelle</a></li>
<li><b>Fonctions d'habillage&nbsp;:</b> <a href="wiki/fr//PartDesign_Fillet.html" title="PartDesign Fillet/fr">Cong&eacute;</a>, <a href="wiki/fr//PartDesign_Chamfer.html" title="PartDesign Chamfer/fr">Chanfrein</a>, <a href="wiki/fr//PartDesign_Draft.html" title="PartDesign Draft/fr">D&eacute;pouille</a>, <a href="wiki/fr//PartDesign_Thickness.html" title="PartDesign Thickness/fr">&Eacute;videment</a></li>
<li><b>Op&eacute;rations Bool&eacute;enne&nbsp;:</b> <a href="wiki/fr//PartDesign_Boolean.html" title="PartDesign Boolean/fr">Op&eacute;rations Bool&eacute;enne</a></li></ul>
<hr>
<ul><li><b>Extras&nbsp;:</b> <a href="wiki/fr//PartDesign_Migrate.html" title="PartDesign Migrate/fr">Migrer</a>, <a href="wiki/fr//PartDesign_WizardShaft.html" title="PartDesign WizardShaft/fr">Conception d'arbre</a>, <a href="wiki/fr//PartDesign_InvoluteGear.html" title="PartDesign InvoluteGear/fr">Engrenage &agrave; d&eacute;veloppante</a></li>
<li><b>Menu contextuel&nbsp;:</b> <a href="wiki/fr//PartDesign_MoveTip.html" title="PartDesign MoveTip/fr">D&eacute;signer comme fonction r&eacute;sultante</a>, <a href="wiki/fr//PartDesign_MoveFeature.html" title="PartDesign MoveFeature/fr">D&eacute;placer vers un autre corps</a>, <a href="wiki/fr//PartDesign_MoveFeatureInTree.html" title="PartDesign MoveFeatureInTree/fr">D&eacute;placer apr&egrave;s un autre objet</a>, <a href="wiki/fr//Std_SetAppearance.html" title="Std SetAppearance/fr">Apparence</a>, <a href="wiki/fr//Part_FaceColors.html" class="mw-redirect" title="Part FaceColors/fr">D&eacute;finir les couleurs</a></li></ul></div>
    </div></div>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: #fefefe;"><span typeof="mw:File"><a href="../File/User_hub.png" class="mw-file-description"><img src="../File/User_hub.png" decoding="async" width="24" height="24" srcset="/images/thumb/9/94/User_hub.png/36px-User_hub.png 1.5x, /images/thumb/9/94/User_hub.png/48px-User_hub.png 2x"></a></span> <a href="wiki/fr//User_hub.html" title="User hub/fr">Hub utilisateurs</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid #aaaaaa; text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: #fefefe;">
<ul><li><b><a href="wiki/fr//Getting_started.html" title="Getting started/fr">D&eacute;marrer avec FreeCAD</a></b></li>
<li><b>Installation&nbsp;:</b> <a href="wiki/fr//Download.html" title="Download/fr">T&eacute;l&eacute;chargements</a>, <a href="wiki/fr//Installing_on_Windows.html" title="Installing on Windows/fr">Windows</a>, <a href="wiki/fr//Installing_on_Linux.html" title="Installing on Linux/fr">Linux</a>, <a href="wiki/fr//Installing_on_Mac.html" title="Installing on Mac/fr">Mac</a>, <a href="wiki/fr//Installing_additional_components.html" title="Installing additional components/fr">Logiciels suppl&eacute;mentaires</a>, <a href="wiki/fr//Compile_on_Docker.html" title="Compile on Docker/fr">Docker</a>, <a href="wiki/fr//AppImage.html" title="AppImage/fr">AppImage</a>, <a href="wiki/fr//Ubuntu_Snap.html" title="Ubuntu Snap/fr">Ubuntu Snap</a></li>
<li><b>Bases&nbsp;:</b> <a href="wiki/fr//About_FreeCAD.html" title="About FreeCAD/fr">&Agrave; propos de FreeCAD</a>, <a href="wiki/fr//Interface.html" title="Interface/fr">Interface</a>, <a href="wiki/fr//Mouse_navigation.html" title="Mouse navigation/fr">Navigation par la souris</a>, <a href="wiki/fr//Selection_methods.html" title="Selection methods/fr">M&eacute;thodes de s&eacute;lection</a>, <a href="wiki/fr//Object_name.html" title="Object name/fr">Objet name</a>, <a href="wiki/fr//Preferences_Editor.html" title="Preferences Editor/fr">Pr&eacute;f&eacute;rences</a>, <a href="wiki/fr//Workbenches.html" title="Workbenches/fr">Ateliers</a>, <a href="wiki/fr//Document_structure.html" title="Document structure/fr">Structure du document</a>, <a href="wiki/fr//Property.html" title="Property/fr">Propri&eacute;t&eacute;s</a>, <a href="wiki/fr//Help_FreeCAD.html" title="Help FreeCAD/fr">Contribuer &agrave; FreeCAD</a>, <a href="wiki/fr//Donate.html" title="Donate/fr">Faire un don</a></li></ul>
<hr>
<ul><li><b>Aide&nbsp;:</b> <a href="wiki/fr//Tutorials.html" title="Tutorials/fr">Tutoriels</a>, <a href="wiki/fr//Video_tutorials.html" title="Video tutorials/fr">Tutoriels vid&eacute;o</a></li>
<li><b><a href="wiki/fr//Workbenches.html" title="Workbenches/fr">Ateliers</a>&nbsp;:</b> <a href="wiki/fr//Std_Base.html" title="Std Base/fr">Std Base</a>, <a href="wiki/fr//Arch_Workbench.html" title="Arch Workbench/fr">Arch</a>, <a href="wiki/fr//Assembly_Workbench.html" title="Assembly Workbench/fr">Assembly</a>, <a href="wiki/fr//CAM_Workbench.html" title="CAM Workbench/fr">CAM</a>, <a href="wiki/fr//Draft_Workbench.html" title="Draft Workbench/fr">Draft</a>, <a href="wiki/fr//FEM_Workbench.html" title="FEM Workbench/fr">FEM</a>, <a href="wiki/fr//Inspection_Workbench.html" title="Inspection Workbench/fr">Inspection</a>, <a href="wiki/fr//Mesh_Workbench.html" title="Mesh Workbench/fr">Mesh</a>, <a href="wiki/fr//OpenSCAD_Workbench.html" title="OpenSCAD Workbench/fr">OpenSCAD</a>, <a href="wiki/fr//Part_Workbench.html" title="Part Workbench/fr">Part</a>, <a href="wiki/fr//PartDesign_Workbench.html" title="PartDesign Workbench/fr">PartDesign</a>, <a href="wiki/fr//Points_Workbench.html" title="Points Workbench/fr">Points</a>, <a href="wiki/fr//Reverse_Engineering_Workbench.html" title="Reverse Engineering Workbench/fr">Reverse Engineering</a>, <a href="wiki/fr//Robot_Workbench.html" title="Robot Workbench/fr">Robot</a>, <a href="wiki/fr//Sketcher_Workbench.html" title="Sketcher Workbench/fr">Sketcher</a>, <a href="wiki/fr//Spreadsheet_Workbench.html" title="Spreadsheet Workbench/fr">Spreadsheet</a>, <a href="wiki/fr//Surface_Workbench.html" title="Surface Workbench/fr">Surface</a>, <a href="wiki/fr//TechDraw_Workbench.html" title="TechDraw Workbench/fr">TechDraw</a>, <a href="wiki/fr//Testing.html" title="Testing/fr">Test</a></li></ul>
<hr>
<ul><li><b><a href="wiki/fr//Addon.html" title="Addon/fr">Addons</a>&nbsp;:</b> <a href="wiki/fr//Std_AddonMgr.html" title="Std AddonMgr/fr">Gestionnaire d'Addons</a>, <a href="wiki/fr//External_workbenches.html" title="External workbenches/fr">Ateliers externes</a>, <a href="wiki/fr//Scripting_and_macros.html" title="Scripting and macros/fr">Scripts et macros</a></li></ul>
<hr>
<ul><li><b>Hubs&nbsp;:</b> <a href="wiki/fr//User_hub.html" title="User hub/fr">Hub utilisateurs</a>, <a href="wiki/fr//Power_users_hub.html" title="Power users hub/fr">Hub utilisateurs exp&eacute;riment&eacute;s</a>, <a href="wiki/fr//Developer_hub.html" title="Developer hub/fr">Hub D&eacute;veloppeurs</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20241202220458
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc, no&#8208;toc&#8208;conversion]
CPU time usage: 0.083 seconds
Real time usage: 0.108 seconds
Preprocessor visited node count: 132/1000000
Post&#8208;expand include size: 14833/2097152 bytes
Template argument size: 5555/2097152 bytes
Highest expansion depth: 4/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 2317/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    5.896      1 -total
 45.74%    2.697      1 Template:PartDesign_Tools_navi/fr
 14.53%    0.857      1 Template:Userdocnavi/fr
 12.99%    0.766      2 Template:Caption
 11.16%    0.658      1 Template:TOCright
 10.96%    0.646      2 Template:Navigation_menu_2
  8.61%    0.508      1 Template:KEY
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:120063-0!canonical and timestamp 20241202220458 and revision id 1512036. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>