<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">FEM Geometry Preparation and Meshing/fr</span></h1><?xml encoding="UTF-8"><div class="mw-parser-output"><div class="mw-pt-languages noprint" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="wiki/de//FEM_Geometry_Preparation_and_Meshing.html" class="mw-pt-progress mw-pt-progress--med" title="FEM Geometrie vorbereiten und vernetzen (50% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="wiki//FEM_Geometry_Preparation_and_Meshing.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="FEM Geometry Preparation and Meshing (100% translated)" lang="en" dir="ltr">English</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="fr" dir="ltr">fran&ccedil;ais</span></li>
<li><a href="wiki/pl//FEM_Geometry_Preparation_and_Meshing.html" class="mw-pt-progress mw-pt-progress--complete" title="MES: Przygotowanie geometrii i tworzenie siatki (100% translated)" lang="pl" dir="ltr">polski</a></li></ul></div>
<table class="fcinfobox wikitable ct" style="width: 230px; float: right; margin-left: 1em">
<tbody><tr>
<td class="ctTitle" style="font-weight: bold; font-size: 125%;"><span typeof="mw:File"><span><img src="../File/Freecad.svg" decoding="async" width="32" height="32"></span></span> Tutoriel
</td></tr>
<tr>
<th class="ctOdd">Th&egrave;me
</th></tr>
<tr>
<td class="ctEven">Analyse par &eacute;l&eacute;ments finis
</td></tr>
<tr>
<th class="ctOdd">Niveau
</th></tr>
<tr>
<td class="ctEven">D&eacute;butant
</td></tr>
<tr>
<th class="ctOdd">Temps d'ex&eacute;cution estim&eacute;
</th></tr>
<tr>
<td class="ctEven">Non applicable
</td></tr>
<tr>
<th class="ctOdd">Auteurs
</th></tr>
<tr>
<td class="ctEven"><a rel="nofollow" class="external text" href="https://www.freecad.org/wiki/index.php?title=User:NewJoker">NewJoker</a>
</td></tr>
<tr>
<th class="ctOdd">Version de FreeCAD
</th></tr>
<tr>
<td class="ctEven">1.0 ou plus r&eacute;cente
</td></tr>
<tr>
<th class="ctOdd">Fichiers exemples
</th></tr>
<tr>
<td class="ctEven"><i>None</i>
</td></tr>
<tr>
<th class="ctOdd">Voir aussi
</th></tr>
<tr>
<td class="ctEven"><a href="wiki/fr//FEM_Workbench.html" title="FEM Workbench/fr">Atelier FEM</a>
</td></tr>
<tr>
<td class="ctToc"><br><div id="toc" class="toc" role="navigation" aria-labelledby="mw-toc-heading"><input type="checkbox" role="button" id="toctogglecheckbox" class="toctogglecheckbox" style="display:none"><div class="toctitle" lang="en" dir="ltr"><h2 id="mw-toc-heading">Contents</h2><span class="toctogglespan"><label class="toctogglelabel" for="toctogglecheckbox"></label></span></div>
<ul>
<li class="toclevel-1 tocsection-1"><a href="#Contexte"><span class="tocnumber">1</span> <span class="toctext">Contexte</span></a></li>
<li class="toclevel-1 tocsection-2"><a href="#Types_de_g%C3%A9om%C3%A9trie_utilis%C3%A9s_pour_la_m%C3%A9thode_des_%C3%A9l%C3%A9ments_finis_dans_FreeCAD"><span class="tocnumber">2</span> <span class="toctext">Types de g&eacute;om&eacute;trie utilis&eacute;s pour la m&eacute;thode des &eacute;l&eacute;ments finis dans FreeCAD</span></a></li>
<li class="toclevel-1 tocsection-3"><a href="#Choix_du_type_de_g%C3%A9om%C3%A9trie"><span class="tocnumber">3</span> <span class="toctext">Choix du type de g&eacute;om&eacute;trie</span></a></li>
<li class="toclevel-1 tocsection-4"><a href="#Validit%C3%A9_de_la_g%C3%A9om%C3%A9trie"><span class="tocnumber">4</span> <span class="toctext">Validit&eacute; de la g&eacute;om&eacute;trie</span></a></li>
<li class="toclevel-1 tocsection-5"><a href="#Simplification_de_la_g%C3%A9om%C3%A9trie"><span class="tocnumber">5</span> <span class="toctext">Simplification de la g&eacute;om&eacute;trie</span></a></li>
<li class="toclevel-1 tocsection-6"><a href="#Partitionnement_de_la_g%C3%A9om%C3%A9trie"><span class="tocnumber">6</span> <span class="toctext">Partitionnement de la g&eacute;om&eacute;trie</span></a></li>
<li class="toclevel-1 tocsection-7"><a href="#Assemblage_de_g%C3%A9om%C3%A9tries"><span class="tocnumber">7</span> <span class="toctext">Assemblage de g&eacute;om&eacute;tries</span></a></li>
<li class="toclevel-1 tocsection-8"><a href="#Les_bases_du_maillage"><span class="tocnumber">8</span> <span class="toctext">Les bases du maillage</span></a></li>
<li class="toclevel-1 tocsection-9"><a href="#Jacobiens_n%C3%A9gatifs"><span class="tocnumber">9</span> <span class="toctext">Jacobiens n&eacute;gatifs</span></a></li>
<li class="toclevel-1 tocsection-10"><a href="#%C3%89tudes_sur_la_convergence_des_maillages"><span class="tocnumber">10</span> <span class="toctext">&Eacute;tudes sur la convergence des maillages</span></a></li>
</ul>
</div>

</td></tr></tbody></table>
<p><span id="Background"></span>
</p>
<h2><span class="mw-headline" id="Contexte">Contexte</span></h2>
<p>La pr&eacute;paration de la g&eacute;om&eacute;trie et le maillage sont des &eacute;l&eacute;ments cruciaux du pr&eacute;traitement des simulations utilisant la m&eacute;thode des &eacute;l&eacute;ments finis (FEM). Bien que les logiciels de simulation facilement accessibles et connect&eacute;s &agrave; un environnement CAO (comme l'<a href="wiki/fr//FEM_Workbench.html" title="FEM Workbench/fr">atelier FEM</a> dans FreeCAD) rendent tentante la r&eacute;alisation imm&eacute;diate d'analyses sur de nouvelles conceptions, il est tr&egrave;s important de se rappeler que la FEM est une m&eacute;thode avanc&eacute;e et qu'elle n&eacute;cessite une g&eacute;om&eacute;trie et un maillage correctement pr&eacute;par&eacute;s afin de fournir des r&eacute;sultats raisonnables et pr&eacute;cis. La vieille r&egrave;gle <a rel="nofollow" class="external text" href="https://fr.wikipedia.org/wiki/GIGO"><i>garbage in, garbage out</i></a> est particuli&egrave;rement importante ici. Il existe &eacute;galement d'autres param&egrave;tres cruciaux dont la pr&eacute;cision de la FEM d&eacute;pend fortement (tels que les propri&eacute;t&eacute;s des mat&eacute;riaux et les conditions aux limites), mais les premi&egrave;res &eacute;tapes et certaines des sources de probl&egrave;mes les plus courantes sont la pr&eacute;paration de la g&eacute;om&eacute;trie et le maillage, dont il est question sur cette page.
</p><p><span id="Types_of_geometry_used_for_FEM_in_FreeCAD"></span>
</p>
<h2><span id="Types_de_g.C3.A9om.C3.A9trie_utilis.C3.A9s_pour_la_m.C3.A9thode_des_.C3.A9l.C3.A9ments_finis_dans_FreeCAD"></span><span class="mw-headline" id="Types_de_g&eacute;om&eacute;trie_utilis&eacute;s_pour_la_m&eacute;thode_des_&eacute;l&eacute;ments_finis_dans_FreeCAD">Types de g&eacute;om&eacute;trie utilis&eacute;s pour la m&eacute;thode des &eacute;l&eacute;ments finis dans FreeCAD</span></h2>
<ul><li>Lignes (polylignes)&nbsp;: pour les analyses avec des &eacute;l&eacute;ments de poutre</li>
<li>Surfaces&nbsp;: pour les analyses avec des &eacute;l&eacute;ments de coque et des &eacute;l&eacute;ments 2D (contraintes et d&eacute;formations planes et axisym&eacute;triques)</li>
<li>Solides&nbsp;: pour les analyses avec des &eacute;l&eacute;ments solides</li></ul>
<p><span id="Choice_of_the_type_of_geometry"></span>
</p>
<h2><span id="Choix_du_type_de_g.C3.A9om.C3.A9trie"></span><span class="mw-headline" id="Choix_du_type_de_g&eacute;om&eacute;trie">Choix du type de g&eacute;om&eacute;trie</span></h2>
<p>Bien que la plupart des conceptions soient constitu&eacute;es de solides, il est souvent fortement recommand&eacute; d'utiliser des polylignes ou des surfaces pour les &eacute;l&eacute;ments finis si la structure le permet&nbsp;:
</p>
<ul><li>Si une pi&egrave;ce est mince (longue et fine) et en forme de poutre et a une section transversale r&eacute;guli&egrave;re de l'un des types de section de poutre actuellement support&eacute;s (rectangulaire, circulaire ou tube), elle doit &ecirc;tre analys&eacute;e &agrave; l'aide d'&eacute;l&eacute;ments de poutre (&agrave; moins qu'il n'y ait des formes sp&eacute;cifiques de charge, de r&eacute;ponse ou des d&eacute;tails g&eacute;om&eacute;triques in&eacute;vitables qui invalident cette supposition). Fondamentalement, il faut dessiner une ligne centrale (des conseils sur la mani&egrave;re de l'extraire d'une g&eacute;om&eacute;trie solide existante peuvent &ecirc;tre trouv&eacute;s dans <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=81589">ce fil de discussion</a>) et appliquer une <a href="wiki/fr//FEM_ElementGeometry1D.html" title="FEM ElementGeometry1D/fr">section de poutre</a> appropri&eacute;e avec une &eacute;ventuelle <a href="wiki/fr//FEM_ElementRotation1D.html" title="FEM ElementRotation1D/fr">rotation</a>. Il n'y a pas de r&egrave;gle unique dictant quand les &eacute;l&eacute;ments de poutre peuvent &ecirc;tre utilis&eacute;s, mais il est souvent conseill&eacute; que les dimensions de la section transversale soient &lt; 1/10 de la longueur de la pi&egrave;ce pour que l'hypoth&egrave;se de la poutre soit valide.</li></ul>
<p><span typeof="mw:File"><a href="../File/FEM_beam_model.JPG" class="mw-file-description"><img src="../File/FEM_beam_model.JPG" decoding="async" width="600" height="233" srcset="/images/thumb/a/af/FEM_beam_model.JPG/900px-FEM_beam_model.JPG 1.5x, /images/a/af/FEM_beam_model.JPG 2x"></a></span>
</p>
<p style="text-align:left; font-style:italic; width:800px; margin-left:1em; margin-right:1em;">Pi&egrave;ce mince convenant &agrave; l'analyse avec des &eacute;l&eacute;ments de poutre - axe central mis en &eacute;vidence</p>
<ul><li>Si une pi&egrave;ce a des parois minces (comme les pi&egrave;ces en t&ocirc;le), elle doit &ecirc;tre analys&eacute;e &agrave; l'aide d'&eacute;l&eacute;ments de coque (sauf si des r&eacute;sultats de contact pr&eacute;cis sont n&eacute;cessaires ou si certaines limites des &eacute;l&eacute;ments de coque sont rencontr&eacute;es). Ce point est tr&egrave;s important et souvent n&eacute;glig&eacute;. Pour obtenir des r&eacute;sultats pr&eacute;cis (en particulier en cas de flexion), il faut quelques &eacute;l&eacute;ments (au moins 3 &agrave; 5) dans la direction de l'&eacute;paisseur. Dans le cas de pi&egrave;ces &agrave; parois minces, cela se traduit g&eacute;n&eacute;ralement par de grandes mailles (en particulier lorsque des t&eacute;tra&egrave;dres sont utilis&eacute;s, car les &eacute;l&eacute;ments hexa&eacute;driques ne peuvent pas &ecirc;tre g&eacute;n&eacute;r&eacute;s dans FreeCAD) et un co&ucirc;t de calcul &eacute;lev&eacute; - puissance informatique &eacute;lev&eacute;e et long temps de r&eacute;solution. Pour obtenir une g&eacute;om&eacute;trie adapt&eacute;e &agrave; l'analyse avec des &eacute;l&eacute;ments coques, il faut dessiner une surface m&eacute;diane de la pi&egrave;ce (des conseils sur la mani&egrave;re de l'extraire d'une g&eacute;om&eacute;trie solide existante peuvent &ecirc;tre trouv&eacute;s dans <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=67505">ce fil de discussion</a>, <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=71821">celui-ci</a> et <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=81834">celui-ci</a>) et appliquer une <a href="wiki/fr//FEM_ElementGeometry2D.html" title="FEM ElementGeometry2D/fr">&eacute;paisseur</a> appropri&eacute;e. L&agrave; encore, il n'y a pas de r&egrave;gle unique, mais il est g&eacute;n&eacute;ralement recommand&eacute; que l'&eacute;paisseur soit &lt; 1/10 d'une dimension globale typique (longueur/largeur) pour que l'hypoth&egrave;se de la coque soit valide.</li></ul>
<p><span typeof="mw:File"><a href="../File/FEM_shell_model.JPG" class="mw-file-description"><img src="../File/FEM_shell_model.JPG" decoding="async" width="600" height="282" srcset="/images/thumb/a/a7/FEM_shell_model.JPG/900px-FEM_shell_model.JPG 1.5x, /images/thumb/a/a7/FEM_shell_model.JPG/1200px-FEM_shell_model.JPG 2x"></a></span>
</p>
<p style="text-align:left; font-style:italic; width:800px; margin-left:1em; margin-right:1em;">Pi&egrave;ce &agrave; paroi mince adapt&eacute;e &agrave; l'analyse avec des &eacute;l&eacute;ments de coque - mise en &eacute;vidence de la surface m&eacute;diane</p>
<ul><li>Dans certains cas, les analyses 2D sont &eacute;galement possibles et peuvent &ecirc;tre activ&eacute;es en d&eacute;finissant la propri&eacute;t&eacute; <span style="font-size:60%; padding-right:0.8em;">Donn&eacute;es</span><b>Model Space</b> du <a href="wiki/fr//FEM_SolverCalculixCxxtools.html" title="FEM SolverCalculixCxxtools/fr">solveur CalculiX</a>&nbsp;:
<ul><li>contrainte plane&nbsp;: pour les pi&egrave;ces minces qui peuvent &ecirc;tre simplifi&eacute;es en surfaces planes repr&eacute;sentant le profil d'extrusion (l'&eacute;paisseur est d&eacute;finie de la m&ecirc;me mani&egrave;re que pour les coques), sont charg&eacute;es et se d&eacute;forment uniquement dans le plan et ont une contrainte nulle dans la direction hors du plan. Seuls deux degr&eacute;s de libert&eacute; sont disponibles&nbsp;: la translation en X et en Y. Dans ce cas, les surfaces doivent se situer sur le plan XY. Cette approche est assez courante. Par exemple, une plaque mince soumise &agrave; une tension peut &ecirc;tre analys&eacute;e de cette mani&egrave;re.</li>
<li>d&eacute;formation dans le plan&nbsp;: pour les pi&egrave;ces &eacute;paisses qui peuvent &ecirc;tre simplifi&eacute;es en surfaces planes repr&eacute;sentant le profil d'extrusion (l'&eacute;paisseur est d&eacute;finie de la m&ecirc;me mani&egrave;re que pour les coquilles), sont charg&eacute;es et se d&eacute;forment uniquement dans le plan et ont une d&eacute;formation nulle dans les directions hors du plan. Seuls deux degr&eacute;s de libert&eacute; sont disponibles&nbsp;: la translation en X et en Y. Dans ce cas, les surfaces doivent &ecirc;tre situ&eacute;es sur le plan XY. Cette approche n'est pas tr&egrave;s courante. Par exemple, un long barrage, un mur ou un tuyau soumis &agrave; une pression uniforme sur toute sa longueur peut &ecirc;tre analys&eacute; de cette mani&egrave;re.</li>
<li>axisym&eacute;trique&nbsp;: pour les pi&egrave;ces qui peuvent &ecirc;tre simplifi&eacute;es en surfaces planes repr&eacute;sentant le profil tournant (l'&eacute;paisseur n'a pas d'importance ici) et qui sont charg&eacute;es uniform&eacute;ment sur toute la circonf&eacute;rence. Seuls deux degr&eacute;s de libert&eacute; sont disponibles&nbsp;: la translation radiale et la translation axiale. Les surfaces doivent &ecirc;tre situ&eacute;es sur le plan XY, &agrave; droite de l'axe Y. Cette approche est tr&egrave;s courante. Par exemple, certains r&eacute;cipients sous pression, les supports en caoutchouc, les bagues, les joints, les brides et m&ecirc;me les assemblages boulonn&eacute;s (en consid&eacute;rant le filetage comme axisym&eacute;trique) peuvent &ecirc;tre analys&eacute;s de cette mani&egrave;re.</li></ul></li></ul>
<p>Il convient de rappeler que les &eacute;l&eacute;ments poutre, coque, contrainte/d&eacute;formation plane et axisym&eacute;trique utilis&eacute;s dans CalculiX ne sont pas de v&eacute;ritables &eacute;l&eacute;ments de ce type (ils n'utilisent pas les formulations d'&eacute;l&eacute;ments classiques connues dans la litt&eacute;rature et dans d'autres logiciels), ils sont &eacute;tendus en interne aux solides. N&eacute;anmoins, leur utilisation est recommand&eacute;e dans les cas susmentionn&eacute;s.
</p><p><span id="Geometry_validity"></span>
</p>
<h2><span id="Validit.C3.A9_de_la_g.C3.A9om.C3.A9trie"></span><span class="mw-headline" id="Validit&eacute;_de_la_g&eacute;om&eacute;trie">Validit&eacute; de la g&eacute;om&eacute;trie</span></h2>
<p>La g&eacute;om&eacute;trie utilis&eacute;e pour la simulation par &eacute;l&eacute;ments finis doit &ecirc;tre valide. Plus important encore, il ne doit pas y avoir d'intersections. Il s'agit d'un probl&egrave;me courant qui survient souvent lorsque des assemblages sont mod&eacute;lis&eacute;s sans contraintes appropri&eacute;es entre les pi&egrave;ces. L'outil <a href="wiki/fr//Part_SectionCut.html" title="Part SectionCut/fr">Part Coupe persistante</a> peut aider &agrave; trouver de telles interf&eacute;rences entre les pi&egrave;ces. Bien entendu, l'outil <a href="wiki/fr//Part_Fuse.html" title="Part Fuse/fr">Part Union</a> peut aider &agrave; les r&eacute;soudre si elles sont intentionnelles. D'autres probl&egrave;mes li&eacute;s &agrave; la g&eacute;om&eacute;trie (tels que les g&eacute;om&eacute;tries non pliantes, les ar&ecirc;tes ou faces redondantes, etc.) doivent &eacute;galement &ecirc;tre r&eacute;solus avant de proc&eacute;der au maillage. L'outil <a href="wiki/fr//Part_CheckGeometry.html" title="Part CheckGeometry/fr">Part V&eacute;rifier la g&eacute;om&eacute;trie</a> peut &ecirc;tre utile, mais les contr&ocirc;les visuels sont &eacute;galement importants. Lors de la pr&eacute;paration d'une simulation utilisant des &eacute;l&eacute;ments solides et en cas de doute quant &agrave; savoir si la pi&egrave;ce est r&eacute;ellement solide ou s'il s'agit simplement d'une coque ferm&eacute;e, les outils susmentionn&eacute;s (Part Coupe persistante et l'onglet <i>Contenu de la forme</i> de Part V&eacute;rifier la g&eacute;om&eacute;trie) peuvent permettre de clarifier la situation.
</p><p><span id="Geometry_simplification"></span>
</p>
<h2><span id="Simplification_de_la_g.C3.A9om.C3.A9trie"></span><span class="mw-headline" id="Simplification_de_la_g&eacute;om&eacute;trie">Simplification de la g&eacute;om&eacute;trie</span></h2>
<p>Les designs pr&eacute;par&eacute;s dans les logiciels de CAO sont g&eacute;n&eacute;ralement trop d&eacute;taill&eacute;s pour &ecirc;tre adapt&eacute;es aux simulations par &eacute;l&eacute;ments finis. Dans de nombreux cas, il est n&eacute;cessaire de les simplifier au pr&eacute;alable. Cette &eacute;tape est souvent n&eacute;glig&eacute;e, mais elle est tr&egrave;s importante car il peut &ecirc;tre difficile d'obtenir un bon maillage lorsque la pi&egrave;ce est trop d&eacute;taill&eacute;e et m&ecirc;me si un tel maillage est finalement obtenu, il peut &ecirc;tre tr&egrave;s dense, ce qui entra&icirc;ne des temps de r&eacute;solution d&eacute;raisonnables. Il faut donc toujours examiner la conception et essayer de la simplifier autant que possible, en ne laissant que les caract&eacute;ristiques g&eacute;om&eacute;triques qui peuvent avoir un impact significatif sur les r&eacute;sultats (r&eacute;sistance/rigidit&eacute;) et qui ne peuvent donc pas &ecirc;tre ignor&eacute;es. Les caract&eacute;ristiques suivantes sont g&eacute;n&eacute;ralement omises
</p>
<ul><li>les petits cong&eacute;s et chanfreins,</li>
<li>petits trous,</li>
<li>autres petits d&eacute;tails,</li>
<li>soudures,</li>
<li>boulons, filetages,</li>
<li>les &eacute;l&eacute;ments d&eacute;coratifs (logos, gravures).</li></ul>
<p>L'outil <a href="wiki/fr//Part_Defeaturing.html" title="Part Defeaturing/fr">Part Supprimer la fonction</a> et l'<a href="wiki/fr//Defeaturing_Workbench.html" title="Defeaturing Workbench/fr">extension Defeaturing</a> peuvent &ecirc;tre utiles pour simplifier les pi&egrave;ces pour les simulations.
</p><p><span typeof="mw:File"><a href="../File/FEM_bracket_original.PNG" class="mw-file-description"><img src="../File/FEM_bracket_original.PNG" decoding="async" width="400" height="471" srcset="/images/8/8b/FEM_bracket_original.PNG 1.5x"></a></span>
</p>
<p style="text-align:left; font-style:italic; width:800px; margin-left:1em; margin-right:1em;">G&eacute;om&eacute;trie originale du support</p>
<p><span typeof="mw:File"><a href="../File/FEM_bracket_simplified.PNG" class="mw-file-description"><img src="../File/FEM_bracket_simplified.PNG" decoding="async" width="400" height="466" srcset="/images/thumb/e/e6/FEM_bracket_simplified.PNG/600px-FEM_bracket_simplified.PNG 1.5x, /images/e/e6/FEM_bracket_simplified.PNG 2x"></a></span>
</p>
<p style="text-align:left; font-style:italic; width:800px; margin-left:1em; margin-right:1em;">G&eacute;om&eacute;trie du support simplifi&eacute;e en utilisant uniquement l'outil Part Supprimer la fonctionnalit&eacute;</p>
<p>Dans le cas des assemblages (plus d'informations &agrave; ce sujet dans l'une des sections suivantes), certaines pi&egrave;ces peuvent souvent &ecirc;tre exclues des simulations et remplac&eacute;es par des conditions aux limites comme si elles &eacute;taient attach&eacute;es aux pi&egrave;ces &agrave; analyser. Cette approche est valable si les pi&egrave;ces exclues sont significativement plus rigides (en termes de rigidit&eacute; structurelle, en tenant compte non seulement de l'&eacute;lasticit&eacute; du mat&eacute;riau mais aussi de la g&eacute;om&eacute;trie de la pi&egrave;ce) que les pi&egrave;ces &agrave; analyser auxquelles elles &eacute;taient connect&eacute;es. En effet, les conditions aux limites fixes introduisent de la rigidit&eacute; (comme si la pi&egrave;ce analys&eacute;e &eacute;tait attach&eacute;e &agrave; un composant infiniment rigide) et les supports flexibles comme les &eacute;l&eacute;ments ressorts ne sont pas disponibles dans l'atelier FEM de FreeCAD lorsque l'on utilise CalculiX (Elmer a un <a href="wiki/fr//FEM_ConstraintSpring.html" title="FEM ConstraintSpring/fr">FEM Ressort</a>).
</p><p>La simplification de la g&eacute;om&eacute;trie pour la simulation par &eacute;l&eacute;ments finis peut &eacute;galement impliquer de la couper dans l'un des plans de sym&eacute;trie afin d'utiliser l'hypoth&egrave;se de sym&eacute;trie plane dans l'analyse. Cette hypoth&egrave;se n'est valable que lorsque tous les aspects suivants du mod&egrave;le pr&eacute;sentent une sym&eacute;trie dans un plan donn&eacute;&nbsp;:
</p>
<ul><li>g&eacute;om&eacute;trie,</li>
<li>charges,</li>
<li>conditions aux limites,</li>
<li>r&eacute;ponse (il faut &ecirc;tre prudent avec les analyses de fr&eacute;quence/flexion utilisant la sym&eacute;trie - on n'obtiendra pas de formes de mode antisym&eacute;triques).</li></ul>
<p>L'utilisation de la sym&eacute;trie (1/2, 1/4 ou 1/8 du mod&egrave;le) est recommand&eacute;e dans la mesure du possible, car elle permet de r&eacute;duire consid&eacute;rablement le co&ucirc;t de calcul de l'analyse. Un autre avantage est qu'elle &eacute;limine certains mouvements des corps rigides, ce qui facilite la contrainte de la pi&egrave;ce. Une condition limite de sym&eacute;trie doit &ecirc;tre appliqu&eacute;e aux faces appartenant au plan de coupe&nbsp;:
</p>
<ul><li>la translation dans la direction normale au plan de sym&eacute;trie doit &ecirc;tre bloqu&eacute;e pour les pi&egrave;ces solides,</li>
<li>la translation dans la direction normale au plan de sym&eacute;trie et les rotations autres qu'autour de l'axe normal au plan de sym&eacute;trie doivent &ecirc;tre bloqu&eacute;es pour les pi&egrave;ces de coque et de poutre.</li></ul>
<p>La force appliqu&eacute;e doit &ecirc;tre correctement r&eacute;duite si le plan de sym&eacute;trie coupe la r&eacute;gion &agrave; laquelle la force est appliqu&eacute;e (sans importance lorsque la charge de pression est utilis&eacute;e).
</p><p><span typeof="mw:File"><a href="../File/FEM_symmetric_vessel.JPG" class="mw-file-description"><img src="../File/FEM_symmetric_vessel.JPG" decoding="async" width="400" height="447" srcset="/images/thumb/c/c6/FEM_symmetric_vessel.JPG/600px-FEM_symmetric_vessel.JPG 1.5x, /images/c/c6/FEM_symmetric_vessel.JPG 2x"></a></span>
</p>
<p style="text-align:left; font-style:italic; width:800px; margin-left:1em; margin-right:1em;">Mod&egrave;le de 1/8 d'un r&eacute;cipient sous pression cylindrique avec des conditions limites de sym&eacute;trie et une charge de pression interne</p>
<p>Un autre type de sym&eacute;trie, moins courant, disponible dans FreeCAD FEM est la sym&eacute;trie cyclique. Elle peut &ecirc;tre d&eacute;finie &agrave; l'aide de la <a href="wiki/fr//FEM_ConstraintTie.html#Sym%C3%A9trie_cyclique" title="FEM ConstraintTie/fr">contrainte de liaison</a> et permet d'analyser un seul secteur repr&eacute;sentatif d'une structure constitu&eacute;e de tels motifs circulaires autour d'un axe. L'hypoth&egrave;se est que les conditions aux limites et les charges pr&eacute;sentent &eacute;galement cette forme de sym&eacute;trie. Des charges tangentielles peuvent &ecirc;tre appliqu&eacute;es et la torsion peut donc &ecirc;tre simul&eacute;e de cette mani&egrave;re. Cependant, une <a href="wiki/fr//FEM_ConstraintCentrif.html" title="FEM ConstraintCentrif/fr">charge centrifuge</a> est g&eacute;n&eacute;ralement utilis&eacute; avec la sym&eacute;trie cyclique. Cette approche peut &ecirc;tre utilis&eacute;e par exemple pour les rotors, les arbres, les turbines, les ventilateurs et les volants d'inertie.
</p><p><span id="Geometry_partitioning"></span>
</p>
<h2><span id="Partitionnement_de_la_g.C3.A9om.C3.A9trie"></span><span class="mw-headline" id="Partitionnement_de_la_g&eacute;om&eacute;trie">Partitionnement de la g&eacute;om&eacute;trie</span></h2>
<p>Le partitionnement est une division de la g&eacute;om&eacute;trie en segments plus petits. Dans d'autres logiciels, il est g&eacute;n&eacute;ralement utilis&eacute; pour permettre le maillage hexagonal, mais dans FreeCAD, il peut &ecirc;tre utile pour d'autres raisons. La principale application du partitionnement est lorsqu'une charge (ou une condition limite) doit &ecirc;tre appliqu&eacute;e uniquement &agrave; une r&eacute;gion s&eacute;lectionn&eacute;e de la surface de la pi&egrave;ce. La fa&ccedil;on la plus simple d'y parvenir est de cr&eacute;er une esquisse avec un contour appropri&eacute; sur cette face et d'utiliser l'outil <a href="wiki/fr//Part_BooleanFragments.html" title="Part BooleanFragments/fr">Part Fragments bool&eacute;ens</a> pour diviser la face avec l'esquisse. Une autre raison d'utiliser le partitionnement est lorsque plusieurs mat&eacute;riaux doivent &ecirc;tre appliqu&eacute;s &agrave; une seule pi&egrave;ce (sans avoir &agrave; utiliser plusieurs pi&egrave;ces connect&eacute;es entre elles). Dans ce cas, le partitionnement peut &ecirc;tre effectu&eacute; &agrave; l'aide d'un <a href="wiki/fr//PartDesign_Plane.html" title="PartDesign Plane/fr">plan</a> et de l'outil Fragments bool&eacute;ens en mode <i>Compsolid</i>. Le partitionnement peut &eacute;galement &ecirc;tre utilis&eacute; pour cr&eacute;er des r&eacute;gions pour <a href="wiki/fr//FEM_MeshRegion.html" title="FEM MeshRegion/fr">mailler plus finement</a>.
</p><p><span typeof="mw:File"><a href="../File/FEM_partition.JPG" class="mw-file-description"><img src="../File/FEM_partition.JPG" decoding="async" width="400" height="404" srcset="/images/thumb/a/a6/FEM_partition.JPG/600px-FEM_partition.JPG 1.5x, /images/a/a6/FEM_partition.JPG 2x"></a></span>
</p>
<p style="text-align:left; font-style:italic; width:800px; margin-left:1em; margin-right:1em;">Pi&egrave;ce avec une cloison de s&eacute;paration pour l'application d'une charge ou d'une condition limite</p>
<p><span id="Assembly_geometries"></span>
</p>
<h2><span id="Assemblage_de_g.C3.A9om.C3.A9tries"></span><span class="mw-headline" id="Assemblage_de_g&eacute;om&eacute;tries">Assemblage de g&eacute;om&eacute;tries</span></h2>
<p>L'une des principales limitations actuelles de l'atelier FEM est que les maillages multiples ne sont pas pris en charge. En pratique, cela signifie qu'il n'est pas possible de mailler chaque pi&egrave;ce de l'assemblage individuellement, puis de connecter les pi&egrave;ces avec les contraintes appropri&eacute;es pour l'analyse. Il est donc n&eacute;cessaire de cr&eacute;er un objet unique contenant toutes les pi&egrave;ces de l'assemblage et de le mailler. Il existe plusieurs options diff&eacute;rentes, toutes bas&eacute;es sur les <a href="wiki/fr//Part_Workbench.html#Barres_d'outils_des_bool%C3%A9ens" title="Part Workbench/fr">Part Outils bool&eacute;ens</a>. Le choix d&eacute;pend de l'effet d&eacute;sir&eacute;&nbsp;: si chaque pi&egrave;ce/volume et leurs limites doivent &ecirc;tre s&eacute;lectionnables (par exemple pour l'affectation de mat&eacute;riaux ou les d&eacute;finitions des conditions limites agissant sur les faces internes) ou non&nbsp;:
</p>
<ul><li><a href="wiki/fr//Part_Fuse.html" title="Part Fuse/fr">Part Union</a>&nbsp;: fusionne les pi&egrave;ces, rendant impossible leur s&eacute;lection individuelle, par exemple pour les d&eacute;finitions de mat&eacute;riaux,</li>
<li><a href="wiki/fr//Part_Compound.html" title="Part Compound/fr">Part Compos&eacute;</a>&nbsp;: cr&eacute;e un objet compos&eacute;, ce qui permet de s&eacute;lectionner chaque pi&egrave;ce,</li>
<li><a href="wiki/fr//Part_JoinConnect.html" title="Part JoinConnect/fr">Part Connecter</a>&nbsp;: fonctionne comme Part Union, mais fusionne les parties, ce qui rend impossible leur s&eacute;lection individuelle,</li>
<li><a href="wiki/fr//Part_BooleanFragments.html" title="Part BooleanFragments/fr">Part Fragments bool&eacute;ens</a>&nbsp;: fonctionne comme Part Compos&eacute;, ce qui permet de s&eacute;lectionner chaque partie.</li></ul>
<p>Il est important de mentionner que si les pi&egrave;ces se touchent, un maillage continu sera cr&eacute;&eacute; sur l'objet bool&eacute;en et aucune contrainte ne sera n&eacute;cessaire pour la simulation. S'il y a un petit espace entre les pi&egrave;ces (ou une intersection &agrave; l'int&eacute;rieur d'un Part Compos&eacute;), le maillage ne sera pas continu et des contraintes comme la <a href="wiki/fr//FEM_ConstraintTie.html" title="FEM ConstraintTie/fr">Contrainte de liaison</a> ou la <a href="wiki/fr//FEM_ConstraintContact.html" title="FEM ConstraintContact/fr">Contrainte de contact</a> seront n&eacute;cessaires. L'ex&eacute;cution d'une analyse en fr&eacute;quence est un bon moyen de r&eacute;v&eacute;ler si le maillage est continu ou non. Si les pi&egrave;ces ne sont pas connect&eacute;es, les premi&egrave;res formes des modes avec d&eacute;formation visualis&eacute;es &agrave; l'aide du <a href="wiki/fr//FEM_PostFilterWarp.html" title="FEM PostFilterWarp/fr">filtre des d&eacute;formations</a> montreront une s&eacute;paration, les pi&egrave;ces "s'envoleront".
</p><p><span typeof="mw:File"><a href="../File/FEM_modal_separation.JPG" class="mw-file-description"><img src="../File/FEM_modal_separation.JPG" decoding="async" width="400" height="484" srcset="/images/9/97/FEM_modal_separation.JPG 1.5x"></a></span>
</p>
<p style="text-align:left; font-style:italic; width:800px; margin-left:1em; margin-right:1em;">La forme du premier mode d'une analyse de fr&eacute;quence visualis&eacute;e avec le filtre des d&eacute;formations - deux cubes avec un petit &eacute;cart initial ont &eacute;t&eacute; analys&eacute;s.</p>
<p>La s&eacute;lection des r&eacute;gions internes (faces/volumes) peut s'av&eacute;rer d&eacute;licate. Elle peut &ecirc;tre n&eacute;cessaire pour l'application de diff&eacute;rents mat&eacute;riaux, charges ou conditions aux limites (en particulier dans les analyses thermiques et &eacute;lectromagn&eacute;tiques). Plusieurs m&eacute;thodes sont possibles&nbsp;:
</p>
<ul><li>activer <a href="wiki/fr//Std_ToggleClipPlane.html" title="Std ToggleClipPlane/fr">plan de coupe</a> pour la s&eacute;lection et le choix des faces internes,</li>
<li>masquer l'objet bool&eacute;en, ne montrer qu'une des parties auxquelles il a &eacute;t&eacute; appliqu&eacute; et la s&eacute;lectionner,</li>
<li>s&eacute;lectionner un autre objet externe et &eacute;diter la propri&eacute;t&eacute; <i>References</i> dans l'onglet <i>Donn&eacute;es</i> d'un &eacute;l&eacute;ment d'analyse donn&eacute; (n&eacute;cessite la sp&eacute;cification manuelle du num&eacute;ro de l'objet g&eacute;om&eacute;trique).</li></ul>
<p><span id="Meshing_basics"></span>
</p>
<h2><span class="mw-headline" id="Les_bases_du_maillage">Les bases du maillage</span></h2>
<div class="mw-translate-fuzzy">
<p>Un maillage trop grossier est l'une des sources les plus courantes d'inexactitudes et d'autres probl&egrave;mes dans les simulations par &eacute;l&eacute;ments finis. Il s'agit souvent d'une erreur partielle des param&egrave;tres du maillage automatique. Ils g&eacute;n&egrave;rent g&eacute;n&eacute;ralement des maillages tr&egrave;s grossiers et inadapt&eacute;s lorsque la taille des &eacute;l&eacute;ments n'est pas sp&eacute;cifi&eacute;e manuellement, mais laiss&eacute;e avec une valeur par d&eacute;faut. Il faut toujours conna&icirc;tre les dimensions approximatives de la pi&egrave;ce, en particulier la taille de la plus petite caract&eacute;ristique pertinente (l'outil <a href="wiki/fr//Part_Measure_Linear.html" title="Part Measure Linear/fr">Part Mesure lin&eacute;aire</a> peut aider &agrave; cet &eacute;gard) et sp&eacute;cifier la taille maximale appropri&eacute;e de l'&eacute;l&eacute;ment sur cette base. Lors du maillage avec Gmsh, il existe &eacute;galement un param&egrave;tre de taille minimale des &eacute;l&eacute;ments qui peut emp&ecirc;cher la cr&eacute;ation d'&eacute;l&eacute;ments trop petits autour de petites caract&eacute;ristiques g&eacute;om&eacute;triques, ce qui peut conduire &agrave; des maillages inutilement denses (et parfois m&ecirc;me &agrave; un plantage ou &agrave; un gel de FreeCAD lorsqu'on essaie de g&eacute;n&eacute;rer de tels maillages). D'une mani&egrave;re g&eacute;n&eacute;rale, il est pr&eacute;f&eacute;rable de commencer par un maillage plus grossier (moins long &agrave; g&eacute;n&eacute;rer), de voir &agrave; quoi il ressemble (une certaine exp&eacute;rience est n&eacute;cessaire) et de l'affiner si n&eacute;cessaire. Il est souvent judicieux d'utiliser un maillage dense uniquement autour des zones d'int&eacute;r&ecirc;t (endroits pr&eacute;sentant des gradients/concentrations de contraintes importants - encoches) et un maillage relativement grossier &agrave; l'&eacute;cart de ces zones. De cette mani&egrave;re, le nombre d'&eacute;l&eacute;ments peut &ecirc;tre consid&eacute;rablement r&eacute;duit, ce qui permet de diminuer les temps de r&eacute;solution. L'am&eacute;lioration du maillage local est d&eacute;fini &agrave; l'aide de <a href="wiki/fr//FEM_MeshRegion.html" title="FEM MeshRegion/fr">FEM Mailler plus finement</a>.
</p>
</div>
<p><span typeof="mw:File"><a href="../File/FEM_default_mesh.PNG" class="mw-file-description"><img src="../File/FEM_default_mesh.PNG" decoding="async" width="400" height="238" srcset="/images/thumb/b/ba/FEM_default_mesh.PNG/600px-FEM_default_mesh.PNG 1.5x, /images/thumb/b/ba/FEM_default_mesh.PNG/800px-FEM_default_mesh.PNG 2x"></a></span>
</p>
<p style="text-align:left; font-style:italic; width:800px; margin-left:1em; margin-right:1em;">Par d&eacute;faut, maillage trop grossier</p>
<p><span typeof="mw:File"><a href="../File/FEM_globally_refined_mesh.PNG" class="mw-file-description"><img src="../File/FEM_globally_refined_mesh.PNG" decoding="async" width="400" height="239" srcset="/images/thumb/1/12/FEM_globally_refined_mesh.PNG/600px-FEM_globally_refined_mesh.PNG 1.5x, /images/thumb/1/12/FEM_globally_refined_mesh.PNG/800px-FEM_globally_refined_mesh.PNG 2x"></a></span>
</p>
<p style="text-align:left; font-style:italic; width:800px; margin-left:1em; margin-right:1em;">Maillage am&eacute;lior&eacute; globalement</p>
<p><span typeof="mw:File"><a href="../File/FEM_locally_refined_mesh.PNG" class="mw-file-description"><img src="../File/FEM_locally_refined_mesh.PNG" decoding="async" width="400" height="239" srcset="/images/thumb/3/34/FEM_locally_refined_mesh.PNG/600px-FEM_locally_refined_mesh.PNG 1.5x, /images/thumb/3/34/FEM_locally_refined_mesh.PNG/800px-FEM_locally_refined_mesh.PNG 2x"></a></span>
</p>
<p style="text-align:left; font-style:italic; width:800px; margin-left:1em; margin-right:1em;">Maillage am&eacute;lior&eacute; localement</p>
<div class="mw-translate-fuzzy">
<p>Le choix du type d'&eacute;l&eacute;ment n'est pas facile et d&eacute;pend de nombreux facteurs, mais la r&egrave;gle g&eacute;n&eacute;rale est que les &eacute;l&eacute;ments hexa&eacute;driques et quadruples sont pr&eacute;f&eacute;rables aux &eacute;l&eacute;ments t&eacute;tra&eacute;driques et triangulaires. Cependant, les g&eacute;om&eacute;tries complexes ne peuvent pas &ecirc;tre maill&eacute;es avec des &eacute;l&eacute;ments hexa&eacute;driques et FreeCAD ne peut pas les g&eacute;n&eacute;rer du tout (seuls les maillages quadruples peuvent &ecirc;tre g&eacute;n&eacute;r&eacute;s sur les surfaces, voir <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=20351">ce fil de discussion</a>). Les &eacute;l&eacute;ments hexa&eacute;driques peuvent &ecirc;tre import&eacute;s &agrave; partir de maillages externes comme <a rel="nofollow" class="external text" href="https://gmsh.info">Gmsh</a> et utilis&eacute;s dans l'atelier FEM comme le montre <a rel="nofollow" class="external text" href="https://www.youtube.com/watch?v=vylt24G7qj4&amp;t=932s">cette vid&eacute;o</a>.
</p>
</div>
<div class="mw-translate-fuzzy">
<p>Le choix de l'ordre des &eacute;l&eacute;ments (premier ou second) d&eacute;pend des conditions d'analyse, mais dans la plupart des cas, les &eacute;l&eacute;ments de second ordre sont pr&eacute;f&eacute;rables. Ceci est particuli&egrave;rement vrai pour les &eacute;l&eacute;ments triangulaires et t&eacute;tra&eacute;driques, leurs versions de premier ordre (lin&eacute;aires) ne sont normalement pas recommand&eacute;es pour un usage r&eacute;gulier et ne devraient &ecirc;tre utilis&eacute;es que comme &eacute;l&eacute;ments de remplissage dans des r&eacute;gions de faible importance. Cependant, comme FreeCAD ne peut pas g&eacute;n&eacute;rer d'&eacute;l&eacute;ments hexa&eacute;driques, les t&eacute;tra&egrave;dres lin&eacute;aires peuvent &ecirc;tre utilis&eacute;s dans certains cas, si les maillages sont suffisamment denses. En particulier lors d'analyses avec une <a href="wiki/fr//FEM_ConstraintContact.html" title="FEM ConstraintContact/fr">contrainte de contact</a>.
</p>
</div>
<p><span id="Negative_Jacobians"></span>
</p>
<h2><span id="Jacobiens_n.C3.A9gatifs"></span><span class="mw-headline" id="Jacobiens_n&eacute;gatifs">Jacobiens n&eacute;gatifs</span></h2>
<p>Si les r&egrave;gles ci-dessus sont respect&eacute;es (notamment en ce qui concerne la validit&eacute; de la g&eacute;om&eacute;trie, le defeaturing et la s&eacute;lection de la taille des &eacute;l&eacute;ments), le maillage devrait &ecirc;tre g&eacute;n&eacute;r&eacute; correctement. Cependant, dans certains cas, la g&eacute;om&eacute;trie ne peut pas &ecirc;tre trop simplifi&eacute;e, ou la proc&eacute;dure de mod&eacute;lisation est appropri&eacute;e mais conduit quand m&ecirc;me &agrave; des ar&ecirc;tes et des faces de petite taille. Dans ce cas, le maillage avec des &eacute;l&eacute;ments de second ordre peut &eacute;chouer en raison de jacobiens n&eacute;gatifs. La raison en est que les maillages doivent suivre le mod&egrave;le CAO et placer les n&oelig;uds m&eacute;dians des &eacute;l&eacute;ments de second ordre sur la g&eacute;om&eacute;trie. Dans le cas de formes plus complexes, les &eacute;l&eacute;ments peuvent &ecirc;tre tellement &eacute;tir&eacute;s qu'ils deviennent invers&eacute;s. Le jacobien est l'une des mesures de qualit&eacute; de maillage les plus courantes. Il repr&eacute;sente l'&eacute;cart de l'&eacute;l&eacute;ment par rapport &agrave; la forme id&eacute;ale. Elle devient n&eacute;gative lorsque l'&eacute;l&eacute;ment se retourne (devient invers&eacute;), soit en raison d'une d&eacute;formation importante au cours de l'analyse (non prise en compte ici), soit en raison des probl&egrave;mes de maillage susmentionn&eacute;s. Les jacobiens n&eacute;gatifs dans l'atelier FEM de FreeCAD peuvent &ecirc;tre signal&eacute;s par Gmsh ou par CalculiX. Leurs emplacements dans le maillage sont mis en &eacute;vidence lorsque les analyses CalculiX sont soumises en utilisant le bouton <a href="wiki/fr//FEM_SolverRun.html" title="FEM SolverRun/fr">Lancer les calculs du solveur</a>. Les conseils suivants peuvent aider &agrave; les &eacute;liminer&nbsp;:
</p>
<ul><li>D&eacute;finir la propri&eacute;t&eacute; <i>Second Order Linear</i> du <a href="wiki/fr//FEM_MeshGmshFromShape.html" title="FEM MeshGmshFromShape/fr">maillage de Gmsh</a> &agrave; <i>true</i>, ceci a pour r&eacute;sultat que les n&oelig;uds du milieu des &eacute;l&eacute;ments de second ordre sont simplement ajout&eacute;s au milieu des bords droits (initialement) des &eacute;l&eacute;ments de premier ordre, sans les attacher &agrave; la g&eacute;om&eacute;trie et r&eacute;sout le probl&egrave;me dans la plupart des cas,</li>
<li>Utiliser Netgen au lieu de Gmsh. Netgen est connu pour &ecirc;tre moins sujet aux probl&egrave;mes de jacobiens n&eacute;gatifs mais ne les signale pas non plus, de sorte que l'utilisateur ne peut s'en rendre compte qu'au moment de soumettre l'analyse,</li>
<li>R&eacute;duire davantage la taille des &eacute;l&eacute;ments,</li>
<li>Exporter la g&eacute;om&eacute;trie, essayer de la mailler dans l'interface graphique de Gmsh ou Netgen (NGSolve) ou dans un autre maillage autonome (comme Salome_Meca). Ces outils ont des fonctions suppl&eacute;mentaires qui peuvent aider &agrave; se d&eacute;barrasser des jacobiens n&eacute;gatifs (par exemple, Gmsh a ce que l'on appelle des "outils d'ordre &eacute;lev&eacute;"),</li>
<li>Utiliser des &eacute;l&eacute;ments de premier ordre. Cela ne doit &ecirc;tre fait qu'en dernier recours car les t&eacute;tra&egrave;dres de premier ordre sont connus pour leur impr&eacute;cision.</li></ul>
<p>Ind&eacute;pendamment de ces conseils, il est important de souligner une fois de plus que les jacobiens n&eacute;gatifs sont g&eacute;n&eacute;ralement dus &agrave; des approches de mod&eacute;lisation d&eacute;sordonn&eacute;es et &agrave; un manque de pr&eacute;paration de la g&eacute;om&eacute;trie pour l'analyse (ce qui est particuli&egrave;rement courant avec les mod&egrave;les STEP t&eacute;l&eacute;charg&eacute;s &agrave; partir de divers sites web). M&ecirc;me si le maillage est finalement g&eacute;n&eacute;r&eacute; dans de tels cas, les r&eacute;sultats risquent d'&ecirc;tre de mauvaise qualit&eacute; (rappelons la r&egrave;gle GIGO mentionn&eacute;e dans le premier paragraphe). Par cons&eacute;quent, le nettoyage de la g&eacute;om&eacute;trie et la pr&eacute;paration pour la FEM devraient toujours &ecirc;tre la priorit&eacute;.
</p><p><span id="Mesh_convergence_studies"></span>
</p>
<h2><span id=".C3.89tudes_sur_la_convergence_des_maillages"></span><span class="mw-headline" id="&Eacute;tudes_sur_la_convergence_des_maillages">&Eacute;tudes sur la convergence des maillages</span></h2>
<p>Les &eacute;tudes de convergence de maillage sont recommand&eacute;es dans tous les projets s&eacute;rieux n&eacute;cessitant des r&eacute;sultats pr&eacute;cis. En effet, les r&eacute;sultats peuvent changer consid&eacute;rablement et s'approcher des valeurs correctes lorsque le maillage est affin&eacute;. L'approche suivante doit &ecirc;tre utilis&eacute;e&nbsp;:
</p>
<ol><li>Apr&egrave;s avoir obtenu les premiers r&eacute;sultats et les avoir not&eacute;s (g&eacute;n&eacute;ralement la contrainte de von Mises maximale, la contrainte de von Mises &agrave; un endroit donn&eacute; et le d&eacute;placement maximal), affiner le maillage (globalement ou mieux localement avec <a href="wiki/fr//FEM_MeshRegion.html" title="FEM MeshRegion/fr">FEM Mailler plus finement</a>) et r&eacute;ex&eacute;cuter la simulation.</li>
<li>V&eacute;rifiez les r&eacute;sultats et notez leurs nouvelles valeurs. S'ils diff&egrave;rent significativement des r&eacute;sultats initiaux, affinez encore le maillage et relancez l'analyse.</li>
<li>R&eacute;p&eacute;tez le processus si les r&eacute;sultats changent encore (g&eacute;n&eacute;ralement en augmentant) de mani&egrave;re significative avec l'affinement du maillage.</li></ol>
<p>Il est g&eacute;n&eacute;ralement utile de cr&eacute;er un graphique avec un r&eacute;sultat donn&eacute; en fonction de la densit&eacute; du maillage. De cette fa&ccedil;on, il est plus facile de remarquer quand les r&eacute;sultats commencent &agrave; converger. La diff&eacute;rence acceptable dans les r&eacute;sultats entre deux ex&eacute;cutions est g&eacute;n&eacute;ralement de l'ordre de quelques pour cent (par exemple, moins de 5&nbsp;%).
</p><p>Dans certains cas, il peut arriver que la contrainte maximale augmente ind&eacute;finiment, quelle que soit la densit&eacute; du maillage. Un tel effet non physique est connu sous le nom de singularit&eacute; de contrainte. Il peut se produire pour les raisons suivantes
</p>
<ul><li>les forces concentr&eacute;es appliqu&eacute;es aux mod&egrave;les de solides et de coques,</li>
<li>conditions limites appliqu&eacute;es &agrave; des points (n&oelig;uds individuels),</li>
<li>angles vifs,</li>
<li>contact survenant dans un coin.</li></ul>
<p>Les moyens typiques de traiter les singularit&eacute;s de contrainte sont les suivants&nbsp;:
</p>
<ul><li>appliquer des charges et des conditions aux limites &agrave; de petites zones plut&ocirc;t qu'&agrave; des points - voir la section sur le partitionnement ci-dessus,</li>
<li>ajouter de petits filets aux angles vifs (une exception &agrave; la r&egrave;gle qui consiste &agrave; omettre les petits filets lors de la simplification de la g&eacute;om&eacute;trie pour les &eacute;l&eacute;ments finis),</li>
<li>inclure la plasticit&eacute; dans le comportement du mat&eacute;riau pour permettre la redistribution des contraintes et limiter les contraintes aux valeurs autoris&eacute;es par la d&eacute;finition de la plasticit&eacute; tout en observant le niveau appropri&eacute; de d&eacute;formation (d&eacute;formation plastique),</li>
<li>ignorer les singularit&eacute;s et lire les contraintes loin d'elles si possible (sur la base du principe de St. Venant).</li></ul>
<p><span typeof="mw:File"><a href="../File/FEM_mesh_convergence.PNG" class="mw-file-description"><img src="../File/FEM_mesh_convergence.PNG" decoding="async" width="400" height="332" srcset="/images/thumb/1/13/FEM_mesh_convergence.PNG/600px-FEM_mesh_convergence.PNG 1.5x, /images/thumb/1/13/FEM_mesh_convergence.PNG/800px-FEM_mesh_convergence.PNG 2x"></a></span>
</p>
<p style="text-align:left; font-style:italic; width:800px; margin-left:1em; margin-right:1em;">Trac&eacute;s de convergence de maillage typiques&nbsp;:<br>
- le d&eacute;placement (<b>courbe verte</b>) converge rapidement,<br>
- la contrainte maximale au niveau d'une entaille comme un trou (<b>courbe bleue</b>) n&eacute;cessite davantage d'it&eacute;rations de raffinement du maillage pour converger, <br>
- tandis que la contrainte maximale au niveau d'un angle aigu avec une condition limite fixe (<b>courbe rouge</b>) ne converge pas du tout. Une singularit&eacute; de contrainte se produit et un petit cong&eacute; devrait &ecirc;tre ajout&eacute; et la connexion devrait &ecirc;tre mod&eacute;lis&eacute;e de mani&egrave;re plus r&eacute;aliste et plus flexible pour &eacute;viter ce comportement.<br></p>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: #fefefe;"><span typeof="mw:File"><a href="../File/Workbench_FEM.svg" class="mw-file-description"><img src="../File/Workbench_FEM.svg" decoding="async" width="24" height="24"></a></span> <a href="wiki/fr//FEM_Workbench.html" title="FEM Workbench/fr">FEM</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid #aaaaaa; text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: #fefefe;">
<ul><li><a href="wiki/fr//FEM_Analysis.html" title="FEM Analysis/fr">FEM Conteneur d'analyse</a></li></ul>
<ul><li><b>Mat&eacute;riaux&nbsp;:</b> <a href="wiki/fr//FEM_MaterialSolid.html" title="FEM MaterialSolid/fr">Solide</a>, <a href="wiki/fr//FEM_MaterialFluid.html" title="FEM MaterialFluid/fr">Fluide</a>, <a href="wiki/fr//FEM_MaterialMechanicalNonlinear.html" title="FEM MaterialMechanicalNonlinear/fr">M&eacute;canique non lin&eacute;aire</a>, <a href="wiki/fr//FEM_MaterialReinforced.html" title="FEM MaterialReinforced/fr">Renforc&eacute; (type b&eacute;ton)</a>&nbsp;; <a href="wiki/fr//FEM_MaterialEditor.html" title="FEM MaterialEditor/fr">&Eacute;diteur de mat&eacute;riaux</a></li></ul>
<ul><li><b>G&eacute;om&eacute;trie de l'&eacute;lement&nbsp;:</b> <a href="wiki/fr//FEM_ElementGeometry1D.html" title="FEM ElementGeometry1D/fr">Poutre (1D)</a>, <a href="wiki/fr//FEM_ElementRotation1D.html" title="FEM ElementRotation1D/fr"> Rotation de poutre (1D)</a>, <a href="wiki/fr//FEM_ElementGeometry2D.html" title="FEM ElementGeometry2D/fr">Coque (2D)</a>, <a href="wiki/fr//FEM_ElementFluid1D.html" title="FEM ElementFluid1D/fr">Section fluide (1D)</a></li></ul>
<hr>
<p><b>Contraintes</b>
</p>
<ul><li><b>&Eacute;lectromagn&eacute;tique&nbsp;:</b> <a href="wiki/fr//FEM_ConstraintElectrostaticPotential.html" title="FEM ConstraintElectrostaticPotential/fr">Potentiel &eacute;lectrostatique</a>, <a href="wiki/fr//FEM_ConstraintCurrentDensity.html" title="FEM ConstraintCurrentDensity/fr">Densit&eacute; de courant</a>, <a href="wiki/fr//FEM_ConstraintMagnetization.html" title="FEM ConstraintMagnetization/fr">Magn&eacute;tisation</a></li></ul>
<ul><li><b>Fluide&nbsp;:</b> <a href="wiki/fr//FEM_ConstraintInitialFlowVelocity.html" title="FEM ConstraintInitialFlowVelocity/fr">Vitesse initiale d'&eacute;coulement</a>, <a href="wiki/fr//FEM_ConstraintInitialPressure.html" title="FEM ConstraintInitialPressure/fr">Pression initiale</a>, <a href="wiki/fr//FEM_ConstraintFlowVelocity.html" title="FEM ConstraintFlowVelocity/fr">Vitesse d'&eacute;coulement</a></li></ul>
<ul><li><b>G&eacute;ometrique&nbsp;:</b> <a href="wiki/fr//FEM_ConstraintPlaneRotation.html" title="FEM ConstraintPlaneRotation/fr">Rotation plane</a>, <a href="wiki/fr//FEM_ConstraintSectionPrint.html" title="FEM ConstraintSectionPrint/fr">Empreinte de section</a>, <a href="wiki/fr//FEM_ConstraintTransform.html" title="FEM ConstraintTransform/fr">Transformation</a></li></ul>
<ul><li><b>M&eacute;canique&nbsp;:</b> <a href="wiki/fr//FEM_ConstraintFixed.html" title="FEM ConstraintFixed/fr">Immobilisation</a>, <a href="wiki/fr//FEM_ConstraintDisplacement.html" title="FEM ConstraintDisplacement/fr">D&eacute;placement</a>, <a href="wiki/fr//FEM_ConstraintContact.html" title="FEM ConstraintContact/fr">Contact</a>, <a href="wiki/fr//FEM_ConstraintTie.html" title="FEM ConstraintTie/fr">Liaison</a>, <a href="wiki/fr//FEM_ConstraintSpring.html" title="FEM ConstraintSpring/fr">Ressort</a>, <a href="wiki/fr//FEM_ConstraintForce.html" title="FEM ConstraintForce/fr">Force</a>, <a href="wiki/fr//FEM_ConstraintPressure.html" title="FEM ConstraintPressure/fr">Pression</a>, <a href="wiki/fr//FEM_ConstraintCentrif.html" title="FEM ConstraintCentrif/fr">Centrifuge</a>, <a href="wiki/fr//FEM_ConstraintSelfWeight.html" title="FEM ConstraintSelfWeight/fr">Poids propre</a></li></ul>
<ul><li><b>Thermique&nbsp;:</b> <a href="wiki/fr//FEM_ConstraintInitialTemperature.html" title="FEM ConstraintInitialTemperature/fr">Temp&eacute;rature initiale</a>, <a href="wiki/fr//FEM_ConstraintHeatflux.html" title="FEM ConstraintHeatflux/fr">Flux de chaleur</a>, <a href="wiki/fr//FEM_ConstraintTemperature.html" title="FEM ConstraintTemperature/fr">Temp&eacute;rature</a>, <a href="wiki/fr//FEM_ConstraintBodyHeatSource.html" title="FEM ConstraintBodyHeatSource/fr">Source thermique</a></li></ul>
<ul><li><b>Remplacer les Constantes&nbsp;:</b> <a href="wiki/fr//FEM_ConstantVacuumPermittivity.html" title="FEM ConstantVacuumPermittivity/fr">Permittivit&eacute; du vide</a></li></ul>
<hr>
<ul><li><b>Maillage&nbsp;:</b> <a href="wiki/fr//FEM_MeshNetgenFromShape.html" title="FEM MeshNetgenFromShape/fr">Maillage Netgen</a>, <a href="wiki/fr//FEM_MeshGmshFromShape.html" title="FEM MeshGmshFromShape/fr">Maillage GMSH</a>, <a href="wiki/fr//FEM_MeshBoundaryLayer.html" title="FEM MeshBoundaryLayer/fr">Couche limite de maillage</a>, <a href="wiki/fr//FEM_MeshRegion.html" title="FEM MeshRegion/fr">R&eacute;gion de maillage</a>, <a href="wiki/fr//FEM_MeshGroup.html" title="FEM MeshGroup/fr">Groupe de maillage</a>, <a href="wiki/fr//FEM_CreateNodesSet.html" title="FEM CreateNodesSet/fr">Ensemble de n&oelig;uds</a>, <a href="wiki/fr//FEM_FemMesh2Mesh.html" title="FEM FemMesh2Mesh/fr">Maillage &agrave; maillage</a></li></ul>
<ul><li><b>Solveur&nbsp;:</b> <a href="wiki/fr//FEM_SolverCalculixCxxtools.html" title="FEM SolverCalculixCxxtools/fr">CalculiX Standard</a>, <a href="wiki/fr//FEM_SolverElmer.html" title="FEM SolverElmer/fr">Elmer</a>, <a href="wiki/fr//FEM_SolverMystran.html" title="FEM SolverMystran/fr">Mystran</a>, <a href="wiki/fr//FEM_SolverZ88.html" title="FEM SolverZ88/fr">Z88</a>&nbsp;; <b>&Eacute;quations&nbsp;:</b> <a href="wiki/fr//FEM_EquationDeformation.html" title="FEM EquationDeformation/fr">D&eacute;formation</a>, <a href="wiki/fr//FEM_EquationElasticity.html" title="FEM EquationElasticity/fr">&Eacute;lasticit&eacute;</a>, <a href="wiki/fr//FEM_EquationElectrostatic.html" title="FEM EquationElectrostatic/fr">&Eacute;lectrostatique</a>, <a href="wiki/fr//FEM_EquationElectricforce.html" title="FEM EquationElectricforce/fr">Force &eacute;lectrique</a>, <a href="wiki/fr//FEM_EquationMagnetodynamic.html" title="FEM EquationMagnetodynamic/fr">Magn&eacute;todynamique</a>, <a href="wiki/fr//FEM_EquationMagnetodynamic2D.html" title="FEM EquationMagnetodynamic2D/fr">Magn&eacute;todynamique 2D</a>, <a href="wiki/fr//FEM_EquationFlow.html" title="FEM EquationFlow/fr">&Eacute;coulement</a>, <a href="wiki/fr//FEM_EquationFlux.html" title="FEM EquationFlux/fr">Flux</a>, <a href="wiki/fr//FEM_EquationHeat.html" title="FEM EquationHeat/fr">Chaleur</a>&nbsp;; <b>Solveur&nbsp;:</b> <a href="wiki/fr//FEM_SolverControl.html" title="FEM SolverControl/fr">R&eacute;glage du solveur</a>, <a href="wiki/fr//FEM_SolverRun.html" title="FEM SolverRun/fr">Calcul du solveur</a></li></ul>
<ul><li><b>R&eacute;sultats&nbsp;:</b> <a href="wiki/fr//FEM_ResultsPurge.html" title="FEM ResultsPurge/fr">Purger</a>, <a href="wiki/fr//FEM_ResultShow.html" title="FEM ResultShow/fr">Afficher</a>&nbsp;; <b>Postprocessing&nbsp;:</b> <a href="wiki/fr//FEM_PostApplyChanges.html" title="FEM PostApplyChanges/fr">Appliquer les modifications</a>, <a href="wiki/fr//FEM_PostPipelineFromResult.html" title="FEM PostPipelineFromResult/fr">Pipeline du r&eacute;sultat</a>, <a href="wiki/fr//FEM_PostFilterWarp.html" title="FEM PostFilterWarp/fr">Filtre des d&eacute;formations</a>, <a href="wiki/fr//FEM_PostFilterClipScalar.html" title="FEM PostFilterClipScalar/fr">Filtre d'&eacute;cr&ecirc;tage scalaire</a>, <a href="wiki/fr//FEM_PostFilterCutFunction.html" title="FEM PostFilterCutFunction/fr">Filtre de fonction de d&eacute;coupe</a>, <a href="wiki/fr//FEM_PostFilterClipRegion.html" title="FEM PostFilterClipRegion/fr">Filtre d'&eacute;cr&ecirc;tage selon une r&eacute;gion</a>, <a href="wiki/fr//FEM_PostFilterContours.html" title="FEM PostFilterContours/fr">Filtre par contours</a>, <a href="wiki/fr//FEM_PostFilterDataAlongLine.html" title="FEM PostFilterDataAlongLine/fr">Filtre d'&eacute;cr&ecirc;tage selon une ligne</a>, <a href="wiki/fr//FEM_PostFilterLinearizedStresses.html" title="FEM PostFilterLinearizedStresses/fr">Graphique de lin&eacute;arisation des crit&egrave;res</a>, <a href="wiki/fr//FEM_PostFilterDataAtPoint.html" title="FEM PostFilterDataAtPoint/fr">Donn&eacute;es du filtre d'&eacute;cr&ecirc;tage du point</a>, <a href="wiki/fr//FEM_PostCreateFunctionPlane.html" title="FEM PostCreateFunctionPlane/fr">Filtre fonction plan</a>, <a href="wiki/fr//FEM_PostCreateFunctionSphere.html" title="FEM PostCreateFunctionSphere/fr">Filtre fonction sph&egrave;re</a>, <a href="wiki/fr//FEM_PostCreateFunctionCylinder.html" title="FEM PostCreateFunctionCylinder/fr">Filtre fonction cylindre</a>, <a href="wiki/fr//FEM_PostCreateFunctionBox.html" title="FEM PostCreateFunctionBox/fr">Filtre fonction bo&icirc;te</a></li></ul>
<ul><li><b>Utilitaires&nbsp;:</b> <a href="wiki/fr//FEM_ClippingPlaneAdd.html" title="FEM ClippingPlaneAdd/fr">Plan de coupe</a>, <a href="wiki/fr//FEM_ClippingPlaneRemoveAll.html" title="FEM ClippingPlaneRemoveAll/fr">Supprimer les plans de coupe</a>, <a href="wiki/fr//FEM_Examples.html" title="FEM Examples/fr">Exemples</a>&nbsp;; <a href="wiki/fr//FEM_MeshClear.html" title="FEM MeshClear/fr">Supprimer le maillage</a>, <a href="wiki/fr//FEM_MeshDisplayInfo.html" title="FEM MeshDisplayInfo/fr">Affichage des informations du maillage</a></li></ul>
<hr>
<ul><li><b>Additionnel&nbsp;:</b> <a href="wiki/fr//FEM_Preferences.html" title="FEM Preferences/fr">Pr&eacute;f&eacute;rences</a>&nbsp;; <a href="wiki/fr//FEM_Install.html" title="FEM Install/fr">Installation</a>, <a href="wiki/fr//FEM_Mesh.html" title="FEM Mesh/fr">FEM Maillage</a>, <a href="wiki/fr//FEM_Solver.html" title="FEM Solver/fr">Solveur</a>, <a href="wiki/fr//FEM_CalculiX.html" title="FEM CalculiX/fr">CalculiX</a>, <a href="wiki/fr//FEM_Concrete.html" title="FEM Concrete/fr">FEM B&eacute;ton</a>&nbsp;; <a href="wiki/fr//FEM_Element_Types.html" title="FEM Element Types/fr">FEM Types d'&eacute;lements</a></li></ul></div>
    </div></div>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: #fefefe;"><span typeof="mw:File"><a href="../File/User_hub.png" class="mw-file-description"><img src="../File/User_hub.png" decoding="async" width="24" height="24" srcset="/images/thumb/9/94/User_hub.png/36px-User_hub.png 1.5x, /images/thumb/9/94/User_hub.png/48px-User_hub.png 2x"></a></span> <a href="wiki/fr//User_hub.html" title="User hub/fr">Hub utilisateurs</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid #aaaaaa; text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: #fefefe;">
<ul><li><b><a href="wiki/fr//Getting_started.html" title="Getting started/fr">D&eacute;marrer avec FreeCAD</a></b></li>
<li><b>Installation&nbsp;:</b> <a href="wiki/fr//Download.html" title="Download/fr">T&eacute;l&eacute;chargements</a>, <a href="wiki/fr//Installing_on_Windows.html" title="Installing on Windows/fr">Windows</a>, <a href="wiki/fr//Installing_on_Linux.html" title="Installing on Linux/fr">Linux</a>, <a href="wiki/fr//Installing_on_Mac.html" title="Installing on Mac/fr">Mac</a>, <a href="wiki/fr//Installing_additional_components.html" title="Installing additional components/fr">Logiciels suppl&eacute;mentaires</a>, <a href="wiki/fr//Compile_on_Docker.html" title="Compile on Docker/fr">Docker</a>, <a href="wiki/fr//AppImage.html" title="AppImage/fr">AppImage</a>, <a href="wiki/fr//Ubuntu_Snap.html" title="Ubuntu Snap/fr">Ubuntu Snap</a></li>
<li><b>Bases&nbsp;:</b> <a href="wiki/fr//About_FreeCAD.html" title="About FreeCAD/fr">&Agrave; propos de FreeCAD</a>, <a href="wiki/fr//Interface.html" title="Interface/fr">Interface</a>, <a href="wiki/fr//Mouse_navigation.html" title="Mouse navigation/fr">Navigation par la souris</a>, <a href="wiki/fr//Selection_methods.html" title="Selection methods/fr">M&eacute;thodes de s&eacute;lection</a>, <a href="wiki/fr//Object_name.html" title="Object name/fr">Objet name</a>, <a href="wiki/fr//Preferences_Editor.html" title="Preferences Editor/fr">Pr&eacute;f&eacute;rences</a>, <a href="wiki/fr//Workbenches.html" title="Workbenches/fr">Ateliers</a>, <a href="wiki/fr//Document_structure.html" title="Document structure/fr">Structure du document</a>, <a href="wiki/fr//Property.html" title="Property/fr">Propri&eacute;t&eacute;s</a>, <a href="wiki/fr//Help_FreeCAD.html" title="Help FreeCAD/fr">Contribuer &agrave; FreeCAD</a>, <a href="wiki/fr//Donate.html" title="Donate/fr">Faire un don</a></li></ul>
<hr>
<ul><li><b>Aide&nbsp;:</b> <a href="wiki/fr//Tutorials.html" title="Tutorials/fr">Tutoriels</a>, <a href="wiki/fr//Video_tutorials.html" title="Video tutorials/fr">Tutoriels vid&eacute;o</a></li>
<li><b><a href="wiki/fr//Workbenches.html" title="Workbenches/fr">Ateliers</a>&nbsp;:</b> <a href="wiki/fr//Std_Base.html" title="Std Base/fr">Std Base</a>, <a href="wiki/fr//Arch_Workbench.html" title="Arch Workbench/fr">Arch</a>, <a href="wiki/fr//Assembly_Workbench.html" title="Assembly Workbench/fr">Assembly</a>, <a href="wiki/fr//CAM_Workbench.html" title="CAM Workbench/fr">CAM</a>, <a href="wiki/fr//Draft_Workbench.html" title="Draft Workbench/fr">Draft</a>, <a href="wiki/fr//FEM_Workbench.html" title="FEM Workbench/fr">FEM</a>, <a href="wiki/fr//Inspection_Workbench.html" title="Inspection Workbench/fr">Inspection</a>, <a href="wiki/fr//Mesh_Workbench.html" title="Mesh Workbench/fr">Mesh</a>, <a href="wiki/fr//OpenSCAD_Workbench.html" title="OpenSCAD Workbench/fr">OpenSCAD</a>, <a href="wiki/fr//Part_Workbench.html" title="Part Workbench/fr">Part</a>, <a href="wiki/fr//PartDesign_Workbench.html" title="PartDesign Workbench/fr">PartDesign</a>, <a href="wiki/fr//Points_Workbench.html" title="Points Workbench/fr">Points</a>, <a href="wiki/fr//Reverse_Engineering_Workbench.html" title="Reverse Engineering Workbench/fr">Reverse Engineering</a>, <a href="wiki/fr//Robot_Workbench.html" title="Robot Workbench/fr">Robot</a>, <a href="wiki/fr//Sketcher_Workbench.html" title="Sketcher Workbench/fr">Sketcher</a>, <a href="wiki/fr//Spreadsheet_Workbench.html" title="Spreadsheet Workbench/fr">Spreadsheet</a>, <a href="wiki/fr//Surface_Workbench.html" title="Surface Workbench/fr">Surface</a>, <a href="wiki/fr//TechDraw_Workbench.html" title="TechDraw Workbench/fr">TechDraw</a>, <a href="wiki/fr//Testing.html" title="Testing/fr">Test</a></li></ul>
<hr>
<ul><li><b><a href="wiki/fr//Addon.html" title="Addon/fr">Addons</a>&nbsp;:</b> <a href="wiki/fr//Std_AddonMgr.html" title="Std AddonMgr/fr">Gestionnaire d'Addons</a>, <a href="wiki/fr//External_workbenches.html" title="External workbenches/fr">Ateliers externes</a>, <a href="wiki/fr//Scripting_and_macros.html" title="Scripting and macros/fr">Scripts et macros</a></li></ul>
<hr>
<ul><li><b>Hubs&nbsp;:</b> <a href="wiki/fr//User_hub.html" title="User hub/fr">Hub utilisateurs</a>, <a href="wiki/fr//Power_users_hub.html" title="Power users hub/fr">Hub utilisateurs exp&eacute;riment&eacute;s</a>, <a href="wiki/fr//Developer_hub.html" title="Developer hub/fr">Hub D&eacute;veloppeurs</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20241205201725
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc, no&#8208;toc&#8208;conversion]
CPU time usage: 0.067 seconds
Real time usage: 0.081 seconds
Preprocessor visited node count: 368/1000000
Post&#8208;expand include size: 22245/2097152 bytes
Template argument size: 8084/2097152 bytes
Highest expansion depth: 7/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 914/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   10.317      1 -total
 36.32%    3.747      1 Template:FEM_Tools_navi/fr
 20.91%    2.157      2 Template:Navigation_menu_2
 18.75%    1.934      1 Template:PropertyData
 14.76%    1.523      1 Template:Userdocnavi/fr
 11.99%    1.237      1 Template:Variable
 11.49%    1.185     11 Template:Caption
 10.06%    1.038      1 Template:TutorialInfo/fr
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:332915-0!canonical and timestamp 20241205201725 and revision id 1513105. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>