<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">FEM Geometry Preparation and Meshing/fr</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="fr" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-FEM+Geometry+Preparation+and+Meshing&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/FEM_Geometry_Preparation_and_Meshing.html" class="mw-pt-progress mw-pt-progress--complete" title="FEM Geometrie vorbereiten und vernetzen (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../FEM_Geometry_Preparation_and_Meshing.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="FEM Geometry Preparation and Meshing (100% translated)" lang="en" dir="ltr">English</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="fr" dir="ltr">fran&ccedil;ais</span></li>
<li><a href="../pl/FEM_Geometry_Preparation_and_Meshing.html" class="mw-pt-progress mw-pt-progress--complete" title="MES: Przygotowanie geometrii i tworzenie siatki (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../ru/FEM_Geometry_Preparation_and_Meshing.html" class="mw-pt-progress mw-pt-progress--high" title="&#1052;&#1050;&#1069; &#1055;&#1086;&#1076;&#1075;&#1086;&#1090;&#1086;&#1074;&#1082;&#1072; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1080; &#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1089;&#1077;&#1090;&#1082;&#1080; (99% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li></ul></div>
<table class="fcinfobox wikitable ct" style="width: 230px; float: right; margin-left: 1em">
<tbody><tr>
<td class="ctTitle" style="font-weight: bold; font-size: 125%;"><span typeof="mw:File"><span><img src="../File/Freecad.svg" decoding="async" width="32" height="32" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span> Tutoriel
</td></tr>
<tr>
<th class="ctOdd">Th&egrave;me
</th></tr>
<tr>
<td class="ctEven">Analyse par &eacute;l&eacute;ments finis
</td></tr>
<tr>
<th class="ctOdd">Niveau
</th></tr>
<tr>
<td class="ctEven">D&eacute;butant
</td></tr>
<tr>
<th class="ctOdd">Temps d'ex&eacute;cution estim&eacute;
</th></tr>
<tr>
<td class="ctEven">Non applicable
</td></tr>
<tr>
<th class="ctOdd">Auteurs
</th></tr>
<tr>
<td class="ctEven"><a rel="nofollow" class="external text" href="https://www.freecad.org/wiki/index.php?title=User:NewJoker">NewJoker</a>
</td></tr>
<tr>
<th class="ctOdd">Version de FreeCAD
</th></tr>
<tr>
<td class="ctEven">1.0 ou plus r&eacute;cente
</td></tr>
<tr>
<th class="ctOdd">Fichiers exemples
</th></tr>
<tr>
<td class="ctEven"><i>None</i>
</td></tr>
<tr>
<th class="ctOdd">Voir aussi
</th></tr>
<tr>
<td class="ctEven"><a href="../fr/FEM_Workbench.html" title="FEM Workbench/fr">Atelier FEM</a>
</td></tr>
<tr>
<td class="ctToc"><br><meta property="mw:PageProp/toc">
</td></tr></tbody></table>
<p><span id="Background"></span>
</p>
<h2><span class="mw-headline" id="Contexte">Contexte</span></h2>
<p>La pr&eacute;paration de la g&eacute;om&eacute;trie et le maillage sont des &eacute;l&eacute;ments cruciaux du pr&eacute;traitement des simulations utilisant la m&eacute;thode des &eacute;l&eacute;ments finis (FEM). Bien que les logiciels de simulation facilement accessibles et connect&eacute;s &agrave; un environnement CAO (comme l'<a href="../fr/FEM_Workbench.html" title="FEM Workbench/fr">atelier FEM</a> dans FreeCAD) rendent tentante la r&eacute;alisation imm&eacute;diate d'analyses sur de nouvelles conceptions, il est tr&egrave;s important de se rappeler que la FEM est une m&eacute;thode avanc&eacute;e et qu'elle n&eacute;cessite une g&eacute;om&eacute;trie et un maillage correctement pr&eacute;par&eacute;s afin de fournir des r&eacute;sultats raisonnables et pr&eacute;cis. La vieille r&egrave;gle <a rel="nofollow" class="external text" href="https://fr.wikipedia.org/wiki/GIGO"><i>garbage in, garbage out</i></a> est particuli&egrave;rement importante ici. Il existe &eacute;galement d'autres param&egrave;tres cruciaux dont la pr&eacute;cision de la FEM d&eacute;pend fortement (tels que les propri&eacute;t&eacute;s des mat&eacute;riaux et les conditions aux limites), mais les premi&egrave;res &eacute;tapes et certaines des sources de probl&egrave;mes les plus courantes sont la pr&eacute;paration de la g&eacute;om&eacute;trie et le maillage, dont il est question sur cette page.
</p><p><span id="Types_of_geometry_used_for_FEM_in_FreeCAD"></span>
</p>
<h2><span id="Types_de_g.C3.A9om.C3.A9trie_utilis.C3.A9s_pour_la_m.C3.A9thode_des_.C3.A9l.C3.A9ments_finis_dans_FreeCAD"></span><span class="mw-headline" id="Types_de_g&eacute;om&eacute;trie_utilis&eacute;s_pour_la_m&eacute;thode_des_&eacute;l&eacute;ments_finis_dans_FreeCAD">Types de g&eacute;om&eacute;trie utilis&eacute;s pour la m&eacute;thode des &eacute;l&eacute;ments finis dans FreeCAD</span></h2>
<ul><li>Lignes (polylignes)&nbsp;: pour les analyses avec des &eacute;l&eacute;ments de poutre</li>
<li>Surfaces&nbsp;: pour les analyses avec des &eacute;l&eacute;ments de coque et des &eacute;l&eacute;ments 2D (contraintes et d&eacute;formations planes et axisym&eacute;triques)</li>
<li>Solides&nbsp;: pour les analyses avec des &eacute;l&eacute;ments solides</li></ul>
<p><span id="Choice_of_the_type_of_geometry"></span>
</p>
<h2><span id="Choix_du_type_de_g.C3.A9om.C3.A9trie"></span><span class="mw-headline" id="Choix_du_type_de_g&eacute;om&eacute;trie">Choix du type de g&eacute;om&eacute;trie</span></h2>
<p>Bien que la plupart des conceptions soient constitu&eacute;es de solides, il est souvent fortement recommand&eacute; d'utiliser des polylignes ou des surfaces pour les &eacute;l&eacute;ments finis si la structure le permet&nbsp;:
</p>
<ul><li>Si une pi&egrave;ce est mince (longue et fine) et en forme de poutre et a une section transversale r&eacute;guli&egrave;re de l'un des types de section de poutre pris en charge (rectangulaire, circulaire ou tube), elle doit &ecirc;tre analys&eacute;e &agrave; l'aide d'&eacute;l&eacute;ments de type poutre (&agrave; moins qu'il n'y ait des formes sp&eacute;cifiques de charge, de r&eacute;ponse ou des d&eacute;tails g&eacute;om&eacute;triques in&eacute;vitables qui invalident cette supposition). Fondamentalement, il faut dessiner une ligne centrale (des conseils sur la mani&egrave;re de l'extraire d'une g&eacute;om&eacute;trie solide existante peuvent &ecirc;tre trouv&eacute;s dans <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=81589">ce fil de discussion</a>. En bref, utilisez <a href="../fr/Draft_Wire.html" title="Draft Wire/fr">Draft Polyligne</a> ou <a href="../fr/Draft_BSpline.html" title="Draft BSpline/fr">Draft B-spline</a> avec les supports appropri&eacute;s d'<a href="../fr/Draft_Workbench.html#Barre_d'outils_d'aimantation_de_Draft" title="Draft Workbench/fr">aimantations</a> et de <a href="../fr/Draft_Line.html" title="Draft Line/fr">lignes</a>) et appliquez <a href="../fr/FEM_ElementGeometry1D.html" title="FEM ElementGeometry1D/fr">coupe transversale d'un &eacute;l&eacute;ment 1D</a> avec accessoirement une <a href="../fr/FEM_ElementRotation1D.html" title="FEM ElementRotation1D/fr">rotation</a>. Il n'y a pas de vraie r&egrave;gle indiquant quand le principe de poutre peut &ecirc;tre utilis&eacute;, mais il est souvent conseill&eacute; que les dimensions de la section transversale soient &lt; 1/10 de la longueur de la pi&egrave;ce pour que l'utilisation du principe de poutre soit valide.</li></ul>
<p><span typeof="mw:File"><a href="../index.php?title=FEM_beam_model.JPG&amp;filetimestamp=20231228195452&amp;.html" class="mw-file-description"><img src="../File/FEM_beam_model.JPG" decoding="async" width="600" height="233" class="mw-file-element" data-file-width="1104" data-file-height="429"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Pi&egrave;ce mince convenant &agrave; l'analyse avec des &eacute;l&eacute;ments de poutre - axe central mis en &eacute;vidence</p>
<ul><li>Si une pi&egrave;ce a des parois minces (comme les pi&egrave;ces en t&ocirc;le), elle doit &ecirc;tre analys&eacute;e &agrave; l'aide d'&eacute;l&eacute;ments de coque (sauf si des r&eacute;sultats de contact pr&eacute;cis sont n&eacute;cessaires ou si certaines limites des &eacute;l&eacute;ments de coque sont rencontr&eacute;es). Ce point est tr&egrave;s important et souvent n&eacute;glig&eacute;. Pour obtenir des r&eacute;sultats pr&eacute;cis (en particulier en cas de flexion), il faut quelques &eacute;l&eacute;ments (au moins 3 &agrave; 5) dans la direction de l'&eacute;paisseur. Dans le cas de pi&egrave;ces &agrave; parois minces, cela se traduit g&eacute;n&eacute;ralement par de grandes mailles (en particulier lorsque des t&eacute;tra&egrave;dres sont utilis&eacute;s, car les &eacute;l&eacute;ments hexa&eacute;driques ne peuvent pas &ecirc;tre g&eacute;n&eacute;r&eacute;s dans FreeCAD) et un co&ucirc;t de calcul &eacute;lev&eacute; - puissance informatique &eacute;lev&eacute;e et long temps de r&eacute;solution. Pour obtenir une g&eacute;om&eacute;trie adapt&eacute;e &agrave; l'analyse avec des &eacute;l&eacute;ments coques, il faut dessiner une surface m&eacute;diane de la pi&egrave;ce (des conseils sur la mani&egrave;re de l'extraire d'une g&eacute;om&eacute;trie solide existante peuvent &ecirc;tre trouv&eacute;s dans <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=67505">ce fil de discussion</a>, <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=71821">celui-ci</a> et <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=81834">celui-ci</a>). En bref, appliquez une <a href="../fr/PartDesign_SubShapeBinder.html" title="PartDesign SubShapeBinder/fr">PartDesign Sous forme li&eacute;e</a> ou une <a href="../fr/Draft_Facebinder.html" title="Draft Facebinder/fr">Draft Surface li&eacute;e</a>, puis une <a href="../fr/Part_Offset.html" title="Part Offset/fr">Part D&eacute;calage</a> et enfin utilisez la <a href="../fr/PartDesign_SubShapeBinder.html" title="PartDesign SubShapeBinder/fr">PartDesign Sous forme li&eacute;e</a> et <a href="../fr/Part_Extrude.html" title="Part Extrude/fr">extrudez</a> pour &eacute;tendre les ar&ecirc;tes des surfaces m&eacute;dianes et ainsi combler les &eacute;carts entre elles. Appliquez une <a href="../fr/FEM_ElementGeometry2D.html" title="FEM ElementGeometry2D/fr">&eacute;paisseur</a> appropri&eacute;e. L&agrave; encore, il n'y a pas de r&egrave;gle unique, mais il est g&eacute;n&eacute;ralement recommand&eacute; que l'&eacute;paisseur soit &lt; 1/10 d'une dimension globale typique (longueur/largeur) pour que l'utilisation du principe de la coque soit valide.</li></ul>
<p><span typeof="mw:File"><a href="../index.php?title=FEM_shell_model.JPG&amp;filetimestamp=20231228195539&amp;.html" class="mw-file-description"><img src="../File/FEM_shell_model.JPG" decoding="async" width="600" height="282" class="mw-file-element" data-file-width="1444" data-file-height="678"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Pi&egrave;ce &agrave; paroi mince adapt&eacute;e &agrave; l'analyse avec des &eacute;l&eacute;ments de coque - mise en &eacute;vidence de la surface m&eacute;diane</p>
<ul><li>Dans certains cas, les analyses 2D sont &eacute;galement possibles et peuvent &ecirc;tre activ&eacute;es en d&eacute;finissant la propri&eacute;t&eacute; <span style="font-size:60%; padding-right:0.8em;">Donn&eacute;es</span><b>Model Space</b> du <a href="../fr/FEM_SolverCalculixCcxtools.html" title="FEM SolverCalculixCcxtools/fr">solveur CalculiX</a>&nbsp;:
<ul><li>contrainte plane&nbsp;: pour les pi&egrave;ces minces qui peuvent &ecirc;tre simplifi&eacute;es en surfaces planes repr&eacute;sentant le profil d'extrusion (l'&eacute;paisseur est d&eacute;finie de la m&ecirc;me mani&egrave;re que pour les coques), sont charg&eacute;es et se d&eacute;forment uniquement dans le plan et ont une contrainte nulle dans la direction hors du plan. Seuls deux degr&eacute;s de libert&eacute; sont disponibles&nbsp;: la translation en X et en Y. Dans ce cas, les surfaces doivent se situer sur le plan XY. Cette approche est assez courante. Par exemple, une plaque mince soumise &agrave; une tension peut &ecirc;tre analys&eacute;e de cette mani&egrave;re.</li>
<li>d&eacute;formation dans le plan&nbsp;: pour les pi&egrave;ces &eacute;paisses qui peuvent &ecirc;tre simplifi&eacute;es en surfaces planes repr&eacute;sentant le profil d'extrusion (l'&eacute;paisseur est d&eacute;finie de la m&ecirc;me mani&egrave;re que pour les coquilles), sont charg&eacute;es et se d&eacute;forment uniquement dans le plan et ont une d&eacute;formation nulle dans les directions hors du plan. Seuls deux degr&eacute;s de libert&eacute; sont disponibles&nbsp;: la translation en X et en Y. Dans ce cas, les surfaces doivent &ecirc;tre situ&eacute;es sur le plan XY. Cette approche n'est pas tr&egrave;s courante. Par exemple, un long barrage, un mur ou un tuyau soumis &agrave; une pression uniforme sur toute sa longueur peut &ecirc;tre analys&eacute; de cette mani&egrave;re.</li>
<li>axisym&eacute;trique&nbsp;: pour les pi&egrave;ces qui peuvent &ecirc;tre simplifi&eacute;es en surfaces planes repr&eacute;sentant le profil de r&eacute;volution (l'&eacute;paisseur n'a pas d'importance ici) et qui sont charg&eacute;es uniform&eacute;ment sur toute la circonf&eacute;rence. Seuls deux degr&eacute;s de libert&eacute; sont disponibles&nbsp;: la translation radiale et la translation axiale. Les surfaces doivent &ecirc;tre situ&eacute;es sur le plan XY, &agrave; droite de l'axe Y. Cette approche est tr&egrave;s courante. Par exemple, certains r&eacute;cipients sous pression, les supports en caoutchouc, les bagues, les joints, les brides et m&ecirc;me les assemblages boulonn&eacute;s (en consid&eacute;rant le filetage comme axisym&eacute;trique) peuvent &ecirc;tre analys&eacute;s de cette mani&egrave;re.</li></ul></li></ul>
<p>Il convient de rappeler que les &eacute;l&eacute;ments poutre, coque, contrainte/d&eacute;formation plane et axisym&eacute;trique utilis&eacute;s dans CalculiX ne sont pas de v&eacute;ritables &eacute;l&eacute;ments de ce type (ils n'utilisent pas les formulations d'&eacute;l&eacute;ments classiques connues dans la litt&eacute;rature et dans d'autres logiciels), ils sont &eacute;tendus en interne aux solides. N&eacute;anmoins, leur utilisation est recommand&eacute;e dans les cas susmentionn&eacute;s.
</p><p><span id="Geometry_validity"></span>
</p>
<h2><span id="Validit.C3.A9_de_la_g.C3.A9om.C3.A9trie"></span><span class="mw-headline" id="Validit&eacute;_de_la_g&eacute;om&eacute;trie">Validit&eacute; de la g&eacute;om&eacute;trie</span></h2>
<p>La g&eacute;om&eacute;trie utilis&eacute;e pour la simulation par &eacute;l&eacute;ments finis doit &ecirc;tre valide. Plus important encore, il ne doit pas y avoir d'intersections. Il s'agit d'un probl&egrave;me courant qui survient souvent lorsque des assemblages sont mod&eacute;lis&eacute;s sans contraintes appropri&eacute;es entre les pi&egrave;ces. L'outil <a href="../fr/Part_SectionCut.html" title="Part SectionCut/fr">Part Coupe persistante</a> peut aider &agrave; trouver de telles interf&eacute;rences entre les pi&egrave;ces. Bien entendu, l'outil <a href="../fr/Part_Fuse.html" title="Part Fuse/fr">Part Union</a> peut aider &agrave; les r&eacute;soudre si elles sont intentionnelles. D'autres probl&egrave;mes li&eacute;s &agrave; la g&eacute;om&eacute;trie (tels que les g&eacute;om&eacute;tries non pliantes, les ar&ecirc;tes ou faces redondantes, etc.) doivent &eacute;galement &ecirc;tre r&eacute;solus avant de proc&eacute;der au maillage. L'outil <a href="../fr/Part_CheckGeometry.html" title="Part CheckGeometry/fr">Part V&eacute;rifier la g&eacute;om&eacute;trie</a> peut &ecirc;tre utile, mais les contr&ocirc;les visuels sont &eacute;galement importants. Lors de la pr&eacute;paration d'une simulation utilisant des &eacute;l&eacute;ments solides et en cas de doute quant &agrave; savoir si la pi&egrave;ce est r&eacute;ellement solide ou s'il s'agit simplement d'une coque ferm&eacute;e, les outils susmentionn&eacute;s (Part Coupe persistante et l'onglet <i>Contenu de la forme</i> de Part V&eacute;rifier la g&eacute;om&eacute;trie) peuvent permettre de clarifier la situation.
</p><p><span id="Surface_normals"></span>
</p>
<h2><span class="mw-headline" id="Normales_de_surface">Normales de surface</span></h2>
<p>Dans le cas des g&eacute;om&eacute;tries de surface utilis&eacute;es pour les analyses avec des &eacute;l&eacute;ments coques et 2D, les directions normales des surfaces peuvent &ecirc;tre importantes. Elles sont utilis&eacute;es pour distinguer les c&ocirc;t&eacute;s positif et n&eacute;gatif d'un maillage d'&eacute;l&eacute;ments finis de surface et affectent les fonctions d'analyse telles que les charges de pression et le contact. De plus, les analyses 2D (contrainte/d&eacute;formation plane et axisym&eacute;trique) avec CalculiX n&eacute;cessitent que les normales pointent dans la direction Z positive. Si elles sont invers&eacute;es, des erreurs jacobiennes n&eacute;gatives se produiront.
</p><p>Pour v&eacute;rifier les normales, utilisez l'une des approches suivantes&nbsp;:
</p>
<ul><li>activez le r&eacute;tro&eacute;clairage dans le <a href="../fr/Preferences_Editor.html" title="Preferences Editor/fr">r&eacute;glage des pr&eacute;f&eacute;rences</a> et d&eacute;finissez la propri&eacute;t&eacute; <span style="font-size:60%; padding-right:0.8em;">Vue</span><b>Lighting</b> de l'objet surface sur &laquo;&nbsp;One side&nbsp;&raquo; (Un c&ocirc;t&eacute;)&nbsp;: la direction normale n&eacute;gative appara&icirc;tra plus sombre,</li>
<li>utilisez la <a href="../fr/Macro_Normal_Vector.html" title="Macro Normal Vector/fr">macro Normal Vector</a>,</li>
<li>maillez la forme de la surface dans FEM&nbsp;: le maillage ne sera color&eacute; que du c&ocirc;t&eacute; normal positif.</li></ul>
<p>Pour inverser les normales, utilisez l'outil <a href="../fr/Part_ReverseShape.html" title="Part ReverseShape/fr">Part Inverser les formes</a>.
</p><p><span id="Using_surface_meshes_for_FEM"></span>
</p>
<h2><span id="Utilisation_de_maillages_de_surface_dans_l.27atelier_FEM"></span><span class="mw-headline" id="Utilisation_de_maillages_de_surface_dans_l'atelier_FEM">Utilisation de maillages de surface dans l'atelier FEM</span></h2>
<p>Les maillages de surface, g&eacute;n&eacute;ralement import&eacute;s &agrave; partir de fichiers STL, OBJ et similaires ou cr&eacute;&eacute;s dans l'atelier Mesh, ne peuvent pas &ecirc;tre utilis&eacute;s directement dans l'atelier FEM. Il est n&eacute;cessaire de cr&eacute;er d'abord une forme &agrave; partir du maillage. Cette forme peut ensuite &ecirc;tre maill&eacute;e dans l'atelier FEM afin de cr&eacute;er un maillage d'&eacute;l&eacute;ments finis de surface (coque / 2D). Si un maillage d'&eacute;l&eacute;ments finis solide (3D) est n&eacute;cessaire, la cr&eacute;ation de la forme doit &ecirc;tre suivie d'une <a href="../fr/Part_MakeSolid.html" title="Part MakeSolid/fr">conversion en solide</a>.
</p><p>Le principal probl&egrave;me avec les formes cr&eacute;&eacute;es &agrave; partir de maillages de surface est que tous leurs triangles deviennent les faces de la forme g&eacute;n&eacute;r&eacute;e. Dans l'atelier FEM, cela rend l'attribution des fonctions d'analyse (telles que les charges et les conditions aux limites) particuli&egrave;rement probl&eacute;matique. Dans le cas de surfaces planes, l'<a href="../fr/Part_RefineShape.html" title="Part RefineShape/fr">affinement</a> apr&egrave;s conversion en solide peut supprimer les faces triangulaires redondantes. Dans la pratique, la plupart resteront toutefois en place et, pour cette raison, les maillages de surface ne sont pas recommand&eacute;s pour une utilisation dans l'atelier FEM. Il convient plut&ocirc;t d'utiliser des g&eacute;om&eacute;tries de CAO (cr&eacute;&eacute;es dans FreeCAD ou import&eacute;es &agrave; partir de fichiers STEP/IGES). Il peut parfois m&ecirc;me &ecirc;tre judicieux de recr&eacute;er la g&eacute;om&eacute;trie &agrave; partir du maillage de surface.
</p><p><span id="Geometry_simplification"></span>
</p>
<h2><span id="Simplification_de_la_g.C3.A9om.C3.A9trie"></span><span class="mw-headline" id="Simplification_de_la_g&eacute;om&eacute;trie">Simplification de la g&eacute;om&eacute;trie</span></h2>
<p><span id="Defeaturing"></span>
</p>
<h3><span class="mw-headline" id="Simplification">Simplification</span></h3>
<p>Les designs pr&eacute;par&eacute;s dans les logiciels de CAO sont g&eacute;n&eacute;ralement trop d&eacute;taill&eacute;s pour &ecirc;tre adapt&eacute;es aux simulations par &eacute;l&eacute;ments finis. Dans de nombreux cas, il est n&eacute;cessaire de les simplifier au pr&eacute;alable. Cette &eacute;tape est souvent n&eacute;glig&eacute;e, mais elle est tr&egrave;s importante car il peut &ecirc;tre difficile d'obtenir un bon maillage lorsque la pi&egrave;ce est trop d&eacute;taill&eacute;e et m&ecirc;me si un tel maillage est finalement obtenu, il peut &ecirc;tre tr&egrave;s dense, ce qui entra&icirc;ne des temps de r&eacute;solution d&eacute;raisonnables. Il faut donc toujours examiner la conception et essayer de la simplifier autant que possible, en ne laissant que les caract&eacute;ristiques g&eacute;om&eacute;triques qui peuvent avoir un impact significatif sur les r&eacute;sultats (r&eacute;sistance/rigidit&eacute;) et qui ne peuvent donc pas &ecirc;tre ignor&eacute;es. Les caract&eacute;ristiques suivantes sont g&eacute;n&eacute;ralement omises
</p>
<ul><li>les petits cong&eacute;s et chanfreins,</li>
<li>petits trous,</li>
<li>autres petits d&eacute;tails,</li>
<li>soudures,</li>
<li>boulons, filetages,</li>
<li>les &eacute;l&eacute;ments d&eacute;coratifs (logos, gravures).</li></ul>
<p>L'outil <a href="../fr/Part_Defeaturing.html" title="Part Defeaturing/fr">Part Supprimer la fonction</a> et l'<a href="../fr/Defeaturing_Workbench.html" title="Defeaturing Workbench/fr">extension Defeaturing</a> peuvent &ecirc;tre utiles pour simplifier les pi&egrave;ces pour les simulations.
</p><p><span typeof="mw:File"><a href="../index.php?title=FEM_bracket_original.PNG&amp;filetimestamp=20240105151839&amp;.html" class="mw-file-description"><img src="../File/FEM_bracket_original.PNG" decoding="async" width="400" height="471" class="mw-file-element" data-file-width="600" data-file-height="706"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">G&eacute;om&eacute;trie originale du support</p>
<p><span typeof="mw:File"><a href="../index.php?title=FEM_bracket_simplified.PNG&amp;filetimestamp=20240105151930&amp;.html" class="mw-file-description"><img src="../File/FEM_bracket_simplified.PNG" decoding="async" width="400" height="466" class="mw-file-element" data-file-width="609" data-file-height="710"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">G&eacute;om&eacute;trie du support simplifi&eacute;e en utilisant uniquement l'outil Part Supprimer la fonctionnalit&eacute;</p>
<p><span id="Replacing_parts_with_boundary_conditions"></span>
</p>
<h3><span id="Remplacer_des_pi.C3.A8ces_par_des_conditions_aux_limites"></span><span class="mw-headline" id="Remplacer_des_pi&egrave;ces_par_des_conditions_aux_limites">Remplacer des pi&egrave;ces par des conditions aux limites</span></h3>
<p>Dans le cas des assemblages (plus d'informations &agrave; ce sujet dans l'une des sections suivantes), certaines pi&egrave;ces peuvent souvent &ecirc;tre exclues des simulations et remplac&eacute;es par des conditions aux limites comme si elles &eacute;taient attach&eacute;es aux pi&egrave;ces &agrave; analyser. Cette approche est valable si les pi&egrave;ces exclues sont significativement plus rigides (en termes de rigidit&eacute; structurelle, en tenant compte non seulement de l'&eacute;lasticit&eacute; du mat&eacute;riau mais aussi de la g&eacute;om&eacute;trie de la pi&egrave;ce) que les pi&egrave;ces &agrave; analyser auxquelles elles &eacute;taient connect&eacute;es. En effet, les conditions aux limites fixes introduisent de la rigidit&eacute; (comme si la pi&egrave;ce analys&eacute;e &eacute;tait attach&eacute;e &agrave; un composant infiniment rigide) et les supports flexibles comme les &eacute;l&eacute;ments ressorts ne sont pas disponibles dans l'atelier FEM de FreeCAD lorsque l'on utilise CalculiX (Elmer a un <a href="../fr/FEM_ConstraintSpring.html" title="FEM ConstraintSpring/fr">FEM Ressort</a>).
</p><p><span id="Utilizing_planar_symmetry"></span>
</p>
<h3><span id="Utiliser_la_sym.C3.A9trie_selon_un_plan"></span><span class="mw-headline" id="Utiliser_la_sym&eacute;trie_selon_un_plan">Utiliser la sym&eacute;trie selon un plan</span></h3>
<p>La simplification de la g&eacute;om&eacute;trie pour la simulation par &eacute;l&eacute;ments finis peut &eacute;galement impliquer de la couper dans l'un des plans de sym&eacute;trie afin d'utiliser l'hypoth&egrave;se de sym&eacute;trie plane dans l'analyse. Cette hypoth&egrave;se n'est valable que lorsque tous les aspects suivants du mod&egrave;le pr&eacute;sentent une sym&eacute;trie dans un plan donn&eacute;&nbsp;:
</p>
<ul><li>g&eacute;om&eacute;trie,</li>
<li>charges,</li>
<li>conditions aux limites,</li>
<li>r&eacute;ponse (il faut &ecirc;tre prudent avec les analyses de fr&eacute;quence/flexion utilisant la sym&eacute;trie - on n'obtiendra pas de formes de mode antisym&eacute;triques).</li></ul>
<p>L'utilisation de la sym&eacute;trie (1/2, 1/4 ou 1/8 du mod&egrave;le) est recommand&eacute;e dans la mesure du possible, car elle permet de r&eacute;duire consid&eacute;rablement le co&ucirc;t de calcul de l'analyse. Un autre avantage est qu'elle &eacute;limine certains mouvements des corps rigides, ce qui facilite la contrainte de la pi&egrave;ce. Une condition limite de sym&eacute;trie doit &ecirc;tre appliqu&eacute;e aux faces appartenant au plan de coupe&nbsp;:
</p>
<ul><li>la translation dans la direction normale au plan de sym&eacute;trie doit &ecirc;tre bloqu&eacute;e pour les pi&egrave;ces solides,</li>
<li>la translation dans la direction normale au plan de sym&eacute;trie et les rotations autres qu'autour de l'axe normal au plan de sym&eacute;trie doivent &ecirc;tre bloqu&eacute;es pour les pi&egrave;ces de coque et de poutre.</li></ul>
<p>La force appliqu&eacute;e doit &ecirc;tre correctement r&eacute;duite si le plan de sym&eacute;trie coupe la r&eacute;gion &agrave; laquelle la force est appliqu&eacute;e (sans importance lorsque la charge de pression est utilis&eacute;e).
</p><p><span typeof="mw:File"><a href="../index.php?title=FEM_symmetric_vessel.JPG&amp;filetimestamp=20231228201421&amp;.html" class="mw-file-description"><img src="../File/FEM_symmetric_vessel.JPG" decoding="async" width="400" height="447" class="mw-file-element" data-file-width="641" data-file-height="717"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Mod&egrave;le de 1/8 d'un r&eacute;cipient sous pression cylindrique avec des conditions limites de sym&eacute;trie et une charge de pression interne</p>
<p><span id="Utilizing_cyclic_symmetry"></span>
</p>
<h3><span id="Utiliser_la_sym.C3.A9trie_cyclique"></span><span class="mw-headline" id="Utiliser_la_sym&eacute;trie_cyclique">Utiliser la sym&eacute;trie cyclique</span></h3>
<p>Un autre type de sym&eacute;trie, moins courant, disponible dans FreeCAD FEM est la sym&eacute;trie cyclique. Elle peut &ecirc;tre d&eacute;finie &agrave; l'aide de la <a href="../fr/FEM_ConstraintTie.html#Sym%C3%A9trie_cyclique" title="FEM ConstraintTie/fr">contrainte de liaison</a> et permet d'analyser un seul secteur repr&eacute;sentatif d'une structure constitu&eacute;e de tels motifs circulaires autour d'un axe. L'hypoth&egrave;se est que les conditions aux limites et les charges pr&eacute;sentent &eacute;galement cette forme de sym&eacute;trie. Des charges tangentielles peuvent &ecirc;tre appliqu&eacute;es et la torsion peut donc &ecirc;tre simul&eacute;e de cette mani&egrave;re. Cependant, une <a href="../fr/FEM_ConstraintCentrif.html" title="FEM ConstraintCentrif/fr">charge centrifuge</a> est g&eacute;n&eacute;ralement utilis&eacute; avec la sym&eacute;trie cyclique. Cette approche peut &ecirc;tre utilis&eacute;e par exemple pour les rotors, les arbres, les turbines, les ventilateurs et les volants d'inertie.
</p><p><span id="Geometry_partitioning"></span>
</p>
<h2><span id="Partitionnement_de_la_g.C3.A9om.C3.A9trie"></span><span class="mw-headline" id="Partitionnement_de_la_g&eacute;om&eacute;trie">Partitionnement de la g&eacute;om&eacute;trie</span></h2>
<p><span id="Partitioning_basics"></span>
</p>
<h3><span class="mw-headline" id="Principes_de_base_du_partitionnement">Principes de base du partitionnement</span></h3>
<p>Ce qu'on appelle le partitionnement est une division de la g&eacute;om&eacute;trie en segments plus petits. Dans d'autres logiciels, il est couramment utilis&eacute; pour permettre le maillage hexagonal, mais dans FreeCAD, il peut &eacute;galement &ecirc;tre utile pour d'autres raisons&nbsp;:
</p>
<ul><li>cr&eacute;er des sous-r&eacute;gions pour l'attribution de fonctions d'analyse,</li>
<li>diviser des pi&egrave;ces en sections compos&eacute;es de diff&eacute;rents mat&eacute;riaux,</li>
<li>cr&eacute;er des r&eacute;gions pour l'<a href="../fr/FEM_MeshRegion.html" title="FEM MeshRegion/fr">affinement du maillage</a>,</li>
<li>contr&ocirc;ler l'algorithme de maillage en le for&ccedil;ant &agrave; suivre des ar&ecirc;tes suppl&eacute;mentaires (particuli&egrave;rement utile pour contr&ocirc;ler la <a href="../fr/FEM_MeshGmshFromShape.html#Croissance_du_maillage" title="FEM MeshGmshFromShape/fr">croissance du maillage Gmsh</a>).</li></ul>
<p><span id="Partitioning_faces_of_solids_with_sketches"></span>
</p>
<h3><span id="Partitionner_des_faces_de_solides_.C3.A0_l.27aide_d.27esquisses"></span><span class="mw-headline" id="Partitionner_des_faces_de_solides_&agrave;_l'aide_d'esquisses">Partitionner des faces de solides &agrave; l'aide d'esquisses</span></h3>
<p>Le partitionnement est principalement utilis&eacute; lorsqu'une charge (ou une condition limite) doit &ecirc;tre appliqu&eacute;e uniquement &agrave; une r&eacute;gion s&eacute;lectionn&eacute;e de la surface de la pi&egrave;ce. La mani&egrave;re la plus simple d'y parvenir pour les pi&egrave;ces solides consiste &agrave; cr&eacute;er une esquisse avec un contour appropri&eacute; sur cette face et &agrave; utiliser l'outil <a href="../fr/Part_BooleanFragments.html" title="Part BooleanFragments/fr">Part Fragments bool&eacute;ens</a> pour fractionner la face avec l'esquisse.
</p><p><span typeof="mw:File"><a href="../index.php?title=FEM_partition.JPG&amp;filetimestamp=20231228200133&amp;.html" class="mw-file-description"><img src="../File/FEM_partition.JPG" decoding="async" width="400" height="404" class="mw-file-element" data-file-width="634" data-file-height="641"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Pi&egrave;ce avec une cloison de s&eacute;paration pour l'application d'une charge ou d'une condition limite</p>
<p><span id="Partitioning_volumes_of_solids_with_datum_planes"></span>
</p>
<h3><span id="Partitionner_des_volumes_solides_.C3.A0_l.27aide_de_plans_de_r.C3.A9f.C3.A9rence"></span><span class="mw-headline" id="Partitionner_des_volumes_solides_&agrave;_l'aide_de_plans_de_r&eacute;f&eacute;rence">Partitionner des volumes solides &agrave; l'aide de plans de r&eacute;f&eacute;rence</span></h3>
<p>Une autre raison justifiant le partitionnement est lorsque plusieurs mat&eacute;riaux doivent &ecirc;tre appliqu&eacute;s &agrave; une seule pi&egrave;ce (sans avoir &agrave; utiliser plusieurs pi&egrave;ces reli&eacute;es entre elles). Dans ce cas, le partitionnement peut &ecirc;tre effectu&eacute; &agrave; l'aide d'un <a href="../fr/PartDesign_Plane.html" title="PartDesign Plane/fr">plan de r&eacute;f&eacute;rence</a> et de l'outil <a href="../fr/Part_BooleanFragments.html" title="Part BooleanFragments/fr">Part Fragments bool&eacute;ens</a> en mode &laquo;&nbsp;Compsolid&nbsp;&raquo;.
</p><p><span id="Partitioning_surface_geometries_with_sketches"></span>
</p>
<h3><span id="Partitionner_des_g.C3.A9om.C3.A9tries_de_surface_.C3.A0_l.27aide_d.27esquisses"></span><span class="mw-headline" id="Partitionner_des_g&eacute;om&eacute;tries_de_surface_&agrave;_l'aide_d'esquisses">Partitionner des g&eacute;om&eacute;tries de surface &agrave; l'aide d'esquisses</span></h3>
<p>Dans le cas des g&eacute;om&eacute;tries surfaciques (coques), la mani&egrave;re la plus simple de r&eacute;aliser une partition bas&eacute;e sur une esquisse consiste &agrave; utiliser l'outil <a href="../fr/Part_BooleanFragments.html" title="Part BooleanFragments/fr">fragments bool&eacute;ens</a> (comme pour les partitions sur les faces des solides). Cependant, comme expliqu&eacute; <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=96029#p820241">ici</a>, lorsque la cr&eacute;ation de groupes de mailles est activ&eacute;e dans les <a href="../fr/FEM_Preferences.html#G%C3%A9n%C3%A9ral" title="FEM Preferences/fr">pr&eacute;f&eacute;rences de FEM</a>, cela peut ne pas fonctionner correctement et l'approche suivante doit &ecirc;tre utilis&eacute;e&nbsp;:
</p>
<ol><li>Cr&eacute;er une face pour un c&ocirc;t&eacute; en utilisant par exemple l'outil <a href="../fr/Part_MakeFace.html" title="Part MakeFace/fr">Part Cr&eacute;er une face</a> (par exemple une plaque carr&eacute;e avec un trou circulaire).</li>
<li>Cr&eacute;er une face pour l'autre c&ocirc;t&eacute; de mani&egrave;re &eacute;quivalente (par exemple, une face circulaire remplissant le trou dans la plaque carr&eacute;e).</li>
<li>Appliquer l'outil <a href="../fr/Part_Builder.html" title="Part Builder/fr">Part G&eacute;n&eacute;rateur de formes</a> avec le mode <i>Coque &agrave; partir de faces</i> et la case &agrave; cocher <i>Affiner la forme</i> d&eacute;sactiv&eacute;e aux faces pr&eacute;c&eacute;demment cr&eacute;&eacute;es.</li></ol>
<p><span typeof="mw:File"><a href="../index.php?title=FEM_shell_partition.JPG&amp;filetimestamp=20250701143021&amp;.html" class="mw-file-description"><img src="../File/FEM_shell_partition.JPG" decoding="async" width="400" height="249" class="mw-file-element" data-file-width="845" data-file-height="526"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Plaque carr&eacute;e avec une partition circulaire</p>
<p><span id="Partitioning_faces_of_solids_with_datum_planes"></span>
</p>
<h3><span id="Partitionner_des_faces_de_solides_.C3.A0_l.27aide_de_plans_de_r.C3.A9f.C3.A9rence"></span><span class="mw-headline" id="Partitionner_des_faces_de_solides_&agrave;_l'aide_de_plans_de_r&eacute;f&eacute;rence">Partitionner des faces de solides &agrave; l'aide de plans de r&eacute;f&eacute;rence</span></h3>
<p>Il est &eacute;galement difficile de partitionner uniquement les faces s&eacute;lectionn&eacute;es d'un solide &agrave; l'aide de plans de r&eacute;f&eacute;rence plut&ocirc;t que d'esquisses sans diviser l'ensemble du volume. Une approche possible consiste &agrave;&nbsp;:
</p>
<ol><li><a href="../fr/Draft_Downgrade.html" title="Draft Downgrade/fr">Draft D&eacute;sagr&eacute;ger</a> le corps en faces.</li>
<li>S&eacute;lectionnez cette face et ce plan de r&eacute;f&eacute;rence, puis utiliser l'outil <a href="../fr/Part_SliceApart.html" title="Part SliceApart/fr">Part S&eacute;parer/exploser</a>.</li>
<li>Supprimez le conteneur Exploded Slice sans supprimer son contenu.</li>
<li>S&eacute;lectionnez toutes les faces et toutes les d&eacute;coupes et les <a href="../fr/Draft_Upgrade.html" title="Draft Upgrade/fr">Draft Agr&eacute;ger</a> en coque.</li>
<li><a href="../fr/Draft_Upgrade.html" title="Draft Upgrade/fr">Draft Agr&eacute;ger</a> la coque vers un solide ou utiliser l'outil <a href="../fr/Part_MakeSolid.html" title="Part MakeSolid/fr">Part Convertir en solide</a>.</li></ol>
<p>Une autre m&eacute;thode consiste &agrave;&nbsp;:
</p>
<ol><li>Cr&eacute;es une <a href="../fr/PartDesign_SubShapeBinder.html" title="PartDesign SubShapeBinder/fr">PartDesign sous forme li&eacute;e</a> de la face &agrave; partitionner.</li>
<li>Divisez la sous forme li&eacute;e avec le plan de r&eacute;f&eacute;rence &agrave; l'aide de l'outil <a href="../fr/Part_SliceApart.html" title="Part SliceApart/fr">Part S&eacute;parer/exploser</a>.</li>
<li>Cr&eacute;ez un nouveau <a href="../fr/PartDesign_Body.html" title="PartDesign Body/fr">PartDesign corps</a> (pour &eacute;viter les d&eacute;pendances cycliques).</li>
<li>Cr&eacute;ez une nouvelle sous forme li&eacute;e &agrave; partir des ar&ecirc;tes obtenues &agrave; l'intersection de la sous forme li&eacute;e pr&eacute;c&eacute;dente et du plan de r&eacute;f&eacute;rence.</li>
<li>S&eacute;lectionnez le corps d'origine et la nouvelle sous forme li&eacute;e et utilisez l'outil <a href="../fr/Part_BooleanFragments.html" title="Part BooleanFragments/fr">Part Fragments bool&eacute;ens</a>.</li></ol>
<p>D'autres id&eacute;es sont disponibles sur <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=98528">ce fil de discussion du forum</a>, mais elles sont plus sp&eacute;cifiques &agrave; certains cas.
</p><p><span typeof="mw:File"><a href="../index.php?title=FEM_split_face_solid.JPG&amp;filetimestamp=20250723164225&amp;.html" class="mw-file-description"><img src="../File/FEM_split_face_solid.JPG" decoding="async" width="400" height="345" class="mw-file-element" data-file-width="598" data-file-height="516"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Face cylindrique d'un trou partitionn&eacute; par un plan afin d'appliquer une charge de 180&deg; d'une tige</p>
<p><span id="Assembly_geometries"></span>
</p>
<h2><span id="Assemblage_de_g.C3.A9om.C3.A9tries"></span><span class="mw-headline" id="Assemblage_de_g&eacute;om&eacute;tries">Assemblage de g&eacute;om&eacute;tries</span></h2>
<p>L'une des principales limitations actuelles de l'atelier FEM est que les maillages multiples ne sont pas pris en charge. En pratique, cela signifie qu'il n'est pas possible de mailler chaque pi&egrave;ce de l'assemblage individuellement, puis de connecter les pi&egrave;ces avec les contraintes appropri&eacute;es pour l'analyse. Il est donc n&eacute;cessaire de cr&eacute;er un objet unique contenant toutes les pi&egrave;ces de l'assemblage et de le mailler. Il existe plusieurs options diff&eacute;rentes, toutes bas&eacute;es sur les <a href="../fr/Part_Workbench.html#Barres_d'outils_des_bool%C3%A9ens" title="Part Workbench/fr">Part Outils bool&eacute;ens</a>. Le choix d&eacute;pend de l'effet d&eacute;sir&eacute;&nbsp;: si chaque pi&egrave;ce/volume et leurs limites doivent &ecirc;tre s&eacute;lectionnables (par exemple pour l'affectation de mat&eacute;riaux ou les d&eacute;finitions des conditions limites agissant sur les faces internes) ou non&nbsp;:
</p>
<ul><li><a href="../fr/Part_Fuse.html" title="Part Fuse/fr">Part Union</a>&nbsp;: fusionne les pi&egrave;ces, rendant impossible leur s&eacute;lection individuelle, par exemple pour les d&eacute;finitions de mat&eacute;riaux,</li>
<li><a href="../fr/Part_Compound.html" title="Part Compound/fr">Part Compos&eacute;</a>&nbsp;: cr&eacute;e un objet compos&eacute;, ce qui permet de s&eacute;lectionner chaque pi&egrave;ce,</li>
<li><a href="../fr/Part_JoinConnect.html" title="Part JoinConnect/fr">Part Connecter</a>&nbsp;: fonctionne comme Part Union, mais fusionne les parties, ce qui rend impossible leur s&eacute;lection individuelle,</li>
<li><a href="../fr/Part_BooleanFragments.html" title="Part BooleanFragments/fr">Part Fragments bool&eacute;ens</a>&nbsp;: fonctionne comme Part Compos&eacute;, ce qui permet de s&eacute;lectionner chaque partie.</li></ul>
<p>Il est important de mentionner que si les pi&egrave;ces se touchent exactement, un maillage continu sera cr&eacute;&eacute; sur l'objet bool&eacute;en et aucune contrainte ne sera n&eacute;cessaire pour la simulation (sauf si Part Compos&eacute; est utilis&eacute; et que les n&oelig;uds ne co&iuml;ncident pas ou que la <a href="../fr/FEM_MeshGmshFromShape.html#Propri%C3%A9t%C3%A9s" title="FEM MeshGmshFromShape/fr">propri&eacute;t&eacute; <i>Coherence Mesh</i> de Gmsh</a> est r&eacute;gl&eacute;e sur <code>false</code>). S'il y a un petit espace entre les pi&egrave;ces (ou une intersection &agrave; l'int&eacute;rieur d'un Part Compos&eacute;), le maillage ne sera pas continu et des contraintes comme la <a href="../fr/FEM_ConstraintTie.html" title="FEM ConstraintTie/fr">FEM Contrainte de liaison</a> ou la <a href="../fr/FEM_ConstraintContact.html" title="FEM ConstraintContact/fr">FEM Contrainte de contact</a> seront n&eacute;cessaires. L'ex&eacute;cution d'une analyse en fr&eacute;quence est un bon moyen de r&eacute;v&eacute;ler si le maillage est continu ou non. Si les pi&egrave;ces ne se touchent pas, les premi&egrave;res formes visualis&eacute;es des modes avec d&eacute;formation &agrave; l'aide du <a href="../fr/FEM_PostFilterWarp.html" title="FEM PostFilterWarp/fr">filtre de visualisation des d&eacute;formations</a> montreront une s&eacute;paration et les pi&egrave;ces "s'envoleront".
</p><p><span typeof="mw:File"><a href="../index.php?title=FEM_modal_separation.JPG&amp;filetimestamp=20231228205154&amp;.html" class="mw-file-description"><img src="../File/FEM_modal_separation.JPG" decoding="async" width="400" height="484" class="mw-file-element" data-file-width="597" data-file-height="722"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">La forme du premier mode d'une analyse de fr&eacute;quence visualis&eacute;e avec le filtre des d&eacute;formations - deux cubes avec un petit &eacute;cart initial ont &eacute;t&eacute; analys&eacute;s.</p>
<p>Il est souvent conseill&eacute; d'utiliser des fragments bool&eacute;ens avec le mode Compsolid et d'y appliquer ensuite un <a href="../fr/Part_CompoundFilter.html" title="Part CompoundFilter/fr">filtre de compos&eacute;</a>, en particulier lors de l'analyse d'assemblages multi-mat&eacute;riaux et de solides encastr&eacute;s dans d'autres solides sans d&eacute;coupes (comme dans le <a href="../fr/FEM_Shear_of_a_Composite_Block.html" title="FEM Shear of a Composite Block/fr">FEM Tutoriel Cisaillement d'un bloc composite</a>). Comme on peut le voir dans l'onglet <i>Contenu des formes</i> de l'outil <a href="../fr/Part_CheckGeometry.html" title="Part CheckGeometry/fr">Part V&eacute;rifier la g&eacute;om&eacute;trie</a> (il est important d'utiliser cet outil en cas de doute dans de tels cas), le filtre de compos&eacute; supprime le compos&eacute; et ne laisse que le Compsolid, qui est constitu&eacute; de plusieurs solides reli&eacute;s par leurs faces. Cette approche est recommand&eacute;e car un compos&eacute; n'est qu'un conteneur contenant des formes topologiquement non connect&eacute;es et pouvant inclure toutes sortes de formes, ce qui peut emp&ecirc;cher le maillage de l'utiliser correctement (maillage uniquement des solides selon les souhaits de l'utilisateur). Les op&eacute;rations telles que les fragments bool&eacute;ens cr&eacute;ent toujours des compos&eacute;s, et le filtre Compound est utilis&eacute; pour extraire la forme pertinente du compos&eacute;.
</p><p>Les solutions de contournement pour les erreurs telles que&nbsp;:
</p>
<div class="mw-highlight mw-highlight-lang-text mw-content-ltr" dir="ltr"><pre><span></span>ERROR: femelement_table&nbsp;!= count_femelements
Error in get_femelement_sets -- &gt; femelements_count_ok() failed!
</pre></div>
<p>et&nbsp;:
</p>
<div class="mw-highlight mw-highlight-lang-text mw-content-ltr" dir="ltr"><pre><span></span>*ERROR in calinput: no material was assigned
to element &hellip;
</pre></div>
<p>incluent&nbsp;:
</p>
<ul><li>laisser le dernier mat&eacute;riau sans aucun solide assign&eacute; (il sera automatiquement assign&eacute; &agrave; tous les solides qui ne sont pas r&eacute;f&eacute;renc&eacute;s dans d'autres d&eacute;finitions de mat&eacute;riaux),</li>
<li>utiliser Netgen au lieu de Gmsh pour cr&eacute;er le maillage,</li>
<li>s&eacute;parer un peu les pi&egrave;ces et appliquer des contraintes de liaison pour les connecter dans la simulation.</li></ul>
<p>Ces erreurs sont dues &agrave; l'absence ou au chevauchement de d&eacute;finitions de mat&eacute;riaux dans certains &eacute;l&eacute;ments. <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=97120&amp;start=50#p829295">Ce message du forum</a> &eacute;num&egrave;re des r&eacute;f&eacute;rences qui le montrent clairement et l'ensemble du fil de discussion peut &eacute;galement s'av&eacute;rer utile en cas de probl&egrave;mes similaires.
</p><p><span id="Selection_of_interior_entities"></span>
</p>
<h3><span id="S.C3.A9lection_des_entit.C3.A9s_int.C3.A9rieures"></span><span class="mw-headline" id="S&eacute;lection_des_entit&eacute;s_int&eacute;rieures">S&eacute;lection des entit&eacute;s int&eacute;rieures</span></h3>
<p>La s&eacute;lection des r&eacute;gions internes (par ex. faces/volumes) peut s'av&eacute;rer d&eacute;licate. Elle peut &ecirc;tre n&eacute;cessaire pour l'application de diff&eacute;rents mat&eacute;riaux, charges ou conditions aux limites (en particulier dans les analyses thermiques et &eacute;lectromagn&eacute;tiques). Plusieurs m&eacute;thodes sont possibles&nbsp;:
</p>
<ul><li>activer <a href="../fr/Std_ToggleClipPlane.html" title="Std ToggleClipPlane/fr">plan de coupe</a> pour la s&eacute;lection et le choix des faces internes,</li>
<li>masquer l'objet bool&eacute;en, ne montrer qu'une des parties auxquelles il a &eacute;t&eacute; appliqu&eacute; et la s&eacute;lectionner,</li>
<li><a href="../fr/Std_ToggleTransparency.html" title="Std ToggleTransparency/fr">Activer la transparence</a> et utiliser la <a href="../fr/Selection_view.html" class="mw-redirect" title="Selection view/fr">fen&ecirc;tre de s&eacute;lection</a> avec l'option &laquo;&nbsp;Liste des objets s&eacute;lectionn&eacute;s&nbsp;&raquo; coch&eacute;e, comme d&eacute;crit <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=96984#p826693">ici</a>,</li>
<li>s&eacute;lectionner un autre objet externe et &eacute;diter la propri&eacute;t&eacute; <i>References</i> dans l'onglet <i>Donn&eacute;es</i> d'un &eacute;l&eacute;ment d'analyse donn&eacute; (n&eacute;cessite la sp&eacute;cification manuelle du num&eacute;ro de l'objet g&eacute;om&eacute;trique).</li></ul>
<p><span id="Meshing_basics"></span>
</p>
<h2><span class="mw-headline" id="Les_bases_du_maillage">Les bases du maillage</span></h2>
<p><span id="Choosing_element_size"></span>
</p>
<h3><span id="Choisir_la_taille_des_.C3.A9l.C3.A9ments"></span><span class="mw-headline" id="Choisir_la_taille_des_&eacute;l&eacute;ments">Choisir la taille des &eacute;l&eacute;ments</span></h3>
<p>Un maillage trop grossier est l'une des sources les plus courantes d'inexactitudes et d'autres probl&egrave;mes dans les simulations par &eacute;l&eacute;ments finis. Il s'agit souvent d'une erreur partielle des param&egrave;tres du maillage automatique. Ils g&eacute;n&egrave;rent g&eacute;n&eacute;ralement des maillages tr&egrave;s grossiers et inadapt&eacute;s lorsque la taille des &eacute;l&eacute;ments n'est pas sp&eacute;cifi&eacute;e manuellement, mais laiss&eacute;e avec une valeur par d&eacute;faut. Il faut toujours conna&icirc;tre les dimensions approximatives de la pi&egrave;ce, en particulier la taille du plus petit &eacute;l&eacute;ment pertinent (l'outil <a href="../fr/Std_Measure.html" title="Std Measure/fr">Std Mesurer</a> peut &ecirc;tre utilis&eacute; pour la trouver) et sp&eacute;cifier la taille maximale appropri&eacute;e de l'&eacute;l&eacute;ment en fonction de celle-ci. Il existe &eacute;galement un r&eacute;glage de la taille minimale des &eacute;l&eacute;ments qui peut emp&ecirc;cher la cr&eacute;ation d'&eacute;l&eacute;ments trop petits autour de petites caract&eacute;ristiques g&eacute;om&eacute;triques, ce qui peut conduire &agrave; des maillages inutilement denses (et parfois m&ecirc;me &agrave; un plantage ou &agrave; un gel de FreeCAD lorsqu'on essaie de g&eacute;n&eacute;rer de tels maillages). D'une mani&egrave;re g&eacute;n&eacute;rale, il est pr&eacute;f&eacute;rable de commencer par un maillage plus grossier (moins long &agrave; g&eacute;n&eacute;rer), de voir &agrave; quoi il ressemble (une certaine exp&eacute;rience est n&eacute;cessaire) et de l'affiner si n&eacute;cessaire. Il est souvent judicieux d'utiliser un maillage dense uniquement autour des zones d'int&eacute;r&ecirc;t (endroits pr&eacute;sentant des gradients/concentrations de contraintes importants - encoches) et un maillage relativement grossier &agrave; l'&eacute;cart de ces zones. De cette mani&egrave;re, le nombre d'&eacute;l&eacute;ments peut &ecirc;tre consid&eacute;rablement r&eacute;duit, ce qui permet de diminuer les temps de r&eacute;solution. L'am&eacute;lioration du maillage local est d&eacute;fini &agrave; l'aide de <a href="../fr/FEM_MeshRegion.html" title="FEM MeshRegion/fr">FEM Mailler plus finement</a>.
</p><p><span typeof="mw:File"><a href="../index.php?title=FEM_default_mesh.PNG&amp;filetimestamp=20231228215838&amp;.html" class="mw-file-description"><img src="../File/FEM_default_mesh.PNG" decoding="async" width="400" height="238" class="mw-file-element" data-file-width="829" data-file-height="493"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Par d&eacute;faut, maillage trop grossier</p>
<p><span typeof="mw:File"><a href="../index.php?title=FEM_globally_refined_mesh.PNG&amp;filetimestamp=20231228220052&amp;.html" class="mw-file-description"><img src="../File/FEM_globally_refined_mesh.PNG" decoding="async" width="400" height="239" class="mw-file-element" data-file-width="826" data-file-height="493"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Maillage am&eacute;lior&eacute; globalement</p>
<p><span typeof="mw:File"><a href="../index.php?title=FEM_locally_refined_mesh.PNG&amp;filetimestamp=20231228220149&amp;.html" class="mw-file-description"><img src="../File/FEM_locally_refined_mesh.PNG" decoding="async" width="400" height="239" class="mw-file-element" data-file-width="838" data-file-height="501"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Maillage am&eacute;lior&eacute; localement</p>
<p><span id="Choosing_element_type"></span>
</p>
<h3><span id="Choisir_le_type_d.27.C3.A9l.C3.A9ment"></span><span class="mw-headline" id="Choisir_le_type_d'&eacute;l&eacute;ment">Choisir le type d'&eacute;l&eacute;ment</span></h3>
<p>Le choix du type d'&eacute;l&eacute;ment n'est pas facile et d&eacute;pend de nombreux facteurs, mais la r&egrave;gle g&eacute;n&eacute;rale est que les &eacute;l&eacute;ments hexa&eacute;driques et quadrilat&eacute;raux sont pr&eacute;f&eacute;rables aux &eacute;l&eacute;ments t&eacute;tra&eacute;driques et triangulaires. Cependant, les g&eacute;om&eacute;tries complexes ne peuvent pas &ecirc;tre maill&eacute;es avec des &eacute;l&eacute;ments hexa&eacute;driques et FreeCAD ne peut pas les g&eacute;n&eacute;rer correctement (uniquement en utilisant l'algorithme de subdivision du maillage Gmsh, mais ses r&eacute;sultats ne sont pas ceux que l'on attendrait d'un maillage hexagonal). Les maillages quadratiques ou &agrave; dominante quadratique peuvent &ecirc;tre g&eacute;n&eacute;r&eacute;s normalement sur les surfaces, voir <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=20351">ce fil de discussion</a>). Les &eacute;l&eacute;ments hexa&eacute;driques peuvent &ecirc;tre import&eacute;s &agrave; partir de maillages externes comme <a rel="nofollow" class="external text" href="https://gmsh.info">Gmsh</a> et utilis&eacute;s dans l'atelier FEM comme le montre <a rel="nofollow" class="external text" href="https://www.youtube.com/watch?v=vylt24G7qj4&amp;t=932s">cette vid&eacute;o</a>.
</p><p><span id="Choosing_element_order"></span>
</p>
<h3><span id="Choisir_l.27ordre_des_.C3.A9l.C3.A9ments"></span><span class="mw-headline" id="Choisir_l'ordre_des_&eacute;l&eacute;ments">Choisir l'ordre des &eacute;l&eacute;ments</span></h3>
<p>Le choix de l'ordre des &eacute;l&eacute;ments (premier ou second) d&eacute;pend des conditions d'analyse, mais dans la plupart des cas, les &eacute;l&eacute;ments de second ordre sont pr&eacute;f&eacute;rables. Ceci est particuli&egrave;rement vrai pour les &eacute;l&eacute;ments triangulaires et t&eacute;tra&eacute;driques, leurs versions de premier ordre (lin&eacute;aires) ne sont normalement pas recommand&eacute;es pour un usage r&eacute;gulier et ne devraient &ecirc;tre utilis&eacute;es que comme &eacute;l&eacute;ments de remplissage dans des r&eacute;gions de faible importance. Cependant, comme FreeCAD ne peut pas g&eacute;n&eacute;rer correctement d'&eacute;l&eacute;ments hexa&eacute;driques, les t&eacute;tra&egrave;dres lin&eacute;aires peuvent &ecirc;tre utilis&eacute;s dans certains cas, si les maillages sont suffisamment denses. En particulier lors d'analyses avec une <a href="../fr/FEM_ConstraintContact.html" title="FEM ConstraintContact/fr">contrainte de contact</a>.
</p><p><span id="Negative_Jacobians"></span>
</p>
<h2><span id="Jacobiens_n.C3.A9gatifs"></span><span class="mw-headline" id="Jacobiens_n&eacute;gatifs">Jacobiens n&eacute;gatifs</span></h2>
<p>Si les r&egrave;gles ci-dessus sont respect&eacute;es (notamment en ce qui concerne la validit&eacute; de la g&eacute;om&eacute;trie, le defeaturing et la s&eacute;lection de la taille des &eacute;l&eacute;ments), le maillage devrait &ecirc;tre g&eacute;n&eacute;r&eacute; correctement. Cependant, dans certains cas, la g&eacute;om&eacute;trie ne peut pas &ecirc;tre trop simplifi&eacute;e, ou la proc&eacute;dure de mod&eacute;lisation est appropri&eacute;e mais conduit quand m&ecirc;me &agrave; des ar&ecirc;tes et des faces de petite taille. Dans ce cas, le maillage avec des &eacute;l&eacute;ments de second ordre peut &eacute;chouer en raison de jacobiens n&eacute;gatifs. La raison en est que les maillages doivent suivre le mod&egrave;le CAO et placer les n&oelig;uds m&eacute;dians des &eacute;l&eacute;ments de second ordre sur la g&eacute;om&eacute;trie. Dans le cas de formes plus complexes, les &eacute;l&eacute;ments peuvent &ecirc;tre tellement &eacute;tir&eacute;s qu'ils deviennent invers&eacute;s. Le jacobien est l'une des mesures de qualit&eacute; de maillage les plus courantes. Il repr&eacute;sente l'&eacute;cart de l'&eacute;l&eacute;ment par rapport &agrave; la forme id&eacute;ale. Elle devient n&eacute;gative lorsque l'&eacute;l&eacute;ment se retourne (devient invers&eacute;), soit en raison d'une d&eacute;formation importante au cours de l'analyse (non prise en compte ici), soit en raison des probl&egrave;mes de maillage susmentionn&eacute;s. Les jacobiens n&eacute;gatifs dans l'atelier FEM de FreeCAD peuvent &ecirc;tre signal&eacute;s par Gmsh ou par CalculiX. Leurs emplacements dans le maillage sont mis en &eacute;vidence lorsque les analyses CalculiX sont soumises en utilisant le bouton <a href="../fr/FEM_SolverRun.html" title="FEM SolverRun/fr">Lancer les calculs du solveur</a>. Les conseils suivants peuvent aider &agrave; les &eacute;liminer&nbsp;:
</p>
<ul><li>D&eacute;finir la propri&eacute;t&eacute; <i>Second Order Linear</i> du <a href="../fr/FEM_MeshGmshFromShape.html" title="FEM MeshGmshFromShape/fr">maillage de Gmsh</a> &agrave; <i>true</i>, ceci a pour r&eacute;sultat que les n&oelig;uds du milieu des &eacute;l&eacute;ments de second ordre sont simplement ajout&eacute;s au milieu des bords droits (initialement) des &eacute;l&eacute;ments de premier ordre, sans les attacher &agrave; la g&eacute;om&eacute;trie et r&eacute;sout le probl&egrave;me dans la plupart des cas,</li>
<li>Utiliser Netgen au lieu de Gmsh. Netgen est connu pour &ecirc;tre moins sujet aux probl&egrave;mes de jacobiens n&eacute;gatifs mais ne les signale pas non plus, de sorte que l'utilisateur ne peut s'en rendre compte qu'au moment de soumettre l'analyse,</li>
<li>R&eacute;duire davantage la taille des &eacute;l&eacute;ments,</li>
<li>Exporter la g&eacute;om&eacute;trie, essayer de la mailler dans l'interface graphique de Gmsh ou Netgen (NGSolve) ou dans un autre maillage autonome (comme Salome_Meca). Ces outils ont des fonctions suppl&eacute;mentaires qui peuvent aider &agrave; se d&eacute;barrasser des jacobiens n&eacute;gatifs (par exemple, Gmsh a ce que l'on appelle des "outils d'ordre &eacute;lev&eacute;"),</li>
<li>Utiliser des &eacute;l&eacute;ments de premier ordre. Cela ne doit &ecirc;tre fait qu'en dernier recours car les t&eacute;tra&egrave;dres de premier ordre sont connus pour leur impr&eacute;cision.</li></ul>
<p>Ind&eacute;pendamment de ces conseils, il est important de souligner une fois de plus que les jacobiens n&eacute;gatifs sont g&eacute;n&eacute;ralement dus &agrave; des approches de mod&eacute;lisation d&eacute;sordonn&eacute;es et &agrave; un manque de pr&eacute;paration de la g&eacute;om&eacute;trie pour l'analyse (ce qui est particuli&egrave;rement courant avec les mod&egrave;les STEP t&eacute;l&eacute;charg&eacute;s &agrave; partir de divers sites web). M&ecirc;me si le maillage est finalement g&eacute;n&eacute;r&eacute; dans de tels cas, les r&eacute;sultats risquent d'&ecirc;tre de mauvaise qualit&eacute; (rappelons la r&egrave;gle GIGO mentionn&eacute;e dans le premier paragraphe). Par cons&eacute;quent, le nettoyage de la g&eacute;om&eacute;trie et la pr&eacute;paration pour la FEM devraient toujours &ecirc;tre la priorit&eacute;.
</p><p><span id="Mesh_convergence_studies"></span>
</p>
<h2><span id=".C3.89tudes_sur_la_convergence_des_maillages"></span><span class="mw-headline" id="&Eacute;tudes_sur_la_convergence_des_maillages">&Eacute;tudes sur la convergence des maillages</span></h2>
<p>Les &eacute;tudes de convergence de maillage sont recommand&eacute;es dans tous les projets s&eacute;rieux n&eacute;cessitant des r&eacute;sultats pr&eacute;cis. En effet, les r&eacute;sultats peuvent changer consid&eacute;rablement et s'approcher des valeurs correctes lorsque le maillage est affin&eacute;. L'approche suivante doit &ecirc;tre utilis&eacute;e&nbsp;:
</p>
<ol><li>Apr&egrave;s avoir obtenu les premiers r&eacute;sultats et les avoir not&eacute;s (g&eacute;n&eacute;ralement la contrainte de von Mises maximale, la contrainte de von Mises &agrave; un endroit donn&eacute; et le d&eacute;placement maximal), affiner le maillage (globalement ou mieux localement avec <a href="../fr/FEM_MeshRegion.html" title="FEM MeshRegion/fr">FEM Mailler plus finement</a>) et r&eacute;ex&eacute;cuter la simulation.</li>
<li>V&eacute;rifiez les r&eacute;sultats et notez leurs nouvelles valeurs. S'ils diff&egrave;rent significativement des r&eacute;sultats initiaux, affinez encore le maillage et relancez l'analyse.</li>
<li>R&eacute;p&eacute;tez le processus si les r&eacute;sultats changent encore (g&eacute;n&eacute;ralement en augmentant) de mani&egrave;re significative avec l'affinement du maillage.</li></ol>
<p>Il est g&eacute;n&eacute;ralement utile de cr&eacute;er un graphique avec un r&eacute;sultat donn&eacute; en fonction de la densit&eacute; du maillage. De cette fa&ccedil;on, il est plus facile de remarquer quand les r&eacute;sultats commencent &agrave; converger. La diff&eacute;rence acceptable dans les r&eacute;sultats entre deux ex&eacute;cutions est g&eacute;n&eacute;ralement de l'ordre de quelques pour cent (par exemple, moins de 5&nbsp;%).
</p><p>Dans certains cas, il peut arriver que la contrainte maximale augmente ind&eacute;finiment, quelle que soit la densit&eacute; du maillage. Un tel effet non physique est connu sous le nom de singularit&eacute; de contrainte. Il peut se produire pour les raisons suivantes
</p>
<ul><li>les forces concentr&eacute;es appliqu&eacute;es aux mod&egrave;les de solides et de coques,</li>
<li>conditions limites appliqu&eacute;es &agrave; des points (n&oelig;uds individuels),</li>
<li>angles vifs,</li>
<li>contact survenant dans un coin.</li></ul>
<p>Les moyens typiques de traiter les singularit&eacute;s de contrainte sont les suivants&nbsp;:
</p>
<ul><li>appliquer des charges et des conditions aux limites &agrave; de petites zones plut&ocirc;t qu'&agrave; des points - voir la section sur le partitionnement ci-dessus,</li>
<li>ajouter de petits filets aux angles vifs (une exception &agrave; la r&egrave;gle qui consiste &agrave; omettre les petits filets lors de la simplification de la g&eacute;om&eacute;trie pour les &eacute;l&eacute;ments finis),</li>
<li>inclure la plasticit&eacute; dans le comportement du mat&eacute;riau pour permettre la redistribution des contraintes et limiter les contraintes aux valeurs autoris&eacute;es par la d&eacute;finition de la plasticit&eacute; tout en observant le niveau appropri&eacute; de d&eacute;formation (d&eacute;formation plastique),</li>
<li>ignorer les singularit&eacute;s et lire les contraintes loin d'elles si possible (sur la base du principe de St. Venant).</li></ul>
<p><span typeof="mw:File"><a href="../index.php?title=FEM_mesh_convergence.PNG&amp;filetimestamp=20240105102927&amp;.html" class="mw-file-description"><img src="../File/FEM_mesh_convergence.PNG" decoding="async" width="400" height="332" class="mw-file-element" data-file-width="850" data-file-height="706"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Trac&eacute;s de convergence de maillage typiques&nbsp;:<br>
- le d&eacute;placement (<b>courbe verte</b>) converge rapidement,<br>
- la contrainte maximale au niveau d'une entaille comme un trou (<b>courbe bleue</b>) n&eacute;cessite davantage d'it&eacute;rations de raffinement du maillage pour converger, <br>
- tandis que la contrainte maximale au niveau d'un angle aigu avec une condition limite fixe (<b>courbe rouge</b>) ne converge pas du tout. Une singularit&eacute; de contrainte se produit et un petit cong&eacute; devrait &ecirc;tre ajout&eacute; et la connexion devrait &ecirc;tre mod&eacute;lis&eacute;e de mani&egrave;re plus r&eacute;aliste et plus flexible pour &eacute;viter ce comportement.<br></p>
<p><br>
</p>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><span typeof="mw:File"><a href="../index.php?title=Workbench_FEM.svg&amp;filetimestamp=20240405093343&amp;.html" class="mw-file-description"><img src="../File/Workbench_FEM.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../fr/FEM_Workbench.html" title="FEM Workbench/fr">FEM</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><a href="../fr/FEM_Analysis.html" title="FEM Analysis/fr">FEM Analyseur</a></li></ul>
<ul><li><b>Mat&eacute;riaux&nbsp;:</b> <a href="../fr/FEM_MaterialSolid.html" title="FEM MaterialSolid/fr">Mat&eacute;riau pour solide</a>, <a href="../fr/FEM_MaterialFluid.html" title="FEM MaterialFluid/fr">Mat&eacute;riau pour fluide</a>, <a href="../fr/FEM_MaterialMechanicalNonlinear.html" title="FEM MaterialMechanicalNonlinear/fr">Mat&eacute;riau m&eacute;canique non lin&eacute;aire</a>, <a href="../fr/FEM_MaterialReinforced.html" title="FEM MaterialReinforced/fr">Mat&eacute;riau renforc&eacute; (type b&eacute;ton)</a>&nbsp;; <a href="../fr/FEM_MaterialEditor.html" title="FEM MaterialEditor/fr">&Eacute;diteur de mat&eacute;riaux</a></li></ul>
<ul><li><b>G&eacute;om&eacute;trie de l'&eacute;lement&nbsp;:</b> <a href="../fr/FEM_ElementGeometry1D.html" title="FEM ElementGeometry1D/fr">&Eacute;l&eacute;ment 1D</a>, <a href="../fr/FEM_ElementRotation1D.html" title="FEM ElementRotation1D/fr">Rotation d'&eacute;l&eacute;ment 1D</a>, <a href="../fr/FEM_ElementGeometry2D.html" title="FEM ElementGeometry2D/fr">&Eacute;paisseur d'un &eacute;l&eacute;ment 2D</a>, <a href="../fr/FEM_ElementFluid1D.html" title="FEM ElementFluid1D/fr">Section fluide 1D</a></li></ul>
<hr>
<ul><li><b>Conditions limites &eacute;lectromagn&eacute;tiques&nbsp;:</b> <a href="../fr/FEM_ConstraintElectrostaticPotential.html" title="FEM ConstraintElectrostaticPotential/fr">de potentiel &eacute;lectrostatique</a>, <a href="../fr/FEM_ConstraintCurrentDensity.html" title="FEM ConstraintCurrentDensity/fr">de densit&eacute; de courant</a>, <a href="../fr/FEM_ConstraintMagnetization.html" title="FEM ConstraintMagnetization/fr">de magn&eacute;tisation</a>, <a href="../fr/FEM_ElectricChargeDensity.html" title="FEM ElectricChargeDensity/fr">Densit&eacute; de charge &eacute;lectrique</a></li></ul>
<ul><li><b>Conditions limites de fluide&nbsp;:</b> <a href="../fr/FEM_ConstraintInitialFlowVelocity.html" title="FEM ConstraintInitialFlowVelocity/fr">de vitesse d'&eacute;coulement initial</a>, <a href="../fr/FEM_ConstraintInitialPressure.html" title="FEM ConstraintInitialPressure/fr">de pression initiale</a>, <a href="../fr/FEM_ConstraintFlowVelocity.html" title="FEM ConstraintFlowVelocity/fr">Vitesse d'&eacute;coulement comme condition limite</a></li></ul>
<ul><li><b> Fonctions d'analyse g&eacute;om&eacute;trique&nbsp;:</b> <a href="../fr/FEM_ConstraintPlaneRotation.html" title="FEM ConstraintPlaneRotation/fr">Contrainte multi-points selon un plan</a>, <a href="../fr/FEM_ConstraintSectionPrint.html" title="FEM ConstraintSectionPrint/fr">Enregistrer les r&eacute;sultats par section</a>, <a href="../fr/FEM_ConstraintTransform.html" title="FEM ConstraintTransform/fr">Syst&egrave;me de coordonn&eacute;es locales</a></li></ul>
<ul><li><b>Conditions limites et charges m&eacute;caniques&nbsp;:</b> <a href="../fr/FEM_ConstraintFixed.html" title="FEM ConstraintFixed/fr">de limite fixe</a>, <a href="../fr/FEM_ConstraintRigidBody.html" title="FEM ConstraintRigidBody/fr">Contrainte de corps rigide</a>, <a href="../fr/FEM_ConstraintDisplacement.html" title="FEM ConstraintDisplacement/fr">de limite de d&eacute;placement</a>, <a href="../fr/FEM_ConstraintContact.html" title="FEM ConstraintContact/fr">Contrainte de contact</a>, <a href="../fr/FEM_ConstraintTie.html" title="FEM ConstraintTie/fr">Contrainte de liaison</a>, <a href="../fr/FEM_ConstraintSpring.html" title="FEM ConstraintSpring/fr">de ressort</a>, <a href="../fr/FEM_ConstraintForce.html" title="FEM ConstraintForce/fr">Charge d'effort</a>, <a href="../fr/FEM_ConstraintPressure.html" title="FEM ConstraintPressure/fr">Charge de pression</a>, <a href="../fr/FEM_ConstraintCentrif.html" title="FEM ConstraintCentrif/fr">Charge centrifuge</a>, <a href="../fr/FEM_ConstraintSelfWeight.html" title="FEM ConstraintSelfWeight/fr">Charge de gravit&eacute;</a></li></ul>
<ul><li><b>Conditions limites et charges thermiques&nbsp;:</b> <a href="../fr/FEM_ConstraintInitialTemperature.html" title="FEM ConstraintInitialTemperature/fr">Temp&eacute;rature initiale</a>, <a href="../fr/FEM_ConstraintHeatflux.html" title="FEM ConstraintHeatflux/fr">Charge de flux thermique</a>, <a href="../fr/FEM_ConstraintTemperature.html" title="FEM ConstraintTemperature/fr">Condition limite de temp&eacute;rature</a>, <a href="../fr/FEM_ConstraintBodyHeatSource.html" title="FEM ConstraintBodyHeatSource/fr">Source de chaleur du corps</a></li></ul>
<ul><li><b>Remplacer les constantes&nbsp;:</b> <a href="../fr/FEM_ConstantVacuumPermittivity.html" title="FEM ConstantVacuumPermittivity/fr">Constante de permittivit&eacute; du vide</a></li></ul>
<hr>
<ul><li><b>Maillage&nbsp;:</b> <a href="../fr/FEM_MeshNetgenFromShape.html" title="FEM MeshNetgenFromShape/fr">avec Netgen</a>, <a href="../fr/FEM_MeshGmshFromShape.html" title="FEM MeshGmshFromShape/fr">avec GMSH</a>, <a href="../fr/FEM_MeshBoundaryLayer.html" title="FEM MeshBoundaryLayer/fr">Couche limite de maillage</a>, <a href="../fr/FEM_MeshRegion.html" title="FEM MeshRegion/fr">Mailler plus finement</a>, <a href="../fr/FEM_MeshGroup.html" title="FEM MeshGroup/fr">Grouper un maillage</a>, <a href="../fr/FEM_CreateElementsSet.html" title="FEM CreateElementsSet/fr">Effacer des &eacute;l&eacute;ments</a>, <a href="../fr/FEM_FemMesh2Mesh.html" title="FEM FemMesh2Mesh/fr">Convertir un maillage FEM en surfacique</a></li></ul>
<ul><li><b>Solveur&nbsp;:</b> <a href="../fr/FEM_SolverCalculixCcxtools.html" title="FEM SolverCalculixCcxtools/fr">CalculiX Standard</a>, <a href="../fr/FEM_SolverElmer.html" title="FEM SolverElmer/fr">Elmer</a>, <a href="../fr/FEM_SolverMystran.html" title="FEM SolverMystran/fr">Mystran</a>, <a href="../fr/FEM_SolverZ88.html" title="FEM SolverZ88/fr">Z88</a>&nbsp;; <b>&Eacute;quations M&eacute;caniques&nbsp;:</b> <a href="../fr/FEM_EquationElasticity.html" title="FEM EquationElasticity/fr">d'&eacute;lasticit&eacute;</a>, <a href="../fr/FEM_EquationDeformation.html" title="FEM EquationDeformation/fr">de d&eacute;formation</a>&nbsp;;  <b>&Eacute;quations &eacute;lectromagn&eacute;tiques&nbsp;:</b> <a href="../fr/FEM_EquationElectrostatic.html" title="FEM EquationElectrostatic/fr">&eacute;lectrostatique</a>, <a href="../fr/FEM_EquationElectricforce.html" title="FEM EquationElectricforce/fr">de force &eacute;lectrique</a>, <a href="../fr/FEM_EquationMagnetodynamic.html" title="FEM EquationMagnetodynamic/fr">de magn&eacute;todynamique</a>, <a href="../fr/FEM_EquationMagnetodynamic2D.html" title="FEM EquationMagnetodynamic2D/fr">de magn&eacute;todynamique 2D</a>,  <a href="../fr/FEM_EquationStaticCurrent.html" title="FEM EquationStaticCurrent/fr">de courant statique</a>&nbsp;; <a href="../fr/FEM_EquationFlow.html" title="FEM EquationFlow/fr">d'&eacute;coulement</a>, <a href="../fr/FEM_EquationFlux.html" title="FEM EquationFlux/fr">de flux</a>, <a href="../fr/FEM_EquationHeat.html" title="FEM EquationHeat/fr">de chaleur</a>&nbsp;; <b>Solveur&nbsp;:</b> <a href="../fr/FEM_SolverControl.html" title="FEM SolverControl/fr">R&eacute;glage du solveur</a>, <a href="../fr/FEM_SolverRun.html" title="FEM SolverRun/fr">Calcul du solveur</a></li></ul>
<ul><li><b>R&eacute;sultats&nbsp;:</b> <a href="../fr/FEM_ResultsPurge.html" title="FEM ResultsPurge/fr">Purger</a>, <a href="../fr/FEM_ResultShow.html" title="FEM ResultShow/fr">Afficher</a>,  <a href="../fr/FEM_PostApplyChanges.html" title="FEM PostApplyChanges/fr">Appliquer les modifications</a>, <a href="../fr/FEM_PostPipelineFromResult.html" title="FEM PostPipelineFromResult/fr">Pipeline du r&eacute;sultat</a>, <a href="../fr/FEM_PostFilterWarp.html" title="FEM PostFilterWarp/fr">Filtre des d&eacute;formations</a>, <a href="../fr/FEM_PostFilterClipScalar.html" title="FEM PostFilterClipScalar/fr">Filtre d'&eacute;cr&ecirc;tage scalaire</a>, <a href="../fr/FEM_PostFilterCutFunction.html" title="FEM PostFilterCutFunction/fr">Filtre de fonction de d&eacute;coupe</a>, <a href="../fr/FEM_PostFilterClipRegion.html" title="FEM PostFilterClipRegion/fr">Filtre d'&eacute;cr&ecirc;tage selon une r&eacute;gion</a>, <a href="../fr/FEM_PostFilterContours.html" title="FEM PostFilterContours/fr">Filtre par contours</a>, <a href="../fr/FEM_PostFilterGlyph.html" title="FEM PostFilterGlyph/fr">Filtre par symboles</a>,  <a href="../fr/FEM_PostFilterDataAlongLine.html" title="FEM PostFilterDataAlongLine/fr">Filtre d'&eacute;cr&ecirc;tage selon une ligne</a>, <a href="../fr/FEM_PostFilterLinearizedStresses.html" title="FEM PostFilterLinearizedStresses/fr">Graphique de lin&eacute;arisation des crit&egrave;res</a>, <a href="../fr/FEM_PostFilterDataAtPoint.html" title="FEM PostFilterDataAtPoint/fr">Donn&eacute;es du filtre d'&eacute;cr&ecirc;tage du point</a>, <a href="../fr/FEM_PostFilterCalculator.html" title="FEM PostFilterCalculator/fr">Champs personnalis&eacute;s de r&eacute;sultats</a>&nbsp;; <b>Fonctions de filtrage&nbsp;:</b> <a href="../fr/FEM_PostCreateFunctionPlane.html" title="FEM PostCreateFunctionPlane/fr">Plan</a>,  <a href="../fr/FEM_PostCreateFunctionSphere.html" title="FEM PostCreateFunctionSphere/fr">Sph&egrave;re</a>, <a href="../fr/FEM_PostCreateFunctionCylinder.html" title="FEM PostCreateFunctionCylinder/fr">Cylindre</a>, <a href="../fr/FEM_PostCreateFunctionBox.html" title="FEM PostCreateFunctionBox/fr">Bo&icirc;te</a>&nbsp;; <b>Visualisation des donn&eacute;es&nbsp;:</b> <a href="../fr/FEM_PostLineplot.html" title="FEM PostLineplot/fr">Courbe</a>, <a href="../fr/FEM_PostHistogram.html" title="FEM PostHistogram/fr"> Histogramme</a>, <a href="../fr/FEM_PostSpreadsheet.html" title="FEM PostSpreadsheet/fr">Tableau</a></li></ul>
<ul><li><b>Utilitaires&nbsp;:</b> <a href="../fr/FEM_ClippingPlaneAdd.html" title="FEM ClippingPlaneAdd/fr">Plan de coupe</a>, <a href="../fr/FEM_ClippingPlaneRemoveAll.html" title="FEM ClippingPlaneRemoveAll/fr">Supprimer les plans de coupe</a>, <a href="../fr/FEM_Examples.html" title="FEM Examples/fr">Exemples</a>&nbsp;; <a href="../fr/FEM_MeshClear.html" title="FEM MeshClear/fr">Supprimer le maillage</a>, <a href="../fr/FEM_MeshDisplayInfo.html" title="FEM MeshDisplayInfo/fr">Affichage des informations du maillage</a></li></ul>
<hr>
<ul><li><b>Additionnel&nbsp;:</b> <a href="../fr/FEM_Preferences.html" title="FEM Preferences/fr">Pr&eacute;f&eacute;rences</a>&nbsp;; <a href="../fr/FEM_Install.html" title="FEM Install/fr">Installation</a>, <a href="../fr/FEM_Mesh.html" title="FEM Mesh/fr">FEM Maillage</a>, <a href="../fr/FEM_Solver.html" title="FEM Solver/fr">Solveur</a>, <a href="../fr/FEM_CalculiX.html" title="FEM CalculiX/fr">CalculiX</a>, <a href="../fr/FEM_Concrete.html" title="FEM Concrete/fr">FEM B&eacute;ton</a>&nbsp;; <a href="../fr/FEM_Element_Types.html" title="FEM Element Types/fr">FEM Types d'&eacute;lements</a></li></ul></div>
    </div></div>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><span typeof="mw:File"><a href="../index.php?title=User_hub.png&amp;filetimestamp=20190221145008&amp;.html" class="mw-file-description"><img src="../File/User_hub.png" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../fr/User_hub.html" title="User hub/fr">Hub utilisateurs</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b><a href="../fr/Getting_started.html" title="Getting started/fr">D&eacute;marrer avec FreeCAD</a></b></li>
<li><b>Installation&nbsp;:</b> <a href="../fr/Download.html" title="Download/fr">T&eacute;l&eacute;chargements</a>, <a href="../fr/Installing_on_Windows.html" title="Installing on Windows/fr">Windows</a>, <a href="../fr/Installing_on_Linux.html" title="Installing on Linux/fr">Linux</a>, <a href="../fr/Installing_on_Mac.html" title="Installing on Mac/fr">Mac</a>, <a href="../fr/Installing_additional_components.html" title="Installing additional components/fr">Logiciels suppl&eacute;mentaires</a>, <a href="../fr/Compile_on_Docker.html" title="Compile on Docker/fr">Docker</a>, <a href="../fr/AppImage.html" title="AppImage/fr">AppImage</a>, <a href="../fr/Ubuntu_Snap.html" title="Ubuntu Snap/fr">Ubuntu Snap</a></li>
<li><b>Bases&nbsp;:</b> <a href="../fr/About_FreeCAD.html" title="About FreeCAD/fr">&Agrave; propos de FreeCAD</a>, <a href="../fr/Interface.html" title="Interface/fr">Interface</a>, <a href="../fr/Mouse_navigation.html" title="Mouse navigation/fr">Navigation par la souris</a>, <a href="../fr/Selection_methods.html" title="Selection methods/fr">M&eacute;thodes de s&eacute;lection</a>, <a href="../fr/Object_name.html" title="Object name/fr">Objet name</a>, <a href="../fr/Preferences_Editor.html" title="Preferences Editor/fr">Pr&eacute;f&eacute;rences</a>, <a href="../fr/Workbenches.html" title="Workbenches/fr">Ateliers</a>, <a href="../fr/Document_structure.html" title="Document structure/fr">Structure du document</a>, <a href="../fr/Property.html" title="Property/fr">Propri&eacute;t&eacute;s</a>, <a href="../fr/Help_FreeCAD.html" title="Help FreeCAD/fr">Contribuer &agrave; FreeCAD</a>, <a href="../fr/Donate.html" title="Donate/fr">Faire un don</a></li></ul>
<hr>
<ul><li><b>Aide&nbsp;:</b> <a href="../fr/Tutorials.html" title="Tutorials/fr">Tutoriels</a>, <a href="../fr/Video_tutorials.html" title="Video tutorials/fr">Tutoriels vid&eacute;o</a></li>
<li><b><a href="../fr/Workbenches.html" title="Workbenches/fr">Ateliers</a>&nbsp;:</b> <a href="../fr/Std_Base.html" title="Std Base/fr">Std Base</a>, <a href="../fr/Assembly_Workbench.html" title="Assembly Workbench/fr">Assembly</a>, <a href="../fr/BIM_Workbench.html" title="BIM Workbench/fr">BIM</a>, <a href="../fr/CAM_Workbench.html" title="CAM Workbench/fr">CAM</a>, <a href="../fr/Draft_Workbench.html" title="Draft Workbench/fr">Draft</a>, <a href="../fr/FEM_Workbench.html" title="FEM Workbench/fr">FEM</a>, <a href="../fr/Inspection_Workbench.html" title="Inspection Workbench/fr">Inspection</a>, <a href="../fr/Material_Workbench.html" title="Material Workbench/fr">Material</a>, <a href="../fr/Mesh_Workbench.html" title="Mesh Workbench/fr">Mesh</a>, <a href="../fr/OpenSCAD_Workbench.html" title="OpenSCAD Workbench/fr">OpenSCAD</a>, <a href="../fr/Part_Workbench.html" title="Part Workbench/fr">Part</a>, <a href="../fr/PartDesign_Workbench.html" title="PartDesign Workbench/fr">PartDesign</a>, <a href="../fr/Points_Workbench.html" title="Points Workbench/fr">Points</a>, <a href="../fr/Reverse_Engineering_Workbench.html" title="Reverse Engineering Workbench/fr">Reverse Engineering</a>, <a href="../fr/Robot_Workbench.html" title="Robot Workbench/fr">Robot</a>, <a href="../fr/Sketcher_Workbench.html" title="Sketcher Workbench/fr">Sketcher</a>, <a href="../fr/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/fr">Spreadsheet</a>, <a href="../fr/Surface_Workbench.html" title="Surface Workbench/fr">Surface</a>, <a href="../fr/TechDraw_Workbench.html" title="TechDraw Workbench/fr">TechDraw</a>, <a href="../fr/Testing.html" title="Testing/fr">Test</a></li></ul>
<hr>
<ul><li><b><a href="../fr/Addon.html" title="Addon/fr">Addons</a>&nbsp;:</b> <a href="../fr/Std_AddonMgr.html" title="Std AddonMgr/fr">Gestionnaire des extensions</a>, <a href="../fr/External_workbenches.html" title="External workbenches/fr">Ateliers externes</a>, <a href="../fr/Scripting_and_macros.html" title="Scripting and macros/fr">Scripts et macros</a></li></ul>
<hr>
<ul><li><b>Hubs&nbsp;:</b> <a href="../fr/User_hub.html" title="User hub/fr">Hub utilisateurs</a>, <a href="../fr/Power_users_hub.html" title="Power users hub/fr">Hub utilisateurs exp&eacute;riment&eacute;s</a>, <a href="../fr/Developer_hub.html" title="Developer hub/fr">Hub D&eacute;veloppeurs</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20260103104928
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.116 seconds
Real time usage: 0.165 seconds
Preprocessor visited node count: 608/1000000
Post&#8208;expand include size: 31188/2097152 bytes
Template argument size: 9336/2097152 bytes
Highest expansion depth: 7/100
Expensive parser function count: 2/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1882/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   28.035      1 -total
 24.13%    6.764      1 Template:FEM_Tools_navi/fr
 17.33%    4.857      2 Template:Navigation_menu_2
 14.99%    4.202      1 Template:TutorialInfo/fr
 13.00%    3.644      1 Template:Userdocnavi/fr
 12.28%    3.443      1 Template:PropertyData
  9.51%    2.665     13 Template:Caption
  7.32%    2.051      1 Template:PropertyView
  7.25%    2.033      2 Template:Code
  7.13%    1.998      2 Template:Variable
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:332915-0!canonical and timestamp 20260103104928 and revision id 1726830. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>