<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">FreeCAD Managing Expectations/fr</span></h1><?xml encoding="UTF-8"><div class="mw-parser-output"><div class="mw-pt-languages noprint" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../de/FreeCAD_Managing_Expectations.html" class="mw-pt-progress mw-pt-progress--low" title="FreeCAD MitErwartungenUmgehen (36% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../FreeCAD_Managing_Expectations.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="FreeCAD Managing Expectations (100% translated)" lang="en" dir="ltr">English</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="fr" dir="ltr">fran&ccedil;ais</span></li>
<li><a href="../pl/FreeCAD_Managing_Expectations.html" class="mw-pt-progress mw-pt-progress--complete" title="FreeCAD Oczekiwania (100% translated)" lang="pl" dir="ltr">polski</a></li></ul></div>
<div id="itsfree" style="text-align:center;color:black;background:#FDE0A8;margin:1em 7em;padding:0.5em 2em;border:2px solid #FF5706;">Bien que nous accueillions et encouragions la croissance et la participation de la communaut&eacute;, les demandes, les divagations &eacute;motionnelles et les revendications sauvages sont g&eacute;n&eacute;ralement mal re&ccedil;ues car notre communaut&eacute; est compos&eacute;e de nombreux partisans exp&eacute;riment&eacute;s et passionn&eacute;s de FreeCAD qui ont entendu des d&eacute;clarations similaires &agrave; maintes reprises. Si vous trouvez qu'une fonctionnalit&eacute; manque, ou que quelque chose vous g&ecirc;ne, nous vous encourageons vivement &agrave; envisager de vous engager dans le code lui-m&ecirc;me. FreeCAD est largement d&eacute;velopp&eacute; par un groupe relativement restreint de personnes talentueuses qui ont toutes un emploi, une famille et d'autres int&eacute;r&ecirc;ts que la programmation &agrave; la demande. Si vous avez les comp&eacute;tences (Python/C++) et la motivation pour participer, vos contributions peuvent aider &agrave; rendre FreeCAD encore meilleur qu'il ne l'est aujourd'hui. Vous pouvez trouver les bogues et les demandes de fonctionnalit&eacute;s suivis <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/issues">ici</a>.</div>
<div style="clear:right; margin-bottom: .5em; float: right; padding: .5em 0 .8em 1.4em; background: none;"><meta property="mw:PageProp/toc"></div>
<p><span id="Purpose"></span>
</p>
<h2><span class="mw-headline" id="Objectif">Objectif</span></h2>
<p>Cette page wiki est destin&eacute;e aux nouveaux utilisateurs de FreeCAD venant d'autres solutions de CAO/FAO.
</p><p><span id="Opening_statement"></span>
</p>
<h2><span id="D.C3.A9claration_liminaire"></span><span class="mw-headline" id="D&eacute;claration_liminaire">D&eacute;claration liminaire</span></h2>
<p>De nombreux amateurs, designers ind&eacute;pendants et petites entreprises cherchent souvent un refuge contre les co&ucirc;ts &eacute;lev&eacute;s et les restrictions de licence des logiciels commerciaux, ou peut-&ecirc;tre avez-vous simplement choisi FreeCAD parce que vous croyez dans la philosophie du <a rel="nofollow" class="external text" href="https://fr.wikipedia.org/wiki/Free/Libre_Open_Source_Software">FOSS</a>. Dans tous les cas, BIENVENUE&nbsp;! Il y a de nombreux utilisateurs, tout comme vous, qui ont r&eacute;ussi la transition vers FreeCAD pour leurs besoins personnels et professionnels. Cette page wiki est con&ccedil;ue pour vous aider &agrave; vous mettre sur la voie du succ&egrave;s et &agrave; &eacute;tablir des attentes r&eacute;alistes tout en vous plongeant dans la <i>M&eacute;thode FreeCAD</i>, qui est tr&egrave;s probablement diff&eacute;rent de ce &agrave; quoi vous vous &ecirc;tes peut-&ecirc;tre habitu&eacute; avec d'autres logiciels de CAO courants.
</p><p><span id="What_can_I_expect?"></span>
</p>
<h2><span id="Qu.27est-ce_que_je_peux_attendre_.3F"></span><span class="mw-headline" id="Qu'est-ce_que_je_peux_attendre_?">Qu'est-ce que je peux attendre&nbsp;?</span></h2>
<p>&Agrave; la base, FreeCAD est un puissant modeleur param&eacute;trique. Il utilise un concept d'"atelier" modulaire, o&ugrave; chaque atelier est responsable de t&acirc;ches et de fonctions sp&eacute;cifiques. Ce concept est tr&egrave;s souple et peut &ecirc;tre utilis&eacute; avec succ&egrave;s &agrave; de nombreuses fins. FreeCAD est activement d&eacute;velopp&eacute;, utilis&eacute; en production, et assez stable&nbsp;; mais comme tout autre programme de CAO, il n'est pas stable &agrave; 100%.
</p><p>Si vous venez d'un autre programme de CAO, vous pouvez trouver la terminologie, la structure et l'organisation de FreeCAD l&eacute;g&egrave;rement &eacute;tranges. Vous aurez probablement besoin de faire quelques ajustements &agrave; vos flux de travail, d'apprendre des solutions de contournement fonctionnelles ou d'utiliser notre puissant &eacute;cosyst&egrave;me des <a href="../fr/Macros.html" title="Macros/fr">macros</a>, mais dans la plupart des cas, vous serez en mesure d'obtenir ce que vous voulez. Et si vous avez besoin d'aide&nbsp;: nous avons un <a rel="nofollow" class="external text" href="https://forum.freecad.org/index.php">forum</a> tr&egrave;s actif et r&eacute;actif, pr&ecirc;t &agrave; vous aider. Parmi les membres du forum, il y a forc&eacute;ment des (anciens) utilisateurs de votre programme de CAO actuel. N'h&eacute;sitez donc pas &agrave; faire appel &agrave; cette ressource.
</p><p><span id="How_can_I_contribute?"></span>
</p>
<h2><span id="Comment_puis-je_contribuer_.3F"></span><span class="mw-headline" id="Comment_puis-je_contribuer_?">Comment puis-je contribuer&nbsp;?</span></h2>
<p>Il y a plusieurs fa&ccedil;ons de le faire&nbsp;: vous pouvez faire un <a href="../fr/Donate.html" title="Donate/fr">donation</a>, aider &agrave; r&eacute;pondre aux questions du <a rel="nofollow" class="external text" href="https://forum.freecad.org/index.php">forum</a>, ou &eacute;crire de la documentation ou du code. Voir <a href="../fr/Help_FreeCAD.html" title="Help FreeCAD/fr">Contribuer &agrave; FreeCAD</a>.
</p><p><span id="Learning_resources"></span>
</p>
<h2><span id="Ressources_p.C3.A9dagogiques"></span><span class="mw-headline" id="Ressources_p&eacute;dagogiques">Ressources p&eacute;dagogiques</span></h2>
<p><span id="Official"></span>
</p>
<h3><span class="mw-headline" id="Officielles">Officielles</span></h3>
<div class="mw-translate-fuzzy">
<ul><li><a href="../fr/Main_Page.html" title="Main Page/fr">Ce wiki</a></li>
<li><a rel="nofollow" class="external text" href="https://forum.freecadweb.org/viewforum.php?f=3">Le forum d'aide</a></li>
<li><a href="../fr/Workarounds.html" title="Workarounds/fr">Solutions de contournement pour les probl&egrave;mes connus</a></li></ul>
</div>
<p><span id="Un-official"></span>
</p>
<h3><span class="mw-headline" id="Non_officielles">Non officielles</span></h3>
<p>Les cha&icirc;nes YouTube suivantes ont un contenu d'assez bonne qualit&eacute; centr&eacute; sur FreeCAD (il est recommand&eacute; d'ignorer les tutoriels bas&eacute;s sur la version 0.17 ou ant&eacute;rieure)&nbsp;:
</p>
<ul><li><i>MangoJelly Solutions</i> (plusieurs listes de lecture de vid&eacute;os pour d&eacute;butants, interm&eacute;diaires et avanc&eacute;s).</li>
<li><i>Joko EngineeringHelp</i> (vid&eacute;os interm&eacute;diaires/avanc&eacute;es)</li>
<li><i>Brodie Fairhall</i> (Quelques vid&eacute;os aidant les utilisateurs de Fusion 360 &agrave; passer &agrave; FreeCAD)</li>
<li>Et plus encore...</li></ul>
<p><span id="Questions_and_answers"></span>
</p>
<h2><span id="Questions_et_r.C3.A9ponses"></span><span class="mw-headline" id="Questions_et_r&eacute;ponses">Questions et r&eacute;ponses</span></h2>
<p><span id='"Can_FreeCAD_do_XYZ?"'></span>
</p>
<h3><span id=".22FreeCAD_peut-il_faire_XYZ_.3F.22"></span><span class="mw-headline" id='"FreeCAD_peut-il_faire_XYZ_?"'>"FreeCAD peut-il faire XYZ&nbsp;?"</span></h3>
<p>FreeCAD permet d&eacute;j&agrave; d'effectuer les types de travaux suivants&nbsp;:
</p>
<ul><li>Mod&eacute;lisation param&eacute;trique bas&eacute;e sur des splines &agrave; l'aide des ateliers <a href="../fr/Part_Workbench.html" title="Part Workbench/fr">Part</a>, <a href="../fr/PartDesign_Workbench.html" title="PartDesign Workbench/fr">PartDesign</a> et <a href="../fr/Sketcher_Workbench.html" title="Sketcher Workbench/fr">Sketcher</a>.</li>
<li>Mod&eacute;lisation de surfaces et de courbes &agrave; l'aide de NURBS</li>
<li>Importation/modification de <a href="../fr/Mesh_Workbench.html" title="Mesh Workbench/fr">maillages</a></li>
<li>Simulation d'assemblage (3 approches diff&eacute;rentes, <a href="../fr/A2plus_Workbench.html" title="A2plus Workbench/fr">A2+</a>, <a href="../fr/Assembly3_Workbench.html" title="Assembly3 Workbench/fr">ASM3</a>, et <a href="../fr/Assembly4_Workbench.html" title="Assembly4 Workbench/fr">ASM4</a>, sont toutes activement d&eacute;velopp&eacute;es)</li>
<li>Conception <a href="../fr/BIM_Workbench.html" title="BIM Workbench/fr">BIM</a></li>
<li>Analyse des contraintes m&eacute;caniques (<a href="../fr/FEM_Workbench.html" title="FEM Workbench/fr">FEM/FEA</a>)</li>
<li>Analyse num&eacute;rique de la dynamique des fluides (<a href="../fr/Cfd_Workbench.html" title="Cfd Workbench/fr">CFD</a>)</li>
<li><a href="../fr/TechDraw_Workbench.html" title="TechDraw Workbench/fr">Dessins techniques</a>/<a href="../fr/Draft_Workbench.html" title="Draft Workbench/fr">Dessin</a></li>
<li>Et d'autres <a href="../fr/Workbenches.html" title="Workbenches/fr">ateliers</a> et <a href="../fr/External_workbenches.html" title="External workbenches/fr">ateliers externes</a>...</li></ul>
<p><span id='"User_interface_(UI/UX)_is_ugly,_odd,_confusing_or_not_like_XYZ_Software!"'></span>
</p>
<h3><span id=".22L.27interface_utilisateur_.28UI.2FUX.29_est_laide.2C_.C3.A9trange.2C_d.C3.A9routante_ou_ne_ressemble_pas_au_logiciel_XYZ_.21.22"></span><span class="mw-headline" id="&quot;L'interface_utilisateur_(UI/UX)_est_laide,_&eacute;trange,_d&eacute;routante_ou_ne_ressemble_pas_au_logiciel_XYZ_!&quot;">"L'interface utilisateur (UI/UX) est laide, &eacute;trange, d&eacute;routante ou ne ressemble pas au logiciel XYZ&nbsp;!"</span></h3>
<p>FreeCAD permet une <a href="../fr/Interface_Customization.html" title="Interface Customization/fr">personnalisation &eacute;tendue</a> de l'interface utilisateur. Bien que nous soyons conscients que les couleurs ou la disposition des &eacute;l&eacute;ments par d&eacute;faut peuvent ne pas plaire &agrave; tout le monde, nous vous encourageons &agrave; les adapter &agrave; vos propres besoins et flux de travail. Si vous pensez avoir trouv&eacute; un arrangement/un th&egrave;me/des barres d'outils personnalis&eacute;es populaires, etc., n'h&eacute;sitez pas &agrave; tirer parti de la fonctions des <a href="../fr/Preference_Packs.html" title="Preference Packs/fr">kits de pr&eacute;f&eacute;rence|</a> r&eacute;cemment ajout&eacute;e et &agrave; la partager avec la communaut&eacute;. Peut-&ecirc;tre vos efforts aideront-ils quelqu'un d'autre dans sa transition vers FreeCAD. Les logiciels libres prosp&egrave;rent gr&acirc;ce &agrave; toutes sortes de contributions de la communaut&eacute; et c'est un sujet de discussion courant.
</p><p><span id="&quot;Why_doesn't_this_feature_work_like_in_XYZ_software?&quot;"></span>
</p>
<h3><span id=".22Pourquoi_cette_fonctionnalit.C3.A9_ne_fonctionne-t-elle_pas_comme_dans_le_logiciel_XYZ_.3F.22"></span><span class="mw-headline" id='"Pourquoi_cette_fonctionnalit&eacute;_ne_fonctionne-t-elle_pas_comme_dans_le_logiciel_XYZ_?"'>"Pourquoi cette fonctionnalit&eacute; ne fonctionne-t-elle pas comme dans le logiciel XYZ&nbsp;?"</span></h3>
<p>FreeCAD a un historique de d&eacute;veloppement qui s'&eacute;tend sur plus de <a href="../fr/History.html" title="History/fr">20 ans</a>. Les fonctions et les comportements sont fortement revus, d&eacute;battus et &eacute;valu&eacute;s avant d'&ecirc;tre ajout&eacute;s ou modifi&eacute;s. Ayez l'esprit ouvert, m&ecirc;me si cela n'est pas &eacute;vident, il y a probablement une tr&egrave;s bonne raison derri&egrave;re ces choses. Cela ne veut pas dire que FreeCAD est parfait, mais consid&eacute;rez que ce &agrave; quoi vous vous &ecirc;tes habitu&eacute; n'est peut-&ecirc;tre pas la seule ou la meilleure fa&ccedil;on de faire quelque chose.
</p><p><span id="&quot;I_can't_figure_out_the_workflow_of_FreeCAD!&quot;"></span>
</p>
<h3><span id=".22Je_n.27arrive_pas_.C3.A0_comprendre_le_flux_de_travail_de_FreeCAD_.21.22"></span><span class="mw-headline" id="&quot;Je_n'arrive_pas_&agrave;_comprendre_le_flux_de_travail_de_FreeCAD_!&quot;">"Je n'arrive pas &agrave; comprendre le flux de travail de FreeCAD&nbsp;!"</span></h3>
<p>La philosophie de FreeCAD est de ne pas dicter "comment" vous l'utilisez. Il fournit plut&ocirc;t des outils et un large &eacute;ventail d'options qui vous permettent de les utiliser. Cela signifie deux choses. Premi&egrave;rement, le logiciel ne va pas n&eacute;cessairement vous "guider" ou vous "orienter" vers un certain style ou flux de travail. Deuxi&egrave;mement, cela signifie que vous pouvez exp&eacute;rimenter avec les outils et trouver ce qui fonctionne le mieux pour vous. Cela ne veut pas dire qu'il n'y a pas de <a href="../fr/Feature_editing.html" title="Feature editing/fr">"meilleures pratiques"</a> g&eacute;n&eacute;rales &agrave; garder &agrave; l'esprit en utilisant FreeCAD, mais ces meilleures pratiques s'appliquent g&eacute;n&eacute;ralement &agrave; tout logiciel de conception professionnel lors de la cr&eacute;ation de mod&egrave;les stables.
</p><p><span id='"What_the_heck_is_with_all_these_workbenches?"'></span>
</p>
<h3><span id=".22C.27est_quoi_ce_bordel_avec_tous_ces_ateliers_.3F.22"></span><span class="mw-headline" id="&quot;C'est_quoi_ce_bordel_avec_tous_ces_ateliers_?&quot;">"C'est quoi ce bordel avec tous ces ateliers&nbsp;?"</span></h3>
<p>L'une des puissantes fonctions de FreeCAD est sa modularit&eacute;. Ceci est r&eacute;alis&eacute; en compartimentant le d&eacute;veloppement des outils dans des ateliers. Une fois que vous &ecirc;tes familiaris&eacute; avec les outils fournis, ils peuvent souvent travailler en synergie pour cr&eacute;er des mod&egrave;les tr&egrave;s complexes et avanc&eacute;s. Une excellente analogie est que FreeCAD est structur&eacute; comme un coffre &agrave; outils roulant de m&eacute;canicien, et que chaque atelier est un tiroir d'outils sp&eacute;cifiques. Vous pouvez utiliser ces outils pour construire une voiture, mais c'est au m&eacute;canicien de comprendre comment les utiliser pour atteindre son objectif.
</p><p><span id='"FreeCAD_is_fundamentally_broken,_my_models_blow-up!"'></span>
</p>
<h3><span id=".22FreeCAD_est_totalement_cass.C3.A9.2C_mes_mod.C3.A8les_explosent_.21.22"></span><span class="mw-headline" id='"FreeCAD_est_totalement_cass&eacute;,_mes_mod&egrave;les_explosent_!"'>"FreeCAD est totalement cass&eacute;, mes mod&egrave;les explosent&nbsp;!"</span></h3>
<p>FreeCAD est construit autour d'un noyau de mod&eacute;lisation g&eacute;om&eacute;trique open-source appel&eacute; "<a href="../fr/OpenCASCADE.html" title="OpenCASCADE/fr">OpenCascade Technology</a>" (ou OCC). Il s'agit du noyau de mod&eacute;lisation open source le plus riche en fonctionnalit&eacute;s et le plus mature qui soit. Cependant, il pr&eacute;sente des bogues, des bizarreries et des limitations. L'un d'entre eux est appel&eacute; le <a href="../fr/Topological_naming_problem.html" title="Topological naming problem/fr">"Probl&egrave;me de d&eacute;nomination topologique"</a> (ou Topological Naming Problem = TNP). Chaque fois qu'un mod&egrave;le est modifi&eacute;, les noms internes des faces et des ar&ecirc;tes sont chang&eacute;s par le noyau, ce qui entra&icirc;ne un comportement ind&eacute;sirable pour toutes les fonctionnalit&eacute;s du mod&egrave;le qui y font r&eacute;f&eacute;rence. Le cycle de d&eacute;veloppement actuel est ax&eacute; sur l'impl&eacute;mentation d'un algorithme de d&eacute;nomination con&ccedil;u pour att&eacute;nuer cet effet dans la plupart des circonstances. Cependant, soyez conscient que l'att&eacute;nuation du TNP ne remplace pas <a href="../fr/Feature_editing.html" title="Feature editing/fr">bonnes pratiques et techniques de mod&eacute;lisation</a>.
</p><p><span id="OpenCascade_kernel"></span>
</p>
<h2><span class="mw-headline" id="Noyau_OpenCascade">Noyau OpenCascade</span></h2>
<p>OpenCascade (OCC) est un noyau externe de CAO dont FreeCAD est totalement d&eacute;pendant. Il y a de nombreux bogues ouverts "en amont" que la communaut&eacute; FreeCAD a identifi&eacute; et suit concernant OCC. Voir&nbsp;:
</p>
<ul><li><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/issues?q=is%3Aopen+is%3Aissue+label%3A%223rd+Party%3A+OCC%22">Bugtracker</a></li>
<li><a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=20264">Bugs OCC dans le Bugtracker (fil du forum)</a></li></ul>
<p><span id="Additional_links"></span>
</p>
<h2><span id="Liens_suppl.C3.A9mentaires"></span><span class="mw-headline" id="Liens_suppl&eacute;mentaires">Liens suppl&eacute;mentaires</span></h2>
<div class="mw-translate-fuzzy">
<ul><li><a rel="nofollow" class="external text" href="https://forum.freecadweb.org/viewtopic.php?f=8&amp;t=43461">Discussion&nbsp;: FreeCAD n'est pas pr&ecirc;t pour la 1.0 (fil du forum)</a></li>
<li><a rel="nofollow" class="external text" href="https://www.youtube.com/watch?v=JBmdbipkbrk">Pourquoi l'&eacute;quipe GIMP vous d&eacute;teste manifestement* (*En fait, nous vous aimons. **Principalement)</a> Pat David de la pr&eacute;sentation de l'&eacute;quipe GIMP &agrave; SCaLE16x Californie 2016</li>
<li><a rel="nofollow" class="external text" href="https://vimeo.com/144089061">Gagner votre soutien au lieu de l'acheter&nbsp;: un guide pratique de l'assistance en mati&egrave;re de code source ouvert</a> par <a rel="nofollow" class="external text" href="https://twitter.com/ijturton">Ian Turton</a> &agrave; la conf&eacute;rence FOSS4G Seoul 2015.</li></ul>
</div>
<!-- 
NewPP limit report
Cached time: 20250705140039
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc, no&#8208;toc&#8208;conversion]
CPU time usage: 0.075 seconds
Real time usage: 0.100 seconds
Preprocessor visited node count: 109/1000000
Post&#8208;expand include size: 1284/2097152 bytes
Template argument size: 1021/2097152 bytes
Highest expansion depth: 3/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 848/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    6.876      1 -total
 69.52%    4.780      1 Template:VeryImportantMessage
 26.66%    1.833      1 Template:TOCright
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:291197-0!canonical and timestamp 20250705140039 and revision id 1602683. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>