<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Macro Wiring And Hoses/fr</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="fr" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Macro+Wiring+And+Hoses&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../Macro_Wiring_And_Hoses.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Macro Wiring And Hoses (100% translated)" lang="en" dir="ltr">English</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="fr" dir="ltr">fran&ccedil;ais</span></li>
<li><a href="../it/Macro_Wiring_And_Hoses.html" class="mw-pt-progress mw-pt-progress--low" title="Macro Cablaggio e Tubazioni (5% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Macro_Wiring_And_Hoses.html" class="mw-pt-progress mw-pt-progress--complete" title="Makrodefinicja: Okablowanie i ruroci&#261;gi (100% translated)" lang="pl" dir="ltr">polski</a></li></ul></div>
<table class="fcinfobox wikitable ct" width="100%" style="float: right; width: 230px; margin-left: 10px;">
<tbody><tr>
<td class="ctTitle" style="font-weight: bold; font-size: 125%;">
<p><span typeof="mw:File"><a href="../index.php?title=Text-x-python.png&amp;filetimestamp=20121224162851&amp;.html" class="mw-file-description" title="Generic macro icon"><img alt="Generic macro icon" src="../File/Text-x-python.png" decoding="async" width="32" height="32" class="mw-file-element"></a></span><span> </span>
Macro Wiring And Hoses
</p>
</td></tr>
<tr>
<th class="ctOdd">Description
</th></tr>
<tr>
<td class="ctEven left macro-description">Cette macro cr&eacute;e des c&acirc;bles et des tubes.<br><br>Auteur: Piffpoof<br>
</td></tr>
<tr>
<th class="ctOdd">Auteur
</th></tr>
<tr>
<td class="ctEven macro-author"><a href="../User;Piffpoof.html" title="User:Piffpoof">Piffpoof</a>
</td></tr>
<tr>
<th class="ctOdd">T&eacute;l&eacute;chargement
</th></tr>
<tr>
<td class="ctEven macro-download"><i>None</i>
</td></tr>
<tr>
<th class="ctOdd">Liens
</th></tr>
<tr>
<td class="ctEven macro-Links"><a href="../fr/Macros_recipes.html" title="Macros recipes/fr">Page des macros</a><br><a href="../fr/How_to_install_macros.html" title="How to install macros/fr">Comment installer une macro</a><br><a href="../fr/Customize_Toolbars.html" title="Customize Toolbars/fr">Comment cr&eacute;er une barre d'outils</a>
</td></tr>
<tr>
<th class="ctOdd">Version Macro
</th></tr>
<tr>
<td class="ctEven macro-version">1.0
</td></tr>
<tr>
<th class="ctOdd">Derni&egrave;re modification
</th></tr>
<tr>
<td class="ctEven macro-date"><i>None</i>
</td></tr>
<tr>
<th class="ctOdd">Version(s) FreeCAD
</th></tr>
<tr>
<td class="ctEven FreeCAD-version"><i>None</i>
</td></tr>
<tr>
<th class="ctOdd">Raccourci clavier
</th></tr>
<tr>
<td class="ctEven"><i>None</i>
</td></tr>
<tr>
<th class="ctOdd">Voir aussi
</th></tr>
<tr>
<td class="ctEven"><i>None</i>
</td></tr>
<tr>
<th class="ctOdd">
</th></tr>
<tr>
<td class="ctToc"><br><meta property="mw:PageProp/toc">
</td></tr>
</tbody></table>
<p><b>Remarque de <a href="../User;Piffpoof.html" title="User:Piffpoof">User:Piffpoof</a>: certains changements entre v 0.14 et v 0.15 ont affect&eacute; cette macro qui retardera sa publication</b>
</p><p>Ces macros prennent en charge la cr&eacute;ation et la maintenance des cables et flexibles.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Wiring_And_HosesCompletedHouse.jpg&amp;filetimestamp=20150225164901&amp;.html" class="mw-file-description"><img src="../File/Macro_Wiring_And_HosesCompletedHouse.jpg" decoding="async" width="500" height="418" class="mw-file-element"></a></span>
</p><p><span id="Background"></span>
</p>
<h2><span class="mw-headline" id="Contexte">Contexte</span></h2>
<p>Dans le cadre de nos autres projets FreeCAD, nous avions besoin d'un moyen de documenter le c&acirc;blage et les tuyaux. Cet ensemble de macros a &eacute;t&eacute; d&eacute;velopp&eacute; pour r&eacute;pondre &agrave; ce besoin. Il y a beaucoup de choses que ce syst&egrave;me ne fait pas, mais ce qu'il fait est de fournir une repr&eacute;sentation visuelle du c&acirc;blage et des tuyaux, soit en tant que syst&egrave;me isol&eacute;, soit avec le c&acirc;blage et les tuyaux dans le contexte d'un mod&egrave;le FreeCAD. L'enregistrement de tous les fils et flexibles est conserv&eacute; dans un fichier au format CSV en dehors de FreeCAD. Le fichier peut donc &ecirc;tre charg&eacute; dans un tableur ou utilis&eacute; par un autre logiciel.
</p>
<h2><span class="mw-headline" id="Description">Description</span></h2>
<p>Dans le cadre d'un projet de documentation, nous avons d&eacute;couvert que nous devions documenter les fils et les tuyaux. Nous avons essay&eacute; diff&eacute;rents sc&eacute;narios tels que la cr&eacute;ation de lignes ou de cylindres dans le cadre du mod&egrave;le existant. En raison de probl&egrave;mes d'utilisation ou de maintenance, nous avons d&eacute;cid&eacute; de conserver les informations dans un format diff&eacute;rent et en dehors de FreeCAD. De cette fa&ccedil;on, ils pourraient &ecirc;tre cr&eacute;&eacute;s seuls ou cr&eacute;&eacute;s dans un document existant. Cette d&eacute;cision a permis &agrave; l'utilisateur de travailler avec le c&acirc;blage et les tuyaux de la mani&egrave;re qui leur convenait. De plus, ils pouvaient travailler avec elle de diff&eacute;rentes mani&egrave;res &agrave; diff&eacute;rents moments selon les besoins.
</p><p>Au d&eacute;part, nous ne savions pas comment maintenir une liste de tuyaux et de fils et diverses approches ont &eacute;t&eacute; essay&eacute;es. Le moyen le plus simple semblait &ecirc;tre d'utiliser le format de fichier CSV qui existe depuis longtemps. Il y avait &eacute;galement des routines d&eacute;j&agrave; &eacute;crites pour g&eacute;rer les fichiers CSV &agrave; partir de Python. Certains des avantages &eacute;taient les suivants:
</p>
<ul><li>lisible par l'homme</li>
<li>peut &ecirc;tre charg&eacute; dans n'importe quelle feuille de calcul</li>
<li>peut &ecirc;tre maintenu &agrave; l'aide d'une feuille de calcul ou d'un simple &eacute;diteur de texte</li>
<li>une am&eacute;lioration future possible serait de l'utiliser avec l'atelier spreadsheet de FreeCAD</li></ul>
<p>Les d&eacute;cisions suivantes ont &eacute;t&eacute; "comment" d&eacute;finir de tels c&acirc;bles. Notre objectif &eacute;tant principalement la documentation, nous avons choisi d'ex&eacute;cuter des segments de ligne de point en point. Des probl&egrave;mes tels que le rayon de virage ne sont pas trait&eacute;s. Le diam&egrave;tre du c&acirc;ble n'est pas non plus manipul&eacute;. Un tableau des chemins de c&acirc;bles est conserv&eacute; dans le fichier CSV, mais des &eacute;l&eacute;ments tels que la proximit&eacute; des c&acirc;bles (pour les probl&egrave;mes d'interf&eacute;rences &eacute;lectriques) et la longueur des c&acirc;bles ne sont pas pris en charge (bien qu'il soit possible d'ajouter une longueur de c&acirc;ble rudimentaire assez facilement).
</p><p>Cet ensemble de macros est essentiellement une "d&eacute;monstration de faisabilit&eacute;". Elle d&eacute;montre quelques id&eacute;es et leur faisabilit&eacute;. Notre objectif principal &eacute;tait la documentation et non la gestion physique de l'usine. Nous avons d&eacute;cid&eacute; de maintenir une structure de donn&eacute;es de points, qui sont les points par lesquels passent les c&acirc;bles et les tuyaux. Deuxi&egrave;mement, nous avons mis en place une structure de donn&eacute;es qui d&eacute;finit les c&acirc;bles et les tuyaux en fonction des points qu'ils traversent. Un c&acirc;ble ne peut donc &ecirc;tre achemin&eacute; que l&agrave; o&ugrave; des points ont &eacute;t&eacute; d&eacute;finis pour lui.
</p><p>Pour les 2 structures de donn&eacute;es, nous avons choisi les noms suivants:
</p>
<ul><li>Nexus - un point par lequel un c&acirc;ble ou un tuyau peut passer (le pluriel est Nexi). Les Nexi ne sont que des points dans 3 espaces, pour faciliter la visualisation, le logiciel place des anneaux toro&iuml;des autour de l'emplacement, mais uniquement pour une facilit&eacute; d'utilisation. Les anneaux toro&iuml;daux peuvent &ecirc;tre d&eacute;sactiv&eacute;s ou activ&eacute;s en fonction des pr&eacute;f&eacute;rences de l'utilisateur</li>
<li>Flows (r&eacute;seaux) - g&eacute;n&eacute;riquement ce sont des routes compos&eacute;es de Nexi. Un code est associ&eacute; &agrave; chaque type, les codes par d&eacute;faut &eacute;tant
<ul><li>W - fils &eacute;lectriques</li>
<li>C - conduits, destin&eacute;s principalement aux c&acirc;bles mais peut repr&eacute;senter n'importe quoi</li>
<li>H - tuyaux pour transporter une vari&eacute;t&eacute; de liquides</li>
<li>G - conduites de gaz</li>
<li>K - un routage de cam&eacute;ra, c'est vraiment juste r&eacute;serv&eacute; pour une exploration future selon <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?f=24&amp;t=8437">Tour camera animation</a></li></ul></li></ul>
<p><br>
Nexi et Flows ont tous deux des noms attribu&eacute;s par l'utilisateur, de plus Nexi a des ID attribu&eacute;s en interne pour faciliter la gestion. Les points ou emplacements dans Nexi &agrave; 3 espaces n'ont pas de couleurs mais les Flows peuvent avoir l'une des 48 couleurs d&eacute;finies. L'accent mis sur les couleurs revient au but recherch&eacute;, celui de la documentation.
</p><p><br>
Le workflow g&eacute;n&eacute;ral est
</p>
<ul><li>d&eacute;finir et positionner Nexi</li>
<li>d&eacute;finir Flow(s) en terme de Nexi</li>
<li>&agrave; des fins de maintenance, modifiez Nexi et Flows visuellement &agrave; l'aide de l'interface graphique FreeCAD ou &agrave; l'aide d'une approche tabulaire et des d&eacute;finitions CSV</li></ul>
<p><br>
Le fichier de donn&eacute;es contenant &agrave; la fois des d&eacute;finitions Nexi et Flow est bas&eacute; sur du texte. Il peut &ecirc;tre utilis&eacute; dans n'importe quel &eacute;diteur de texte ou par tout autre programme souhaitant acc&eacute;der aux donn&eacute;es.
</p><p><br>
</p>
<h3><span class="mw-headline" id="Modes_de_navigation">Modes de navigation</span></h3>
<p>Comme une grande partie du travail avec ces macros d&eacute;pend de la manipulation de l'affichage du mod&egrave;le pour placer et v&eacute;rifier le placement du point dans 3 espaces, il est essentiel d'&ecirc;tre &agrave; l'aise avec les modes de navigation de FreeCAD qui sont document&eacute;s sur la page <a href="../fr/Mouse_navigation.html" title="Mouse navigation/fr">Navigation par la souris</a>. Il est essentiel de pouvoir faire pivoter le mod&egrave;le dans la 3-D puis d'effectuer des op&eacute;rations sur un mod&egrave;le stationnaire.
</p><p><br>
</p>
<h2><span class="mw-headline" id="Installation">Installation</span></h2>
<p>Le code pour le c&acirc;blage et les flexibles est dans plusieurs macros et une biblioth&egrave;que. L'installation consiste donc &agrave; copier le code dans le r&eacute;pertoire Macro appropri&eacute; et &agrave; appeler l'utilitaire de g&eacute;n&eacute;ration &agrave; partir du menu Macro, de la console Python ou d'un bouton de barre d'outils (la m&eacute;thode pr&eacute;f&eacute;r&eacute;e).
</p><p><br>
&lt;plus &agrave; venir&gt;
</p>
<ul><li>voir <a href="../fr/How_to_install_macros.html" title="How to install macros/fr">Comment installer les macros</a> pour plus d'informations sur l'installation de ce code de macro</li>
<li>voir <a href="../fr/Customize_Toolbars.html" title="Customize Toolbars/fr">Personnaliser les barres d'outils</a> pour plus d'informations sur l'installation en tant que bouton sur une barre d'outils</li></ul>
<h2><span class="mw-headline" id="Utilisation">Utilisation</span></h2>
<p>Il existe en r&eacute;alit&eacute; deux approches diff&eacute;rentes pour travailler avec ces macros: le nexi et les flows peuvent &ecirc;tre d&eacute;finis seuls &agrave; l'aide de leurs coordonn&eacute;es 3-D ou bien, un document FreeCAD existant peut &ecirc;tre utilis&eacute; et le nexi et les flows peuvent &ecirc;tre d&eacute;finis dans le contexte de ce document. Il ne s'agit pas d'une d&eacute;cision &laquo;l'un ou l'autre&raquo;, mais plut&ocirc;t les deux approches peuvent &ecirc;tre utilis&eacute;es lorsqu'elles sont les plus appropri&eacute;es. Comme les d&eacute;finitions du nexi et des flows sont conserv&eacute;es dans un fichier au format CSV qui est stock&eacute; en dehors de FreeCAD, la pr&eacute;sence ou l'absence d'un document FreeCAD n'affecte pas le travail avec le nexi et le flow, cela facilite la t&acirc;che en fournissant un contexte visuel. Pour cette description de l'utilisation, l'exemple utilisera un document FreeCAD pr&eacute;c&eacute;demment charg&eacute; comme contexte car il est plus facile de placer le 
</p><p><br>
L'utilisation de ces macros se d&eacute;compose vraiment en 3 sections:
</p>
<ul><li>d&eacute;finir les nexi</li>
<li>d&eacute;finir les flows</li>
<li>&eacute;ditez le fichier au format CSV pour modifier ou ajouter nexi et flows</li></ul>
<p><br>
Il existe d'autres fa&ccedil;ons d'effectuer certaines des t&acirc;ches d&eacute;crites ci-dessous et les pr&eacute;f&eacute;rences personnelles peuvent d&eacute;cider. Cet exemple appliquera le c&acirc;blage &eacute;lectrique et la plomberie d'eau froide &agrave; une maison. Notre maison vide ressemble &agrave; ceci
</p><p><br>
<span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Wiring_And_HosesEmptyHouse.jpg&amp;filetimestamp=20150225164838&amp;.html" class="mw-file-description"><img src="../File/Macro_Wiring_And_HosesEmptyHouse.jpg" decoding="async" width="500" height="440" class="mw-file-element"></a></span>
</p><p>et attend l'installation d'eau froide et d'&eacute;lectricit&eacute;. Pour des raisons d'explication, tous les &eacute;l&eacute;ments &eacute;lectriques sont en jaune et l'eau en bleu (&agrave; l'exception des 2 lavabos).
</p><p><br>
</p>
<h3><span id="D.C3.A9finir_les_Nexi"></span><span class="mw-headline" id="D&eacute;finir_les_Nexi">D&eacute;finir les Nexi</span></h3>
<p>La premi&egrave;re &eacute;tape consiste &agrave; cr&eacute;er des points dans l'espace 3-D (appel&eacute;s &laquo;nexus&raquo; ou &laquo;nexi&raquo; au pluriel). Ces points seront utilis&eacute;s dans l'&eacute;tape suivante pour d&eacute;finir un r&eacute;seau ou Flow. Nous cr&eacute;ons ces points en cliquant sur (c'est-&agrave;-dire en s&eacute;lectionnant ) une surface et en donnant ensuite un nom au nexi. Cette description consiste &agrave; d&eacute;finir le nexi pour le d&eacute;bit d'eau.
</p><p><br>
</p>
<ol><li>cliquez sur &lt;ic&ocirc;ne N&gt;</li>
<li>la bo&icirc;te de dialogue suivante appara&icirc;tra:</li></ol>
<p>&lt;screenSnapshot Do You Want to Load&gt; (Capture d'&eacute;cran que vous souhaitez charger)
Cela vous demande si vous souhaitez ouvrir et charger un document FreeCAD contenant le mod&egrave;le auquel vous souhaitez ajouter nexi et les flows. Il n'est pas n&eacute;cessaire d'en charger un mais pour cet exemple nous chargerons notre maison vide
</p>
<ol><li>s&eacute;lectionnez une surface en cliquant dessus, elle sera mise en surbrillance dans la fen&ecirc;tre Arborescence et aura une couleur indiquant sa s&eacute;lection &agrave; l'&eacute;cran.</li>
<li>cliquez sur &lt;ic&ocirc;ne N&gt;</li>
<li>la bo&icirc;te de dialogue suivante appara&icirc;tra demandant un nom pour le nouveau nexi:</li></ol>
<p>&lt;ScreenSnapshot Nexus Name&gt;
</p>
<ol><li>le nexi va maintenant &ecirc;tre d&eacute;fini. Il sera positionn&eacute; dans un espace 3-D afin qu'il soit sur la ligne du visage s&eacute;lectionn&eacute; au spectateur, positionn&eacute; juste &agrave; c&ocirc;t&eacute; du visage afin qu'il ne soit pas &agrave; l'int&eacute;rieur de l'objet. Bien que le lien ne soit peut-&ecirc;tre pas dans la position parfaite, laissez-le pour le moment car il sera modifi&eacute; ult&eacute;rieurement. Un tore (c'est-&agrave;-dire un anneau) sera affich&eacute;, il est centr&eacute; sur le point du nexus. Cet anneau est purement un outil de visualisation afin que l'emplacement du point puisse &ecirc;tre identifi&eacute;. Les anneaux de visualisation peuvent &ecirc;tre activ&eacute;s/d&eacute;sactiv&eacute;s &agrave; tout moment.</li>
<li>d&eacute;finir plus de nexi de la m&ecirc;me mani&egrave;re en donnant &agrave; chacun un nom significatif</li>
<li>cliquez sur &lt;ic&ocirc;ne N&gt;</li>
<li>la bo&icirc;te de dialogue suivante appara&icirc;tra:</li></ol>
<p>&lt;screenSnapshot Save to a File&gt;
</p>
<ol><li>r&eacute;pondez Yes pour enregistrer votre nouveau nexi</li></ol>
<p><strong>Remarque</strong>: &agrave; tout moment vous pouvez fusionner un projet existant afin d'avoir un contexte visuel
</p><p><br>
</p>
<h3><span id="D.C3.A9finir_le_Flow"></span><span class="mw-headline" id="D&eacute;finir_le_Flow">D&eacute;finir le Flow</span></h3>
<p>Une fois que les nexi ont &eacute;t&eacute; d&eacute;finis, ils peuvent &ecirc;tre utilis&eacute;s pour d&eacute;finir un Flow (r&eacute;seau). Notre maison ressemble maintenant &agrave; ceci:
</p><p>&lt;image d'une maison avec nexi mais pas de flows&gt;
</p><p>les Nexis sont d&eacute;finis pour le d&eacute;bit d'eau mais pas les Flows encore.
</p><p><br>
</p>
<ol><li>cliquez sur l'&lt;ic&ocirc;ne F&gt;</li></ol>
<p>la fen&ecirc;tre de dialogue suivante appara&icirc;t&nbsp;:
</p><p>&lt;screenSnapshot Select Nexi for Flow&gt;
</p><p><br>
Cela vous demande si vous s&eacute;lectionnez le nexi dans l'ordre dans lequel vous souhaitez qu'il cr&eacute;e votre r&eacute;seau.
</p>
<ol><li>s&eacute;lectionner le type de d&eacute;bit: fils, conduits, tuyaux, conduites de gaz</li>
<li>en utilisant la deuxi&egrave;me popup, s&eacute;lectionnez les nexi dans l'ordre que vous voulez</li></ol>
<p>&lt;screenSnapshot Selected Nexi for Flow&gt;
</p><p><br>
</p>
<ol><li>fournir un nom pour le r&eacute;seau</li>
<li>s&eacute;lectionnez une couleur pour le r&eacute;seau</li>
<li>cliquez sur OK ou sur Annuler. Si vous faites une erreur en s&eacute;lectionnant le nexi (que ce soit une commande ou en incluant un mauvais nexi), cliquez sur Annuler et red&eacute;marrez cette &eacute;tape.</li></ol>
<p>&lt;image d'une maison avec un r&eacute;seau d'eau&gt;&gt;
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_Wiring_And_HosesFlowsOnly.jpg&amp;filetimestamp=20150226104411&amp;.html" class="mw-file-description"><img src="../File/Macro_Wiring_And_HosesFlowsOnly.jpg" decoding="async" width="500" height="358" class="mw-file-element"></a></span>
</p><p><br>
</p>
<h3><span class="mw-headline" id="Modification_de_Nexi_et_des_Flows">Modification de Nexi et des Flows</span></h3>
<p>Il existe 3 fa&ccedil;ons diff&eacute;rentes de modifier nexi. Comme les r&eacute;seaux sont d&eacute;finis en termes de nexi, la modification de nexi affectera tout flux qui les inclut. Pour les attributs de flux descriptifs comme la couleur et le nom, il existe un moyen d'effectuer des modifications.
</p><p>Jusqu'&agrave; pr&eacute;sent, dans cet exemple, nous avons g&eacute;n&eacute;r&eacute; le tableau suivant:
</p><p>&lt;screenSnapshot edit table&gt;
</p><p>&lt;screenSnapshot editing Position for nexus&gt;
</p><p>&lt;screenSnapshot double-click editing of toroid&gt;
</p><p><br>
</p>
<h2><span class="mw-headline" id="Interface_utilisateur">Interface utilisateur</span></h2>
<p>L'interface utilisateur est une combinaison d'&eacute;crans personnalis&eacute;s et de parties standard de l'interface graphique FreeCAD.
</p><p>&lt;snapshot 1 defining Nexi&gt;
</p><p>&lt;snapshot 2 defining flow&gt;
</p><p>&lt;snapshot 3 editing CSV file&gt;
</p><p>&lt;snapshot 4 editing Position&gt;
</p>
<h2><span class="mw-headline" id="Options">Options</span></h2>
<p>&Agrave; l'heure actuelle, il n'y a pas vraiment d'options pour le c&acirc;blage et les tuyaux.
</p>
<h2><span class="mw-headline" id="Exemples_de_fichiers">Exemples de fichiers</span></h2>
<p>bla bla bla
</p>
<h2><span class="mw-headline" id="Remarques">Remarques</span></h2>
<p>blah blah blah
</p>
<h2><span id="Probl.C3.A8mes_connus"></span><span class="mw-headline" id="Probl&egrave;mes_connus">Probl&egrave;mes connus</span></h2>
<p>bla bla bla
</p>
<h2><span id="Possibilit.C3.A9s_futures"></span><span class="mw-headline" id="Possibilit&eacute;s_futures">Possibilit&eacute;s futures</span></h2>
<p>bla bla bla
</p>
<h2><span class="mw-headline" id="Glossaire">Glossaire</span></h2>
<p>blah blah blah
</p>
<h2><span class="mw-headline" id="Liens">Liens</span></h2>
<p>blah blah blah
</p>
<h2><span class="mw-headline" id="Script">Script</span></h2>
<p>blah blah blah
</p>
<div style="clear:both"></div>
<!-- 
NewPP limit report
Cached time: 20250713102833
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.032 seconds
Real time usage: 0.048 seconds
Preprocessor visited node count: 120/1000000
Post&#8208;expand include size: 1693/2097152 bytes
Template argument size: 141/2097152 bytes
Highest expansion depth: 7/100
Expensive parser function count: 2/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1064/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    4.108      1 -total
 75.41%    3.098      1 Template:Macro/fr
 21.08%    0.866      1 Template:Clear
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:62255-0!canonical and timestamp 20250713102833 and revision id 1611665. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>