<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Macro Heat Flow Convection Conduction/fr</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="fr" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Macro+Heat+Flow+Convection+Conduction&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/Macro_Heat_Flow_Convection_Conduction.html" class="mw-pt-progress mw-pt-progress--complete" title="Makro W&auml;rmestr&ouml;mung Konvektion W&auml;rmeleitung (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Macro_Heat_Flow_Convection_Conduction.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Macro Heat Flow Convection Conduction (100% translated)" lang="en" dir="ltr">English</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--high" lang="fr" dir="ltr">fran&ccedil;ais</span></li></ul></div>
<table class="fcinfobox wikitable ct" width="100%" style="float: right; width: 230px; margin-left: 10px;">
<tbody><tr>
<td class="ctTitle" style="font-weight: bold; font-size: 125%;">
<p><span typeof="mw:File"><a href="../index.php?title=Text-x-python.png&amp;filetimestamp=20121224162851&amp;.html" class="mw-file-description" title="Generic macro icon"><img alt="Generic macro icon" src="../File/Text-x-python.png" decoding="async" width="32" height="32" class="mw-file-element" data-file-width="48" data-file-height="48"></a></span><span> </span>
Macro Flux thermique Convection Conduction
</p>
</td></tr>
<tr>
<th class="ctOdd">Description
</th></tr>
<tr>
<td class="ctEven left macro-description">Cette macro calcule le flux thermique dans une direction due &agrave; la convection et (ou) &agrave; la conduction, lorsque le ph&eacute;nom&egrave;ne est en &eacute;tat stationnaire. Elle calcule &eacute;galement les temp&eacute;ratures entre les couches des mat&eacute;riaux.<br><br>Version macro&nbsp;: 0.0.2<br>Date derni&egrave;re modification&nbsp;: 14/09/2025<br>Version FreeCAD&nbsp;: Toutes<br>T&eacute;l&eacute;chargement&nbsp;: <a rel="nofollow" class="external text" href="https://www.freecadweb.org/wiki/images/2/2c/Text-x-python.png">Text-x-python.png</a><br>Auteur: Garlic<br>
</td></tr>
<tr>
<th class="ctOdd">Auteur
</th></tr>
<tr>
<td class="ctEven macro-author"><a href="../index.php?title=User;Garlic&amp;action=edit&amp;redlink=1.html" class="new" title="User:Garlic (page does not exist)">Garlic</a>
</td></tr>
<tr>
<th class="ctOdd">T&eacute;l&eacute;chargement
</th></tr>
<tr>
<td class="ctEven macro-download"><a rel="nofollow" class="external text" href="https://www.freecadweb.org/wiki/images/2/2c/Text-x-python.png">Text-x-python.png</a>
</td></tr>
<tr>
<th class="ctOdd">Liens
</th></tr>
<tr>
<td class="ctEven macro-Links"><a rel="nofollow" class="external text" href="https://git.disroot.org/CrowdDiscussesAlternatives/ScriptsForFreeCAD/src/branch/master/Thermal/HeatFlowConvectionConduction_documentation.pdf">Documentation sur le flux thermique, la convection et la conduction</a><br><a href="../fr/Macros_recipes.html" title="Macros recipes/fr">Page des macros</a><br><a href="../fr/How_to_install_macros.html" title="How to install macros/fr">Comment installer une macro</a><br><a href="../fr/Customize_Toolbars.html" title="Customize Toolbars/fr">Comment cr&eacute;er une barre d'outils</a>
</td></tr>
<tr>
<th class="ctOdd">Version Macro
</th></tr>
<tr>
<td class="ctEven macro-version">0.0.2
</td></tr>
<tr>
<th class="ctOdd">Derni&egrave;re modification
</th></tr>
<tr>
<td class="ctEven macro-date">14/09/2025
</td></tr>
<tr>
<th class="ctOdd">Version(s) FreeCAD
</th></tr>
<tr>
<td class="ctEven FreeCAD-version">Toutes
</td></tr>
<tr>
<th class="ctOdd">Raccourci clavier
</th></tr>
<tr>
<td class="ctEven"><i>None</i>
</td></tr>
<tr>
<th class="ctOdd">Voir aussi
</th></tr>
<tr>
<td class="ctEven"><i>None</i>
</td></tr>
<tr>
<th class="ctOdd">
</th></tr>
<tr>
<td class="ctToc"><br><meta property="mw:PageProp/toc">
</td></tr>
</tbody></table>
<h2><span class="mw-headline" id="Description">Description</span></h2>
<p>Il s'agit d'un algorithme qui calcule le flux thermique d&ucirc; &agrave; la conduction et/ou &agrave; la convection dans une seule direction (par exemple, un mur compos&eacute; de plusieurs couches de mat&eacute;riaux tels que du pl&acirc;tre, des briques et de l'isolant, ou une fen&ecirc;tre &agrave; double vitrage avec une cavit&eacute; remplie d'air, etc.). Le ph&eacute;nom&egrave;ne doit &ecirc;tre en &eacute;tat stationnaire (c'est-&agrave;-dire non variable dans le temps).
</p><p>Les donn&eacute;es doivent &ecirc;tre saisies dans un tableur dans <a rel="nofollow" class="external text" href="https://freecad.org">FreeCAD</a> et les r&eacute;sultats sont &eacute;crits dans le m&ecirc;me tableur, quelques lignes en dessous de la derni&egrave;re ligne &eacute;crite. Ces donn&eacute;es d'entr&eacute;e doivent inclure (dans un ordre sp&eacute;cifique) les propri&eacute;t&eacute;s thermiques des mat&eacute;riaux des couches dans lesquelles le flux thermique se produit, l'&eacute;paisseur de chaque couche, la surface, la temp&eacute;rature du premier et du dernier point dans la direction du flux thermique, le type de ph&eacute;nom&egrave;ne dans chaque couche (par exemple <a rel="nofollow" class="external text" href="https://fr.wikipedia.org/wiki/Conduction_thermique">conduction</a>, ou <a rel="nofollow" class="external text" href="https://fr.wikipedia.org/wiki/Convection">convection</a> forc&eacute;e, ou convection libre sur une surface horizontale, verticale, inclin&eacute;e ou dans une cavit&eacute; ferm&eacute;e). Les r&eacute;sultats sont le d&eacute;bit thermique (en watts), la pr&eacute;cision relative des calculs (l'algorithme utilise des &eacute;quations de flux thermique et r&eacute;sout le probl&egrave;me par it&eacute;rations, en essayant de converger) et les temp&eacute;ratures calcul&eacute;es des deux surfaces sur chaque couche.
</p>
<h2><span class="mw-headline" id="Installation">Installation</span></h2>
<p>Notez que vous ne devez effectuer les &eacute;tapes suivantes qu'une seule fois&nbsp;:
</p>
<ol><li>Dans le menu de FreeCAD, allez dans <b>Macro &rarr; Macros...</b>.</li>
<li>Recherchez le chemin d'acc&egrave;s indiqu&eacute; dans le champ <b>"Emplacement des macros de l'utilisateur&nbsp;:"</b></li>
<li>Ouvrez ce dossier &agrave; l'aide de l'explorateur de fichiers (ou de toute autre application de gestion de fichiers).</li>
<li>T&eacute;l&eacute;chargez les fichiers <b>HeatFlowConvectionConduction.py</b>, <b>Thermal.py</b> et <b>SpreadsheetDataReadWrite.py</b> depuis <a rel="nofollow" class="external free" href="https://git.disroot.org/CrowdDiscussesAlternatives/ScriptsForFreeCAD/src/branch/master/Thermal">https://git.disroot.org/CrowdDiscussesAlternatives/ScriptsForFreeCAD/src/branch/master/Thermal</a> et collez-les dans ce dossier.</li>
<li><span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">Fermer</span> la bo&icirc;te de dialogue <a href="../fr/Std_DlgMacroExecute.html" title="Std DlgMacroExecute/fr">Ex&eacute;cuter la macro</a>.</li></ol>
<p><a href="../fr/How_to_install_macros.html" title="How to install macros/fr">Ici</a>, vous trouverez plus d'informations sur la mani&egrave;re d'installer manuellement des macros.
</p><p><span id="Usage"></span>
</p>
<h2><span class="mw-headline" id="Utilisation">Utilisation</span></h2>
<p>Les exemples suivants montrent comment utiliser ce script.
</p><p><span id="Example_1"></span>
</p>
<h3><span class="mw-headline" id="Exemple_1">Exemple 1</span></h3>
<p>Dans cet exemple, le d&eacute;bit thermique qui traverse une fen&ecirc;tre &agrave; double vitrage est calcul&eacute;. On sait que la temp&eacute;rature ambiante &agrave; l'int&eacute;rieur de la pi&egrave;ce est de 25 &deg;C et que la temp&eacute;rature ambiante &agrave; l'ext&eacute;rieur de la fen&ecirc;tre est de 10 &deg;C. La fen&ecirc;tre mesure 0.57 m de haut et 0.43 m de large (soit une surface de 0.2451 m<sup>2</sup>). L'&eacute;paisseur de chaque vitre est de 4 mm (soit 0.004 m) et l'espace entre les deux vitres est de 16 mm.
</p><p>Pour utiliser l'algorithme, ouvrez d'abord l'application FreeCAD. Ensuite, s&eacute;lectionnez le <a href="../fr/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/fr">atelier Spreadsheet</a>, cr&eacute;ez un nouveau <span typeof="mw:File"><a href="../index.php?title=Std_New.svg&amp;filetimestamp=20240528091658&amp;.html" class="mw-file-description"><img src="../File/Std_New.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../fr/Std_New.html" title="Std New/fr">document</a> et, apr&egrave;s cela, cr&eacute;ez une nouvelle <span typeof="mw:File"><a href="../index.php?title=Spreadsheet_CreateSheet.svg&amp;filetimestamp=20240527155333&amp;.html" class="mw-file-description"><img src="../File/Spreadsheet_CreateSheet.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../fr/Spreadsheet_CreateSheet.html" title="Spreadsheet CreateSheet/fr">feuille de calcul</a>.
</p><p><span id="Input_data"></span>
</p>
<h3><span id="Donn.C3.A9es_d.27entr.C3.A9e"></span><span class="mw-headline" id="Donn&eacute;es_d'entr&eacute;e">Donn&eacute;es d'entr&eacute;e</span></h3>
<p>L'algorithme recherche la premi&egrave;re colonne du tableur afin de trouver le premier nombre. Lorsqu'il le trouve, il suppose qu'il s'agit de l'identifiant de la premi&egrave;re couche. Il recherche ensuite l'identifiant de la deuxi&egrave;me couche. Si cinq lignes cons&eacute;cutives ne contiennent pas de nombre dans la premi&egrave;re colonne, il suppose qu'il n'y a pas d'autres couches. Les lignes situ&eacute;es entre les donn&eacute;es des couches peuvent &ecirc;tre utilis&eacute;es pour &eacute;crire les unit&eacute;s, les commentaires, etc. Les propri&eacute;t&eacute;s de chaque couche doivent &ecirc;tre &eacute;crites dans un ordre sp&eacute;cifique.
</p><p>Pour cet exemple, les donn&eacute;es du tableur peuvent &ecirc;tre &eacute;crites comme illustr&eacute; dans l'image ci-dessous.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=HeatFlowConvectionConduction_Macro_Example1_InputData.png&amp;filetimestamp=20251102065941&amp;.html" class="mw-file-description"><img src="../File/HeatFlowConvectionConduction_Macro_Example1_InputData.png" decoding="async" width="1039" height="298" class="mw-file-element" data-file-width="1039" data-file-height="298"></a></span>
</p><p>La ligne 4 contient les donn&eacute;es de la couche dont l'identifiant est 1. Il s'agit de la couche dans laquelle se produit la convection entre l'air ambiant &agrave; l'ext&eacute;rieur de la fen&ecirc;tre et la surface ext&eacute;rieure du vitrage ext&eacute;rieur de la fen&ecirc;tre. <b>Les unit&eacute;s des donn&eacute;es sont exprim&eacute;es en <a rel="nofollow" class="external text" href="https://fr.wikipedia.org/wiki/Syst%C3%A8me_international_d%27unit%C3%A9s">S.I.</a></b> (syst&egrave;me m&eacute;trique).
</p><p>Temp. 1 est la temp&eacute;rature ambiante ext&eacute;rieure, en kelvins (qui est connue&nbsp;: 10 &deg;C + 273,15 = 283,15 K).
</p><p>Temp. 2 est la temp&eacute;rature de la surface ext&eacute;rieure du verre ext&eacute;rieur et est estim&eacute;e approximativement &agrave; 286,15 K. Il s'agit d'une valeur initiale permettant au solveur de d&eacute;marrer la premi&egrave;re it&eacute;ration. Cette temp&eacute;rature sera calcul&eacute;e et pr&eacute;sent&eacute;e dans les r&eacute;sultats. Afin d'estimer une valeur initiale, nous avons utilis&eacute; l'&eacute;quation suivante&nbsp;: (25 - 10) / 5 = 3, o&ugrave; 25 &deg;C est la temp&eacute;rature int&eacute;rieure, 10 &deg;C est la temp&eacute;rature ext&eacute;rieure et 5 est le nombre de couches. Nous avons donc ajout&eacute; 3 &agrave; 283,15 K.
</p><p>0,2451 m<sup>2</sup> est la superficie de la fen&ecirc;tre.
</p><p>2 est le nombre qui sp&eacute;cifie la cat&eacute;gorie <i>&laquo;&nbsp;convection libre sur une surface inclin&eacute;e ou verticale&nbsp;&raquo;</i> (en tant que m&eacute;canisme de transfert thermique dans cette couche).
</p><p>101325 Pa correspond &agrave; la pression atmosph&eacute;rique au niveau de la mer.
</p><p>0,7 (70&nbsp;% / 100) correspond &agrave; l'humidit&eacute; relative de l'air ambiant ext&eacute;rieur.
</p><p>0,57 m est la longueur caract&eacute;ristique (pour une convection libre sur un plan vertical, la longueur caract&eacute;ristique correspond &agrave; la hauteur du plan).
</p><p>0 degr&eacute; est l'angle entre le plan et la verticale.
</p><p><b>Notez que pour que l'algorithme puisse comprendre les donn&eacute;es, celles-ci doivent &ecirc;tre &eacute;crites dans l'ordre ci-dessus</b> (sans cellules vides entre elles), lorsque le m&eacute;canisme de transfert thermique est une convection libre sur un plan vertical.
</p><p>La ligne 7 contient les donn&eacute;es relatives &agrave; la couche sur laquelle la conduction se produit sur le verre ext&eacute;rieur de la fen&ecirc;tre. 2 est l'identifiant de cette couche.
</p><p>Temp. 1 est la temp&eacute;rature de la surface ext&eacute;rieure du verre ext&eacute;rieur et est estim&eacute;e approximativement &agrave; 286,15 K (elle doit avoir la m&ecirc;me valeur que la temp. 2 de la couche pr&eacute;c&eacute;dente, puisqu'elle se r&eacute;f&egrave;re &agrave; la m&ecirc;me surface).
</p><p>Temp. 2 est la temp&eacute;rature de la surface interne du verre ext&eacute;rieur (c'est-&agrave;-dire la surface en contact avec l'air emprisonn&eacute; entre les deux verres) et est estim&eacute;e approximativement &agrave; 289,15 K (la temp&eacute;rature pr&eacute;c&eacute;dente plus 3 K). Cette temp&eacute;rature sera calcul&eacute;e par le solveur.
</p><p>0,2451 m<sup>2</sup> est la superficie de la fen&ecirc;tre.
</p><p>1 est le nombre qui sp&eacute;cifie la cat&eacute;gorie de <i>&laquo;&nbsp;conduction&nbsp;&raquo;</i> (en tant que m&eacute;canisme de transfert thermique dans cette couche).
</p><p>0,96 W/(m &times; K) est la conductivit&eacute; thermique du verre <a rel="nofollow" class="external autonumber" href="https://www.engineeringtoolbox.com/thermal-conductivity-d_429.html">[1]</a>. Il existe divers tableaux sur Internet qui r&eacute;pertorient les propri&eacute;t&eacute;s thermiques des mat&eacute;riaux les plus courants. Vous pouvez &eacute;galement utiliser l'<a href="../fr/Material_Workbench.html" title="Material Workbench/fr">atelier Material</a> pour afficher les propri&eacute;t&eacute;s d'un <a href="../fr/Std_SetMaterial.html" title="Std SetMaterial/fr">mat&eacute;riau</a>.
</p><p>0,004 m est l'&eacute;paisseur du verre.
</p><p>L'ordre ci-dessus est celui dans lequel les donn&eacute;es doivent &ecirc;tre inscrites sur la feuille de calcul, en ce qui concerne la conduction.
</p><p>La ligne 10 contient les donn&eacute;es relatives &agrave; la couche d'air emprisonn&eacute;e entre les deux verres. 3 est l'identifiant de cette couche.
</p><p>289,15 K est la temp&eacute;rature approximative de la surface interne du verre ext&eacute;rieur.
</p><p>292,15 K est la temp&eacute;rature approximative de la surface oppos&eacute;e qui enferme l'air (c'est-&agrave;-dire la surface de l'autre vitre en contact avec l'air emprisonn&eacute;). Cette temp&eacute;rature sera &eacute;galement calcul&eacute;e par le solveur.
</p><p>0,2451 m<sup>2</sup> est la superficie de la fen&ecirc;tre.
</p><p>4 est le nombre qui sp&eacute;cifie la cat&eacute;gorie de <i>&laquo;&nbsp;convection libre dans une enceinte&nbsp;&raquo;</i> (en tant que m&eacute;canisme de transfert thermique dans cette couche). Notez que l'ensemble d'&eacute;quations de l'algorithme (pour ce cas) ne convient qu'aux petits espaces, similaires &agrave; l'espace dans une fen&ecirc;tre &agrave; double vitrage (c'est-&agrave;-dire inf&eacute;rieur &agrave; 0,05 m) <a rel="nofollow" class="external autonumber" href="https://iopscience.iop.org/article/10.1088/1757-899X/939/1/012049/pdf">[2]</a>.
</p><p>101325 Pa correspond &agrave; la pression atmosph&eacute;rique au niveau de la mer.
</p><p>0,2 (20&nbsp;% / 100) correspond &agrave; l'humidit&eacute; relative de l'air confin&eacute;.
</p><p>0,016 m est la longueur caract&eacute;ristique (pour une convection libre dans une enceinte, la longueur caract&eacute;ristique correspond &agrave; l'&eacute;paisseur de l'espace d'air, c'est-&agrave;-dire la distance entre les deux vitres).
</p><p>La ligne 13 contient les donn&eacute;es de la couche avec l'identifiant 4, qui concerne la conduction (cat&eacute;gorie 1) qui se produit au niveau du deuxi&egrave;me vitrage de la fen&ecirc;tre.
</p><p>La ligne 16 contient les donn&eacute;es de la couche avec l'identifiant 5, qui concerne la convection libre (cat&eacute;gorie 2) qui se produit &agrave; la surface du deuxi&egrave;me vitrage de la fen&ecirc;tre en contact avec l'air ambiant de la pi&egrave;ce. Notez que la temp&eacute;rature 2 de cette couche est de 298,15 K, soit 25 &deg;C (valeur donn&eacute;e dans cet exemple).
</p><p>Notez que les &eacute;quations utilis&eacute;es sont valables pour une plage de valeurs concernant les donn&eacute;es d'entr&eacute;e (les commentaires dans le script <a rel="nofollow" class="external text" href="https://git.disroot.org/CrowdDiscussesAlternatives/ScriptsForFreeCAD/src/branch/master/Thermal/Thermal.py">Thermal.py</a> pr&eacute;cisent ces plages). <b>Si ces plages sont d&eacute;pass&eacute;es, des avertissements (ou des erreurs) s'affichent dans la <a href="../fr/Python_Console.html" title="Python Console/fr">console Python</a> de FreeCAD.</b>
</p><p><span id="Executing_the_script"></span>
</p>
<h4><span id="Ex.C3.A9cution_du_script"></span><span class="mw-headline" id="Ex&eacute;cution_du_script">Ex&eacute;cution du script</span></h4>
<p>Pour que l'algorithme fonctionne, vous devez ouvrir la <a href="../fr/Python_Console.html" title="Python Console/fr">console Python</a> dans FreeCAD et ex&eacute;cuter le code ci-dessous (c'est-&agrave;-dire copier-coller chaque ligne du code ci-dessous s&eacute;par&eacute;ment et appuyer &agrave; chaque fois sur <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">Entr&eacute;e</span>).
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="kn">import</span> <span class="nn">HeatFlowConvectionConduction</span>
<span class="n">heatFlowObj</span> <span class="o">=</span> <span class="n">HeatFlowConvectionConduction</span><span class="o">.</span><span class="n">HeatFlowConvectionConduction</span><span class="p">()</span>
<span class="n">heatFlowObj</span><span class="o">.</span><span class="n">calcHeatFlowConvectionConduction</span><span class="p">()</span>
</pre></div>
<p>Notez qu'une fois FreeCAD ouvert, vous devez copier-coller les deux premi&egrave;res lignes de ce code une seule fois (la premi&egrave;re ligne importe le script et la deuxi&egrave;me ligne cr&eacute;e un objet). Ensuite, chaque fois que vous souhaitez ex&eacute;cuter l'algorithme du script (afin de lire les donn&eacute;es de la feuille de calcul, lancer le solveur et pr&eacute;senter les r&eacute;sultats), il suffit de copier-coller la troisi&egrave;me ligne du code ci-dessus, puis d'appuyer sur <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">Entr&eacute;e</span>.
</p><p>Les r&eacute;sultats sont inscrits dans la m&ecirc;me feuille de calcul, trois lignes en dessous de la derni&egrave;re ligne &eacute;crite (veuillez noter que l'algorithme v&eacute;rifie uniquement si les dix premi&egrave;res colonnes de sept lignes cons&eacute;cutives sont vides et, si tel est le cas, il consid&egrave;re qu'il a trouv&eacute; &laquo;&nbsp;la derni&egrave;re ligne &eacute;crite&nbsp;&raquo;).
</p><p><span id="Results"></span>
</p>
<h4><span id="R.C3.A9sultats"></span><span class="mw-headline" id="R&eacute;sultats">R&eacute;sultats</span></h4>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=HeatFlowConvectionConduction_Macro_Example1_Results.png&amp;filetimestamp=20251102070338&amp;.html" class="mw-file-description"><img src="../File/HeatFlowConvectionConduction_Macro_Example1_Results.png" decoding="async" width="831" height="179" class="mw-file-element" data-file-width="831" data-file-height="179"></a></span>
</p><p>Le d&eacute;bit thermique est de 2,62 W. Nous avons d'abord indiqu&eacute; la temp&eacute;rature la plus basse, c'est pourquoi le signe moins dans l'image ci-dessus indique que le flux est dans la direction oppos&eacute;e (c'est-&agrave;-dire de la temp&eacute;rature la plus &eacute;lev&eacute;e vers la plus basse).
</p><p>La pr&eacute;cision relative est de 0,76&nbsp;% (le solveur de l'algorithme s'arr&ecirc;te si la pr&eacute;cision relative est inf&eacute;rieure &agrave; 5&nbsp;% ou si le nombre d'it&eacute;rations est sup&eacute;rieur &agrave; dix. Vous pouvez modifier ces limites en changeant leurs valeurs dans la fonction <code>simulate_thermal_flow</code> &agrave; l'int&eacute;rieur du script).
</p><p>Les temp&eacute;ratures de chaque couche sont calcul&eacute;es. Le reste des donn&eacute;es d'entr&eacute;e est &eacute;galement r&eacute;imprim&eacute; pour chaque couche, pour plus de clart&eacute;.
</p><p><span id="Example_2"></span>
</p>
<h3><span class="mw-headline" id="Exemple_2">Exemple 2</span></h3>
<p>Un vent d'une vitesse de 10 m/sec, d'une humidit&eacute; de 40&nbsp;% et d'une temp&eacute;rature de 10 &deg;C souffle parall&egrave;lement &agrave; la largeur d'un mur de 5 m de largeur et 3 m de hauteur, dont la surface a une temp&eacute;rature de 11&deg;C.
</p><p>Afin de calculer le d&eacute;bit thermique, nous devons saisir les donn&eacute;es dans le tableur, dans le bon ordre.
</p><p>1 est l'identifiant de la couche.
</p><p>283,15 K est la temp&eacute;rature de l'air (la temp&eacute;rature du mur aurait &eacute;galement pu &ecirc;tre indiqu&eacute;e en premier).
</p><p>284,15 K est la temp&eacute;rature &agrave; la surface du mur.
</p><p>15 m<sup>2</sup> est la superficie de la surface.
</p><p>5 sp&eacute;cifie la cat&eacute;gorie <i>&laquo;&nbsp;convection forc&eacute;e parall&egrave;le &agrave; une surface plane&nbsp;&raquo;</i>.
</p><p>101325 Pa correspond &agrave; la pression atmosph&eacute;rique au niveau de la mer.
</p><p>0,4 correspond &agrave; l'humidit&eacute; relative divis&eacute;e par 100.
</p><p>5 m est la longueur caract&eacute;ristique (pour la convection forc&eacute;e, il s'agit de la dimension de la surface parall&egrave;le &agrave; l'&eacute;coulement).
</p><p>10 m/sec est la vitesse d'&eacute;coulement.
</p><p>Les r&eacute;sultats montrent que le d&eacute;bit thermique est de 367,18 W.
</p><p><span id="Example_3"></span>
</p>
<h3><span class="mw-headline" id="Exemple_3">Exemple 3</span></h3>
<p>La surface d'une terrasse est de 50m<sup>2</sup> (10 m de long &times; 5 m de large) et sa temp&eacute;rature est de 11&deg;C. La temp&eacute;rature ambiante ext&eacute;rieure est de 10&deg;C et l'humidit&eacute; est de 50&nbsp;%.
</p><p>Afin de calculer le d&eacute;bit thermique, nous devons saisir ces donn&eacute;es dans un ordre correct.
</p><p>1 est l'identifiant de la couche.
</p><p>283,15 K est la temp&eacute;rature de l'air ambiant (c'est-&agrave;-dire la temp&eacute;rature du fluide &agrave; l'ext&eacute;rieur de la <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/Thermal_boundary_layer_thickness_and_shape">couche limite thermique</a>, en Kelvins).
</p><p>284,15 K est la temp&eacute;rature &agrave; la surface due la terrasse.
</p><p>50 m<sup>2</sup> est la superficie de la surface.
</p><p>3 sp&eacute;cifie la cat&eacute;gorie <i>&laquo;&nbsp;convection libre sur une surface horizontale&nbsp;&raquo;</i>.
</p><p>101325 Pa correspond &agrave; la pression atmosph&eacute;rique au niveau de la mer.
</p><p>0,5 correspond &agrave; l'humidit&eacute; relative divis&eacute;e par 100.
</p><p>1,67 m est la longueur caract&eacute;ristique (pour la convection libre sur une surface horizontale, il s'agit de la surface divis&eacute;e par le p&eacute;rim&egrave;tre&nbsp;: 50 / (10 + 5 + 10 + 5)). <b>Notez que pour que les donn&eacute;es soient lues correctement, vous devez &eacute;crire 1,67 dans la cellule du tableur (et non = 50 / (10 + 5 + 10 + 5)).</b>
</p><p>1 correspond &agrave; la direction de la surface. &Eacute;tant donn&eacute; que l'air se trouve au-dessus de la surface, cette entr&eacute;e doit &ecirc;tre 1. Si l'air se trouvait au-dessous de la surface (par exemple dans le cas d'un plafond), vous devriez alors inscrire -1.
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>2 is the last written data in the row, and it specifies that temp. 1 is the temperature of the air and temp. 2 is the temperature of the surface. If you had written firstly the temperature of the surface and secondly the temperature of the air, then this last entry should be 1.
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>The results show that the heat flow rate is 92.55W
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h3><span class="mw-headline" id="Simulated_cases_of_heat_transfer">Simulated cases of heat transfer</span></h3>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>The above examples cover the five cases (categories) that the algorithm in the script can calculate heat flow:
</p>
<ul><li>Category 1: Conduction.</li>
<li>Category 2: Free convection on an inclined or a vertical surface.</li>
<li>Category 3: Free convection on a horizontal surface.</li>
<li>Category 4: Free convection in an enclosure (for small gaps, similar to the gap in a double glazed window).</li>
<li>Category 5: Forced convection parallel to a flat surface.</li></ul>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h2><span class="mw-headline" id="Scripts">Scripts</span></h2>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>You can download the files HeatFlowConvectionConduction.py, Thermal.py and
SpreadsheetDataReadWrite.py from:
</p>
</div>
<p><a rel="nofollow" class="external free" href="https://git.disroot.org/CrowdDiscussesAlternatives/ScriptsForFreeCAD/src/branch/master/Thermal">https://git.disroot.org/CrowdDiscussesAlternatives/ScriptsForFreeCAD/src/branch/master/Thermal</a>
</p>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h2><span class="mw-headline" id="Links">Links</span></h2>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>The forum discussion: <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?t=99795">Presenting HeatFlowConvectionConduction macro</a>
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<p>The documentation of this script in pdf format: <a rel="nofollow" class="external text" href="https://git.disroot.org/CrowdDiscussesAlternatives/ScriptsForFreeCAD/src/branch/master/Thermal/HeatFlowConvectionConduction_documentation.pdf">Heat Flow Convection Conduction Documentation</a>
</p>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<h2><span class="mw-headline" id="References">References</span></h2>
</div>
<div lang="en" dir="ltr" class="mw-content-ltr">
<ol><li><a rel="nofollow" class="external text" href="https://www.engineeringtoolbox.com/thermal-conductivity-d_429.html">Thermal Conductivity of Common Materials - Solids, Liquids and Gases</a></li>
<li>Heat transfer through a double-glazed window by convection, V &#1040; &#1052;&#1072;i&#1086;r&#1086;v. Citation V A Maiorov 2020 IOP Conf. Ser.: Mater. Sci. Eng. 939 012049, DOI 10.1088/1757-899X/939/1/012049. <a rel="nofollow" class="external free" href="https://iopscience.iop.org/article/10.1088/1757-899X/939/1/012049/pdf">https://iopscience.iop.org/article/10.1088/1757-899X/939/1/012049/pdf</a></li>
<li>Heat Transfer Handbook, by Adrian Bejan and Allan D. Kraus</li></ol>
</div>
<!-- 
NewPP limit report
Cached time: 20251207103514
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.042 seconds
Real time usage: 0.058 seconds
Preprocessor visited node count: 190/1000000
Post&#8208;expand include size: 3950/2097152 bytes
Template argument size: 1329/2097152 bytes
Highest expansion depth: 7/100
Expensive parser function count: 3/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1542/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   11.167      1 -total
 43.47%    4.854      1 Template:Macro/fr
 18.30%    2.044      1 Template:MenuCommand
 14.19%    1.584      1 Template:Code
 10.53%    1.176      3 Template:Button
  9.77%    1.091      1 Template:Incode
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:400445-0!canonical and timestamp 20251207103514 and revision id 1712349. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>