<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Package Metadata/fr</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="fr" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Package+Metadata&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/Package_Metadata.html" class="mw-pt-progress mw-pt-progress--complete" title="Package Metadata (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Package_Metadata.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Package Metadata (100% translated)" lang="en" dir="ltr">English</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="fr" dir="ltr">fran&ccedil;ais</span></li>
<li><a href="../it/Package_Metadata.html" class="mw-pt-progress mw-pt-progress--med" title="Pacchetto Metadata (20% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Package_Metadata.html" class="mw-pt-progress mw-pt-progress--complete" title="Metadane pakietu (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../ru/Package_Metadata.html" class="mw-pt-progress mw-pt-progress--med" title="&#1052;&#1077;&#1090;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1076;&#1083;&#1103; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1055;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1081; (39% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li></ul></div>
<div style="clear:right; margin-bottom: .5em; float: right; padding: .5em 0 .8em 1.4em; background: none;"><meta property="mw:PageProp/toc"></div>
<h2><span class="mw-headline" id="Introduction">Introduction</span></h2>
<p>&Agrave; partir de la version 0.20 de FreeCAD, les extensions externes (ateliers, macros, et kits de pr&eacute;f&eacute;rences, bundles <sup><a href="../fr/Release_notes_1.1.html" title="Release notes 1.1/fr">introduit dans la version 1.1</a></sup>, et &laquo;&nbsp;autres&nbsp;&raquo; collections g&eacute;n&eacute;riques d'outils <sup><a href="../fr/Release_notes_1.1.html" title="Release notes 1.1/fr">introduit dans la version 1.1</a></sup>) peuvent &ecirc;tre distribu&eacute;s avec un fichier de m&eacute;tadonn&eacute;es d&eacute;crivant le contenu du package. Si le fichier "package.xml" est pr&eacute;sent, il est lu par FreeCAD et son contenu est utilis&eacute; dans diverses parties de l'interface utilisateur. Il est pour l'instant facultatif pour les ateliers et les macros, et obligatoire pour les kits de pr&eacute;f&eacute;rences. Cette page documente le format de ce fichier de m&eacute;tadonn&eacute;es. Le format (et le contenu de cette page Wiki) est bas&eacute; sur <a rel="nofollow" class="external text" href="https://ros.org/reps/rep-0149.html">REP 149</a>.
</p><p><span id="Overall_file_format"></span>
</p>
<h2><span id="Format_g.C3.A9n.C3.A9ral_du_fichier"></span><span class="mw-headline" id="Format_g&eacute;n&eacute;ral_du_fichier">Format g&eacute;n&eacute;ral du fichier</span></h2>
<p>Ce document d&eacute;crit actuellement la version 1 du format de fichier. 
</p><p>Le fichier de m&eacute;tadonn&eacute;es doit &ecirc;tre un document XML 1.0 valide et bien form&eacute;. Il doit &ecirc;tre nomm&eacute; &laquo;&nbsp;package.xml&nbsp;&raquo; et doit se trouver dans le r&eacute;pertoire de base de chacune des branches affich&eacute;es du paquet logiciel (comme sp&eacute;cifi&eacute; par le <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD-addons/blob/master/AddonCatalog.json">fichier FreeCAD-addons AddonCatalog.json</a>) dans son d&eacute;p&ocirc;t git. Chaque branche doit contenir un fichier package.xml ind&eacute;pendant qui se rapporte sp&eacute;cifiquement &agrave; cette branche (par exemple, une branche &laquo;&nbsp;d&eacute;veloppement&nbsp;&raquo; doit sp&eacute;cifier un num&eacute;ro de version qui indique clairement qu'il s'agit d'une branche de d&eacute;veloppement, etc). Toutes les balises XML reconnues sont en minuscules, mais les balises non reconnues ne constituent <b>pas</b> une erreur. La plupart des balises sont facultatives, et certaines ne s'appliquent qu'&agrave; certains types de contenu de paquet (par exemple, seuls les Workbenches fournissent actuellement un &eacute;l&eacute;ment &laquo;&nbsp;classname&nbsp;&raquo;). Les &eacute;l&eacute;ments inutiles ou non reconnus sont ignor&eacute;s.
</p><p>Tout chemin de fichier sp&eacute;cifi&eacute; dans package.xml doit utiliser la barre oblique ("/") comme s&eacute;parateur de r&eacute;pertoire&nbsp;: sur les syst&egrave;mes qui attendent un s&eacute;parateur diff&eacute;rent pendant l'ex&eacute;cution (par exemple Windows), FreeCAD convertira automatiquement vers le s&eacute;parateur correct.
</p><p><span id="Content_elements"></span>
</p>
<h2><span id=".C3.89l.C3.A9ments_de_contenu"></span><span class="mw-headline" id="&Eacute;l&eacute;ments_de_contenu">&Eacute;l&eacute;ments de contenu</span></h2>
<h3><span id=".3Cpackage.3E"></span><span class="mw-headline" id="&lt;package&gt;">&lt;package&gt;</span></h3>
<p>Le seul &eacute;l&eacute;ment de haut niveau autoris&eacute; est &lt;package&gt;, et le fichier ne peut contenir qu'un seul &eacute;l&eacute;ment &lt;package&gt;. Imm&eacute;diatement subordonn&eacute;s &agrave; celui-ci se trouvent plusieurs &eacute;l&eacute;ments obligatoires ou facultatifs, d&eacute;finis ici. Aucune autre balise n'est autoris&eacute;e directement sous l'&eacute;l&eacute;ment &lt;package&gt;.
</p>
<pre>&lt;package format="1" xmlns="https://wiki.freecad.org/Package_Metadata"&gt;
</pre>
<p>La balise &lt;package&gt; est la balise unique de premier niveau dans un fichier package.xml. Toutes les autres balises sont imbriqu&eacute;es sous elle.
</p><p><span id="Attributes"></span>
</p>
<h4><span class="mw-headline" id="Attributs">Attributs</span></h4>
<ul><li>format="NUMERO"&nbsp;: Sp&eacute;cifier le format package.xml utilis&eacute;. Pour cette interface, vous devez sp&eacute;cifier format="1".</li>
<li>xmlns="NAMESPACE"&nbsp;: Sp&eacute;cifie l'espace de noms XML pour ce paquet, et doit &ecirc;tre inclus exactement comme indiqu&eacute; ci-dessus, comme un lien vers <a rel="nofollow" class="external free" href="https://wiki.freecad.org/Package_Metadata">https://wiki.freecad.org/Package_Metadata</a>.</li></ul>
<p><span id="Required_child_tags"></span>
</p>
<h4><span class="mw-headline" id="Balises_enfant_requises">Balises enfant requises</span></h4>
<p>L'&eacute;l&eacute;ment &lt;package&gt; de niveau sup&eacute;rieur doit contenir au moins les balises suivantes&nbsp;:
</p>
<ul><li><a href="#.3Cname.3E">&lt;name&gt;</a></li>
<li><a href="#.3Cversion.3E">&lt;version&gt;</a></li>
<li><a href="#.3Cdate.3E">&lt;date&gt;</a></li>
<li><a href="#.3Cdescription.3E">&lt;description&gt;</a></li>
<li><a href="#.3Cmaintainer.3E">&lt;maintainer&gt;</a> (plusieurs, mais au moins un)</li>
<li><a href="#.3Clicense.3E">&lt;license&gt;</a> (plusieurs, mais au moins un)</li>
<li><a href="#.3Cicon.3E">&lt;icon&gt;</a> (plusieurs, mais au moins un)</li>
<li><a href="#.3Ccontent.3E">&lt;content&gt;</a> (&eacute;l&eacute;ment conteneur pour les &eacute;l&eacute;ments de contenu du paquet)</li></ul>
<p><span id="Optional_child_tags"></span>
</p>
<h4><span class="mw-headline" id="Balises_enfant_facultatives">Balises enfant facultatives</span></h4>
<ul><li><a href="#.3Curl.3E">&lt;url&gt;</a> (plusieurs)</li>
<li><a href="#.3Cauthor.3E">&lt;author&gt;</a> (plusieurs)</li>
<li><a href="#.3Cdepend.3E">&lt;depend&gt;</a> (plusieurs)</li>
<li><a href="#.3Cconflict.3E">&lt;conflict&gt;</a> (plusieurs)</li>
<li><a href="#.3Creplace.3E">&lt;replace&gt;</a> (plusieurs)</li>
<li><a href="#.3Ctag.3E">&lt;tag&gt;</a> (plusieurs)</li>
<li><a href="#.3Cfreecadmin.3E">&lt;freecadmin&gt;</a></li>
<li><a href="#.3Cfreecadmax.3E">&lt;freecadmax&gt;</a></li>
<li><a href="#.3Cpythonmin.3E">&lt;pythonmin&gt;</a></li></ul>
<h3><span id=".3Cname.3E"></span><span class="mw-headline" id="&lt;name&gt;">&lt;name&gt;</span></h3>
<p>OBLIGATOIRE
</p><p>Le nom de ce paquet. Ne doit contenir que des caract&egrave;res valides pour les noms de fichiers (les caract&egrave;res non autoris&eacute;s sont /\?%*:|"&lt;&gt; ).
</p>
<h3><span id=".3Cversion.3E"></span><span class="mw-headline" id="&lt;version&gt;">&lt;version&gt;</span></h3>
<p>OBLIGATOIRE
</p><p>Un num&eacute;ro de version qui suit soit la <a rel="nofollow" class="external text" href="https://semver.org">norme de versionnement s&eacute;mantique 2.0</a> (par exemple 1.0.2-beta), soit le <a rel="nofollow" class="external text" href="https://calver.org/">style CalVer</a> (par exemple 2021.12.08). Notez que vous ne pouvez pas inclure les deux types, et que le passage d'un type &agrave; l'autre n'est pas pris en charge. En interne, le code n'a aucune notion du type choisi, lors de la comparaison des versions, il effectue une simple comparaison num&eacute;rique entre chaque composant num&eacute;rique successif, quel que soit le type. Notez que ce champ ne peut pas &ecirc;tre laiss&eacute; vide, un num&eacute;ro de version doit &ecirc;tre attribu&eacute;. Lorsque le gestionnaire d'addons d&eacute;tecte une augmentation du num&eacute;ro de version, il affiche l'information "mise &agrave; jour disponible" aux utilisateurs.
</p>
<h3><span id=".3Cdate.3E"></span><span class="mw-headline" id="&lt;date&gt;">&lt;date&gt;</span></h3>
<p>OBLIGATOIRE
</p><p>La date de la version en cours, au format AAAA-MM-JJ ou AAAA.MM.JJ.
</p>
<h3><span id=".3Cdescription.3E"></span><span class="mw-headline" id="&lt;description&gt;">&lt;description&gt;</span></h3>
<p>OBLIGATOIRE
</p><p>Une description textuelle concise (plusieurs phrases maximum) de ce paquet. Aucun balisage n'est pris en charge.
</p><p>=== &lt;maintainer&gt;
</p><p>AU MOINS UN OBLIGATOIRE (plusieurs autoris&eacute;s)
</p><p>Le nom de la personne qui maintient le paquet. Tous les paquets n&eacute;cessitent un mainteneur. Pour les paquets orphelins, voir ci-dessous.
</p><p><span id="Attributes"></span>
</p>
<h4><span class="mw-headline" id="Attributs_2">Attributs</span></h4>
<ul><li>email="name@domain.tld" (obligatoire)&nbsp;: Adresse &eacute;lectronique du responsable.</li></ul>
<p>Un paquet orphelin est un paquet qui n'a pas de mainteneur attitr&eacute;. Les paquets orphelins doivent utiliser les informations suivantes sur le mainteneur&nbsp;:
</p>
<pre>&lt;maintainer email="no-one@freecad.org"&gt;No current maintainer&lt;/maintainer&gt;
</pre>
<h3><span id=".3Clicense.3E"></span><span class="mw-headline" id="&lt;license&gt;">&lt;license&gt;</span></h3>
<p>AU MOINS UN OBLIGATOIRE (plusieurs autoris&eacute;s)
</p><p>Identifiant court SPDX de la (des) licence(s) pour ce paquetage, par exemple BSD-2-Clause, GPL-3.0-or-later, LGPL-2.1-or-later. Pour faciliter la lecture par les machines, n'incluez que l'identifiant court SPDX de la licence (voir <a rel="nofollow" class="external text" href="https://spdx.org/licenses/">le site SPDX</a>). Pour les licences multiples, plusieurs balises distinctes doivent &ecirc;tre utilis&eacute;es. Un paquet aura plusieurs licences si les diff&eacute;rents fichiers sources ont des licences diff&eacute;rentes. Chaque licence pr&eacute;sente dans les fichiers source doit avoir une balise &lt;license&gt; correspondante. Pour tout texte explicatif concernant les avertissements relatifs &agrave; la licence, veuillez utiliser la balise &lt;description&gt;. Pour sp&eacute;cifier qu'aucune licence ne s'applique (par exemple, "Tous droits r&eacute;serv&eacute;s"), d&eacute;finissez cette valeur &agrave; "UNLICENSED". Pour sp&eacute;cifier une licence personnalis&eacute;e sans identifiant SPDX, d&eacute;finissez cette valeur &agrave; "SEE LICENSE IN &lt;filename&gt;".
</p><p>Les licences les plus utilis&eacute;es&nbsp;:
</p>
<ul><li><code>"Apache-2.0"</code></li>
<li><code>"BSD-2-Clause"</code></li>
<li><code>"BSD-3-Clause"</code></li>
<li><code>"BSL-1.0"</code></li>
<li><code>"GPL-2.0-or-later"</code></li>
<li><code>"GPL-3.0-or-later"</code></li>
<li><code>"LGPL-2.1-or-later"</code></li>
<li><code>"LGPL-3.0-or-later"</code></li>
<li><code>"MIT"</code></li>
<li><code>"MPL-1.1"</code></li>
<li><code>"CC0-1.0"</code> (D&eacute;claration du domaine public)</li></ul>
<p><b>Note de r&eacute;trocompatibilit&eacute;</b>&nbsp;: le gestionnaire des extensions tentera de normaliser les identifiants de licence qui ne correspondent pas exactement &agrave; une cha&icirc;ne de licence SPDX. Il en r&eacute;sultera parfois un identifiant de licence qui produira une licence non-FSF-Libre ou non approuv&eacute;e par l'OSI&nbsp;: par exemple, "LGPL2" sera normalis&eacute; en "LGPL-2.0", qui est une licence non-FSF-Libre&nbsp;: ce qui &eacute;tait probablement pr&eacute;vu &eacute;tait "LGPL-2.1-or-later".
</p><p><span id="Attributes"></span>
</p>
<h4><span class="mw-headline" id="Attributs_3">Attributs</span></h4>
<ul><li><code>file="FILE"</code> (facultatif)&nbsp;: un chemin relatif au fichier <code>package.xml</code> contenant le texte complet de la licence. De nombreuses licences exigent l'inclusion du texte de la licence lors de la redistribution du logiciel. Par exemple, la licence Apache, version 2.0, stipule au paragraphe 4.1&nbsp;: "Vous devez remettre &agrave; tout autre destinataire de l'&oelig;uvre ou des &oelig;uvres d&eacute;riv&eacute;es une copie de la pr&eacute;sente licence".</li></ul>
<h3><span id=".3Ccontent.3E"></span><span class="mw-headline" id="&lt;content&gt;">&lt;content&gt;</span></h3>
<p>OBLIGATOIRE
</p><p>La balise &lt;content&gt; d&eacute;crit le contenu r&eacute;el du paquet. Elle n'a pas d'attributs, et contient un nombre quelconque d'enfants. Ces enfants peuvent avoir des noms de balises arbitraires, dont seuls certains peuvent &ecirc;tre reconnus par FreeCAD. FreeCAD prend en charge pour le moment les &eacute;l&eacute;ments "atelier", "macro", "kit de pr&eacute;f&eacute;rences", "paquet" (<span style="font-size:small;"><a href="../fr/Release_notes_1.1.html" title="Release notes 1.1/fr">introduit dans la version 1.1</a></span>) et "autre" (<span style="font-size:small;"><a href="../fr/Release_notes_1.1.html" title="Release notes 1.1/fr">introduit dans la version 1.1</a></span>). Chaque enfant est ensuite d&eacute;fini r&eacute;cursivement par cette norme, contenant n'importe quel ou tous les &eacute;l&eacute;ments autoris&eacute;s pour le noeud racine &lt;package&gt;. Par exemple&nbsp;:
</p>
<pre>&lt;content&gt;
  &lt;preferencepack&gt;
    &lt;name&gt;Unicorn Sparkles Theme&lt;/name&gt;
    &lt;version&gt;1.0.0&lt;/version&gt;
    &lt;url type="readme"&gt;https://github.com/chennes/FreeCAD-themes/blob/main/Unicorn%20Sparkles%20Theme/Readme.md&lt;/url&gt;
    &lt;icon&gt;sparkles.svg&lt;/icon&gt;
  &lt;/preferencepack&gt;
&lt;/content&gt;
</pre>
<p>L'existence de la plupart des &eacute;l&eacute;ments &lt;content&gt; implique un ensemble de sous-dossiers, un pour chaque &eacute;l&eacute;ment de contenu, nomm&eacute; exactement comme le nom donn&eacute; &agrave; l'&eacute;l&eacute;ment. Ainsi, pour l'exemple ci-dessus, la structure des dossiers du paquet est la suivante&nbsp;:
</p>
<pre>Package Directory/
  package.xml
  Unicorn Sparkles Theme/
    Unicorn Sparkles Theme.cfg
    sparkles.svg
    (the theme's other files)
</pre>
<p>Outre les autres &eacute;l&eacute;ments de &lt;package&gt;, les &eacute;l&eacute;ments de contenu peuvent &eacute;ventuellement fournir des informations dans les balises &lt;icon&gt;, &lt;classname&gt; et &lt;file&gt; (techniquement, celles-ci peuvent &eacute;galement &ecirc;tre fournies &agrave; la balise racine &lt;package&gt;, mais elles y sont g&eacute;n&eacute;ralement inutilis&eacute;es).
</p><p><b>Note de r&eacute;trocompatibilit&eacute;</b>&nbsp;: pour &eacute;viter de devoir restructurer les paquets ant&eacute;rieurs &agrave; cette norme de m&eacute;tadonn&eacute;es, la balise facultative <a href="#.3Csubdirectory.3E">&lt;subdirectory&gt;</a> est autoris&eacute;e &agrave; sp&eacute;cifier "./" comme sous-r&eacute;pertoire pour un &eacute;l&eacute;ment de contenu, auquel cas aucun sous-r&eacute;pertoire n'est n&eacute;cessaire. Cela correspond au syst&egrave;me pr&eacute;-standard o&ugrave; un seul poste de travail &eacute;tait situ&eacute; au sommet de la structure des r&eacute;pertoires.
</p>
<h4><span id=".3Cicon.3E"></span><span class="mw-headline" id="&lt;icon&gt;">&lt;icon&gt;</span></h4>
<p>OBLIGATOIRE pour les ateliers
</p><p>Le chemin d'acc&egrave;s &agrave; un fichier d'ic&ocirc;ne. S'il s'agit d'une ic&ocirc;ne pour le paquet de premier niveau, ce chemin est relatif au fichier package.xml lui-m&ecirc;me. Si l'ic&ocirc;ne est un &eacute;l&eacute;ment d'un &eacute;l&eacute;ment &lt;content&gt;, le chemin est relatif au dossier du contenu. Le gestionnaire d'addons affichera l'ic&ocirc;ne de niveau sup&eacute;rieur comme l'ic&ocirc;ne du paquetage global. Si aucune ic&ocirc;ne de niveau sup&eacute;rieur n'est pr&eacute;sente, la premi&egrave;re ic&ocirc;ne de banc de travail sp&eacute;cifi&eacute;e sera utilis&eacute;e comme ic&ocirc;ne du paquet.
</p>
<h4><span id=".3Csubdirectory.3E"></span><span class="mw-headline" id="&lt;subdirectory&gt;">&lt;subdirectory&gt;</span></h4>
<p>Optionnel.
</p><p>Normalement, un &eacute;l&eacute;ment de contenu est suppos&eacute; se trouver dans un sous-r&eacute;pertoire portant le m&ecirc;me nom que l'&eacute;l&eacute;ment. Dans certains cas, cependant, il est utile de sp&eacute;cifier explicitement le sous-r&eacute;pertoire. Par exemple, de nombreuses macros peuvent se trouver dans un seul sous-r&eacute;pertoire, mais chacune a sa propre entr&eacute;e dans le fichier package.xml. Cela fournit &eacute;galement un support de r&eacute;trocompatibilit&eacute; pour les paquets ant&eacute;rieurs &agrave; la sp&eacute;cification du format de fichier package.xml, et qui ne suivent pas la structure de sous-r&eacute;pertoire attendue. Souvent, dans ces cas, un "&lt;subdirectory&gt;./&lt;/subdirectory&gt;" est utilis&eacute; pour indiquer que l'&eacute;l&eacute;ment n'est pas situ&eacute; dans un sous-r&eacute;pertoire du tout.
</p>
<h4><span id=".3Cclassname.3E"></span><span class="mw-headline" id="&lt;classname&gt;">&lt;classname&gt;</span></h4>
<p>OBLIGATOIRE pour les ateliers
</p><p>Pour les ateliers, le nom de la classe d'entr&eacute;e principale en Python. C'est la classe que FreeCAD essaiera de charger au d&eacute;marrage pour localiser l'ic&ocirc;ne de l'atelier, qui doit &ecirc;tre d&eacute;finie comme une variable membre de la classe. Par exemple, si votre atelier d&eacute;finit la classe suivante (g&eacute;n&eacute;ralement dans InitGui.py)&nbsp;:
</p>
<div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="k">class</span> <span class="nc">MyNewWB</span><span class="p">:</span>
    <span class="n">Icon</span> <span class="o">=</span> <span class="s2">"resources/icon.svg"</span>
</pre></div>
<p>alors le fichier package.xml attend&nbsp;:
</p>
<pre>&lt;classname&gt;MyNewWB&lt;/classname&gt;
</pre>
<h4><span id=".3Cfile.3E"></span><span class="mw-headline" id="&lt;file&gt;">&lt;file&gt;</span></h4>
<p>Optionnel.
</p><p>Fournis pour la convivialit&eacute; d'autres outils, un certain nombre d'autres fichiers peuvent &ecirc;tre r&eacute;pertori&eacute;s ici. Leur utilisation d&eacute;pend du type de contenu. Dans un &eacute;l&eacute;ment de contenu macro, chaque entr&eacute;e de fichier est une macro unique et sera li&eacute;e au r&eacute;pertoire d'installation des macros de l'utilisateur par le <a href="../fr/Std_AddonMgr.html" title="Std AddonMgr/fr">Gestionnaire des extensions</a>.
</p>
<h3><span id=".3Curl.3E"></span><span class="mw-headline" id="&lt;url&gt;">&lt;url&gt;</span></h3>
<p>Plusieurs autoris&eacute;s&nbsp;: le "d&eacute;p&ocirc;t" est obligatoire et le type "readme" est fortement recommand&eacute;.
</p><p>Un URL (Uniform Resource Locator) pour le site web du paquet, le syst&egrave;me de suivi des bogues, le d&eacute;p&ocirc;t des sources, le lien de t&eacute;l&eacute;chargement du zip, le fichier readme ou la documentation (comme sp&eacute;cifi&eacute; par l'attribut "type", voir ci-dessous). 
</p><p>Lorsque vous sp&eacute;cifiez le type "readme", un lien direct vers une version restitu&eacute;e du fichier README doit &ecirc;tre fourni. Par exemple, sur GitHub, il s'agit d'un lien de type "blob" tel que "<a rel="nofollow" class="external free" href="https://github.com/FreeCAD/FreeCAD-addons/blob/master/README.md">https://github.com/FreeCAD/FreeCAD-addons/blob/master/README.md</a>", ou sur une instance GitLab, "<a rel="nofollow" class="external free" href="https://gitlab.com/opensimproject/cfdof/-/blob/master/README.md">https://gitlab.com/opensimproject/cfdof/-/blob/master/README.md</a>" (notez le format d'URL l&eacute;g&egrave;rement diff&eacute;rent entre les deux).
</p><p>C'est une bonne id&eacute;e d'inclure des balises &lt;url&gt; pointant les utilisateurs vers les ressources en ligne de votre paquet. Il s'agit g&eacute;n&eacute;ralement d'une page wiki de wiki.freecad.org o&ugrave; les utilisateurs peuvent trouver et mettre &agrave; jour des informations sur le paquet, par exemple. Le gestionnaire d'addons r&eacute;pertorie ces URL et fournit des liens cliquables vers celles-ci dans la description du paquet.
</p><p><span id="Attributes"></span>
</p>
<h4><span class="mw-headline" id="Attributs_4">Attributs</span></h4>
<ul><li>type="TYPE" (obligatoire)&nbsp;: Le type doit &ecirc;tre l'un des identifiants suivants&nbsp;: "website", "bugtracker", "repository", "readme", "documentation" ou "discussion".</li>
<li>branch="BRANCH" (obligatoire pour type="repository")&nbsp;: Le nom de la branche &agrave; extraire pour obtenir ce paquet. Il s'agit g&eacute;n&eacute;ralement du nom de votre branche de d&eacute;veloppement principale. Peut &eacute;galement sp&eacute;cifier tout autre type de r&eacute;f&eacute;rence git, par exemple une balise ou un commit sp&eacute;cifique.</li></ul>
<h3><span id=".3Cauthor.3E"></span><span class="mw-headline" id="&lt;author&gt;">&lt;author&gt;</span></h3>
<p>Multiple autoris&eacute;
</p><p>Le nom d'une personne qui est un auteur du paquet, comme reconnaissance de son travail et pour les questions.
</p><p><span id="Attributes"></span>
</p>
<h4><span class="mw-headline" id="Attributs_5">Attributs</span></h4>
<ul><li>email="name@domain.tld" (facultatif)&nbsp;: Adresse &eacute;lectronique de l'auteur.</li></ul>
<h3><span id=".3Cdepend.3E"></span><span class="mw-headline" id="&lt;depend&gt;">&lt;depend&gt;</span></h3>
<p>Multiple autoris&eacute;, au moins un est requis pour les bundles.
</p><p>D&eacute;clare une d&eacute;pendance sur une autre extension de FreeCAD ou un atelier interne, ou un module en Python. La d&eacute;pendance nomm&eacute;e est d'abord v&eacute;rifi&eacute;e par rapport &agrave; la liste des extensions connues (par exemple ceux disponibles soit dans le d&eacute;p&ocirc;t git officiel des extensions de FreeCAD, soit dans un d&eacute;p&ocirc;t personnalis&eacute; sp&eacute;cifi&eacute; par l'utilisateur). La v&eacute;rification porte sur le nom canonique de l'extension. Si un fichier package.xml est pr&eacute;sent pour cette extension, le nom est l'&eacute;l&eacute;ment &lt;name&gt; de ce package. Une correspondance exacte est requise. Si aucune correspondance n'est trouv&eacute;e, le nom est compar&eacute; &agrave; la liste des ateliers internes connus (install&eacute;s et d&eacute;sinstall&eacute;s). Enfin, si la d&eacute;pendance nomm&eacute;e n'a pas &eacute;t&eacute; localis&eacute;e lors des deux &eacute;tapes pr&eacute;c&eacute;dentes, elle est suppos&eacute;e &ecirc;tre une d&eacute;pendance du module en Python. Notez que toutes les fonctionnalit&eacute;s li&eacute;es aux d&eacute;pendances ne sont pas encore compl&egrave;tement impl&eacute;ment&eacute;es.
</p><p>Un &eacute;l&eacute;ment du contenu d'un &laquo;&nbsp;paquet&nbsp;&raquo; (<span style="font-size:small;"><a href="../fr/Release_notes_1.1.html" title="Release notes 1.1/fr">introduit dans la version 1.1</a></span>) doit avoir plusieurs lignes &laquo;&nbsp;depends&nbsp;&raquo;, une pour chaque extension &laquo;&nbsp;empaquet&eacute;e&nbsp;&raquo;. Notez que l'empaquetage n'est pas litt&eacute;ral, en ce sens que le paquet n'est pas cens&eacute; contenir le code source de la d&eacute;pendance, mais seulement d&eacute;clarer qu'elle doit &ecirc;tre install&eacute;e par le gestionnaire des extensions dans le cadre de l'installation du paquet.
</p><p><span id="Attributes"></span>
</p>
<h4><span class="mw-headline" id="Attributs_6">Attributs</span></h4>
<p>Toutes les d&eacute;pendances et relations peuvent restreindre leur applicabilit&eacute; &agrave; des versions particuli&egrave;res. Un attribut peut &ecirc;tre utilis&eacute; pour chaque op&eacute;rateur de comparaison. Deux de ces attributs peuvent &ecirc;tre utilis&eacute;s ensemble pour d&eacute;crire une gamme de versions.
</p>
<ul><li>version_lt="VERSION" (facultatif)&nbsp;: la d&eacute;pendance au paquet est limit&eacute;e aux versions inf&eacute;rieures au num&eacute;ro de version indiqu&eacute;.</li>
<li>version_lte="VERSION" (facultatif)&nbsp;: la d&eacute;pendance au paquet est limit&eacute;e aux versions inf&eacute;rieures ou &eacute;gales au num&eacute;ro de version indiqu&eacute;.</li>
<li>version_eq="VERSION" (facultatif)&nbsp;: la d&eacute;pendance au paquet est restreinte &agrave; une version &eacute;gale au num&eacute;ro de version indiqu&eacute;.</li>
<li>version_gte="VERSION" (facultatif)&nbsp;: la d&eacute;pendance au paquet est limit&eacute;e aux versions sup&eacute;rieures ou &eacute;gales au num&eacute;ro de version indiqu&eacute;.</li>
<li>version_gt="VERSION" (facultatif)&nbsp;: la d&eacute;pendance au paquet est limit&eacute;e aux versions sup&eacute;rieures au num&eacute;ro de version indiqu&eacute;.</li>
<li>optional="true|false"&nbsp;: si "optional" est "true", la d&eacute;pendance est trait&eacute;e comme facultative lorsque l'extension est install&eacute;e &agrave; l'aide du gestionnaire des extensions. En g&eacute;n&eacute;ral, cela signifie qu'un &eacute;chec de l'installation de la d&eacute;pendance n'emp&ecirc;che pas l'installation de l'extension, et l'utilisateur peut &ecirc;tre invit&eacute; &agrave; dire s'il veut l'installer. Les versions de FreeCAD ant&eacute;rieures &agrave; 0.21 ne reconnaissent pas cet attribut et l'ignorent.</li>
<li>type="automatic|addon|internal|python"&nbsp;: facultatif, la valeur par d&eacute;faut est "automatic". Indique &agrave; quoi se r&eacute;f&egrave;re cette d&eacute;claration de d&eacute;pendance. "addon" est pour les extensions externes, "internal" est pour les ateliers internes, et "python" indique une d&eacute;pendance du paquetage Python. Les versions de FreeCAD ant&eacute;rieures &agrave; 0.21 n'utilisent pas cet attribut, et "automatic" est toujours suppos&eacute;.</li></ul>
<p><span id="Type:_internal"></span>
</p>
<h5><span class="mw-headline" id="Type_:_interne">Type&nbsp;: interne</span></h5>
<p>Types d'ateliers internes suivants disponibles&nbsp;:
</p>
<ul><li><code>assembly</code></li>
<li><code>bim</code></li>
<li><code>cam</code></li>
<li><code>draft</code></li>
<li><code>fem</code></li>
<li><code>import</code></li>
<li><code>material</code></li>
<li><code>mesh</code></li>
<li><code>openscad</code></li>
<li><code>part</code></li>
<li><code>partdesign</code></li>
<li><code>plot</code></li>
<li><code>points</code></li>
<li><code>reverseengineering</code></li>
<li><code>robot</code></li>
<li><code>sketcher</code></li>
<li><code>spreadsheet</code></li>
<li><code>techdraw</code></li>
<li><code>tux</code></li>
<li><code>web</code></li></ul>
<h3><span id=".3Cconflict.3E"></span><span class="mw-headline" id="&lt;conflict&gt;">&lt;conflict&gt;</span></h3>
<p>Multiple autoris&eacute;
</p><p>D&eacute;clare un nom de paquet avec lequel ce paquet est en conflit. Ce paquet et le paquet en conflit ne doivent pas &ecirc;tre install&eacute;s en m&ecirc;me temps.
</p><p><span id="Attributes"></span>
</p>
<h4><span class="mw-headline" id="Attributs_7">Attributs</span></h4>
<p>Voir &lt;depend&gt;.
</p>
<h3><span id=".3Creplace.3E"></span><span class="mw-headline" id="&lt;replace&gt;">&lt;replace&gt;</span></h3>
<p>Multiple autoris&eacute;
</p><p>D&eacute;clare un nom de paquet que ce paquet est destin&eacute; &agrave; remplacer.
</p><p><span id="Attributes"></span>
</p>
<h4><span class="mw-headline" id="Attributs_8">Attributs</span></h4>
<p>Voir &lt;depend&gt;.
</p>
<h3><span id=".3Ctag.3E"></span><span class="mw-headline" id="&lt;tag&gt;">&lt;tag&gt;</span></h3>
<p>Une simple balise texte utilis&eacute;e pour la cat&eacute;gorisation lors de l'utilisation d'un gestionnaire de paquets. Plusieurs &eacute;l&eacute;ments &lt;tag&gt; peuvent &ecirc;tre sp&eacute;cifi&eacute;s.
</p><p>=== &lt;freecadmin&gt;
</p><p>Version minimale de FreeCAD requise pour utiliser ce package/&eacute;l&eacute;ment, sous la forme d'une cha&icirc;ne de caract&egrave;re de version s&eacute;mantique 2.0 au format MAJOR.MINOR.BUILD. Cette balise peut &ecirc;tre utilis&eacute;e pour sp&eacute;cifier qu'une branche particuli&egrave;re de cette extension ne doit &ecirc;tre affich&eacute;e qu'aux utilisateurs d'une version sp&eacute;cifique de FreeCAD (ou ult&eacute;rieure). Elle peut &ecirc;tre combin&eacute;e avec <code>&lt;freecadmax&gt;</code> pour d&eacute;finir une plage valide sp&eacute;cifique.
</p><p>=== &lt;freecadmax&gt;
</p><p>La version maximale de FreeCAD requise pour utiliser le package/&eacute;l&eacute;ment, sous la forme d'une cha&icirc;ne de caract&egrave;re de version s&eacute;mantique 2.0 au format MAJOR.MINOR.BUILD. Cette balise peut &ecirc;tre utilis&eacute;e pour sp&eacute;cifier qu'une branche particuli&egrave;re de cette extension ne doit &ecirc;tre affich&eacute;e qu'aux utilisateurs d'une version sp&eacute;cifique de FreeCAD (ou ant&eacute;rieure). Elle peut &ecirc;tre combin&eacute;e avec <code>&lt;freecadmin&gt;</code> pour d&eacute;finir une plage valide sp&eacute;cifique. Notez qu'il s'agit d'une cha&icirc;ne de caract&egrave;re de version exacte, donc pour indiquer que l'extension prend en charge une version mineure enti&egrave;re, le composant &laquo;&nbsp;patch&nbsp;&raquo; doit &ecirc;tre choisi pour &ecirc;tre un nombre suffisamment grand (par exemple &laquo;&nbsp;1.0.99&nbsp;&raquo; pour prendre en charge toute la s&eacute;rie de versions 1.0.x).
</p><p>=== &lt;pythonmin&gt;
</p><p>(Nouveau dans FreeCAD 0.21, ignor&eacute; par les versions pr&eacute;c&eacute;dentes). La version minimale requise de Python pour utiliser le package/&eacute;l&eacute;ment, sous la forme d'une cha&icirc;ne s&eacute;mantique version 2.0 au format MAJOR.MINOR. Le gestionnaire des extensions ne permettra pas l'installation d'une extension sur un syst&egrave;me utilisant une version de Python ant&eacute;rieure &agrave; celle-ci. Seules les versions Python 3.x sont prises en charge. Bien que vous puissiez sp&eacute;cifier une version &agrave; trois composants, seul le num&eacute;ro mineur est pris en compte lors de la v&eacute;rification de la compatibilit&eacute;.
</p>
<h2><span class="mw-headline" id="Validation">Validation</span></h2>
<p>Pour valider votre fichier package.xml, vous pouvez activer le "mode d&eacute;veloppeur" dans le gestionnaire d'addons&nbsp;: cr&eacute;ez une variable bool&eacute;enne appel&eacute;e "developerMode" dans le groupe de param&egrave;tres "Addons" et d&eacute;finissez-la sur True&nbsp;: <b>Outils &rarr; Editer les param&egrave;tres... &rarr; BaseApp &rarr; Pr&eacute;f&eacute;rences &rarr; Addons &rarr; developerMode</b>. Lorsque le gestionnaire d'addons a fini de lire la base de donn&eacute;es des addons, il examine tous les fichiers package.xml disponibles &agrave; la recherche d'erreurs.
</p><p><span id="Quick_guide"></span>
</p>
<h2><span class="mw-headline" id="Guide_rapide">Guide rapide</span></h2>
<p>Pour un guide rapide sur la fa&ccedil;on de cr&eacute;er un fichier package.xml de base et d'ajouter un atelier au <a href="../fr/Std_AddonMgr.html" title="Std AddonMgr/fr">Gestionnaire des extensions</a> voir&nbsp;: <a href="../fr/Add_Workbench_to_Addon_Manager.html" title="Add Workbench to Addon Manager/fr">Ajouter un atelier au gestionnaire des extensions</a>.
</p><p><span id="Examples"></span>
</p>
<h2><span class="mw-headline" id="Exemples">Exemples</span></h2>
<p>Notez que les commentaires (le texte entre <code>&lt;!--</code> et <code>--&gt;</code>) sont ignor&eacute;s par l'analyseur XML et ne sont pas une partie obligatoire du format de fichier. Ils sont fournis ici &agrave; titre d'information et peuvent &ecirc;tre omis du package.xml final si vous le souhaitez.
</p><p>Un paquet simple r&eacute;serv&eacute; &agrave; l'atelier (par exemple, pour ajouter un fichier de m&eacute;tadonn&eacute;es &agrave; un paquet ant&eacute;rieur &agrave; ce format de m&eacute;tadonn&eacute;es)&nbsp;:
</p>
<pre>&lt;?xml version="1.0" encoding="UTF-8" standalone="no"&nbsp;?&gt;
&lt;package format="1" xmlns="https://wiki.freecad.org/Package_Metadata"&gt;
  &lt;name&gt;Legacy Workbench&lt;/name&gt; &lt;!-- What the Addon Manager displays to users --&gt;
  &lt;description&gt;Text that the Addon Manager shows for the Addon. Any length, but remember that Addon Manager's compact view only shows the first sentence or so.&lt;/description&gt;
  &lt;version&gt;1.0.1&lt;/version&gt; &lt;!-- Semantic versioning (1.2.3-beta) or CalVer-based, (2022.01.07), don't omit or non-git installations won't see your updates --&gt;
  &lt;date&gt;2022-01-07&lt;/date&gt; &lt;!-- Date of the last update to the version number --&gt;
  &lt;maintainer email="your_address@null.com"&gt;Your Name&lt;/maintainer&gt;
  &lt;license file="LICENSE"&gt;LGPL-2.1-or-later&lt;/license&gt; &lt;!-- Make sure you actually have this file in your Addon repo if the license requires it --&gt;
  &lt;url type="repository" branch="main"&gt;https://github.com/chennes/FreeCAD-Package&lt;/url&gt; &lt;!-- Don't forget to update the branch name here --&gt;
  &lt;url type="readme"&gt;https://github.com/chennes/FreeCAD-Package/blob/main/README.md&lt;/url&gt; &lt;!-- Link to the HTML-rendered README page --&gt;
  &lt;icon&gt;Resources/icons/PackageIcon.svg&lt;/icon&gt; &lt;!-- If you include your icon here, you don't have to submit it to the main FreeCAD repo --&gt;

  &lt;content&gt;
    &lt;workbench&gt;
      &lt;classname&gt;MyLegacyWorkbench&lt;/classname&gt; &lt;!-- Must match class name in InitGui.py --&gt;
      &lt;subdirectory&gt;./&lt;/subdirectory&gt;
    &lt;/workbench&gt;
  &lt;/content&gt;

&lt;/package&gt;
</pre>
<p>Un paquet complexe, &agrave; plusieurs composantes&nbsp;:
</p>
<pre>&lt;?xml version="1.0" encoding="UTF-8" standalone="no"&nbsp;?&gt;
&lt;package format="1" xmlns="https://wiki.freecad.org/Package_Metadata"&gt;
  &lt;name&gt;Example Package Format&lt;/name&gt;
  &lt;description&gt;An example of the package.xml file format&lt;/description&gt;
  &lt;version&gt;2022.01&lt;/version&gt;
  &lt;date&gt;2022-01-07&lt;/date&gt;
  &lt;maintainer email="no-one@freecad.org"&gt;No Maintainer&lt;/maintainer&gt;
  &lt;license file="LICENSE"&gt;GPL-3.0-or-later&lt;/license&gt;
  &lt;url type="repository" branch="main"&gt;https://github.com/chennes/FreeCAD-Package&lt;/url&gt;
  &lt;icon&gt;PackageIcon.svg&lt;/icon&gt;

  &lt;content&gt;
    &lt;preferencepack&gt;
      &lt;name&gt;FreeCAD Classic Colors&lt;/name&gt;
      &lt;description&gt;FreeCAD default colors for core app and included Mods.&lt;/description&gt;
      &lt;version&gt;1.0.0&lt;/version&gt;
      &lt;tag&gt;color&lt;/tag&gt;
      &lt;tag&gt;stylesheet&lt;/tag&gt;
    &lt;/preferencepack&gt;
    &lt;workbench&gt;
      &lt;name&gt;Metadata Creation Workbench&lt;/name&gt;
      &lt;description&gt;A set of tools to assist in creation of package.xml metadata files&lt;/description&gt;
      &lt;classname&gt;MetadataCreationWorkbench&lt;/classname&gt;
      &lt;subdirectory&gt;MCW&lt;/subdirectory&gt;
      &lt;icon&gt;Resources/mcw.svg&lt;/icon&gt;
      &lt;tag&gt;developers&lt;/tag&gt;
      &lt;version&gt;0.9.0-alpha&lt;/version&gt;
    &lt;/workbench&gt;
    &lt;macro&gt;
      &lt;name&gt;Problem Solver 9000&lt;/name&gt;
      &lt;description&gt;Deletes all emails in your inbox&lt;/description&gt;
      &lt;subdirectory&gt;./&lt;/subdirectory&gt;
      &lt;file&gt;PS9000.FCMacro&lt;/file&gt;
    &lt;/macro&gt;
  &lt;/content&gt;

&lt;/package&gt;

</pre>
<p>Un paquet avec des d&eacute;pendances&nbsp;:
</p>
<pre>&lt;?xml version="1.0" encoding="UTF-8" standalone="no"&nbsp;?&gt;
&lt;package format="1" xmlns="https://wiki.freecad.org/Package_Metadata"&gt;
  &lt;name&gt;Example with Dependencies&lt;/name&gt;
  &lt;description&gt;An example of the package.xml file format&lt;/description&gt;
  &lt;version&gt;1.0.1-beta3&lt;/version&gt;
  &lt;date&gt;2022-01-07&lt;/date&gt;
  &lt;maintainer email="no-one@freecad.org"&gt;No Maintainer&lt;/maintainer&gt;
  &lt;license file="LICENSE"&gt;GPL-3.0-or-later&lt;/license&gt;
  &lt;url type="repository" branch="main"&gt;https://github.com/chennes/FreeCAD-Package&lt;/url&gt;
  &lt;icon&gt;PackageIcon.svg&lt;/icon&gt;

  &lt;content&gt;
    &lt;workbench&gt;
      &lt;name&gt;Metadata Creation Workbench&lt;/name&gt;
      &lt;description&gt;A set of tools to assist in creation of package.xml metadata files&lt;/description&gt;
      &lt;classname&gt;MetadataCreationWorkbench&lt;/classname&gt;
      &lt;subdirectory&gt;MCW&lt;/subdirectory&gt;
      &lt;icon&gt;Resources/mcw.svg&lt;/icon&gt;
      &lt;tag&gt;developers&lt;/tag&gt;

      &lt;depend&gt;FEM&lt;/depend&gt;
      &lt;depend version_gte="0.3.0"&gt;Curves workbench&lt;/depend&gt;
      &lt;depend version_gte="3.3" version_lt="4"&gt;Steel column&lt;/depend&gt;

      &lt;!-- As of FreeCAD 0.21, additional information may be provided about dependencies --&gt;
      &lt;depend optional="true" type="python"&gt;markdown&lt;/depend&gt;
      &lt;depend type="addon"&gt;TabBar&lt;/depend&gt;

      &lt;!-- If this package is installed, the Addon Manager may warn the user to remove it --&gt;
      &lt;replace&gt;Metadata Creation Workbench Beta&lt;/replace&gt;

      &lt;!-- An unresolvable conflict to prevent installation on, e.g. a specific build --&gt;
      &lt;conflict condition="$BuildRevision==24267"&gt;Do not use with build 24267&lt;/conflict&gt; 

      &lt;!-- Python package dependencies (no support for version information) --&gt;
      &lt;depend&gt;matplotlib&lt;/depend&gt;
      &lt;depend&gt;some_other_package&lt;/depend&gt; &lt;!-- Assumed to be a Python dependency because it's unrecognized --&gt;
    &lt;/workbench&gt;
  &lt;/content&gt;

&lt;/package&gt;

</pre>
<p><br>
</p>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><span typeof="mw:File"><a href="../index.php?title=Power_user_hub.png&amp;filetimestamp=20200511213015&amp;.html" class="mw-file-description"><img src="../File/Power_user_hub.png" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="128" data-file-height="128"></a></span> <a href="../fr/Power_users_hub.html" title="Power users hub/fr">Hub utilisateurs exp&eacute;riment&eacute;s</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b>Scripts FreeCAD&nbsp;:</b> <a href="../fr/Python.html" title="Python/fr">Python</a>, <a href="../fr/Introduction_to_Python.html" title="Introduction to Python/fr">Introduction &agrave; Python</a>, <a href="../fr/Python_scripting_tutorial.html" title="Python scripting tutorial/fr">Tutoriel sur les scripts Python</a>, <a href="../fr/FreeCAD_Scripting_Basics.html" title="FreeCAD Scripting Basics/fr">D&eacute;buter avec les scripts</a></li></ul>
<hr>
<ul><li><b>Modules&nbsp;:</b> <a href="../fr/Builtin_modules.html" title="Builtin modules/fr">Modules int&eacute;gr&eacute;s</a>, <a href="../fr/Units.html" title="Units/fr">Unit&eacute;s</a>, <a href="../fr/Quantity.html" title="Quantity/fr">Quantity</a></li>
<li><b>Ateliers&nbsp;:</b> <a href="../fr/Workbench_creation.html" title="Workbench creation/fr">Cr&eacute;ation d'atelier</a>, <a href="../fr/Gui_Command.html" title="Gui Command/fr">Commands Gui</a>, <a href="../fr/Command.html" title="Command/fr">Les commandes</a>, <a href="../fr/Installing_more_workbenches.html" title="Installing more workbenches/fr">Installer des ateliers suppl&eacute;mentaires</a></li>
<li><b>Maillages et objets Parts&nbsp;:</b> <a href="../fr/Mesh_Scripting.html" title="Mesh Scripting/fr">Scripts Mesh</a>, <a href="../fr/Topological_data_scripting.html" title="Topological data scripting/fr">Script de donn&eacute;es topologiques</a>, <a href="../fr/Mesh_to_Part.html" title="Mesh to Part/fr">Conversion objet Mesh en Part</a>, <a href="../fr/PythonOCC.html" title="PythonOCC/fr">PythonOCC</a></li></ul>
<hr>
<ul><li><b>Objets param&eacute;triques&nbsp;:</b> <a href="../fr/Scripted_objects.html" title="Scripted objects/fr">Objets cr&eacute;&eacute;s par script</a>, <a href="../fr/Viewprovider.html" title="Viewprovider/fr">Viewproviders</a> <small>(<a href="../fr/Custom_icon_in_tree_view.html" title="Custom icon in tree view/fr">Ic&ocirc;ne personnalis&eacute;e dans l'arborescence</a>)</small></li>
<li><b>Sc&eacute;nographie&nbsp;:</b> <a href="../fr/Scenegraph.html" title="Scenegraph/fr">Graphe de sc&egrave;ne Coin (Inventor)</a>, <a href="../fr/Pivy.html" title="Pivy/fr">Pivy</a></li>
<li><b>Interface graphique&nbsp;:</b> <a href="../fr/Interface_creation.html" title="Interface creation/fr">Cr&eacute;ation d'interface</a>, <a href="../fr/Dialog_creation.html" title="Dialog creation/fr">Cr&eacute;ation d'une boite de dialogue</a> <small>(<a href="../fr/Dialog_creation_with_various_widgets.html" title="Dialog creation with various widgets/fr">1</a>, <a href="../fr/Dialog_creation_reading_and_writing_files.html" title="Dialog creation reading and writing files/fr">2</a>, <a href="../fr/Dialog_creation_setting_colors.html" title="Dialog creation setting colors/fr">3</a>, <a href="../fr/Dialog_creation_image_and_animated_GIF.html" title="Dialog creation image and animated GIF/fr">4</a>, <a href="../fr/PySide_usage_snippets.html" title="PySide usage snippets/fr">5</a>)</small>, <a href="../fr/PySide.html" title="PySide/fr">PySide</a>, Exemples PySide <a href="../fr/PySide_Beginner_Examples.html" title="PySide Beginner Examples/fr">d&eacute;butant</a>, <a href="../fr/PySide_Intermediate_Examples.html" title="PySide Intermediate Examples/fr">interm&eacute;diaire</a>, <a href="../fr/PySide_Advanced_Examples.html" title="PySide Advanced Examples/fr">exp&eacute;riment&eacute;</a></li>
<li><b>Macros&nbsp;:</b> <a href="../fr/Macros.html" title="Macros/fr">Macros</a>, <a href="../fr/How_to_install_macros.html" title="How to install macros/fr">Comment installer des macros</a></li>
<li><b>Int&eacute;gration&nbsp;:</b> <a href="../fr/Embedding_FreeCAD.html" title="Embedding FreeCAD/fr">Int&eacute;grer FreeCAD</a>, <a href="../fr/Embedding_FreeCADGui.html" title="Embedding FreeCADGui/fr">Int&eacute;gration de FreeCADGui</a></li></ul>
<hr>
<ul><li><b>Autre&nbsp;:</b> <a href="../fr/Expressions.html" title="Expressions/fr">Expressions</a>, <a href="../fr/Code_snippets.html" title="Code snippets/fr">Extraits de codes</a>, <a href="../fr/Line_drawing_function.html" title="Line drawing function/fr">Fonction - tracer une ligne</a>, <a href="../fr/FreeCAD_vector_math_library.html" title="FreeCAD vector math library/fr">Biblioth&egrave;que math&eacute;matique vectorielle de FreeCAD</a> <small>(d&eacute;pr&eacute;ci&eacute;)</small></li></ul>
<hr>
<ul><li><b>Hubs&nbsp;:</b> <a href="../fr/User_hub.html" title="User hub/fr">Hub utilisateurs</a>, <a href="../fr/Power_users_hub.html" title="Power users hub/fr">Hub utilisateurs exp&eacute;riment&eacute;s</a>, <a href="../fr/Developer_hub.html" title="Developer hub/fr">Hub d&eacute;veloppeurs</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20260112215911
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.060 seconds
Real time usage: 0.085 seconds
Preprocessor visited node count: 522/1000000
Post&#8208;expand include size: 8087/2097152 bytes
Template argument size: 2889/2097152 bytes
Highest expansion depth: 5/100
Expensive parser function count: 1/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 8148/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   21.302      1 -total
 23.37%    4.978      1 Template:Powerdocnavi/fr
 13.93%    2.967      2 Template:VersionNote/fr
 13.63%    2.904     37 Template:Incode
 12.88%    2.743      1 Template:TOCright
 11.97%    2.549      1 Template:Navigation_menu_2
  8.86%    1.888      3 Template:Version/fr
  7.97%    1.698      1 Template:Code
  6.51%    1.386      1 Template:MenuCommand
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:278530-0!canonical and timestamp 20260112215911 and revision id 1737789. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>