<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">PartDesign Bearingholder Tutorial I/fr</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="fr" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-PartDesign+Bearingholder+Tutorial+I&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/PartDesign_Bearingholder_Tutorial_I.html" class="mw-pt-progress mw-pt-progress--complete" title="PartDesign Lagergeh&auml;use Tutorium I (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../PartDesign_Bearingholder_Tutorial_I.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="PartDesign Bearingholder Tutorial I (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../tr/PartDesign_Bearingholder_Tutorial_I.html" class="mw-pt-progress mw-pt-progress--low" title="PartDesign Bearingholder Tutorial I/tr (2% translated)" lang="tr" dir="ltr">T&uuml;rk&ccedil;e</a></li>
<li><a href="../es/PartDesign_Bearingholder_Tutorial_I.html" class="mw-pt-progress mw-pt-progress--low" title="PartDesign Soporte de rodamiento Tutorial I (8% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="fr" dir="ltr">fran&ccedil;ais</span></li>
<li><a href="../it/PartDesign_Bearingholder_Tutorial_I.html" class="mw-pt-progress mw-pt-progress--complete" title="Prima parte del tutorial per creare un supporto per cuscinetto con PartDesign (100% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/PartDesign_Bearingholder_Tutorial_I.html" class="mw-pt-progress mw-pt-progress--complete" title="Poradnik: Projekt cz&#281;&#347;ci, uchwyt &#322;o&#380;yska cze&#347;&#263; 1 (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt-br/PartDesign_Bearingholder_Tutorial_I.html" class="mw-pt-progress mw-pt-progress--low" title="Tutorial de Projeto de Mancais de Apoio I (2% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../ro/PartDesign_Bearingholder_Tutorial_I.html" class="mw-pt-progress mw-pt-progress--high" title="PartDesign Bearingholder Tutorial I (92% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><a href="../ru/PartDesign_Bearingholder_Tutorial_I.html" class="mw-pt-progress mw-pt-progress--low" title="PartDesign Bearingholder Tutorial I/ru (2% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li></ul></div>
<table class="fcinfobox wikitable ct" style="width: 230px; float: right; margin-left: 1em">
<tbody><tr>
<td class="ctTitle" style="font-weight: bold; font-size: 125%;"><span typeof="mw:File"><span><img src="../File/Freecad.svg" decoding="async" width="32" height="32" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span> Tutorial
</td></tr>
<tr>
<th class="ctOdd">Topic
</th></tr>
<tr>
<td class="ctEven">Mod&eacute;lisation
</td></tr>
<tr>
<th class="ctOdd">Level
</th></tr>
<tr>
<td class="ctEven">Utilisateur exp&eacute;riment&eacute;
</td></tr>
<tr>
<th class="ctOdd">Time to complete
</th></tr>
<tr>
<td class="ctEven">
</td></tr>
<tr>
<th class="ctOdd">Authors
</th></tr>
<tr>
<td class="ctEven">NormandC
</td></tr>
<tr>
<th class="ctOdd">FreeCAD version
</th></tr>
<tr>
<td class="ctEven">&ge; 0.19.23300
</td></tr>
<tr>
<th class="ctOdd">Example files
</th></tr>
<tr>
<td class="ctEven">
</td></tr>
<tr>
<th class="ctOdd">See also
</th></tr>
<tr>
<td class="ctEven"><i>None</i>
</td></tr>
<tr>
<td class="ctToc"><br><meta property="mw:PageProp/toc">
</td></tr></tbody></table>
<p><span id="Purpose_in_Brief"></span>
</p>
<h2><span id="L.27objectif_en_deux_mots"></span><span class="mw-headline" id="L'objectif_en_deux_mots">L'objectif en deux mots</span></h2>
<p>Le but de ce tutoriel est de vous pr&eacute;senter deux flux de travail diff&eacute;rents pour cr&eacute;er une pi&egrave;ce moul&eacute;e avec des &eacute;bauches et des cong&eacute;s. Selon les autres programmes de CAO que vous avez utilis&eacute;s, l'un ou l'autre peut vous &ecirc;tre familier. Comme exemple de travail, nous allons mod&eacute;liser un simple support de roulement.
</p><p>Ceci est la premi&egrave;re partie du tutoriel. Elle utilisera ce qu'on pourrait appeler la m&eacute;thode &laquo;corps unique&raquo; , en utilisant la partie (simple) sup&eacute;rieure du support comme un exemple
</p><p>&Eacute;videmment, pour suivre ce tutoriel, vous devez activer l'Atelier Conception de Pi&egrave;ce.
</p><p><span typeof="mw:File"><a href="../index.php?title=HolderTop1-1.jpg&amp;filetimestamp=20130609182657&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-1.jpg" decoding="async" width="400" height="277" class="mw-file-element" data-file-width="600" data-file-height="416"></a></span>
</p>
<p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Tutoriel sur les supports de roulement. Support de roulement termin&eacute; (partie haute)</p>
<p><span id="Design_data"></span>
</p>
<h2><span id="Les_Donn.C3.A9es_de_Conception"></span><span class="mw-headline" id="Les_Donn&eacute;es_de_Conception">Les Donn&eacute;es de Conception</span></h2>
<p>Le support doit &ecirc;tre en mesure de tenir un Roulement d'un diam&egrave;tre de 90mm avec une largeur allant jusqu'&agrave; 33mm (par exemple DIN 630 Type 2308, qui a un diam&egrave;tre int&eacute;rieur de 40 mm). Le roulement n&eacute;cessite une hauteur d'&eacute;paulement d'au moins 4,5 mm dans le support (et sur l'arbre). La partie sup&eacute;rieure du support sera boulonn&eacute; sur l'autre partie avec deux boulons de 12mm. Pour la t&ecirc;te d'un tel boulon, il faudra au moins 20 mm de diam&egrave;tre d'espace libre. Il devrait y avoir une rainure sur les deux c&ocirc;t&eacute;s du roulement capables de tenir un arbre standard bague d'&eacute;tanch&eacute;it&eacute; DIN 3760: 38x55x7 40x55x7 ou sur un c&ocirc;t&eacute;, 50x68x8 de l'autre c&ocirc;t&eacute;.
</p><p>Le support sera r&eacute;alis&eacute; dans un moule en sable avec une &eacute;paisseur minimale de paroi de 5 mm, un angle de d&eacute;pouille de 2 degr&eacute;s, et un rayon de cong&eacute; minimum de 3mm.
</p>
<h2><span id="Mise_en_place_de_la_g.C3.A9om.C3.A9trie_de_l.27ossature"></span><span class="mw-headline" id="Mise_en_place_de_la_g&eacute;om&eacute;trie_de_l'ossature">Mise en place de la g&eacute;om&eacute;trie de l'ossature</span></h2>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop1-2.jpg&amp;filetimestamp=20130610181806&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-2.jpg" decoding="async" width="400" height="284" class="mw-file-element" data-file-width="560" data-file-height="397"></a><figcaption>support de roulement avec les deux plans les plus importants de l'ossature</figcaption></figure>
<p>L'id&eacute;e de la g&eacute;om&eacute;trie de l'ossature est de capturer les dimensions de base de la conception en une caract&eacute;ristique unique de r&eacute;f&eacute;rence (par exemple, un plan ou un axe). Lorsque la dimension de conception change, tout ce qui doit &ecirc;tre fait est de changer la fonction de squelette. Si le mod&egrave;le est bien construit, alors toute sa fonction sera de recalculer pour refl&eacute;ter le changement de conception. Cela r&eacute;duit le risque que, dans un mod&egrave;le complexe, o&ugrave; les dimensions de conception de base sont utilis&eacute;es dans de multiples endroits, vous oubliez de changer des &eacute;l&eacute;ments quelque part.
</p><p>L'alternative &agrave; la g&eacute;om&eacute;trie de l'ossature est d'avoir une table des dimensions de conception de base qui attribuent un nom symbolique &agrave; chaque dimension, puis utilisez le nom symbolique l&agrave; o&ugrave; les dimensions sont n&eacute;cessaires pour construire le mod&egrave;le. FreeCAD ne permet pas encore cette approche
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop1-3.jpg&amp;filetimestamp=20130610183102&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-3.jpg" decoding="async" width="400" height="277" class="mw-file-element" data-file-width="700" data-file-height="485"></a><figcaption>Plans de Base et tous les plans de r&eacute;f&eacute;rence</figcaption></figure>
<p>Dans le cas du support de palier, les deux dimensions de conception les plus importants sont la distance entre les boulons (ce qui limite la taille du roulement qui peut &ecirc;tre utilis&eacute;e) et la hauteur de la t&ecirc;te des boulons. Les dimensions sont choisies * Distance entre les boulons: rayon de roulement (45) + &eacute;paisseur de paroi (5) plus le rayon du trou pour boulon (7) = 57 mm, de sorte que le plan vertical de 57 mm est d&eacute;cal&eacute; par rapport au plan YZ. Pour cr&eacute;er ce plan de r&eacute;f&eacute;rence, s&eacute;lectionnez le plan YZ et ensuite choisir de cr&eacute;er un nouveau plan de r&eacute;f&eacute;rence. Entrez le d&eacute;calage dans la bo&icirc;te de dialogue qui se ouvre * Hauteur de t&ecirc;tes de boulons: Cela a &eacute;t&eacute; choisi comme un d&eacute;calage de 28mm du plan XZ
</p><p>Pour plus de commodit&eacute;, deux autres plans de r&eacute;f&eacute;rence peuvent &ecirc;tre cr&eacute;&eacute;s pour refl&eacute;ter la quantit&eacute; de mat&eacute;riau qui doit &ecirc;tre coup&eacute;e  des c&ocirc;t&eacute;s du support d&eacute;roulement. Ils sont d&eacute;cal&eacute;s de +22 et -22 depuis le plan XY.
</p><p>Il est conseill&eacute; de donner des noms clairs &agrave; la g&eacute;om&eacute;trie du de l'ossature. La plupart du temps, vous voudrez d&eacute;sactiver la visibilit&eacute; des plans de r&eacute;f&eacute;rence, car ils encombrent l'&eacute;cran, et si les plans ont des noms explicites vous pouvez simplement choisir leur nom au lieu de les choisir depuis l'&eacute;cran. <br clear="all">
</p><p><span id="The_solid_geometry"></span>
</p>
<h2><span id="Le_solide_g.C3.A9om.C3.A9trique"></span><span class="mw-headline" id="Le_solide_g&eacute;om&eacute;trique">Le solide g&eacute;om&eacute;trique</span></h2>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop1-4.jpg&amp;filetimestamp=20130612185214&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-4.jpg" decoding="async" width="400" height="244" class="mw-file-element" data-file-width="1126" data-file-height="686"></a><figcaption> Croquis du premi&egrave;re protusion</figcaption></figure><p> Maintenant il est temps de commencer &agrave; cr&eacute;er une g&eacute;om&eacute;trie r&eacute;elle. L'esquisse pour la premi&egrave;re protusion est affich&eacute;e sur la droite. Elle est plac&eacute;e sur le plan XY. Il y a juste trois dimensions: le rayon int&eacute;rieur (de 22,5 mm), l'allocation d'usinage (3mm) &agrave; la base comme un d&eacute;calage au pla-XZ et la distance entre le plan de r&eacute;f&eacute;rence repr&eacute;sentant l'axe du boulon (7mm). Cela signifie que si vous vous d&eacute;placez plus tard, le plan de r&eacute;f&eacute;rence, la protusion ajustera automatiquement son rayon ext&eacute;rieur. N'oubliez pas qu'avant de pouvoir utiliser le plan de r&eacute;f&eacute;rence pour le dimensionnement, vous devez introduire la g&eacute;om&eacute;trie externe au sketcher
</p><p>Vous vous demandez probablement pourquoi il y a ce petit segment de droite au bas de chaque arc. Ce segment indique qu'il y aura un angle de deux degr&eacute;s sur les arcs. Cela pourrait ressembler &agrave; beaucoup de travail pour un tr&egrave;s petit avantage, mais de nombreux programmes de CAO (et peut-&ecirc;tre un jour FreeCAD) disposent d'outils qui mettent en &eacute;vidence un mod&egrave;le solide en diff&eacute;rentes couleurs imm&eacute;diatement et vous pr&eacute;sentent toutes les faces o&ugrave; l'angle de d&eacute;pouille n'est pas correct. Vous ne voulez pas que cela arrive &agrave; votre mod&egrave;le, en particulier apr&egrave;s la mise en place d'un grand nombre de cong&eacute;s! <br clear="all">
</p><p>Lorsque vous avez fait le croquis (qui est un peu difficile &agrave; cause des deux degr&eacute;s des lignes tangentielles), ajuster la protusion sym&eacute;triquement au plan d'esquisse d'une longueur de 62mm: 34mm pour le palier, 2x 9mm pour les bagues d'&eacute;tanch&eacute;it&eacute;, 2x 5mm pour l'&eacute;paisseur de paroi. <br clear="all">
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop1-5.jpg&amp;filetimestamp=20130612190636&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-5.jpg" decoding="async" width="400" height="229" class="mw-file-element" data-file-width="1048" data-file-height="601"></a><figcaption> Croquis de la coupe sur le cot&eacute; de la Protusion</figcaption></figure><p> Ensuite, nous voulons  retrancher certains mat&eacute;riaux o&ugrave; sont les bagues d'&eacute;tanch&eacute;it&eacute;, parce que leur diam&egrave;tre ext&eacute;rieur est beaucoup moins que le roulement . La meilleure fa&ccedil;on de cr&eacute;er les croquis est de s&eacute;lectionner l'esquisse de la protusion et puis choisissez "s&eacute;lection Dupliquer" dans le menu d'&eacute;dition. Vous pouvez ensuite red&eacute;finir le croquis sur le c&ocirc;t&eacute; de la protusion, et le modifier comme indiqu&eacute; dans l'image.
</p><p>Les deux seules dimensions importantes dans l'esquisse sont 3 mm de sur&eacute;paisseur d'usinage au fond, et un diam&egrave;tre int&eacute;rieur de 78mm&nbsp;: 68mm pour le diam&egrave;tre ext&eacute;rieur de l'&eacute;paisseur de paroi + 2x5mm de bague d'&eacute;tanch&eacute;it&eacute;. Puisque la bague d'&eacute;tanch&eacute;it&eacute; de l'autre c&ocirc;t&eacute; aura un diam&egrave;tre de 55mm, la d&eacute;coupe peut &ecirc;tre de 65mm ici.
</p><p>Apr&egrave;s avoir cr&eacute;&eacute; l'esquisse, creusez jusqu'au plan de r&eacute;f&eacute;rence marquant le cot&eacute; du roulement plus l'&eacute;paisseur de paroi 5 mm . Si jamais vous voulez modifier le support pour qu'il soit  capable de porter des roulements plus larges, tout ce que vous avez &agrave; faire est de changer la dimension de ces plans de r&eacute;f&eacute;rence, et la profondeur de d&eacute;coupe devra suivre. <br clear="all">
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop1-6.jpg&amp;filetimestamp=20130612193209&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-6.jpg" decoding="async" width="400" height="254" class="mw-file-element" data-file-width="1106" data-file-height="703"></a><figcaption>Croquis de d&eacute;coupe &agrave; l'int&eacute;rieur de la protusion</figcaption></figure><p> Pour r&eacute;duire la quantit&eacute; d'usinage n&eacute;cessaire, nous voulons aussi d&eacute;couper certains mat&eacute;riaux &agrave; l'int&eacute;rieur du support . Encore une fois, la duplication de l'esquisse de la premi&egrave;re Protusion est pratique. Elle n'a m&ecirc;me pas besoin d'&ecirc;tre reconfigur&eacute;e. Encore une fois, les seules dimensions importantes sont la sur&eacute;paisseur d'usinage (3mm) et les diam&egrave;tres ext&eacute;rieurs: 84mm pour le l'emplacement du roulement  (90mm - 2x allocation d'usinage), 49mm pour le petit anneau d'&eacute;tanch&eacute;it&eacute; (55mm - 2x 3mm) et 62mm pour la bague d'&eacute;tanch&eacute;it&eacute; plus grande.
</p><p>Apr&egrave;s avoir cr&eacute;&eacute; les esquisses, les creuser: Sym&eacute;triquement 28mm pour la d&eacute;coupe du roulement (34mm - 2x sur&eacute;paisseur d'usinage ) et 23mm sur un cot&eacute; pour les d&eacute;coupes des bagues d'&eacute;tanch&eacute;it&eacute;: 34mm / 2 pour la moiti&eacute; de la largeur du roulement + 9mm pour la bagues d'&eacute;tanch&eacute;it&eacute; - sur&eacute;paisseur d'usinage de 3mm. <br clear="all">
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop1-7.jpg&amp;filetimestamp=20130612193845&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-7.jpg" decoding="async" width="400" height="273" class="mw-file-element" data-file-width="1050" data-file-height="717"></a><figcaption>G&eacute;om&eacute;trie principale du haut du support</figcaption></figure><p> La pi&egrave;ce doit maintenant ressembler &agrave; l'image sur la droite. Notez comment les diff&eacute;rentes d&eacute;coupes se combinent pour cr&eacute;er une &eacute;paisseur de paroi presque uniforme, ce qui rendra la coul&eacute;e plus facile et moins susceptibles d'avoir des pores. <br clear="all">
</p><figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop1-8.jpg&amp;filetimestamp=20130612194752&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-8.jpg" decoding="async" width="400" height="276" class="mw-file-element" data-file-width="1123" data-file-height="774"></a><figcaption>Croquis avec l'emplacement des boulons</figcaption></figure><p> Maintenant tout ce qui reste a faire est de cr&eacute;er de la mati&egrave;re pour le passage des boulons. Vous pourriez &ecirc;tre tent&eacute; d'esquisser ceci comme un cercle puis le protuser, mais cela vous dirigera vers des probl&egrave;mes lorsque vous essaierez de le mettre plus tard sur le projet (je suppose que c'est une faiblesse d'OpenCascade). Donc, pour &eacute;viter les probl&egrave;mes, il est pr&eacute;f&eacute;rable de cr&eacute;er une esquisse de l'angle projet&eacute;  inclus, puis la tourner de 360 degr&eacute;s.
</p><p>L&agrave; encore, les plans de l'ossature deviennent utile. Vous aurez besoin du plan de l'axe du boulon et du plan de la t&ecirc;te du boulon comme g&eacute;om&eacute;trie externe. Ensuite, cr&eacute;ez une ligne droite pour l'axe de rotation et assurez-vous qu'il est contraint &agrave; l'axe du boulon du plan de r&eacute;f&eacute;rence. Le basculer pour devenir une g&eacute;om&eacute;trie de construction. Puis, esquisser le reste du contour. Les dimensions importantes sont la sur&eacute;paisseur d'usinage en haut et en bas et le rayon de 12 mm&nbsp;: 7 mm pour le rayon du trou + &eacute;paisseur de paroi de 5 mm. <br clear="all">
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop1-9.jpg&amp;filetimestamp=20130612195344&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-9.jpg" decoding="async" width="400" height="273" class="mw-file-element" data-file-width="1116" data-file-height="763"></a><figcaption>g&eacute;om&eacute;trie finie de la partie sup&eacute;rieure du support (sans projet et  cong&eacute;s)</figcaption></figure><p> Cr&eacute;er une fonction de r&eacute;volution de l'esquisse, puis la sym&eacute;triser sur le plan YZ . C'est toute la g&eacute;om&eacute;trie solide nous devons mod&eacute;liser. Le reste est brouillon et cong&eacute;s. <br clear="all">
</p><p><span id="Applying_draft_to_the_side_faces"></span>
</p>
<h2><span id="Application_de_d.C3.A9pouille_sur_les_faces_lat.C3.A9rales"></span><span class="mw-headline" id="Application_de_d&eacute;pouille_sur_les_faces_lat&eacute;rales">Application de d&eacute;pouille sur les faces lat&eacute;rales</span></h2>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop1-10.jpg&amp;filetimestamp=20130616085052&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-10.jpg" decoding="async" width="400" height="254" class="mw-file-element" data-file-width="1104" data-file-height="700"></a><figcaption> Le plan neutre pour la cr&eacute;ation de d&eacute;pouille</figcaption></figure><p> L'&eacute;tape suivante consiste &agrave; appliquer des d&eacute;pouilles sur toutes les faces . Il est important de bien choisir l'emplacement du plan neutre, c'est le plan autour duquel on tourne. Si nous choisissons comme plan neutre, le bas du support, alors nous aurons un probl&egrave;me avec l'&eacute;paisseur de paroi dans la partie sup&eacute;rieure du support. Par cons&eacute;quent, nous cr&eacute;ons un plan de r&eacute;f&eacute;rence avec un d&eacute;calage de 40 mm par rapport au plan XZ comme un compromis entre le haut de la porte devant mince et le bas de devenant large . <br clear="all">
</p><figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop1-11.jpg&amp;filetimestamp=20130616085807&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-11.jpg" decoding="async" width="400" height="170" class="mw-file-element" data-file-width="1035" data-file-height="441"></a><figcaption>Application de d&eacute;pouille sur les faces lat&eacute;rales du support</figcaption></figure><p> Pour mettre une d&eacute;pouille sur une face , s&eacute;lectionner cette face et  cr&eacute;er la caract&eacute;ristique de la d&eacute;pouille . Vous pouvez ensuite s&eacute;lectionner plusieurs faces et appliquer la d&eacute;pouille dessus . Si vous avez une grande pi&egrave;ce, il est conseill&eacute; de d&eacute;pouiller une seule face &agrave; la fois. Cela signifie que si vous modifiez la g&eacute;om&eacute;trie et qu'une d&eacute;pouille &eacute;choue, seul cette  caract&eacute;ristique va &eacute;chouer, alors que si vous mettez sur tous les faces une fonction de d&eacute;pouille, alors l'ensemble  des fonction ensemble pourrait &eacute;chouer &agrave; cause d'une faute d'une face. Pour une petite pi&egrave;ce comme le support de roulement, c'est suffisant de cr&eacute;er deux fonctions de d&eacute;pouille&nbsp;: Une pour les quatre faces ext&eacute;rieures, et une pour les faces internes.
</p><p>La bo&icirc;te de dialogue va vous forcer &agrave; choisir un plan neutre avant de remplir. Vous pouvez laisser la direction d'&eacute;tirement vide, dans ce cas, il sera perpendiculaire au plan neutre. Ne oubliez pas de r&eacute;gler l'angle de d&eacute;pouille &agrave; 2 degr&eacute;s. <br clear="all">
</p><p><span id="Filleting_the_holder"></span>
</p>
<h2><span id="Cong.C3.A9s_sur_le_support"></span><span class="mw-headline" id="Cong&eacute;s_sur_le_support">Cong&eacute;s sur le support</span></h2>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop1-13.jpg&amp;filetimestamp=20130616091631&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-13.jpg" decoding="async" width="400" height="275" class="mw-file-element" data-file-width="965" data-file-height="663"></a><figcaption>Cong&eacute;s o&ugrave; seront les boulons</figcaption></figure><p> Nous pouvons maintenant arrondir la pi&egrave;ce. La photo montre le premier jeu de cong&eacute;s. Commencez par les petits cong&eacute;s circulaires et leurs donner un rayon 4mm. M&ecirc;me si 3 mm suffiraient selon les sp&eacute;cifications de la pi&egrave;ce, un rayon de 4 mm signifie qu'apr&egrave;s l'usinage du cong&eacute;  1 mm est laiss&eacute;, r&eacute;duisant l'ar&ecirc;te vive produite par l'usinage. Les grands cong&eacute;s ont un rayon de 6mm pour aider &agrave; r&eacute;pandre la force des boulons sur le reste de la pi&egrave;ce. Ce serait bien de faire ce rayon encore plus grand, mais malheureusement OpenCascade ne peut pas g&eacute;rer encore les cong&eacute;s qui se chevauchent .
</p><p>Comme avec les d&eacute;pouilles, dans un cadre complexe, vous devez arrondir un seul bord &agrave; la fois pour &eacute;viter les &eacute;checs inutiles si la g&eacute;om&eacute;trie de base change. <br clear="all">
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop1-12.jpg&amp;filetimestamp=20130616091416&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-12.jpg" decoding="async" width="400" height="259" class="mw-file-element" data-file-width="1036" data-file-height="671"></a><figcaption> Cong&eacute; &agrave; l'ext&eacute;rieur du support</figcaption></figure><p> Le reste des cong&eacute;s ont tout simplement un rayon de 3 mm. En regardant l'image sur la droite, les deux cong&eacute;s mis en &eacute;vidence pourraient effectivement &ecirc;tre des cong&eacute;s avec un rayon de 5 mm pour atteindre une &eacute;paisseur de paroi plus uniforme pour la coul&eacute;e. Apr&egrave;s usinage, l'&eacute;paisseur de paroi minimale de 5 mm serait toujours maintenue. Mais encore une fois le fait que OpenCascade ne peut pas g&eacute;rer le chevauchement des cong&eacute;s nous emp&ecirc;che de le faire pour les deux cong&eacute;s int&eacute;rieurs mis en &eacute;vidence. <br clear="all">
</p><figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop1-14.jpg&amp;filetimestamp=20130616092602&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-14.jpg" decoding="async" width="400" height="331" class="mw-file-element" data-file-width="833" data-file-height="689"></a><figcaption>Cong&eacute; &agrave; l'int&eacute;rieur du support - bord probl&eacute;matique</figcaption></figure><p> Faire des cong&eacute;s l'int&eacute;rieur de la pi&egrave;ce nous pr&eacute;sente une difficult&eacute; qui ne peut &ecirc;tre r&eacute;solue avec les outils actuels dans l'atelier PartDesign. Le bord du cong&eacute; ne peut pas du tout &ecirc;tre mis en &eacute;vidence , encore une fois parce que les cong&eacute;s se chevaucheraient. Cela pourrait &ecirc;tre contourn&eacute; par la cr&eacute;ation d'une courbe &agrave; la place d'un cong&eacute;, sauf que les courbes ne sont pas encore mises en &oelig;uvre dans PartDesign. Pour le moment, nous sommes forc&eacute;s de quitter le bord comme il est. <br clear="all">
</p><figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop1-15.jpg&amp;filetimestamp=20130616093234&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-15.jpg" decoding="async" width="400" height="279" class="mw-file-element" data-file-width="1051" data-file-height="734"></a><figcaption>La pi&egrave;ce en cong&eacute; (sauf pour le bord impossible)</figcaption></figure><p> L'image de droite montre la pi&egrave;ce finie dans l'&eacute;tat o&ugrave; elle sera avant l'usinage (&agrave; l'exception de l'un des bords o&ugrave; il est impossible de cr&eacute;er un cong&eacute;). Vous remarquerez qu'un bord qui tourne autour de toute la pi&egrave;ce a &eacute;t&eacute; laiss&eacute; sans cong&eacute; dans ce but. Il s'agit du bord o&ugrave; la partie inf&eacute;rieure et la partie sup&eacute;rieure du moule se rencontrent. Ici, pas de cong&eacute; possible (et aucun n' est requis de toute fa&ccedil;on). <br clear="all">
</p><p><span id="Machining"></span>
</p>
<h2><span class="mw-headline" id="Usinage">Usinage</span></h2>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop1-16.jpg&amp;filetimestamp=20130616094809&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-16.jpg" decoding="async" width="400" height="201" class="mw-file-element" data-file-width="1098" data-file-height="552"></a><figcaption>Usinage haut et bas du support</figcaption></figure> <figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop1-17.jpg&amp;filetimestamp=20130616115136&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-17.jpg" decoding="async" width="400" height="295" class="mw-file-element" data-file-width="958" data-file-height="706"></a><figcaption>Usinage int&eacute;rieur du support de Roulement</figcaption></figure><p> maintenant, nous pouvons couper le mat&eacute;riel qui sera usin&eacute; &agrave; partir de la pi&egrave;ce brute en fonte. C'est tr&egrave;s facile avec la g&eacute;om&eacute;trie du squelette d&eacute;fini. L'id&eacute;e est de cr&eacute;er toutes les caract&eacute;ristiques d'usinage (Cavit&eacute;s et  rainures) en utilisant uniquement  donn&eacute;e caract&eacute;ristiques. Cela signifie qu'ils vont &ecirc;tre totalement ind&eacute;pendant de la g&eacute;om&eacute;trie solide du support de roulement, ce qui nous donne quelques grands avantages: * Peu importe comment vous modifiez la g&eacute;om&eacute;trie solide, les caract&eacute;ristiques pour l'usinage ne pourront pas &eacute;chouer. * Vous pouvez cr&eacute;er la g&eacute;om&eacute;trie d'usinage avant de finaliser le solide, ce qui vous donne une r&eacute;troaction visuelle utile. * Si vous d&eacute;placez les plans squelettes de rep&egrave;re, alors la g&eacute;om&eacute;trie du solide et l'usinage s'adapteront automatiquement en m&ecirc;me temps . * Si vous faites une erreur dans votre g&eacute;om&eacute;trie solide, l'usinage sera toujours dans la position correcte, et tr&egrave;s probablement l'erreur deviendra flagrante (par exemple, une &eacute;paisseur de paroi de 2 mm au lieu 5mm). Alors que si vous faites r&eacute;f&eacute;rence &agrave; l'usinage de la g&eacute;om&eacute;trie solide, il va s'adapter &agrave; l'erreur dans le solide et, par exemple maintenir l'&eacute;paisseur de paroi de 5 mm, juste au mauvais endroit o&ugrave; se trouve le solide.
</p><p>Avant de commencer la g&eacute;om&eacute;trie d'usinage, j'aime placer un point de r&eacute;f&eacute;rence dans l'arbre et le nommer comme "Usinage_d&eacute;marrera_ici". C'est utile si vous souhaitez basculer entre l'&eacute;tat brut et l'&eacute;tat usin&eacute; de la pi&egrave;ce parce que vous pouvez voir en un coup d'&oelig;il o&ugrave; d&eacute;placer le point d'insertion pour obtenir l'&eacute;tat brut.
</p><p>Pour usiner la partie inf&eacute;rieure du support, il suffit de tracer un grand rectangle dans le plan XZ et le creuser. Pour le haut, esquisser un cercle sur le plan de r&eacute;f&eacute;rence d&eacute;finissant l'emplacement de la t&ecirc;te de vis, puis sym&eacute;triser la cavit&eacute; sur le plan YZ. De la m&ecirc;me mani&egrave;re, cr&eacute;er une cavit&eacute; pour le trou o&ugrave; passe le boulon et le sym&eacute;triser. Pour usiner l'int&eacute;rieur du support, cr&eacute;er une esquisse sur le plan YZ et le rainurer. <br clear="all">
</p>
<figure class="mw-halign-right" typeof="mw:File/Thumb"><a href="../index.php?title=HolderTop1-1.jpg&amp;filetimestamp=20130609182657&amp;.html" class="mw-file-description"><img src="../File/HolderTop1-1.jpg" decoding="async" width="400" height="277" class="mw-file-element" data-file-width="600" data-file-height="416"></a><figcaption> Pi&egrave;ce finie</figcaption></figure><p> Une fois que vous avez r&eacute;aliser l'usinage, vous pouvez avoir un bon effet visuel en colorant toutes les surfaces usin&eacute;es de sorte que vous pouvez voir d'un coup d'&oelig;il les parties qui sont brut de fonderie et celles qui sont usin&eacute;es apr&egrave;s la coul&eacute;e.
</p><p><br clear="all">
</p><p><span id="Final_notes"></span>
</p>
<h2><span class="mw-headline" id="Notes_Finales">Notes Finales</span></h2>
<p>Nous avons mod&eacute;lis&eacute; le haut du support de roulement avec les dimensions qu'il aura apr&egrave;s la coul&eacute;e. Pour cr&eacute;er le moule, vous devez appliquer un retrait &agrave; votre pi&egrave;ce parce que apr&egrave;s la coul&eacute;e, lorsque le m&eacute;tal chaud se refroidit, il va diminuer de quelques pour cent (selon le mat&eacute;riau). Habituellement, il est pr&eacute;f&eacute;rable de laisser l'application de retrait &agrave; la fonderie faisant la pi&egrave;ce parce qu'ils ont les connaissances particuli&egrave;res requises. Ils devraient &eacute;galement vous dire si votre pi&egrave;ce comporte des zones probl&eacute;matiques, par exemple parois tr&egrave;s &eacute;paisse rejoignant brusquement des sections tr&egrave;s minces sans transition correcte entre elles.
</p>
<h2><span class="mw-headline" id="Partie_Deux">Partie Deux</span></h2>
<p><a href="../fr/PartDesign_Bearingholder_Tutorial_II.html" title="PartDesign Bearingholder Tutorial II/fr">Tutoriel de Conception Support de Roulement II</a>
</p>
<div style="clear:both"></div>
<!-- 
NewPP limit report
Cached time: 20251220223849
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.071 seconds
Real time usage: 0.091 seconds
Preprocessor visited node count: 110/1000000
Post&#8208;expand include size: 1570/2097152 bytes
Template argument size: 144/2097152 bytes
Highest expansion depth: 4/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 2422/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    8.266      1 -total
 35.24%    2.913      1 Template:Clear
 35.15%    2.905      1 Template:TutorialInfo
 25.21%    2.084      1 Template:Caption
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:55225-0!canonical and timestamp 20251220223849 and revision id 1687156. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>