<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Release notes 0.16/fr</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="fr" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Release+notes+0.16&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/Release_notes_0.16.html" class="mw-pt-progress mw-pt-progress--complete" title="Versionshinweise 0.16 (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Release_notes_0.16.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Release notes 0.16 (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/Release_notes_0.16.html" class="mw-pt-progress mw-pt-progress--low" title="Notas del lanzamiento 0.16 (3% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="fr" dir="ltr">fran&ccedil;ais</span></li>
<li><a href="../it/Release_notes_0.16.html" class="mw-pt-progress mw-pt-progress--complete" title="Note di rilascio della versione 0.16 (100% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Release_notes_0.16.html" class="mw-pt-progress mw-pt-progress--complete" title="Informacje o wydaniu 0.16 (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt/Release_notes_0.16.html" class="mw-pt-progress mw-pt-progress--med" title="Notas de lan&ccedil;amento da vers&atilde;o 0.16 (22% translated)" lang="pt" dir="ltr">portugu&ecirc;s</a></li>
<li><a href="../ru/Release_notes_0.16.html" class="mw-pt-progress mw-pt-progress--low" title="&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1103; &#1082; &#1074;&#1099;&#1087;&#1091;&#1089;&#1082;&#1091; 0.16 (3% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li></ul></div>
<p>FreeCAD 0.16 a &eacute;t&eacute; publi&eacute; le 18 avril 2016, obtenez la depuis la page <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/releases/tag/0.16">GitHub</a>. Ceci est un r&eacute;sum&eacute; des changements les plus int&eacute;ressants. La liste compl&egrave;te des changements peut &ecirc;tre trouv&eacute;e dans <a rel="nofollow" class="external text" href="http://www.freecad.org/tracker/changelog_page.php">sur Mantis (en anglais)</a>. Les versions plus anciennes&nbsp;: <a href="../fr/Release_notes_0.15.html" title="Release notes 0.15/fr">0.15</a> - <a href="../fr/Release_notes_0.14.html" title="Release notes 0.14/fr">0.14</a> - <a href="../fr/Release_notes_0.13.html" title="Release notes 0.13/fr">0.13</a> - <a href="../fr/Release_notes_0.12.html" title="Release notes 0.12/fr">0.12</a> - <a href="../fr/Release_notes_0.11.html" title="Release notes 0.11/fr">0.11</a><br>
</p><p><span typeof="mw:File"><a href="../index.php?title=Satnogs_Rotator_FreeCAD.jpg&amp;filetimestamp=20160201215017&amp;.html" class="mw-file-description"><img src="../File/Satnogs_Rotator_FreeCAD.jpg" decoding="async" width="1024" height="576" class="mw-file-element" data-file-width="1920" data-file-height="1080"></a></span>
</p>
<center>Satnogs Rotator (<a rel="nofollow" class="external free" href="https://satnogs.org/">https://satnogs.org/</a>)</center>
<meta property="mw:PageProp/toc">
<h2><span id="Nouveaut.C3.A9s_Principales"></span><span class="mw-headline" id="Nouveaut&eacute;s_Principales">Nouveaut&eacute;s Principales</span></h2>
<p><b>Le support d'expression</b> a &eacute;t&eacute; introduit, ce qui permet de d&eacute;finir des relations entre des objets par des formules. Le support d'expression est une avanc&eacute;e majeur pour cr&eacute;er de meilleurs mod&egrave;les param&eacute;trique avec FreeCAD. Le support d'expressions offre une interface simple pour cr&eacute;er des mod&egrave;le pilotable avec une feuille de tableur.
</p><p><span typeof="mw:File"><a href="../index.php?title=Expressions-demo.png&amp;filetimestamp=20160104174250&amp;.html" class="mw-file-description"><img src="../File/Expressions-demo.png" decoding="async" width="300" height="173" class="mw-file-element" data-file-width="561" data-file-height="323"></a></span>
</p><p>Le comportement du <b>solveur d'esquisse</b> a &eacute;t&eacute; grandement am&eacute;lior&eacute;. En plus d'&ecirc;tre plus rapide et plus stable, il ne se bloque plus sur les esquisses insolubles. Et le recalcule automatique du document apr&egrave;s chaque petit changement dans l'esquisse peut d&eacute;sormais &ecirc;tre d&eacute;sactiv&eacute; &agrave; la vol&eacute;e, ce qui facilite l'&eacute;dition d'esquisse enterr&eacute;e sous de profondes d&eacute;pendances.
</p><p><span typeof="mw:File"><a href="../index.php?title=Sketcher-v0.16-demo.png&amp;filetimestamp=20160104175547&amp;.html" class="mw-file-description"><img src="../File/Sketcher-v0.16-demo.png" decoding="async" width="300" height="225" class="mw-file-element" data-file-width="519" data-file-height="389"></a></span>
</p><p>FreeCAD supporte maintenant de nouveaux styles de navigation dont un tactile. Cela rend possible l'utilisation de FreeCAD sans souris, sur un laptop convertible, avec un &eacute;cran tactile et un stylet.
</p><p><b>L'atelier FEM</b> a re&ccedil;u des tonnes d'am&eacute;liorations. Il est d&eacute;montr&eacute; qu'il est utilisable pour diff&eacute;rents types d'analyses m&eacute;canique.
</p><p><span typeof="mw:File"><a href="../index.php?title=Multiple_material.jpg&amp;filetimestamp=20160115220713&amp;.html" class="mw-file-description"><img src="../File/Multiple_material.jpg" decoding="async" width="700" height="438" class="mw-file-element" data-file-width="1440" data-file-height="900"></a></span>
</p>
<h2><span id="G.C3.A9n.C3.A9ral"></span><span class="mw-headline" id="G&eacute;n&eacute;ral">G&eacute;n&eacute;ral</span></h2>
<ul><li>Support des expressions/formules</li>
<li>Trois nouveaux styles de navigation&nbsp;: Gesture (avec le support du tactile sur Windows), Maya, et OpenCascade.</li>
<li>Liste des ateliers personnalisable (la liste peut &ecirc;tre r&eacute;ordonn&eacute;e et chacun des ateliers peut &ecirc;tre masqu&eacute; de la liste)</li>
<li>Outils de r&eacute;cup&eacute;ration de projet</li>
<li>Nouvelles options de sauvegarde (R&eacute;tablir, Enregistrer une copie)</li>
<li>Nouvelle page d'accueil</li></ul>
<h2><span class="mw-headline" id="Atelier_Part">Atelier Part</span></h2>
<ul><li>Nouvel outils pour fusionner des objets creux (ex: des tuyaux)&nbsp;: <a href="../fr/Part_JoinConnect.html" title="Part JoinConnect/fr">Connecter</a>, <a href="../fr/Part_JoinEmbed.html" title="Part JoinEmbed/fr">Int&eacute;grer</a> and <a href="../fr/Part_JoinCutout.html" title="Part JoinCutout/fr">D&eacute;couper</a></li>
<li>Nouvelle fonction: Cr&eacute;er une face &agrave; partir d'une esquisse (param&eacute;trique)</li></ul>
<h2><span id="Ateliers_PartDesign_.26_Sketcher"></span><span class="mw-headline" id="Ateliers_PartDesign_&amp;_Sketcher">Ateliers PartDesign &amp; Sketcher</span></h2>
<ul><li>Nouvelle fonction&nbsp;: bascule entre les <a href="../fr/Sketcher_ToggleDrivingConstraint.html" title="Sketcher ToggleDrivingConstraint/fr">contraintes R&eacute;f&eacute;rence et Pilote</a></li>
<li>Nouvelle fonction&nbsp;: mode cr&eacute;ation continue (l'outil reste actif)</li>
<li>Nouvelle fonction&nbsp;: contraintes Non-pilote (ou contrainte pilot&eacute;e)</li>
<li>Acc&eacute;l&eacute;ration majeure</li>
<li>Contr&ocirc;le avanc&eacute; du solveur</li>
<li>Nouvelles fonctions&nbsp;: outils pour copier, faire un miroir et un r&eacute;seau rectangulaire.</li>
<li>Support des <a href="../fr/Expressions.html" title="Expressions/fr">expressions/formules</a> dans les contraintes et les propri&eacute;t&eacute;s.</li></ul>
<p><span id="Spreadsheet_Workbench"></span>
</p>
<h2><span class="mw-headline" id="Atelier_Tableur">Atelier Tableur</span></h2>
<ul><li>Ajout des fonctions&nbsp;: round, trunc, ceil, et floor.</li></ul>
<p><span id="Draft_Workbench"></span>
</p>
<h2><span class="mw-headline" id="Atelier_Draft">Atelier Draft</span></h2>
<ul><li><b>Nouveau importer DXF</b>: L'atelier Draft dispose d'un tout nouveau importer DXF, cod&eacute; enti&egrave;rement en C++, h&eacute;rit&eacute; de <a rel="nofollow" class="external text" href="https://github.com/Heeks/heekscad">HeeksCad</a>, qui n'a plus besoin d'&ecirc;tre t&eacute;l&eacute;charg&eacute; sur Internet et qui est plus rapide  et robuste avec les gros fichiers. Une option dans les pr&eacute;f&eacute;rence DXF permet de basculer sur l'ancien importer si besoin.</li>
<li>Un nouvel <b><a href="../fr/Draft_Mirror.html" title="Draft Mirror/fr">outil Miroir</a></b> permet de faire une sym&eacute;trie "&agrave; la Draft"</li>
<li>Plusieurs <b>patrons DXF</b> ont &eacute;t&eacute; ajout&eacute; en correspondance avec leur mod&egrave;le SVG facilitant l'export des pages de dessins en DXF.</li>
<li>Les objets <a href="../fr/Draft_Rectangle.html" title="Draft Rectangle/fr">Rectangles</a>,<a href="../fr/Draft_Wire.html" title="Draft Wire/fr">Filaires et Lignes</a> peuvent maintenant &ecirc;tre <b>subdivis&eacute;s</b>, permettant toute sorte de nouvelles combinaisons de forme.</li></ul>
<p><br>
<span typeof="mw:File"><a href="../index.php?title=Draft_subdivisions.jpg&amp;filetimestamp=20160106133831&amp;.html" class="mw-file-description"><img src="../File/Draft_subdivisions.jpg" decoding="async" width="1024" height="538" class="mw-file-element" data-file-width="1503" data-file-height="790"></a></span>
</p>
<h2><span class="mw-headline" id="Atelier_Drawing">Atelier Drawing</span></h2>
<ul><li>Un nouvel objet <b><a href="../fr/Drawing_SpreadsheetView.html" title="Drawing SpreadsheetView/fr">Vue tableur</a></b> permet de placer une r&eacute;gion de cellules d'un <a href="../fr/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/fr">tableur</a> dans une page de dessin.</li></ul>
<p><span typeof="mw:File"><a href="../index.php?title=Drawing_spreadsheetview.jpg&amp;filetimestamp=20160106133510&amp;.html" class="mw-file-description"><img src="../File/Drawing_spreadsheetview.jpg" decoding="async" width="1024" height="421" class="mw-file-element" data-file-width="1919" data-file-height="789"></a></span>
</p>
<h2><span class="mw-headline" id="Atelier_Arch">Atelier Arch</span></h2>
<ul><li><b><a href="../fr/Arch_SetMaterial.html" title="Arch SetMaterial/fr">Support des Materiaux</a></b>: Un objet Arch peut maintenant avoir un <a href="../Material.html" title="Material">mat&eacute;riau</a> associ&eacute;, qui utilise le framework des mat&eacute;riaux int&eacute;gr&eacute; &agrave; FreeCAD. Ces mat&eacute;riaux sont partag&eacute;s entre les ateliers. Ils sont pleinement support&eacute; lors de l'import et l'export IFC.</li>
<li>La <b><a href="../fr/Arch_SectionPlane.html" title="Arch SectionPlane/fr">Section plane</a></b> peut maintenant faire une coupe dans la vue 3D montrant en temps r&eacute;el la section.</li></ul>
<p><span typeof="mw:File"><a href="../index.php?title=Arch_clip_plane.jpg&amp;filetimestamp=20160106132627&amp;.html" class="mw-file-description"><img src="../File/Arch_clip_plane.jpg" decoding="async" width="1024" height="769" class="mw-file-element" data-file-width="1112" data-file-height="835"></a></span>
</p>
<ul><li>Plusieurs am&eacute;liorations de l'<b>importer IFC</b> comme de nouvelles options pour traiter les gros fichier IFC, un meilleur support des extrusions (maintenant d&eacute;tect&eacute;es &agrave; l'import) et des segments courbe, le support des annotations 2D. L'import des IFC Analytic a &eacute;t&eacute; ajout&eacute;. Pour l'instant l'import des g&eacute;om&eacute;trie de repr&eacute;sentation de tout les objets analytique sont support&eacute;.</li>
<li>Meilleurs  <b>options de maillage</b> pour les formats DAE et IFC.</li>
<li>Un nouvel outil <a href="../fr/Arch_Schedule.html" title="Arch Schedule/fr">Arch Schedule/fr</a> permet de cr&eacute;er diff&eacute;rent type de liste de mat&eacute;riaux &agrave; partir d'une maquette BIM.</li>
<li><b>Les attributs IFC</b> peuvent maintenant &ecirc;tre import&eacute;s, &eacute;dit&eacute;s et export&eacute;s. Il s'agit d'un objet Tableur attach&eacute; &agrave; un objet Arch.</li></ul>
<h2><span class="mw-headline" id="Atelier_FEM">Atelier FEM</span></h2>
<ul><li>Les commandes  dans <b>l'interface</b> FEM ont maintenant des raccourcis clavier. Une page de pr&eacute;f&eacute;rence FEM &agrave; &eacute;t&eacute; ajout&eacute;e. Le chemin de l&rsquo;ex&eacute;cutable CalculiX fait partie de ces pr&eacute;f&eacute;rences.</li>
<li><b>Conteneurs d'analyse dans l'interface</b> Les membres d'une analyse utilise le glisser/d&eacute;poser. Ils peuvent &ecirc;tre d&eacute;placer dans ou en dehors d'un conteneur d'analyse. Depuis qu'il y a le support de multiples analyses, les membres peuvent &ecirc;tre d&eacute;plac&eacute;s dans une autre analyse. Les contraintes multiple peuvent &ecirc;tre cr&eacute;&eacute;es dans une analyse.</li>
<li><b>Analyse en un clic dans l'interface</b> Un bouton pour lancer en un clic une analyse a &eacute;t&eacute; ajout&eacute; &agrave; l'interface graphique utilisateur. Il purge les r&eacute;sultats, &eacute;crit un fichier d'entr&eacute;e CalculiX et r&eacute;alise l'analyse avec le solveur s&eacute;lectionn&eacute;. Il est d&eacute;tect&eacute; si le multithreading est disponible pour CalculiX et utilise le maximum de thread possible.</li>
<li><b>Fichier d'entr&eacute;e</b> L'&eacute;diteur int&eacute;gr&eacute; de FreeCAD supporte l'&eacute;dition des fichiers d'entr&eacute;e CalculiX (*.inp). La coloration syntaxique a &eacute;t&eacute; impl&eacute;ment&eacute; aussi.</li>
<li><b>Objet maillage Netgen</b> L'interface et l'&eacute;diteur de propri&eacute;t&eacute; des objets maillage Netgen a &eacute;t&eacute; revu. Le maillage t&eacute;tra&eacute;drique de premier et second ordre est support&eacute; tout comme la possibilit&eacute; d'ajuster les param&egrave;tres de maillage.</li>
<li><b>Objets contrainte de force et contrainte fixe</b> Il est maintenant possible d'ajouter des forces et des fixations sur les ar&ecirc;tes et les points.</li>
<li><b>Objet contrainte de pression</b> Un nouvel objet pour le chargement de pression a &eacute;t&eacute; ajout&eacute;. La pression (chargement surfacique) est pass&eacute;e directement &agrave; CalculiX ce qui signifie que le chargement ponctuel sur les n&oelig;uds n'est pas calcul&eacute; par FreeCAD mais par CalculiX.</li>
<li><b>Objet de contrainte de d&eacute;placement</b>  Un nouvel objet pour contraindre les d&eacute;placements a &eacute;t&eacute; ajout&eacute;. Une contrainte de d&eacute;placement peut &ecirc;tre ajout&eacute;e aux n&oelig;uds, ar&ecirc;tes et faces. Pour les analyses de coques et de barres il est possible de fixer les degr&eacute;s de libert&eacute;s de rotation.</li>
<li><b>Objet Section de Poutre</b> Le nouvel objet section de poutre permet de d&eacute;finir des section rectangulaire pour les poutre FEM. Cela supporte diff&eacute;rentes sections en une seule analyse en d&eacute;finissant la forme de r&eacute;f&eacute;rence pour chaque section.</li>
<li><b>Objet &Eacute;paisseur de Coque</b> Le nouvel objet &eacute;paisseur de coque permet de d&eacute;finir l'&eacute;paisseur d'une coque plate. Comme avec la section de poutre cela supporte de multiple &eacute;paisseur en une analyse en d&eacute;finissant les formes de r&eacute;f&eacute;rences.</li>
<li><b>Objet Mat&eacute;riau</b> Les mat&eacute;riaux multiples sont support&eacute;s pour les ar&ecirc;tes, les coques, les maillages solides. Comme pour les objets section de poutre et &eacute;paisseur de coque, un maillage FEM appropri&eacute; est n&eacute;cessaire pour utilis&eacute; les mat&eacute;riaux multiple.</li>
<li><b>Objet Solveur</b> En tant que base pour des solveurs multiple l'objet Solveur a &eacute;t&eacute; impl&eacute;ment&eacute;. Toutes les propri&eacute;t&eacute;s de l&rsquo;analyse sont d&eacute;plac&eacute;es vers le solveur.</li>
<li><b>Analyse de Fr&eacute;quence</b> On peut faire une analyse de fr&eacute;quence. Le nombre de valeur eigen et de forme eigen peut &ecirc;tre ajust&eacute; dans la fen&ecirc;tre des pr&eacute;f&eacute;rences.</li>
<li><b>View provider</b> Les maillages FEM de type coques et poutres peuvent &ecirc;tre vus dans FreeCAD ainsi que les r&eacute;sultats de l'analyse.</li>
<li><b>API Python</b> Ajout de m&eacute;thodes pour travailler avec les maillages FEM et r&eacute;aliser des analyses depuis python.</li>
<li><b>Macro GMSH</b> La <a href="../Macro_GMSH.html" title="Macro GMSH">Macro_GMSH</a> est un d&eacute;veloppement externe interessant qui rend possible le maillage avec GMSH. C'est tr&egrave;s pratique pour ceux qui ne peuvent pas install&eacute; ou compiler Netgen ou pour le maillage de coques et d'ar&ecirc;tes.</li>
<li><b>Am&eacute;liorations g&eacute;n&eacute;rales</b> En raison de la forte augmentation du d&eacute;veloppement, il y a eu des tonnes d'am&eacute;liorations sur la base du code du module FEM.</li></ul>
<p><span id="Path_Workbench"></span>
</p>
<h2><span class="mw-headline" id="Atelier_Path">Atelier Path</span></h2>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Exercise_path_02.jpg&amp;filetimestamp=20160121205256&amp;.html" class="mw-file-description"><img src="../File/Exercise_path_02.jpg" decoding="async" width="804" height="582" class="mw-file-element" data-file-width="804" data-file-height="582"></a></span>
</p><p>Un nouvel <a href="../fr/Path_Workbench.html" class="mw-redirect" title="Path Workbench/fr">Atelier Path</a> a &eacute;t&eacute; ajout&eacute; &agrave; FreeCAD. Cet atelier bien qu'encore en d&eacute;veloppement impl&eacute;mente d&eacute;j&agrave; quelques op&eacute;rations CNC et permet d'exporter le fichier <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/G-code">G-code</a> vers diverse vari&eacute;t&eacute; de machines CNC. 
</p><p>Dans son &eacute;tat actuel, l'atelier permet de cr&eacute;er des profiles et des poches autour d'objets bas&eacute;s sur <a href="../fr/Part_Workbench.html" title="Part Workbench/fr">Part</a>, de cr&eacute;er des chemin complexe en joignant plusieurs partie de chemin, inspecter et &eacute;diter le G-code de chaque chemin, g&eacute;rer la banque d'outils et choisir entre diff&eacute;rents scripts pre-post-processing lors de l'import et l'export de G-code. Il propose aussi une <a href="../fr/Path_scripting.html" class="mw-redirect" title="Path scripting/fr">API Python</a> compl&egrave;te.
</p><p><span id="Additional_Modules"></span>
</p>
<h2><span class="mw-headline" id="Modules_Additionnels">Modules Additionnels</span></h2>
<p>Plusieurs nouveaux <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD-addons">ateliers compl&eacute;mentaires</a> ont &eacute;t&eacute; cr&eacute;&eacute;s par des membres de la communaut&eacute;. Ces ateliers s'installe tr&egrave;s facilement sur une installation existante de FreeCAD. Parmi eux on trouve&nbsp;:
</p>
<ul><li>Un <a rel="nofollow" class="external text" href="https://github.com/microelly2/Animation">atelier Animation</a> qui vous permet de cr&eacute;er des animations depuis vos mod&egrave;les FreeCAD, en d&eacute;finissant le mouvement de la cam&eacute;ra et en exportant une s&eacute;quence d'images.</li>
<li>Une <a rel="nofollow" class="external text" href="https://github.com/marmni/FreeCAD-Kerkythea">Kerkythea macro Export Kerkythea</a> qui permet d'exporter votre document FreeCAD vers le <a rel="nofollow" class="external text" href="http://www.kerkythea.net/cms/">logiciel de rendu gratuit Kerkythea</a>.</li>
<li>Un <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewtopic.php?f=22&amp;t=10892%7CPie">Menu</a> (menu circulaire) toujours en d&eacute;veloppement est disponible.</li>
<li>Finalement, un <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD-addons">d&eacute;p&ocirc;t d'extensions</a> a &eacute;t&eacute; cr&eacute;&eacute; pour rassembler tout les ateliers, modules et macros int&eacute;ressantes qui fleurissent autour de FreeCAD. Ce d&eacute;p&ocirc;t propose un utilitaire qui installe et met &agrave; jour ces extensions pour vous.</li></ul>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Macro_installer_02.jpg&amp;filetimestamp=20151225190104&amp;.html" class="mw-file-description"><img src="../File/Macro_installer_02.jpg" decoding="async" width="404" height="377" class="mw-file-element" data-file-width="404" data-file-height="377"></a></span>
</p>
<!-- 
NewPP limit report
Cached time: 20251009171754
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.067 seconds
Real time usage: 0.091 seconds
Preprocessor visited node count: 76/1000000
Post&#8208;expand include size: 9/2097152 bytes
Template argument size: 0/2097152 bytes
Highest expansion depth: 2/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1758/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    0.000      1 -total
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:67782-0!canonical and timestamp 20251009171754 and revision id 1659603. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>