<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Sketcher Tutorial/fr</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="fr" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Sketcher+Tutorial&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/Sketcher_Tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Sketcher Tutorium (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Sketcher_Tutorial.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Sketcher Tutorial (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/Sketcher_Tutorial.html" class="mw-pt-progress mw-pt-progress--med" title="Tutorial Croquizador (41% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="fr" dir="ltr">fran&ccedil;ais</span></li>
<li><a href="../hr/Sketcher_Tutorial.html" class="mw-pt-progress mw-pt-progress--low" title="Sketcher Tutorial/hr (1% translated)" lang="hr" dir="ltr">hrvatski</a></li>
<li><a href="../it/Sketcher_Tutorial.html" class="mw-pt-progress mw-pt-progress--high" title="Sketcher Tutorial (78% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Sketcher_Tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Poradnik dla &#347;rodowiska pracy Szkicownik (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../ru/Sketcher_Tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="&#1059;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082; &#1087;&#1086; &#1057;&#1082;&#1077;&#1090;&#1095;&#1077;&#1088; (100% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li></ul></div>
<table class="fcinfobox wikitable ct" style="width: 230px; float: right; margin-left: 1em">
<tbody><tr>
<td class="ctTitle" style="font-weight: bold; font-size: 125%;"><span typeof="mw:File"><span><img src="../File/Freecad.svg" decoding="async" width="32" height="32" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span> Tutoriel
</td></tr>
<tr>
<th class="ctOdd">Th&egrave;me
</th></tr>
<tr>
<td class="ctEven">Sketcher
</td></tr>
<tr>
<th class="ctOdd">Niveau
</th></tr>
<tr>
<td class="ctEven">D&eacute;butant
</td></tr>
<tr>
<th class="ctOdd">Temps d'ex&eacute;cution estim&eacute;
</th></tr>
<tr>
<td class="ctEven">
</td></tr>
<tr>
<th class="ctOdd">Auteurs
</th></tr>
<tr>
<td class="ctEven">Ulrich
</td></tr>
<tr>
<th class="ctOdd">Version de FreeCAD
</th></tr>
<tr>
<td class="ctEven">
</td></tr>
<tr>
<th class="ctOdd">Fichiers exemples
</th></tr>
<tr>
<td class="ctEven">
</td></tr>
<tr>
<th class="ctOdd">Voir aussi
</th></tr>
<tr>
<td class="ctEven"><i>None</i>
</td></tr>
<tr>
<td class="ctToc"><br><meta property="mw:PageProp/toc">
</td></tr></tbody></table>
<h2><span class="mw-headline" id="Introduction">Introduction</span></h2>
<p>Le Sketcher (esquisseur) est un outil pour g&eacute;n&eacute;rer des objets 2D pour une utilisation dans la conception des pi&egrave;ces. Le sketcher est diff&eacute;rent des outils de dessin traditionnels. Une fa&ccedil;on de montrer la diff&eacute;rence est la construction d'un triangle. Un triangle est enti&egrave;rement d&eacute;fini par trois valeurs, qui peuvent &ecirc;tre toutes de la liste suivante&nbsp;: longueur de c&ocirc;t&eacute;, angle, hauteur, surface. La seule exception est trois angles, qui ne d&eacute;finira pas la taille.
</p><p>Afin de construire un triangle &agrave; partir de trois longueurs par la m&eacute;thode traditionnelle, faire comme suit&nbsp;: 
</p>
<ul><li>Tracer la ligne de base</li>
<li>Faire deux cercles avec un rayon donn&eacute; par les deux autres longueurs des c&ocirc;t&eacute;s, ou encore calculer les coordonn&eacute;es du troisi&egrave;me sommet</li>
<li>Tirer les deux c&ocirc;t&eacute;s manquants depuis les extr&eacute;mit&eacute;s de la ligne de base au point de deux cercles ou le sommet calcul&eacute;e .</li></ul>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Traditional_triangle.png&amp;filetimestamp=20140520190800&amp;.html" class="mw-file-description"><img src="../File/Traditional_triangle.png" decoding="async" width="325" height="190" class="mw-file-element" data-file-width="325" data-file-height="190"></a></span>
</p><p>La page  <a rel="nofollow" class="external text" href="https://fr.wikipedia.org/wiki/Triangle">Wikipedia Triangle</a> montre une collection de formules pour calculer les informations manquantes pour dessiner un triangle &agrave; partir de sp&eacute;cification minimum. Celles-ci sont n&eacute;cessaires si le triangle doit &ecirc;tre d&eacute;fini par des coordonn&eacute;es pr&eacute;calcul&eacute;es.
</p><p>Le Sketcher est diff&eacute;rent. Les formules et les constructions auxiliaires ci-dessus ne sont pas n&eacute;cessaires. Afin de comprendre la diff&eacute;rence, il est pr&eacute;f&eacute;rable de construire un triangle par vous-m&ecirc;me.
</p><p><span id="First_sketch:_a_triangle"></span>
</p>
<h2><span id="Premi.C3.A8re_esquisse_:_un_triangle"></span><span class="mw-headline" id="Premi&egrave;re_esquisse_:_un_triangle">Premi&egrave;re esquisse&nbsp;: un triangle</span></h2>
<p>Un document ouvert est n&eacute;cessaire pour faire une esquisse. Quand il n'y a pas de document ouvert, un nouveau document sera cr&eacute;&eacute; en cliquant sur <span typeof="mw:File"><a href="../fr/Std_New.html" title="Std New/fr"><img src="../File/Std_New.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span>. L'atelier Sketcher doit &ecirc;tre s&eacute;lectionn&eacute;&nbsp;: 
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Workbench_select_sketcher.png&amp;filetimestamp=20140507181022&amp;.html" class="mw-file-description"><img src="../File/Workbench_select_sketcher.png" decoding="async" width="400" height="200" class="mw-file-element" data-file-width="400" data-file-height="200"></a></span>
</p><p>Une nouvelle esquisse sera cr&eacute;&eacute;e en cliquant sur <span typeof="mw:File"><a href="../fr/Sketcher_NewSketch.html" title="Sketcher NewSketch/fr"><img src="../File/Sketcher_NewSketch.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span>. Une bo&icirc;te de dialogue appara&icirc;t, o&ugrave; l'orientation de la nouvelle esquisse dans l'espace 3D peut &ecirc;tre s&eacute;lectionn&eacute;e. Il n'a pas d'importance dans ce cas, de sorte que le plan XY peut &ecirc;tre confirm&eacute;. Une nouvelle esquisse vide sera cr&eacute;&eacute;e et ouverte en mode &eacute;dition. Une grille avec un syst&egrave;me de coordonn&eacute;es s'affiche avec un point rouge &agrave; l'origine.
</p><p>Dans Sketcher, tout est ok pour dessiner un triangle quelconque avec l' outil <span typeof="mw:File"><a href="../fr/Sketcher_CreatePolyline.html" title="Sketcher CreatePolyline/fr"><img src="../File/Sketcher_CreatePolyline.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> Polyligne et d&eacute;finir ses propri&eacute;t&eacute;s dans une &eacute;tape ult&eacute;rieure. Chaque clic dans le plan du dessin &eacute;tablit un sommet. Le triangle doit &ecirc;tre ferm&eacute;. Donc, pour la derni&egrave;re ligne un clic est n&eacute;cessaire sur le premier sommet cr&eacute;&eacute;. Un point rouge doit &ecirc;tre visible pr&egrave;s du pointeur de la souris avant de cliquer.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Closed_triangle_with_pointer_small.png&amp;filetimestamp=20140427203907&amp;.html" class="mw-file-description"><img src="../File/Closed_triangle_with_pointer_small.png" decoding="async" width="400" height="200" class="mw-file-element" data-file-width="400" data-file-height="200"></a></span>
</p><p>Cela fera en sorte que le dernier sommet est identique au premier, et le profil sera ferm&eacute;. Ces symboles qui apparaissent sous le pointeur de dessin  indiquent des auto-contraintes. Elles sont mises automatiquement en cliquant &agrave; ces endroits. Le point rouge tirant sous le pointeur indique une contrainte de co&iuml;ncidence entre deux sommets, c'est &agrave; dire que les sommets de ces diff&eacute;rents &eacute;l&eacute;ments de dessin sont contraints au m&ecirc;me emplacement.
</p><p>Le triangle cr&eacute;&eacute; est flexible. Un sommet peut &ecirc;tre touch&eacute; avec la souris et d&eacute;plac&eacute; &agrave; proximit&eacute;. Les c&ocirc;t&eacute;s du triangle suivent le sommet. La m&ecirc;me chose peut &ecirc;tre faite avec une ligne.
</p><p>Chaque longueur de c&ocirc;t&eacute; est maintenant facile &agrave; d&eacute;finir en le s&eacute;lectionnant avec la souris&nbsp;: l'&eacute;l&eacute;ment s&eacute;lectionn&eacute; se transforme en vert. En cliquant sur l'outil de longueur <span typeof="mw:File"><a href="../fr/Sketcher_ConstrainDistance.html" title="Sketcher ConstrainDistance/fr"><img src="../File/Sketcher_ConstrainDistance.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span>, une bo&icirc;te de dialogue s'ouvre et la longueur d&eacute;sir&eacute;e peut &ecirc;tre mise. L'image ci-dessous montre un triangle avec les longueurs des c&ocirc;t&eacute;s r&eacute;gl&eacute;es &agrave; 35 mm, 27 mm et 25 mm. La ligne de base a &eacute;t&eacute; fix&eacute; horizontalement en la s&eacute;lectionnant et en cliquant sur l'outil de contrainte horizontale <span typeof="mw:File"><a href="../fr/Sketcher_ConstrainHorizontal.html" title="Sketcher ConstrainHorizontal/fr"><img src="../File/Sketcher_ConstrainHorizontal.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span>.
</p><p><br> 
<span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Sketcher_triangle3_small.png&amp;filetimestamp=20140507193409&amp;.html" class="mw-file-description"><img src="../File/Sketcher_triangle3_small.png" decoding="async" width="400" height="200" class="mw-file-element" data-file-width="400" data-file-height="200"></a></span>
</p><p>Ces d&eacute;finitions de longueur sont appel&eacute;es contraintes. Les contraintes sont utilis&eacute;es pour d&eacute;finir une conception fixe &agrave; partir d'une entr&eacute;e g&eacute;om&eacute;trique flexible. Le dessinateur fournit toutes les contraintes n&eacute;cessaires pour d&eacute;finir tout type de triangle. Seulement la zone ne peut pas &ecirc;tre utilis&eacute;e pour d&eacute;finir un. Ainsi, le triangle cr&eacute;&eacute; peut &ecirc;tre red&eacute;fini en changeant la valeur d'une contrainte ou par suppression des contraintes et ajout d'autres. Voici une liste de triangles avec d'autres propri&eacute;t&eacute;s donn&eacute;es. Il n'y a aucun probl&egrave;me pour tourner le triangle qui vient d'&ecirc;tre cr&eacute;&eacute; dans l'un de ceux-ci.
</p>
<ul><li>Un ou deux angles donn&eacute;s&nbsp;: Deux c&ocirc;t&eacute;s du triangle doivent &ecirc;tre coch&eacute;es. Un clic sur <span typeof="mw:File"><a href="../fr/Sketcher_ConstrainAngle.html" title="Sketcher ConstrainAngle/fr"><img src="../File/Sketcher_ConstrainAngle.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> ouvre une bo&icirc;te de dialogue pour d&eacute;finir l'angle.</li></ul>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Triangel_angle_small.png&amp;filetimestamp=20140427210102&amp;.html" class="mw-file-description"><img src="../File/Triangel_angle_small.png" decoding="async" width="400" height="200" class="mw-file-element" data-file-width="400" data-file-height="200"></a></span>
</p>
<ul><li>Triangle rectangle&nbsp;: Deux c&ocirc;t&eacute;s du triangle doivent &ecirc;tre coch&eacute;s. Un clic sur <span typeof="mw:File"><a href="../fr/Sketcher_ConstrainPerpendicular.html" title="Sketcher ConstrainPerpendicular/fr"><img src="../File/Sketcher_ConstrainPerpendicular.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> d&eacute;finit un angle droit entre les deux c&ocirc;t&eacute;s.</li></ul>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Right_triangle_sketcher.png&amp;filetimestamp=20140427213057&amp;.html" class="mw-file-description"><img src="../File/Right_triangle_sketcher.png" decoding="async" width="400" height="200" class="mw-file-element" data-file-width="400" data-file-height="200"></a></span>
</p>
<ul><li>&Eacute;quilat&eacute;ral&nbsp;: Un c&ocirc;t&eacute; doit &ecirc;tre r&eacute;gl&eacute; &agrave; une longueur d&eacute;finie. Ensuite, toutes les parties doivent &ecirc;tre s&eacute;lectionn&eacute;s. Un clic sur <span typeof="mw:File"><a href="../fr/Sketcher_ConstrainEqual.html" title="Sketcher ConstrainEqual/fr"><img src="../File/Sketcher_ConstrainEqual.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> d&eacute;finit deux contraintes de longueur &eacute;gale afin de donner &agrave; tout les c&ocirc;t&eacute;s la m&ecirc;me longueur.</li></ul>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Triangle_equilateral_small.png&amp;filetimestamp=20140428202540&amp;.html" class="mw-file-description"><img src="../File/Triangle_equilateral_small.png" decoding="async" width="400" height="200" class="mw-file-element" data-file-width="400" data-file-height="200"></a></span>
</p>
<ul><li>Triangle isoc&egrave;le (deux cot&eacute;s de longueur identique) avec hauteur donn&eacute;e&nbsp;: S&eacute;lectionnez d'abord les deux c&ocirc;t&eacute;s de m&ecirc;me longueur. Un clic sur <span typeof="mw:File"><a href="../fr/Sketcher_ConstrainEqual.html" title="Sketcher ConstrainEqual/fr"><img src="../File/Sketcher_ConstrainEqual.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> &eacute;tablit une &eacute;galit&eacute; entre les deux c&ocirc;t&eacute;s. Ensuite, s&eacute;lectionnez la ligne de base et le sommet en haut et cliquez sur l'outil de longueur <span typeof="mw:File"><a href="../fr/Sketcher_ConstrainDistance.html" title="Sketcher ConstrainDistance/fr"><img src="../File/Sketcher_ConstrainDistance.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span>.</li></ul>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Triangle_isosceles_small.png&amp;filetimestamp=20140428202700&amp;.html" class="mw-file-description"><img src="../File/Triangle_isosceles_small.png" decoding="async" width="400" height="200" class="mw-file-element" data-file-width="400" data-file-height="200"></a></span>
</p><p>Les contraintes peuvent &ecirc;tre s&eacute;lectionn&eacute;es en cliquant sur le symbole ou en cliquant dans la liste de contraintes. Elles peuvent &ecirc;tre supprim&eacute;es ou en cas de contraintes avec une valeur &eacute;dit&eacute;e apr&egrave;s un double clic. Un triangle donn&eacute; peut &ecirc;tre chang&eacute; plus tard dans un autre type de triangle en modifiant ou en changeant les contraintes. L'esquisseur est une partie de l'approche mod&eacute;lisation param&eacute;trique de FreeCAD. Ce que vous avez cr&eacute;&eacute;, peut &ecirc;tre facilement chang&eacute; un moment plus tard, si par exemple une variante de la conception est n&eacute;cessaire.
</p><p>Les triangles montr&eacute;s ci-dessus ont des lignes blanches. C'est une indication que l'esquisse conserve des degr&eacute;s de libert&eacute;. Cela peut &ecirc;tre test&eacute; en tirant sur des lignes ou des points. Si la ligne ou point se d&eacute;place, cet &eacute;l&eacute;ment n'est pas enti&egrave;rement d&eacute;fini. Une esquisse avec aucun degr&eacute; de libert&eacute; s'allume en vert.
</p><p>Pour le triangle isoc&egrave;le, la longueur de la ligne de base est manquante  et il peut se d&eacute;placer et tourner librement dans le plan du dessin du dessinateur.
</p><p>Si les propri&eacute;t&eacute;s du triangle sont d&eacute;finies, il doit encore &ecirc;tre fix&eacute; dans le plan du dessin. Le plan de l'esquisse a un syst&egrave;me de coordonn&eacute;es. L'origine du syst&egrave;me de coordonn&eacute;es est visible comme le point rouge dans le centre de l'axe rose des X et de l'axe vert clair des Y. La meilleure fa&ccedil;on de r&eacute;gler le probl&egrave;me, est de choisir un sommet et de cliquer sur <span typeof="mw:File"><a href="../fr/Sketcher_ConstrainLock.html" title="Sketcher ConstrainLock/fr"><img src="../File/Sketcher_ConstrainLock.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span>. Cela ajoute une horizontale et une distance verticale &agrave; partir du sommet &agrave; l'origine du syst&egrave;me de coordonn&eacute;es. Le triangle peut encore avoir un degr&eacute; de libert&eacute; en rotation. Donc, une autre partie a besoin d'une contrainte horizontale ou verticale ou d'un angle d&eacute;fini avec l'un des axes de coordonn&eacute;es du syst&egrave;me. L'image suivante montre une esquisse totalement contrainte. Toutes les lignes et les sommets ont maintenant une couleur verte.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Sketcher_triangle3_fc_small.png&amp;filetimestamp=20140507202524&amp;.html" class="mw-file-description"><img src="../File/Sketcher_triangle3_fc_small.png" decoding="async" width="400" height="200" class="mw-file-element" data-file-width="400" data-file-height="200"></a></span>
</p><p><span id="More_about_Constraints"></span>
</p>
<h2><span class="mw-headline" id="Plus_au_sujet_des_Contraintes">Plus au sujet des Contraintes</span></h2>
<p>L'esquisseur ne conna&icirc;t pas les formules de triangle de wikipedia. Au contraire, il met en place un syst&egrave;me d'&eacute;quations pour les coordonn&eacute;es en 2 dimensions sur la base des contraintes donn&eacute;es. Ce syst&egrave;me d'&eacute;quations est alors r&eacute;solu num&eacute;riquement.
</p><p>De cette mani&egrave;re, une grande vari&eacute;t&eacute; de probl&egrave;me g&eacute;om&eacute;trique peut &ecirc;tre r&eacute;solu. Mais il y a aussi un inconv&eacute;nient. Si l'ensemble d'&eacute;quations a plusieurs solutions, nous pouvons obtenir quelque chose de totalement diff&eacute;rent de ce que nous attendons. Cela est particuli&egrave;rement g&ecirc;nant, si la m&ecirc;me conception doit &ecirc;tre utilis&eacute; pour des dimensions diff&eacute;rentes. Le sympt&ocirc;me typique, c'est qu'apr&egrave;s un changement d'une contrainte de longueur, l'esquisse retourne &agrave; quelque chose de totalement diff&eacute;rent. Un exemple simple est la division d'une distance en trois partitions &eacute;gales. L'image suivante montre trois lignes &eacute;gales et un ensemble de contraintes parall&egrave;les. La distance totale est de 10 mm.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Dimension_partitions_parallel.png&amp;filetimestamp=20140511211052&amp;.html" class="mw-file-description"><img src="../File/Dimension_partitions_parallel.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>Cela fonctionne bien aussi longtemps que seules de grandes distances sont entr&eacute;es. Lorsque la distance est r&eacute;duite au-del&agrave; d'un certain ratio, les lignes se replient ensemble. Donc, nous n'obtenons pas plus un tiers de la distance donn&eacute;e, mais la distance elle-m&ecirc;me ou les deux tiers de celui-ci. Certaines lignes de notre alignement ont chang&eacute; leur orientation. Cela donne encore une solution valable pour l'ensemble des contraintes, mais n'est pas ce qui &eacute;tait pr&eacute;vu. Comme le montre l'image suivante de la m&ecirc;me esquisse. La contrainte de longueur a &eacute;t&eacute; r&eacute;gl&eacute;e &agrave; 1000 mm, puis ramen&eacute; &agrave; 5 mm.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Dimension_partitions_flipped.png&amp;filetimestamp=20140511211333&amp;.html" class="mw-file-description"><img src="../File/Dimension_partitions_flipped.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>La solution consiste &agrave; d&eacute;finir un angle de 180&deg; entre les lignes de s&eacute;paration comme remplacement de la contrainte parall&egrave;le. La contrainte 180&deg; n'a qu'une solution. L'esquisse est maintenant robuste contre les grands changements de distance. Il faut dire, que m&ecirc;me une contrainte 0&deg; vise le m&ecirc;me objectif, le cas &eacute;ch&eacute;ant.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Constraint180_600x400.png&amp;filetimestamp=20140512164523&amp;.html" class="mw-file-description"><img src="../File/Constraint180_600x400.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>La contrainte 180&deg; est une solution pour beaucoup de probl&egrave;mes. Certaines versions plus anciennes de FreeCAD ont des probl&egrave;mes pour montrer la contrainte 180&deg; dans le plan d'esquisse. Dans la plupart des cas, l'arc 180&deg; n'est pas affich&eacute; comme pr&eacute;vu dans le plan du dessin d'esquisse. C'est un probl&egrave;me connu pour FreeCAD avant la version 14.3613.
</p><p>En cas de plusieurs dimensions suppl&eacute;mentaires en ligne droite, il peut &ecirc;tre conseill&eacute; de dessiner une ligne zigzag d'abord et puis de d&eacute;finir les contraintes 180&deg;. Cela aide &agrave; ne pas en oublier une, ou ne pas la cr&eacute;er deux fois.
</p><p><br>
</p><p><br>
Le tableau suivant montre certaines combinaisons de contraintes pour la d&eacute;finition d'un coude simple. La combinaison a &eacute;t&eacute; test&eacute;e par l&rsquo;accroissement de la longueur horizontale de 10 mm &agrave; des valeurs sup&eacute;rieures jusqu'&agrave; ce que le coude retourne son orientation. Les documents du tableau pour chaque combinaison de contrainte montre la longueur modifi&eacute;e o&ugrave; le retournement se produit. 
</p>
<table border="1" cellspacing="0" cellpadding="2" rules="all" class="hintergrundfarbe1 rahmenfarbe1" style="margin:1em 1em 1em 0; border-style:solid; border-width:1px; border-collapse:collapse; empty-cells:show;" width="100%">

<tbody><tr>
<th>Combinaisons Contraintes
</th>
<th>Remarques
</th></tr>
<tr>
<td>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Elbow_equality_horizontal_vertical.png&amp;filetimestamp=20140518142225&amp;.html" class="mw-file-description"><img src="../File/Elbow_equality_horizontal_vertical.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p>
</td>
<td>
<p>D&eacute;finition de la longueur&nbsp;: Contrainte &eacute;galit&eacute; pour la d&eacute;finition de la longueur <br> <br>
D&eacute;finition de l'orientation&nbsp;: contrainte horizontale et verticale <br> <br>
Retourne &agrave; 51 mm
</p>
</td></tr>
<tr>
<td>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Elbow_fix_point_onto_object_52mm.png&amp;filetimestamp=20140519102919&amp;.html" class="mw-file-description"><img src="../File/Elbow_fix_point_onto_object_52mm.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p>
</td>
<td>
<p>D&eacute;finition de la longueur&nbsp;: Contrainte &eacute;galit&eacute; pour la d&eacute;finition de longueur verticale, arc pour d&eacute;finition de la longueur horizontale <br> <br>.
D&eacute;finition de l'orientation&nbsp;: deux points pour la d&eacute;finition de l'orientation des contraintes de lignes horizontales et verticales <br> <br>
Retourne &agrave; 52 mm
</p>
</td></tr>
<tr>
<td>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Elbow_equality_perpendicular_vertical.png&amp;filetimestamp=20140519104410&amp;.html" class="mw-file-description"><img src="../File/Elbow_equality_perpendicular_vertical.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p>
</td>
<td>
<p>D&eacute;finition de la longueur&nbsp;: Contrainte &eacute;galit&eacute; pour la d&eacute;finition de la longueur <br> <br>
D&eacute;finition de l'orientation&nbsp;: ligne horizontale perpendiculaire &agrave; l'axe Y et ligne verticale avec la contrainte verticale <br> <br>
Retourne &agrave; 51 mm
</p>
</td></tr>
<tr>
<td>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Elbow_dimension_length_82_mm.png&amp;filetimestamp=20140519101709&amp;.html" class="mw-file-description"><img src="../File/Elbow_dimension_length_82_mm.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p>
</td>
<td>
<p>D&eacute;finition de la longueur&nbsp;: Longueur horizontale d&eacute;finie avec la contrainte &laquo;g&eacute;n&eacute;rale&raquo;  de longueur. Contrainte &eacute;galit&eacute; pour la d&eacute;finition de longueur verticale. <br>
D&eacute;finition de l'orientation&nbsp;: contraintes horizontale et verticales <br>
Retourne &agrave; 82 mm <br>
D&eacute;finition de la longueur&nbsp;: Longueur horizontale d&eacute;finie avec la contrainte de longueur &laquo;horizontale&raquo;. Contrainte &eacute;galit&eacute; pour la d&eacute;finition de longueur verticale. <br>
D&eacute;finition de l'orientation&nbsp;: contraintes horizontale et verticales <br>
La ligne horizontale ne retourne pas &agrave; une &eacute;preuve de 10 km, mais la ligne verticale a &eacute;t&eacute; retourn&eacute;e&nbsp;! <br>
</p>
</td></tr>
<tr>
<td>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Elbow_equality_90%C2%B0to_vertical.png&amp;filetimestamp=20140519110511&amp;.html" class="mw-file-description"><img src="../File/Elbow_equality_90%C2%B0to_vertical.png" decoding="async" width="600" height="440" class="mw-file-element" data-file-width="600" data-file-height="440"></a></span>
</p>
</td>
<td>
<p>D&eacute;finition de la longueur&nbsp;: Contrainte &eacute;galit&eacute; pour la d&eacute;finition de la longueur <br>
D&eacute;finition de l'orientation&nbsp;: ligne horizontale angle 90&deg; avec la ligne verticale et ligne verticale avec la contrainte verticale <br>
Ne retourne pas, test&eacute;e jusqu'&agrave; 10 km
</p>
</td></tr></tbody></table>
<p>Le test a r&eacute;v&eacute;l&eacute; ce qui suit&nbsp;: de plus grands changements de contraintes de dimension peuvent provoquer un retournement de certaines lignes de l'esquisse en raison de multiples solutions du syst&egrave;me sous-jacent d'&eacute;quations. Les seules contraintes qui font pr&eacute;server l'orientation des &eacute;l&eacute;ments auxquels ils s'appliquent, sont la contrainte d'angle et les contraintes de dimensions horizontales et verticales. Les diff&eacute;rences entre les autres contraintes concernant le maintien de l'orientation sont mineures.
</p><p>Recommandation&nbsp;: <b>Utiliser les contraintes d'angles et les contraintes de dimensions horizontales et verticales &agrave; des endroits critiques pour faire une esquisse robuste envers les changements de dimension.</b>
</p><p><span id="Problematic_combination_of_constraints"></span>
</p>
<h2><span id="Combinaison_probl.C3.A9matique_de_Contraintes"></span><span class="mw-headline" id="Combinaison_probl&eacute;matique_de_Contraintes">Combinaison probl&eacute;matique de Contraintes</span></h2>
<p>Parfois, deux ou plusieurs contraintes d&eacute;finissent la m&ecirc;me propri&eacute;t&eacute;. Un exemple peut &ecirc;tre r&eacute;alis&eacute; avec deux lignes connect&eacute;es, o&ugrave; le centre est le point d'une contrainte de sym&eacute;trie pour les extr&eacute;mit&eacute;s des lignes. Ces lignes ont maintenant des longueur &eacute;gales et sont parall&egrave;les. Tout cela est la cons&eacute;quence de la contrainte de sym&eacute;trie.
</p><p>Que se passe-t-il, si ces deux lignes ont d&eacute;j&agrave; une contrainte d'&eacute;galit&eacute; et une contrainte parall&egrave;le et que la contrainte de sym&eacute;trie est rajout&eacute;e&nbsp;? Maintenant, la propri&eacute;t&eacute; parall&egrave;le est d&eacute;fini par deux contraintes et la longueur &eacute;gale est &eacute;galement d&eacute;finie par deux contraintes. En principe, le syst&egrave;me d'&eacute;quations sous-jacent doit avoir une solution. Mais il peut y avoir des probl&egrave;mes num&eacute;riques. Cela peut &ecirc;tre test&eacute; en essayant de d&eacute;placer les lignes. Dans la plupart des cas, les lignes sont fig&eacute;es, m&ecirc;me si le croquis rapporte encore plusieurs degr&eacute;s de libert&eacute;.
</p><p>Le cas ci-dessus montre un probl&egrave;me qui semble &ecirc;tre difficile &agrave; r&eacute;soudre pour les solveurs d'esquisse. Ainsi, l'utilisateur doit prendre des pr&eacute;cautions pour &eacute;viter de telles situations. Les esquisses avec des contraintes redondantes  se comportent de fa&ccedil;on inattendue et probl&eacute;matique. Les sympt&ocirc;mes de ces contraintes redondantes sont l'&eacute;tat gel&eacute; ci-dessus ou les contraintes  signal&eacute;s redondantes apr&egrave;s la modification d'un objet diff&eacute;rent dans l'esquisse.
</p><p>En g&eacute;n&eacute;ral, l'esquisse donne un avertissement, lorsque les contraintes redondantes sont d&eacute;tect&eacute;es. Mais ce m&eacute;canisme de d&eacute;tection semble ne pas fonctionner dans tous les cas. Lorsque le probl&egrave;me est reconnu, il peut &ecirc;tre &eacute;vit&eacute; simplement en supprimant les contraintes redondantes. Parfois, il est n&eacute;cessaire de choisir une combinaison diff&eacute;rente de contraintes.  
</p><p>Les cas suivants sont des sources de contraintes redondantes&nbsp;:
</p>
<ul><li>Une contrainte d'&eacute;galit&eacute; pour deux rayons d'un m&ecirc;me arc</li>
<li>Une contrainte de sym&eacute;trie pour deux rayons du m&ecirc;me arc</li>
<li>Une contrainte de sym&eacute;trie en combinaison avec une contrainte parall&egrave;le, d'&eacute;galit&eacute; et/ou des contraintes perpendiculaires</li></ul>
<p>Un cas probl&eacute;matique diff&eacute;rent sont les parall&egrave;les avec un point d'intersection &agrave; l'infini. Il est possible de d&eacute;finir une contrainte 180&deg; pour deux lignes parall&egrave;les sans point d'intersection. Ce <b>n'est pas</b> recommand&eacute;. Un angle avec une autre ligne ou axe doit &ecirc;tre utilis&eacute; &agrave; la place.
</p><p><br>
Un autre probl&egrave;me est le changement d'orientation d'angles. Cela peut arriver si des changements d'angle sup&eacute;rieurs &agrave; 180&deg; sont faits. Faire cela par petites &eacute;tapes &eacute;vite le probl&egrave;me.
</p><p><span id="Construction_Lines_-_Step_by_Step_Example"></span>
</p>
<h2><span id="Lignes_de_Construction_-_Exemple_pas_.C3.A0_pas"></span><span class="mw-headline" id="Lignes_de_Construction_-_Exemple_pas_&agrave;_pas">Lignes de Construction - Exemple pas &agrave; pas</span></h2>
<p>Dans la premi&egrave;re partie, il a &eacute;t&eacute; montr&eacute; que la g&eacute;om&eacute;trie de construction n'est pas n&eacute;cessaire pour construire des triangles. Mais n&eacute;anmoins l'esquisse fournit la g&eacute;om&eacute;trie de construction, qui est utile pour des probl&egrave;mes plus complexes. Toute ligne peut &ecirc;tre convertie en une ligne de construction avec le bouton <span typeof="mw:File"><a href="../fr/Sketcher_ToggleConstruction.html" title="Sketcher ToggleConstruction/fr"><img src="../File/Sketcher_ToggleConstruction.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span>. Les lignes de construction sont pr&eacute;sent&eacute;es dans l'esquisse comme lignes bleues. Elles peuvent &ecirc;tre utilis&eacute;es avec des contraintes de la m&ecirc;me mani&egrave;re que d'autres lignes, mais ne sont pas repr&eacute;sent&eacute;es et ne servent pas lorsque l'esquisse est termin&eacute;e.
</p><p>Donner la t&acirc;che de faire un rectangle avec la longueur de c&ocirc;t&eacute; ayant le rapport d'or. Wikipedia montre comment construire deux lignes avec un rapport de longueur correspondant au nombre d'or. 
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Goldener_Schnitt_Konstr_beliebt.svg&amp;filetimestamp=20151124195817&amp;.html" class="mw-file-description"><img src="../File/Goldener_Schnitt_Konstr_beliebt.svg" decoding="async" width="645" height="404" class="mw-file-element" data-file-width="645" data-file-height="404"></a></span>
</p><p>Le sketcher est un outil parfait pour construire un rectangle avec le nombre d'or pour la longueur de c&ocirc;t&eacute;. La taille du rectangle peut &ecirc;tre modifi&eacute; par la suite sans faire une nouvelle construction. Les &eacute;tapes de construction pour le nombre d'or selon Wikipedia sont&nbsp;:
</p>
<ol><li>Ayant un segment AB, construire une perpendiculaire BC  au point B, avec BC moiti&eacute; de la longueur de AB. Dessinez l'hypot&eacute;nuse AC.</li>
<li>Tracer un arc de centre C et de rayon BC. Cet arc croise l'hypot&eacute;nuse AC au point D.</li>
<li>Tracer un arc de centre A et de rayon AD. Cet arc croise le segment de ligne originale AB au point S. Le point S divise le segment d'origine AB en segments de ligne AS et SB avec des longueurs ayant un rapport correspondant au nombre d'or.</li></ol>
<p><br>
</p><p>Voici une explication &eacute;tape par &eacute;tape, de la mani&egrave;re dont cela peut &ecirc;tre fait.
</p>
<ul><li>Faire une nouvelle esquisse comme expliqu&eacute; sur l'exemple de triangle.</li>
<li>Dessinez un rectangle dans l'esquisse. Utilisez le bouton <span typeof="mw:File"><a href="../fr/Sketcher_CreateRectangle.html" title="Sketcher CreateRectangle/fr"><img src="../File/Sketcher_CreateRectangle.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span>. L'image suivante montre le rectangle. FreeCAD fait ajouter des contraintes horizontales et verticales au rectangle. Ce rectangle ne peut pas &ecirc;tre mis en rotation.</li></ul>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Step1_rectangle_600x400.png&amp;filetimestamp=20140513201026&amp;.html" class="mw-file-description"><img src="../File/Step1_rectangle_600x400.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>Le rectangle doit rester au centre du syst&egrave;me de coordonn&eacute;es. A cet effet, une contrainte de sym&eacute;trie est ajout&eacute; &agrave; une ligne horizontale. Ceci est r&eacute;alis&eacute; en s&eacute;lectionnant d'abord les deux sommets de la ligne horizontale, puis l'axe vertical du syst&egrave;me de coordonn&eacute;es. La contrainte de sym&eacute;trie est ajout&eacute;e en cliquant sur le bouton <span typeof="mw:File"><a href="../fr/Sketcher_ConstrainSymmetric.html" title="Sketcher ConstrainSymmetric/fr"><img src="../File/Sketcher_ConstrainSymmetric.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span>. On fait de m&ecirc;me pour une ligne verticale, mais maintenant l'axe horizontal est s&eacute;lectionn&eacute; comme axe de sym&eacute;trie. L'image ci-dessous montre le r&eacute;sultat. Le rectangle reste maintenant au centre et peut &ecirc;tre redimensionn&eacute;e, mais pas d&eacute;plac&eacute;.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Step2_rectangle_with_symmetry_600x400.png&amp;filetimestamp=20140513201459&amp;.html" class="mw-file-description"><img src="../File/Step2_rectangle_with_symmetry_600x400.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>Il s'agissait de la pr&eacute;paration du rectangle. La ligne horizontale sup&eacute;rieure devrait &ecirc;tre la distance AS de la construction avec le chiffre d'or. Une ligne suppl&eacute;mentaire est n&eacute;cessaire pour repr&eacute;senter la distance SB. Il est dessin&eacute; un peu fauss&eacute;, comme indiqu&eacute; ci-dessous. Ceci permet d'&eacute;viter l'auto-contrainte &agrave; l'horizontale. Cette ligne devrait plut&ocirc;t &ecirc;tre contrainte plus tard avec un angle 180&deg;, afin d'&eacute;viter l'existence de solutions multiples &agrave; la combinaison de contrainte construite. Si la ligne est trac&eacute;e avec une horizontale limit&eacute;e, le sketcher se plaindra plus tard, lors de l'ajout de l'angle contrainte de 180&deg;. La contrainte horizontale doit &ecirc;tre enlev&eacute;e dans un tel cas. La photo montre comment ajouter une contrainte angulaire en s&eacute;lectionnant sur deux lignes et en cliquant sur <span typeof="mw:File"><a href="../fr/Sketcher_ConstrainAngle.html" title="Sketcher ConstrainAngle/fr"><img src="../File/Sketcher_ConstrainAngle.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span>. Apr&egrave;s avoir ajout&eacute; une ligne, il est souvent conseill&eacute; de glisser sur la ligne avec la souris. Ce sera facile de montrer, si une ligne n'est pas attach&eacute;e aux autres &eacute;l&eacute;ments trac&eacute;s. Si une ligne n'est pas correctement connect&eacute;e aux autres lignes, des probl&egrave;mes peuvent survenir dans les &eacute;tapes ult&eacute;rieures de la construction de la pi&egrave;ce.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Step3_making_SB_600x400.png&amp;filetimestamp=20140513203541&amp;.html" class="mw-file-description"><img src="../File/Step3_making_SB_600x400.png" decoding="async" width="600" height="399" class="mw-file-element" data-file-width="600" data-file-height="399"></a></span>
</p><p>La derni&egrave;re ligne ne fait pas partie du rectangle. Il est donc n&eacute;cessaire de la convertir en une ligne de construction. S&eacute;lectionnez la ligne et cliquer sur le bouton <span typeof="mw:File"><a href="../fr/Sketcher_ToggleConstruction.html" title="Sketcher ToggleConstruction/fr"><img src="../File/Sketcher_ToggleConstruction.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> pour faire la conversion. 
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Step4_make_SB_construction_line_600x400.png&amp;filetimestamp=20140515193001&amp;.html" class="mw-file-description"><img src="../File/Step4_make_SB_construction_line_600x400.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>La ligne a maintenant une couleur bleue visible ci-dessous. La recette de Wikip&eacute;dia pour le nombre d'or n&eacute;cessite une ligne moiti&eacute; de la distance AB. Afin d'obtenir un point de r&eacute;f&eacute;rence pour cela, un sommet suppl&eacute;mentaire est fix&eacute; &agrave; la ligne avec l'outil <span typeof="mw:File"><a href="../fr/Sketcher_CreatePoint.html" title="Sketcher CreatePoint/fr"><img src="../File/Sketcher_CreatePoint.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span>. Ceci est illustr&eacute; ci-dessous.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Step5_helper_vertex.png&amp;filetimestamp=20140515193517&amp;.html" class="mw-file-description"><img src="../File/Step5_helper_vertex.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>Le point de r&eacute;f&eacute;rence doit rester au centre de la distance AB. Cet objectif sera atteint en s&eacute;lectionnant d'abord les deux extr&eacute;mit&eacute;s de la distance AB et en s&eacute;lectionnant ensuite le point central. Lorsque les trois points sont s&eacute;lectionn&eacute;s dans le bon ordre, la contrainte de sym&eacute;trie peut &ecirc;tre fix&eacute;e en cliquant sur le bouton <span typeof="mw:File"><a href="../fr/Sketcher_ConstrainSymmetric.html" title="Sketcher ConstrainSymmetric/fr"><img src="../File/Sketcher_ConstrainSymmetric.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span>, comme indiqu&eacute; ci-dessous.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Step6_symmetry_setting.png&amp;filetimestamp=20140515193603&amp;.html" class="mw-file-description"><img src="../File/Step6_symmetry_setting.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>L'Image ci-dessous montre d&eacute;j&agrave; le deuxi&egrave;me c&ocirc;t&eacute; BC de la construction du triangle. Cette ligne a &eacute;t&eacute; &eacute;labor&eacute;e comme d&eacute;crit ci-dessus et convertie en une ligne de construction. Cette ligne doit avoir une contrainte verticale visible dans l'image. Ceci peut &ecirc;tre facilement obtenu en tra&ccedil;ant la ligne presque verticale. Si la ligne est presque verticale un symbole de contrainte verticale est affich&eacute; et r&eacute;gl&eacute; par le Sketcher lors de la finition de la ligne &agrave; cet &eacute;tat.
</p><p>La ligne BC doit avoir la moiti&eacute; de la longueur de AB. Il n'y a qu'un point de r&eacute;f&eacute;rence disponibles &agrave; cet effet, de sorte que la contrainte d'&eacute;galit&eacute; ne peut pas &ecirc;tre utilis&eacute;. La contrainte d'&eacute;galit&eacute; aurait besoin d'une ligne avec cette longueur comme r&eacute;f&eacute;rence, ce qui ne est pas disponible dans la construction. Par cons&eacute;quent l'arc classique est utilis&eacute;e pour d&eacute;finir la longueur BC. L'image ci-dessous montre le dessin de l'arc. L'outil Arc <span typeof="mw:File"><a href="../fr/Sketcher_CreateArc.html" title="Sketcher CreateArc/fr"><img src="../File/Sketcher_CreateArc.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> est utilis&eacute;. D'abord, le point central est fix&eacute; sur B. Le point devrait &ecirc;tre visible sous l'outil-arc en cliquant sur B. Souvent l'outil-arc n'a pas a &ecirc;tre pas directement sur le point de cible, mais un peu en dessous, afin d'obtenir le point  de co&iuml;ncidence visible. Deuxi&egrave;mement, le rayon de l'arc est d&eacute;fini en r&eacute;glant le point suivant au point de r&eacute;f&eacute;rence. Le dernier point de l'arc se trouve dans le voisinage du point C. Il est important que les deux premiers points soient fix&eacute;s &agrave; C et le point central. Cela devrait &ecirc;tre test&eacute; en glissant sur l'arc apr&egrave;s l' avoir termin&eacute;.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Step7_arc_defining_BC.png&amp;filetimestamp=20140515193651&amp;.html" class="mw-file-description"><img src="../File/Step7_arc_defining_BC.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>Afin de d&eacute;finir la longueur de BC, la ligne doit se terminer &agrave; l'arc. Cela sera fait en d&eacute;finissant une contrainte de co&iuml;ncidence entre le dernier point de l'arc et le point C, comme indiqu&eacute; ci-dessous. Les deux points doivent &ecirc;tre s&eacute;lectionn&eacute;s et le bouton de co&iuml;ncidence <span typeof="mw:File"><a href="../fr/Constraint_PointOnPoint.html" title="Constraint PointOnPoint/fr"><img src="../File/Constraint_PointOnPoint.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> doit &ecirc;tre cliqu&eacute;.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Step8_arc_BC_finishing.png&amp;filetimestamp=20140515193732&amp;.html" class="mw-file-description"><img src="../File/Step8_arc_BC_finishing.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>L'image suivante montre le triangle pr&ecirc;t. L'hypot&eacute;nuse AC est d&eacute;j&agrave; trac&eacute;e et convertie en une ligne de construction.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Step9_triangle_ready.png&amp;filetimestamp=20140515193821&amp;.html" class="mw-file-description"><img src="../File/Step9_triangle_ready.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>Maintenant l'&eacute;tape 2 de la technique Wikip&eacute;dia doit &ecirc;tre r&eacute;alis&eacute;e. Un second arc doit &ecirc;tre dessin&eacute; avec le point central en C et le point de d&eacute;part en B. Le dernier point devrait &ecirc;tre &agrave; la fin de l'hypot&eacute;nuse comme indiqu&eacute; dans l'image ci-dessous. 
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Step10_second_arc.png&amp;filetimestamp=20140515193909&amp;.html" class="mw-file-description"><img src="../File/Step10_second_arc.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>L'arc dessin&eacute; a &eacute;t&eacute; converti en une ligne de construction. Maintenant l'&eacute;tape 3 de la technique Wikip&eacute;dia commence en dessinant le dernier arc comme indiqu&eacute; dans l'image ci-dessous. Le rayon de cet arc peut &ecirc;tre d&eacute;fini avec le point ci-dessus construit sur l'hypot&eacute;nuse. Le dernier point ne sera g&eacute;n&eacute;ralement pas &agrave; un coin du rectangle. Mais ce n'est pas un probl&egrave;me, car il sera fix&eacute; ult&eacute;rieurement. Le dernier point peut &ecirc;tre d&eacute;fini comme indiqu&eacute; ci-dessous.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Step11_last_arc.png&amp;filetimestamp=20140515193951&amp;.html" class="mw-file-description"><img src="../File/Step11_last_arc.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>Il faut maintenant passer &agrave; l'&eacute;tape finale, afin que la ligne horizontale du rectangle soit &eacute;gale &agrave; la distance AS. Ceci est illustr&eacute; ci-dessous en fixant une contrainte de co&iuml;ncidence entre l'extr&eacute;mit&eacute; du dernier arc et le coin du rectangle. 
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Step12_define_ratio.png&amp;filetimestamp=20140515194106&amp;.html" class="mw-file-description"><img src="../File/Step12_define_ratio.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>Maintenant, la ligne verticale doit &ecirc;tre faite de la longueur de la distance SC. D&eacute;finissez une contrainte d'&eacute;galit&eacute; en s&eacute;lectionnant le bouton <span typeof="mw:File"><a href="../fr/Sketcher_ConstrainEqual.html" title="Sketcher ConstrainEqual/fr"><img src="../File/Sketcher_ConstrainEqual.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> comme indiqu&eacute; ci-dessous, qui le fera.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Step12_define_rectangle.png&amp;filetimestamp=20140515194359&amp;.html" class="mw-file-description"><img src="../File/Step12_define_rectangle.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>Le tableau suivant montre le rectangle avec un rapport de longueur de c&ocirc;t&eacute; &eacute;gale au nombre d'or. Le rectangle aura seulement laiss&eacute; un degr&eacute; de libert&eacute;. Donc, en glissant sur lui, il  devrait changer de taille, mais pas bouger. Si une certaine taille d'un c&ocirc;t&eacute; est n&eacute;cessaire, une contrainte de longueur peut &ecirc;tre ajout&eacute;e &agrave; ce c&ocirc;t&eacute;. Le croquis est pr&ecirc;t et peut &ecirc;tre ferm&eacute;. Seul un rectangle devrait &ecirc;tre visible dans la fen&ecirc;tre FreeCAD.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Step14_rectangle_with_golden_ratio.png&amp;filetimestamp=20140515194458&amp;.html" class="mw-file-description"><img src="../File/Step14_rectangle_with_golden_ratio.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p><span id="Exercise:_resilient_sketch"></span>
</p>
<h2><span id="Exercice_:_esquisse_param.C3.A9trable"></span><span class="mw-headline" id="Exercice_:_esquisse_param&eacute;trable">Exercice&nbsp;: esquisse param&eacute;trable</span></h2>
<p>L'exemple ci-dessus a pr&eacute;sent&eacute; les lignes de construction. Maintenant des choses importantes sont discut&eacute;es pour  faire des esquisses param&eacute;tr&eacute;es. Voici un exercice pour obtenir un peu de pratique pour travailler avec le sketcher. L'objectif est de faire une esquisse pour quelque chose comme un cadre sp&eacute;cial, comme indiqu&eacute; ci-dessous.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Frame_erxercise_pad.png&amp;filetimestamp=20140519201221&amp;.html" class="mw-file-description"><img src="../File/Frame_erxercise_pad.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>Il ne devrait y avoir que trois dimensions n&eacute;cessaires pour d&eacute;finir le cadre. Afin de rendre plus facile l'&eacute;volution des dimensions, les contraintes peuvent &ecirc;tre renomm&eacute;es par quelque chose de mn&eacute;motechnique. Il suffit de s&eacute;lectionner la contrainte dans la vue liste et d'appuyer sur &lt;F2&gt;. La contrainte peut &ecirc;tre nomm&eacute; par exemple "Epaisseur". Le dessin ci-dessous montre les dimensions. Le pic &agrave; la droite devrait avoir deux fois l'&eacute;paisseur de paroi.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Frame_exercise_dimensions.png&amp;filetimestamp=20140519201841&amp;.html" class="mw-file-description"><img src="../File/Frame_exercise_dimensions.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>L'esquisse doit avoir l'aspect pr&eacute;vu m&ecirc;me apr&egrave;s avoir modifi&eacute; les dimensions cl&eacute;s, par exemple en les faisant passer &agrave; 2000 mm puis &agrave; 30. Vous devrez peut-&ecirc;tre utiliser des contraintes d'angle &agrave; certains endroits pour atteindre cet objectif. L'image ci-dessous montre une esquisse qui n'a pas r&eacute;sist&eacute; &agrave; de telles modifications. Elle est d&eacute;sormais inutilisable. Pour retrouver l'&eacute;tat d'origine, le bouton d'annulation <span typeof="mw:File"><a href="../fr/Std_Undo.html" title="Std Undo/fr"><img src="../File/Std_Undo.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> peut &ecirc;tre utilis&eacute;.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Frame_erxercise_failed_sketch.png&amp;filetimestamp=20140519202547&amp;.html" class="mw-file-description"><img src="../File/Frame_erxercise_failed_sketch.png" decoding="async" width="600" height="400" class="mw-file-element" data-file-width="600" data-file-height="400"></a></span>
</p><p>Le sch&eacute;ma ci-dessus est inutilisable pour l'atelier Conception de Pi&egrave;ce. Seul le Profil sans intersection de lignes est autoris&eacute;. Les lignes de construction peuvent se croiser. Celles ci ne sont pas utilis&eacute;es pour la fabrication de solides.
</p><p><br>
Une des utilisations principales de l'esquisseur est la construction de pi&egrave;ces dans l'atelier Conception de Pi&egrave;ce. La g&eacute;om&eacute;trie d&eacute;j&agrave; existante peut &ecirc;tre utilis&eacute;e semblable &agrave; des lignes de construction. Comme ce tutoriel met davantage l'accent sur la fonctionnalit&eacute; basique du sketcher, voir ici pour l'utilisation de g&eacute;om&eacute;trie externe&nbsp;: <a href="../fr/Sketcher_External.html" title="Sketcher External/fr">Sketcher g&eacute;om&eacute;trie externe</a>
</p>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><span typeof="mw:File"><a href="../index.php?title=Workbench_Sketcher.svg&amp;filetimestamp=20231231194727&amp;.html" class="mw-file-description"><img src="../File/Workbench_Sketcher.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../fr/Sketcher_Workbench.html" title="Sketcher Workbench/fr">Sketcher</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b>G&eacute;n&eacute;ral&nbsp;:</b> <a href="../fr/Sketcher_NewSketch.html" title="Sketcher NewSketch/fr">Cr&eacute;er une esquisse</a>, <a href="../fr/Sketcher_EditSketch.html" title="Sketcher EditSketch/fr">Modifier l'esquisse</a>, <a href="../fr/Sketcher_MapSketch.html" title="Sketcher MapSketch/fr">Esquisse sur une face</a>, <a href="../fr/Sketcher_ReorientSketch.html" title="Sketcher ReorientSketch/fr">R&eacute;orienter l'esquisse</a>, <a href="../fr/Sketcher_ValidateSketch.html" title="Sketcher ValidateSketch/fr">Valider l'esquisse</a>, <a href="../fr/Sketcher_MergeSketches.html" title="Sketcher MergeSketches/fr">Fusionner les esquisses</a>, <a href="../fr/Sketcher_MirrorSketch.html" title="Sketcher MirrorSketch/fr">Esquisse miroir</a>, <a href="../fr/Sketcher_LeaveSketch.html" title="Sketcher LeaveSketch/fr">Quitter l'esquisse</a>, <a href="../fr/Sketcher_ViewSketch.html" title="Sketcher ViewSketch/fr">Vue de l'esquisse</a>, <a href="../fr/Sketcher_ViewSection.html" title="Sketcher ViewSection/fr">Vue de section</a>, <a href="../fr/Sketcher_Grid.html" title="Sketcher Grid/fr">Grille</a>, <a href="../fr/Sketcher_Snap.html" title="Sketcher Snap/fr">Aimantation</a>, <a href="../fr/Sketcher_RenderingOrder.html" title="Sketcher RenderingOrder/fr">Ordre de rendu</a>, <a href="../fr/Sketcher_StopOperation.html" title="Sketcher StopOperation/fr">Arr&ecirc;t de l'op&eacute;ration</a></li></ul>
<hr>
<ul><li><b>G&eacute;om&eacute;tries&nbsp;:</b> <a href="../fr/Sketcher_CreatePoint.html" title="Sketcher CreatePoint/fr">Point</a>, <a href="../fr/Sketcher_CreateLine.html" title="Sketcher CreateLine/fr">Ligne</a>, <a href="../fr/Sketcher_CreateArc.html" title="Sketcher CreateArc/fr">Arc</a>, <a href="../fr/Sketcher_Create3PointArc.html" title="Sketcher Create3PointArc/fr">Arc par 3 points</a>, <a href="../fr/Sketcher_CreateCircle.html" title="Sketcher CreateCircle/fr">Cercle</a>, <a href="../fr/Sketcher_Create3PointCircle.html" title="Sketcher Create3PointCircle/fr">Cercle par 3 points</a>, <a href="../fr/Sketcher_CreateEllipseByCenter.html" title="Sketcher CreateEllipseByCenter/fr">Ellipse par son centre</a>, <a href="../fr/Sketcher_CreateEllipseBy3Points.html" title="Sketcher CreateEllipseBy3Points/fr">Ellipse par 3 points</a>, <a href="../fr/Sketcher_CreateArcOfEllipse.html" title="Sketcher CreateArcOfEllipse/fr">Arc d'ellipse</a>, <a href="../fr/Sketcher_CreateArcOfHyperbola.html" title="Sketcher CreateArcOfHyperbola/fr">Arc d'hyperbole</a>, <a href="../fr/Sketcher_CreateArcOfParabola.html" title="Sketcher CreateArcOfParabola/fr">Arc de parabole</a>, <a href="../fr/Sketcher_CreateBSpline.html" title="Sketcher CreateBSpline/fr">B-spline simple</a>, <a href="../fr/Sketcher_CreatePeriodicBSpline.html" title="Sketcher CreatePeriodicBSpline/fr">B-spline p&eacute;riodique</a>, <a href="../fr/Sketcher_CreateBSplineByInterpolation.html" title="Sketcher CreateBSplineByInterpolation/fr">B-spline par des n&oelig;uds</a>, <a href="../fr/Sketcher_CreatePeriodicBSplineByInterpolation.html" title="Sketcher CreatePeriodicBSplineByInterpolation/fr">B-spline p&eacute;riodique par des n&oelig;uds</a>, <a href="../fr/Sketcher_CreatePolyline.html" title="Sketcher CreatePolyline/fr">Polyligne</a>, <a href="../fr/Sketcher_CreateRectangle.html" title="Sketcher CreateRectangle/fr">Rectangle</a>, <a href="../fr/Sketcher_CreateRectangle_Center.html" title="Sketcher CreateRectangle Center/fr">Rectangle centr&eacute;</a>, <a href="../fr/Sketcher_CreateOblong.html" title="Sketcher CreateOblong/fr">Rectangle arrondi</a>, <a href="../fr/Sketcher_CreateTriangle.html" title="Sketcher CreateTriangle/fr">Triangle</a>, <a href="../fr/Sketcher_CreateSquare.html" title="Sketcher CreateSquare/fr">Carr&eacute;</a>, <a href="../fr/Sketcher_CreatePentagon.html" title="Sketcher CreatePentagon/fr">Pentagone</a>, <a href="../fr/Sketcher_CreateHexagon.html" title="Sketcher CreateHexagon/fr">Hexagone</a>, <a href="../fr/Sketcher_CreateHeptagon.html" title="Sketcher CreateHeptagon/fr">Heptagone</a>, <a href="../fr/Sketcher_CreateOctagon.html" title="Sketcher CreateOctagon/fr">Octogone</a>, <a href="../fr/Sketcher_CreateRegularPolygon.html" title="Sketcher CreateRegularPolygon/fr">Polygone r&eacute;gulier</a>, <a href="../fr/Sketcher_CreateSlot.html" title="Sketcher CreateSlot/fr">Contour oblong</a>, <a href="../fr/Sketcher_CreateFillet.html" title="Sketcher CreateFillet/fr">Cong&eacute;</a>, <a href="../fr/Sketcher_CreatePointFillet.html" title="Sketcher CreatePointFillet/fr">Cong&eacute; avec contrainte</a>, <a href="../fr/Sketcher_Trimming.html" title="Sketcher Trimming/fr">Ajuster</a>, <a href="../fr/Sketcher_Extend.html" title="Sketcher Extend/fr">Prolonger</a>, <a href="../fr/Sketcher_Split.html" title="Sketcher Split/fr">Diviser</a>, <a href="../fr/Sketcher_External.html" title="Sketcher External/fr">G&eacute;om&eacute;trie externe</a>, <a href="../fr/Sketcher_CarbonCopy.html" title="Sketcher CarbonCopy/fr">Copie carbone</a>, <a href="../fr/Sketcher_ToggleConstruction.html" title="Sketcher ToggleConstruction/fr">G&eacute;om&eacute;trie de construction</a></li></ul>
<hr>
<ul><li><b>Contraintes&nbsp;:</b>
<ul><li><b>Contraintes geometriques&nbsp;:</b> <a href="../fr/Sketcher_ConstrainCoincident.html" title="Sketcher ConstrainCoincident/fr">Co&iuml;ncidence</a>, <a href="../fr/Sketcher_ConstrainPointOnObject.html" title="Sketcher ConstrainPointOnObject/fr">Point sur objet</a>, <a href="../fr/Sketcher_ConstrainVertical.html" title="Sketcher ConstrainVertical/fr">Vertical</a>, <a href="../fr/Sketcher_ConstrainHorizontal.html" title="Sketcher ConstrainHorizontal/fr">Horizontal</a>, <a href="../fr/Sketcher_ConstrainParallel.html" title="Sketcher ConstrainParallel/fr">Parall&egrave;le</a>, <a href="../fr/Sketcher_ConstrainPerpendicular.html" title="Sketcher ConstrainPerpendicular/fr">Perpendiculaire</a>, <a href="../fr/Sketcher_ConstrainTangent.html" title="Sketcher ConstrainTangent/fr">Tangente</a>, <a href="../fr/Sketcher_ConstrainEqual.html" title="Sketcher ConstrainEqual/fr">&Eacute;galit&eacute;</a>, <a href="../fr/Sketcher_ConstrainSymmetric.html" title="Sketcher ConstrainSymmetric/fr">Sym&eacute;trie</a>, <a href="../fr/Sketcher_ConstrainBlock.html" title="Sketcher ConstrainBlock/fr">Blocage</a></li>
<li><b>Contraintes de dimension&nbsp;:</b> <a href="../fr/Sketcher_ConstrainLock.html" title="Sketcher ConstrainLock/fr">Fixe</a>, <a href="../fr/Sketcher_ConstrainDistanceX.html" title="Sketcher ConstrainDistanceX/fr">Distance horizontale</a>, <a href="../fr/Sketcher_ConstrainDistanceY.html" title="Sketcher ConstrainDistanceY/fr">Distance verticale</a>, <a href="../fr/Sketcher_ConstrainDistance.html" title="Sketcher ConstrainDistance/fr">Dimensionnelle</a>, <a href="../fr/Sketcher_ConstrainRadius.html" title="Sketcher ConstrainRadius/fr">Rayon ou poids</a>, <a href="../fr/Sketcher_ConstrainDiameter.html" title="Sketcher ConstrainDiameter/fr">Diam&egrave;tre</a>, <a href="../fr/Sketcher_ConstrainRadiam.html" title="Sketcher ConstrainRadiam/fr">Rayon automatique</a>, <a href="../fr/Sketcher_ConstrainAngle.html" title="Sketcher ConstrainAngle/fr">Angle</a>, <a href="../fr/Sketcher_ConstrainSnellsLaw.html" title="Sketcher ConstrainSnellsLaw/fr">Contrainte de r&eacute;fraction</a></li>
<li><b>Outils de contraintes&nbsp;:</b> <a href="../fr/Sketcher_ToggleDrivingConstraint.html" title="Sketcher ToggleDrivingConstraint/fr">Contraintes pilotantes</a>, <a href="../fr/Sketcher_ToggleActiveConstraint.html" title="Sketcher ToggleActiveConstraint/fr">Activation des contraintes</a></li></ul></li></ul>
<hr>
<ul><li><b>Outils&nbsp;:</b> <a href="../fr/Sketcher_SelectElementsWithDoFs.html" title="Sketcher SelectElementsWithDoFs/fr">Degr&eacute;s de libert&eacute; non contraints</a>, <a href="../fr/Sketcher_SelectConstraints.html" title="Sketcher SelectConstraints/fr">Contraintes associ&eacute;es</a>, <a href="../fr/Sketcher_SelectElementsAssociatedWithConstraints.html" title="Sketcher SelectElementsAssociatedWithConstraints/fr">&Eacute;l&eacute;ments associ&eacute;s aux contraintes</a>, <a href="../fr/Sketcher_SelectRedundantConstraints.html" title="Sketcher SelectRedundantConstraints/fr">Contraintes redondantes</a>, <a href="../fr/Sketcher_SelectConflictingConstraints.html" title="Sketcher SelectConflictingConstraints/fr">Contraintes conflictuelles</a>, <a href="../fr/Sketcher_RestoreInternalAlignmentGeometry.html" title="Sketcher RestoreInternalAlignmentGeometry/fr">G&eacute;om&eacute;trie interne</a>, <a href="../fr/Sketcher_SelectOrigin.html" title="Sketcher SelectOrigin/fr">Origine</a>, <a href="../fr/Sketcher_SelectHorizontalAxis.html" title="Sketcher SelectHorizontalAxis/fr">Axe horizontal</a>, <a href="../fr/Sketcher_SelectVerticalAxis.html" title="Sketcher SelectVerticalAxis/fr">Axe vertical</a>, <a href="../fr/Sketcher_Symmetry.html" title="Sketcher Symmetry/fr">Sym&eacute;trie</a>, <a href="../fr/Sketcher_Clone.html" title="Sketcher Clone/fr">Clone</a>, <a href="../fr/Sketcher_Copy.html" title="Sketcher Copy/fr">Copie</a>, <a href="../fr/Sketcher_Move.html" title="Sketcher Move/fr">D&eacute;placer</a>, <a href="../fr/Sketcher_RectangularArray.html" title="Sketcher RectangularArray/fr">R&eacute;seau rectangulaire</a>, <a href="../fr/Sketcher_RemoveAxesAlignment.html" title="Sketcher RemoveAxesAlignment/fr">Supprimer l'alignement des axes</a>, <a href="../fr/Sketcher_DeleteAllGeometry.html" title="Sketcher DeleteAllGeometry/fr">Supprimer tous les &eacute;l&eacute;ments de g&eacute;om&eacute;trie</a>, <a href="../fr/Sketcher_DeleteAllConstraints.html" title="Sketcher DeleteAllConstraints/fr">Supprimer toutes les contraintes</a></li></ul>
<hr>
<ul><li><b>Outils B-spline&nbsp;:</b> <a href="../fr/Sketcher_BSplineDegree.html" title="Sketcher BSplineDegree/fr">Degr&eacute; de la B-spline</a>, <a href="../fr/Sketcher_BSplinePolygon.html" title="Sketcher BSplinePolygon/fr">Polygone de contr&ocirc;le de la B-spline</a>, <a href="../fr/Sketcher_BSplineComb.html" title="Sketcher BSplineComb/fr">Peigne de courbure</a>, <a href="../fr/Sketcher_BSplineKnotMultiplicity.html" title="Sketcher BSplineKnotMultiplicity/fr">Multiplicit&eacute; des n&oelig;uds</a>, <a href="../fr/Sketcher_BSplinePoleWeight.html" title="Sketcher BSplinePoleWeight/fr">Poids des points de contr&ocirc;le</a>, <a href="../fr/Sketcher_BSplineConvertToNURBS.html" title="Sketcher BSplineConvertToNURBS/fr">Convertir une g&eacute;om&eacute;trie en B-spline</a>, <a href="../fr/Sketcher_BSplineIncreaseDegree.html" title="Sketcher BSplineIncreaseDegree/fr">Augmenter le degr&eacute;</a>, <a href="../fr/Sketcher_BSplineDecreaseDegree.html" title="Sketcher BSplineDecreaseDegree/fr">Diminuer le degr&eacute;</a>, <a href="../fr/Sketcher_BSplineIncreaseKnotMultiplicity.html" title="Sketcher BSplineIncreaseKnotMultiplicity/fr">Augmenter la multiplicit&eacute; des n&oelig;uds</a>, <a href="../fr/Sketcher_BSplineDecreaseKnotMultiplicity.html" title="Sketcher BSplineDecreaseKnotMultiplicity/fr">Diminuer la multiplicit&eacute; des n&oelig;uds</a>, <a href="../fr/Sketcher_BSplineInsertKnot.html" title="Sketcher BSplineInsertKnot/fr">Ins&eacute;rer un n&oelig;ud</a>, <a href="../fr/Sketcher_JoinCurves.html" title="Sketcher JoinCurves/fr">Joindre des courbes</a></li></ul>
<hr>
<ul><li><b>Espace virtuel&nbsp;:</b> <a href="../fr/Sketcher_SwitchVirtualSpace.html" title="Sketcher SwitchVirtualSpace/fr">Espace virtuel</a></li></ul>
<hr>
<ul><li><b>Autres&nbsp;:</b> <a href="../fr/Sketcher_Dialog.html" title="Sketcher Dialog/fr">Sketcher Boite de dialogue</a>, <a href="../fr/Sketcher_Preferences.html" title="Sketcher Preferences/fr">Pr&eacute;f&eacute;rences</a>, <a href="../fr/Sketcher_scripting.html" title="Sketcher scripting/fr">Sketcher Scripts</a></li></ul></div>
    </div></div>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><span typeof="mw:File"><a href="../index.php?title=User_hub.png&amp;filetimestamp=20190221145008&amp;.html" class="mw-file-description"><img src="../File/User_hub.png" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../fr/User_hub.html" title="User hub/fr">Hub utilisateurs</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b><a href="../fr/Getting_started.html" title="Getting started/fr">D&eacute;marrer avec FreeCAD</a></b></li>
<li><b>Installation&nbsp;:</b> <a href="../fr/Download.html" title="Download/fr">T&eacute;l&eacute;chargements</a>, <a href="../fr/Installing_on_Windows.html" title="Installing on Windows/fr">Windows</a>, <a href="../fr/Installing_on_Linux.html" title="Installing on Linux/fr">Linux</a>, <a href="../fr/Installing_on_Mac.html" title="Installing on Mac/fr">Mac</a>, <a href="../fr/Installing_additional_components.html" title="Installing additional components/fr">Logiciels suppl&eacute;mentaires</a>, <a href="../fr/Compile_on_Docker.html" title="Compile on Docker/fr">Docker</a>, <a href="../fr/AppImage.html" title="AppImage/fr">AppImage</a>, <a href="../fr/Ubuntu_Snap.html" title="Ubuntu Snap/fr">Ubuntu Snap</a></li>
<li><b>Bases&nbsp;:</b> <a href="../fr/About_FreeCAD.html" title="About FreeCAD/fr">&Agrave; propos de FreeCAD</a>, <a href="../fr/Interface.html" title="Interface/fr">Interface</a>, <a href="../fr/Mouse_navigation.html" title="Mouse navigation/fr">Navigation par la souris</a>, <a href="../fr/Selection_methods.html" title="Selection methods/fr">M&eacute;thodes de s&eacute;lection</a>, <a href="../fr/Object_name.html" title="Object name/fr">Objet name</a>, <a href="../fr/Preferences_Editor.html" title="Preferences Editor/fr">Pr&eacute;f&eacute;rences</a>, <a href="../fr/Workbenches.html" title="Workbenches/fr">Ateliers</a>, <a href="../fr/Document_structure.html" title="Document structure/fr">Structure du document</a>, <a href="../fr/Property.html" title="Property/fr">Propri&eacute;t&eacute;s</a>, <a href="../fr/Help_FreeCAD.html" title="Help FreeCAD/fr">Contribuer &agrave; FreeCAD</a>, <a href="../fr/Donate.html" title="Donate/fr">Faire un don</a></li></ul>
<hr>
<ul><li><b>Aide&nbsp;:</b> <a href="../fr/Tutorials.html" title="Tutorials/fr">Tutoriels</a>, <a href="../fr/Video_tutorials.html" title="Video tutorials/fr">Tutoriels vid&eacute;o</a></li>
<li><b><a href="../fr/Workbenches.html" title="Workbenches/fr">Ateliers</a>&nbsp;:</b> <a href="../fr/Std_Base.html" title="Std Base/fr">Std Base</a>, <a href="../fr/Arch_Workbench.html" title="Arch Workbench/fr">Arch</a>, <a href="../fr/Assembly_Workbench.html" title="Assembly Workbench/fr">Assembly</a>, <a href="../fr/CAM_Workbench.html" title="CAM Workbench/fr">CAM</a>, <a href="../fr/Draft_Workbench.html" title="Draft Workbench/fr">Draft</a>, <a href="../fr/FEM_Workbench.html" title="FEM Workbench/fr">FEM</a>, <a href="../fr/Inspection_Workbench.html" title="Inspection Workbench/fr">Inspection</a>, <a href="../fr/Mesh_Workbench.html" title="Mesh Workbench/fr">Mesh</a>, <a href="../fr/OpenSCAD_Workbench.html" title="OpenSCAD Workbench/fr">OpenSCAD</a>, <a href="../fr/Part_Workbench.html" title="Part Workbench/fr">Part</a>, <a href="../fr/PartDesign_Workbench.html" title="PartDesign Workbench/fr">PartDesign</a>, <a href="../fr/Points_Workbench.html" title="Points Workbench/fr">Points</a>, <a href="../fr/Reverse_Engineering_Workbench.html" title="Reverse Engineering Workbench/fr">Reverse Engineering</a>, <a href="../fr/Robot_Workbench.html" title="Robot Workbench/fr">Robot</a>, <a href="../fr/Sketcher_Workbench.html" title="Sketcher Workbench/fr">Sketcher</a>, <a href="../fr/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/fr">Spreadsheet</a>, <a href="../fr/Surface_Workbench.html" title="Surface Workbench/fr">Surface</a>, <a href="../fr/TechDraw_Workbench.html" title="TechDraw Workbench/fr">TechDraw</a>, <a href="../fr/Testing.html" title="Testing/fr">Test</a></li></ul>
<hr>
<ul><li><b><a href="../fr/Addon.html" title="Addon/fr">Addons</a>&nbsp;:</b> <a href="../fr/Std_AddonMgr.html" title="Std AddonMgr/fr">Gestionnaire d'Addons</a>, <a href="../fr/External_workbenches.html" title="External workbenches/fr">Ateliers externes</a>, <a href="../fr/Scripting_and_macros.html" title="Scripting and macros/fr">Scripts et macros</a></li></ul>
<hr>
<ul><li><b>Hubs&nbsp;:</b> <a href="../fr/User_hub.html" title="User hub/fr">Hub utilisateurs</a>, <a href="../fr/Power_users_hub.html" title="Power users hub/fr">Hub utilisateurs exp&eacute;riment&eacute;s</a>, <a href="../fr/Developer_hub.html" title="Developer hub/fr">Hub D&eacute;veloppeurs</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20250922180111
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.179 seconds
Real time usage: 0.199 seconds
Preprocessor visited node count: 244/1000000
Post&#8208;expand include size: 19857/2097152 bytes
Template argument size: 7637/2097152 bytes
Highest expansion depth: 5/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1711/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   10.562      1 -total
 40.76%    4.305      1 Template:Sketcher_Tools_navi/fr
 28.78%    3.040      2 Template:Navigation_menu_2
 25.81%    2.726      1 Template:TutorialInfo/fr
 21.04%    2.222      1 Template:Userdocnavi/fr
  9.24%    0.976      1 Template:Prettytable
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:56317-0!canonical and timestamp 20250922180111 and revision id 1647503. Rendering was triggered because: api-parse
 -->
</div>
</div><script src="../site.js"></script>