<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">The FreeCAD source code/fr</span></h1><?xml encoding="UTF-8"><div class="mw-parser-output"><div class="mw-pt-languages noprint" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../de/The_FreeCAD_source_code.html" class="mw-pt-progress mw-pt-progress--complete" title="Der FreeCAD Quellcode (92% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../The_FreeCAD_source_code.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="The FreeCAD source code (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/The_FreeCAD_source_code.html" class="mw-pt-progress mw-pt-progress--low" title="El c&oacute;digo fuente de FreeCAD (38% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="fr" dir="ltr">fran&ccedil;ais</span></li>
<li><a href="../it/The_FreeCAD_source_code.html" class="mw-pt-progress mw-pt-progress--complete" title="Il codice sorgente di FreeCAD (92% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/The_FreeCAD_source_code.html" class="mw-pt-progress mw-pt-progress--complete" title="Kod &#378;r&oacute;d&#322;owy FreeCAD (92% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt-br/The_FreeCAD_source_code.html" class="mw-pt-progress mw-pt-progress--complete" title="O c&oacute;digo-fonte do FreeCAD (92% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../ru/The_FreeCAD_source_code.html" class="mw-pt-progress mw-pt-progress--stub" title="&#1048;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076; FreeCAD (8% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li>
<li><a href="../zh-cn/The_FreeCAD_source_code.html" class="mw-pt-progress mw-pt-progress--med" title="FreeCAD&#30340;&#28304;&#20195;&#30721; (46% translated)" lang="zh-Hans-CN" dir="ltr">&#20013;&#25991;&#65288;&#20013;&#22269;&#22823;&#38470;&#65289;</a></li></ul></div>
<div class="mw-translate-fuzzy">
<p>Le <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD">FreeCAD source code</a> est g&eacute;r&eacute; avec git et est public, ouvert et disponible sous la <a rel="nofollow" class="external text" href="https://en.wikipedia.org/wiki/GNU_Lesser_General_Public_License">licence LGPL</a>. Il peut &ecirc;tre copi&eacute;, t&eacute;l&eacute;charg&eacute;, lu, analys&eacute;, redistribu&eacute; et modifi&eacute; par n'importe qui. Si vous pr&eacute;voyez d'apporter des modifications que vous souhaitez voir incluses dans le code officiel lui-m&ecirc;me, n'oubliez pas que vos modifications devront &ecirc;tre approuv&eacute;es par les d&eacute;veloppeurs de FreeCAD, il est donc sage de discuter d'abord de vos intentions et de vos id&eacute;es sur le <a rel="nofollow" class="external text" href="http://forum.freecadweb.org">forum</a>, pour &eacute;viter le risque de voir vos modifications rejet&eacute;es pour une raison que vous n'aviez pas pr&eacute;vue.
</p>
</div>
<p>Vous trouverez ci-dessous quelques indices et informations utiles pour vous mettre sur les rails si vous souhaitez explorer le code FreeCAD.
</p>
<ul><li>Le code FreeCAD est principalement programm&eacute; en <b>C++</b> mais repose fortement sur <b>Python</b>. Une tr&egrave;s grande partie de ses fonctionnalit&eacute;s fournit des liaisons Python associ&eacute;es, et cela fait partie de la philosophie de base du d&eacute;veloppement FreeCAD de toujours offrir un acc&egrave;s python &agrave; toute nouvelle fonctionnalit&eacute; impl&eacute;ment&eacute;e en C++. Pour obtenir cela, CPython (les outils d'interfa&ccedil;age C fournis par Python lui-m&ecirc;me) et sp&eacute;cialement <a rel="nofollow" class="external text" href="http://cxx.sourceforge.net/">PyCXX</a> sont largement utilis&eacute;s dans FreeCAD. De nombreux mod&egrave;les et outils personnalis&eacute;s sont &eacute;galement fournis dans le code FreeCAD lui-m&ecirc;me pour faciliter la cr&eacute;ation de liaisons python associ&eacute;es. Certaines parties de plus haut niveau du code FreeCAD sont enti&egrave;rement cod&eacute;es en Python.</li></ul>
<ul><li>Le code source de FreeCAD est enti&egrave;rement <b>multi-plateforme</b> et un grand soin est pris pour permettre d'utiliser l'application sur un plus grand nombre possible de plates-formes et de configurations, et de ne pas mettre les utilisateurs existants dans des situations difficiles. Par cons&eacute;quent, autant que possible, les nouvelles versions des composants n&eacute;cessaires sont &eacute;vit&eacute;es alors qu'elles ne sont pas largement et facilement disponibles sur toutes les plates-formes, et la r&eacute;trocompatibilit&eacute; (la possibilit&eacute; d'ouvrir un fichier produit avec une ancienne version de FreeCAD sur une version plus r&eacute;cente) est un priorit&eacute; importante.</li></ul>
<ul><li>Presque toutes les fonctionnalit&eacute;s de FreeCAD sont s&eacute;par&eacute;es en deux parties diff&eacute;rentes, nomm&eacute;es <b>App</b> et <b>Gui</b>. Cette s&eacute;paration se refl&egrave;te partout dans la structure des fichiers du code source. L'application contient toutes les fonctionnalit&eacute;s n&eacute;cessaires pour fonctionner en mode console pure (pas d'interface graphique). Comme FreeCAD peut &ecirc;tre compil&eacute; et ex&eacute;cut&eacute; sans son interface utilisateur graphique, le code de l'application est ind&eacute;pendant de toute biblioth&egrave;que li&eacute;e &agrave; l'interface graphique. L'interface graphique contient tout le code n&eacute;cessaire pour s'ex&eacute;cuter en mode GUI et est construite autour de la fonctionnalit&eacute; de l'application.</li></ul>
<ul><li>La plupart des fonctionnalit&eacute;s de FreeCAD sont impl&eacute;ment&eacute;es dans <b>Modules</b>. FreeCAD sans son module est une simple fen&ecirc;tre de conteneur qui peut simplement ouvrir et enregistrer un fichier. Tous les outils de g&eacute;om&eacute;trie et les ateliers sont impl&eacute;ment&eacute;s dans des modules. Les modules peuvent &ecirc;tre &eacute;crits en C++, en Python ou en combinant le meilleur des deux mondes. Il peut s'agir de modules hybrides C++/Python, o&ugrave; les fonctionnalit&eacute;s de base solides sont programm&eacute;es en C++ et les outils de l'utilisateur final sont &eacute;crits en Python, ce qui les rend plus faciles &agrave; &eacute;tendre et &agrave; adapter par les utilisateurs de FreeCAD. Chaque module d&eacute;finit et cr&eacute;e g&eacute;n&eacute;ralement un <b>Atelier </b> dans l'interface FreeCAD, lorsqu'il est utilis&eacute; en mode GUI, g&eacute;n&eacute;ralement avec le m&ecirc;me nom, mais il n'est pas obligatoire pour les modules de contenir un workbench.</li></ul>
<ul><li>Les modules FreeCAD <b>d&eacute;pendent souvent d'autres modules</b>. La plupart des modules qui utilisent la g&eacute;om&eacute;trie solide d&eacute;pendent du module <b>Part</b>, qui est le module le plus fondamental de FreeCAD, et impl&eacute;mente la plupart de l'interfa&ccedil;age avec OpenCascade. Bien que d'autres modules puissent utiliser directement la fonctionnalit&eacute; OpenCascade, ils s'appuient souvent sur des fonctions de niveau sup&eacute;rieur fournies par Part.</li></ul>
<ul><li>Les modules sont toujours <b>initialis&eacute;s</b> depuis Python. M&ecirc;me s'ils sont enti&egrave;rement &eacute;crits en C++, ils contiennent toujours une structure Python/CPython minimale.</li></ul>
<ul><li>FreeCAD est un utilisateur avide d'<b>autres biblioth&egrave;ques open-source</b>. Outre Python et Qt, utilis&eacute;s par le noyau et presque tous les modules, les deux biblioth&egrave;ques lourdes utilis&eacute;es dans la plupart des modules sont <a rel="nofollow" class="external text" href="https://fr.wikipedia.org/wiki/Open_CASCADE_Technology">Open CASCADE Technology</a> (OCCT) et <a rel="nofollow" class="external text" href="http://www.coin3d.org/">Coin3D</a> Open Cascade est utilis&eacute; pour cr&eacute;er et g&eacute;rer toute la g&eacute;om&eacute;trie solide de FreeCAD, tandis que coin3D est utilis&eacute; pour g&eacute;rer la vue 3D. OpenCascade est principalement utilis&eacute; dans le monde des applications et coin3D exclusivement dans le monde de l'interface graphique. Une compr&eacute;hension de base d'Open Cascade est fondamentale pour effectuer tout travail li&eacute; &agrave; la g&eacute;om&eacute;trie avec FreeCAD. Des modules plus sp&eacute;cifiques utilisent des biblioth&egrave;ques plus sp&eacute;cifiques, et comme il n'y a g&eacute;n&eacute;ralement aucune restriction sur ce point en dehors de ces biblioth&egrave;ques pour &ecirc;tre facilement disponibles sur toutes les plates-formes, la liste des d&eacute;pendances d'une installation compl&egrave;te de FreeCAD avec tous ses modules peut &ecirc;tre assez longue.</li></ul>
<ul><li>Les <b>objets de document</b> de FreeCAD, qui sont tous les objets contenus dans un document FreeCAD, sont ce qui appara&icirc;t dans l'arborescence de l'interface graphique et dans FreeCAD.ActiveDocument.Objects() en Python. Ils peuvent ou non avoir des donn&eacute;es g&eacute;om&eacute;triques, et peuvent ou non afficher quoi que ce soit dans la vue 3D. Ils sont toujours s&eacute;par&eacute;s dans les parties App et Gui. La partie Gui n'est pas charg&eacute;e lors de l'ex&eacute;cution en mode console. Les objets g&eacute;om&eacute;triques standard, tels que ceux trouv&eacute;s dans Part ou PartDesign, ont leur g&eacute;om&eacute;trie bas&eacute;e sur OpenCascade d&eacute;finie dans leur homologue App, tandis que l'homologue Gui (&eacute;galement g&eacute;n&eacute;ralement appel&eacute; "View Provider") est responsable de la cr&eacute;ation d'une repr&eacute;sentation coin3D de cette g&eacute;om&eacute;trie, qui sera ins&eacute;r&eacute; dans le graphique principal de la sc&egrave;ne coin3D de la vue 3D.</li></ul>
<ul><li>La structure de r&eacute;pertoire de base du code source est organis&eacute;e comme ceci:
<ul><li><b>App</b>: contient l'application en mode console FreeCAD, d&eacute;finit les structures de base et les classes de base pour les objets de document, qui sont utilis&eacute;es par les modules pour cr&eacute;er leurs propres</li>
<li><b>Base</b>: contient les fonctionnalit&eacute;s de base couramment utilis&eacute;es partout dans FreeCAD: vecteurs 3D, unit&eacute;s, matrices, placements, etc.</li>
<li><b>Gui</b>: contient l'application en mode GUI de FreeCAD, d&eacute;finit la vue 3D, contient de nombreux outils et fonctions &agrave; utiliser par les &eacute;tablis pour interagir avec l'interface et avec la vue 3D, d&eacute;finit les classes de base pour les fournisseurs de vues .</li>
<li><b>Doc</b>: contient principalement un fichier d'aide Qt tout-en-un g&eacute;n&eacute;r&eacute; &agrave; partir de ce wiki.</li>
<li><b>Mod</b>: contient tous les modules, eux-m&ecirc;mes s&eacute;par&eacute;s en App et Gui (&agrave; l'exception des modules python, qui ne suivent pas toujours cette r&egrave;gle aussi clairement).</li></ul></li></ul>
<h3><span class="mw-headline" id="En_relation">En relation</span></h3>
<ul><li><a href="../fr/Source_code_management.html" title="Source code management/fr">Gestion du code source</a></li>
<li>La <a href="../fr/Power_users_hub.html" title="Power users hub/fr">Documentation pour utilisateurs exp&eacute;riment&eacute;s</a> contient beaucoup de documentation sur les modules, OpenCascade et Coin3D, principalement pour le programmeur Python. Cependant, comme la fonctionnalit&eacute; est similaire, ces pages int&eacute;resseront &eacute;galement le programmeur C++.</li>
<li><a href="../fr/File_Format_FCStd.html" title="File Format FCStd/fr">FCStd</a> - le format de fichier FreeCAD</li></ul>
<!-- 
NewPP limit report
Cached time: 20250705150838
Cache expiry: 86400
Reduced expiry: false
Complications: [no&#8208;toc&#8208;conversion]
CPU time usage: 0.055 seconds
Real time usage: 0.106 seconds
Preprocessor visited node count: 9/1000000
Post&#8208;expand include size: 3/2097152 bytes
Template argument size: 0/2097152 bytes
Highest expansion depth: 2/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1763/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    0.000      1 -total
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:81923-0!canonical and timestamp 20250705150838 and revision id 1603578. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>