<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">WikiPages/fr</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="fr" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-WikiPages&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/WikiPages.html" class="mw-pt-progress mw-pt-progress--complete" title="WikiSeiten (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../WikiPages.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="WikiPages (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/WikiPages.html" class="mw-pt-progress mw-pt-progress--med" title="P&aacute;ginasWiki (42% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="fr" dir="ltr">fran&ccedil;ais</span></li>
<li><a href="../it/WikiPages.html" class="mw-pt-progress mw-pt-progress--complete" title="WikiPages (100% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/WikiPages.html" class="mw-pt-progress mw-pt-progress--complete" title="Strona Wiki FreeCAD (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../pt-br/WikiPages.html" class="mw-pt-progress mw-pt-progress--high" title="PaginasWiki (76% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../cs/WikiPages.html" class="mw-pt-progress mw-pt-progress--med" title="Wiki str&aacute;nky (38% translated)" lang="cs" dir="ltr">&#269;e&scaron;tina</a></li>
<li><a href="../bg/WikiPages.html" class="mw-pt-progress mw-pt-progress--low" title="&#1059;&#1080;&#1082;&#1080; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1080; (4% translated)" lang="bg" dir="ltr">&#1073;&#1098;&#1083;&#1075;&#1072;&#1088;&#1089;&#1082;&#1080;</a></li>
<li><a href="../ru/WikiPages.html" class="mw-pt-progress mw-pt-progress--complete" title="WikiPages &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1072;&#1094;&#1080;&#1080; &#1087;&#1086; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1091; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094; (100% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li>
<li><a href="../zh-cn/WikiPages.html" class="mw-pt-progress mw-pt-progress--low" title="WikiPages/zh-cn (1% translated)" lang="zh-Hans-CN" dir="ltr">&#20013;&#25991;&#65288;&#20013;&#22269;&#22823;&#38470;&#65289;</a></li>
<li><a href="../ja/WikiPages.html" class="mw-pt-progress mw-pt-progress--low" title="Wiki&#12506;&#12540;&#12472; (13% translated)" lang="ja" dir="ltr">&#26085;&#26412;&#35486;</a></li>
<li><a href="../ko/WikiPages.html" class="mw-pt-progress mw-pt-progress--low" title="&#50948;&#53412; &#54168;&#51060;&#51648; (6% translated)" lang="ko" dir="ltr">&#54620;&#44397;&#50612;</a></li></ul></div>
<div style="clear:right; margin-bottom: .5em; float: right; padding: .5em 0 .8em 1.4em; background: none;"><meta property="mw:PageProp/toc"></div>
<p>Cette page est une prolongation de la page <a href="../fr/Help;Editing.html" title="Help:Editing/fr">Help:Editing</a> et donne des directives communes pour la r&eacute;daction et la mise &agrave; jour de la documentation du wiki FreeCAD. Elle r&eacute;sume plusieurs discussions et s&eacute;ances de r&eacute;flexion.
</p><p><span id="Before_starting"></span>
</p>
<h2><span class="mw-headline" id="Avant_de_commencer">Avant de commencer</span></h2>
<ul><li>Cette documentation wiki est bas&eacute;e sur <a class="external text" href="https://www.mediawiki.org/wiki/Template:Main_page/fr">MediaWiki</a>, le m&ecirc;me logiciel qui alimente <a rel="nofollow" class="external text" href="https://fr.wikipedia.org/wiki/Wikip%C3%A9dia:Accueil_principal">Wikipedia</a>. Si vous avez contribu&eacute; &agrave; Wikip&eacute;dia, la modification des pages du wiki FreeCAD devrait &ecirc;tre facile.</li>
<li>Si vous n'avez jamais utilis&eacute; de logiciel wiki auparavant, veuillez lire <a href="../fr/Help;Editing.html" title="Help:Editing/fr">Help:Editing</a> pour vous familiariser avec le balisage utilis&eacute;.</li>
<li>Pour une utilisation avanc&eacute;e du logiciel wiki, voir <a class="external text" href="https://www.mediawiki.org/wiki/Help:Contents/fr">MediaWiki Aide:Sommaire</a>. Toutes les fonctionnalit&eacute;s de MediaWiki ne sont pas disponibles dans ce wiki FreeCAD, mais beaucoup le sont.</li>
<li>Nous aimons garder la documentation facile &agrave; lire, &eacute;vitez donc d'utiliser des fonctionnalit&eacute;s complexes. Rester simple.</li>
<li>Utilisez un bac &agrave; sable (sandbox) pour tester votre code, par exemple, <a href="../FreeCADDocu;Sandbox.html" title="FreeCADDocu:Sandbox">FreeCADDocu:Sandbox</a> ou une page particuli&egrave;re avec votre nom <a href="../index.php?title=Sandbox;Yourname&amp;action=edit&amp;redlink=1.html" class="new" title="Sandbox:Yourname (page does not exist)">Sandbox:Yourname</a>. Les pages Sandbox doivent &ecirc;tre plac&eacute;es dans la cat&eacute;gorie Sandbox. Cela se fait en ajoutant <code>[[Category:Sandbox]]</code> au bas du code du wiki.</li>
<li>Veuillez prendre connaissance des traductions. Le wiki FreeCAD utilise la prise en charge de la traduction automatis&eacute;e pour fournir des pages dans de nombreuses langues. Pour chaque page, plusieurs versions linguistiques peuvent exister. Sur de nombreuses pages, vous verrez des balises telles que <code>&lt;translate&gt;...&lt;/translate&gt;</code> et de nombreuses balises simples telles que <code>&lt;!--T:8--&gt;</code>. Ces derni&egrave;res marquent ce que l'on appelle des unit&eacute;s de traduction et sont cr&eacute;&eacute;es par le syst&egrave;me de traduction, vous ne devez jamais les cr&eacute;er manuellement. Elles lient les titres et les paragraphes &agrave; leurs versions traduites. Vous ne devriez pas les changer car cela d&eacute;truirait ces liens. Il est cependant bien de d&eacute;placer des paragraphes ou de modifier le libell&eacute; tant que les balises restent avec eux. Si vous supprimez un titre ou un paragraphe, vous devez &eacute;galement supprimer la balise qui lui appartient. Veuillez noter que les modifications apport&eacute;es aux en-t&ecirc;tes et aux paragraphes existants affectent les traductions actuelles. Vos changements devraient en valoir la peine. Ne vous inqui&eacute;tez pas lors de l'ajout de nouveau mat&eacute;riel car le syst&egrave;me ajoutera automatiquement de nouvelles balises apr&egrave;s vos modifications. Pour plus d'informations, consultez <a href="../fr/Localisation.html" title="Localisation/fr">Localisation</a> et la page d'origine <a class="external text" href="https://www.mediawiki.org/wiki/Help:Extension:Translate/Page_translation_example/fr">Aide:Extension:Translate/Exemple de traduction de page</a>.</li></ul>
<p><span id="General_guidelines"></span>
</p>
<h2><span id="Directives_g.C3.A9n.C3.A9rales"></span><span class="mw-headline" id="Directives_g&eacute;n&eacute;rales">Directives g&eacute;n&eacute;rales</span></h2>
<p><span id="Concise_descriptions"></span>
</p>
<h3><span class="mw-headline" id="Descriptions_concises">Descriptions concises</span></h3>
<p>Lorsque vous d&eacute;crivez FreeCAD, essayez d'&ecirc;tre concis et pr&eacute;cis et &eacute;vitez les r&eacute;p&eacute;titions. D&eacute;crivez ce que FreeCAD <i>fait</i>, et non ce que FreeCAD <i>ne fait pas</i>. &Eacute;vitez &eacute;galement les expressions famili&egrave;res telles que "un petit nombre". Utilisez "quelques" lorsqu'il s'agit d'un nombre ind&eacute;termin&eacute;, ou pr&eacute;cisez la quantit&eacute; exacte.
</p>
<dl><dt>Mauvaise description</dt>
<dd><a href="../fr/PartDesign_Workbench.html" title="PartDesign Workbench/fr">Atelier PartDesign</a>&nbsp;: l'atelier PartDesign est un atelier de conception de pi&egrave;ces qui vise &agrave; fournir des outils pour la mod&eacute;lisation de pi&egrave;ces solides complexes.</dd></dl>
<dl><dt>Bonne description</dt>
<dd><a href="../fr/PartDesign_Workbench.html" title="PartDesign Workbench/fr">Atelier PartDesign</a>&nbsp;: vise &agrave; fournir des outils pour la mod&eacute;lisation de pi&egrave;ces solides complexes.</dd></dl>
<p><span id="Centralized_information"></span>
</p>
<h3><span id="Informations_centralis.C3.A9es"></span><span class="mw-headline" id="Informations_centralis&eacute;es">Informations centralis&eacute;es</span></h3>
<p>&Eacute;vitez de dupliquer les m&ecirc;mes informations &agrave; diff&eacute;rents endroits. Ins&eacute;rez les informations dans une nouvelle page et cr&eacute;ez un lien vers cette page &agrave; partir d'autres pages qui n&eacute;cessitent ces informations.
</p><p>N'utilisez pas la transclusion de pages (<a href="../Help;Editing.html#Templates_and_transcluding_pages" title="Help:Editing">Help:Editing#Templates and transcluding pages</a>) car cela rend le wiki difficile &agrave; traduire. Utilisez uniquement les mod&egrave;les d&eacute;crits ci-dessous dans <a href="#Mod.C3.A8les">Mod&egrave;les</a>.
</p><p><span id="Styling"></span>
</p>
<h3><span class="mw-headline" id="Style">Style</span></h3>
<p>Il existe un mod&egrave;le pour styliser les commandes de menu, comme <b>Fichier &rarr; Sauvegarder</b>, un autre mod&egrave;le pour styliser les touches sur lesquelles appuyer, comme <span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">Shift</span>, un autre mod&egrave;le pour afficher une valeur bool&eacute;enne <code>true</code> etc... Cela permet &agrave; la documentation d'avoir une apparence coh&eacute;rente et de pouvoir &ecirc;tre traduite sans trop d'effort. Veuillez vous familiariser avec la section <a href="#Mod.C3.A8les">Mod&egrave;les</a> avant d'&eacute;crire des pages d'aide.
</p><p><span id="Temporary_flags"></span>
</p>
<h3><span class="mw-headline" id="Indicateurs_temporaires">Indicateurs temporaires</span></h3>
<p>Si vous travaillez sur une grande page, il est conseill&eacute; de marquer la page comme travail en cours ou comme inachev&eacute;e. Cela garantit que les administrateurs du wiki ne marquent pas votre page comme pr&ecirc;te pour la traduction pendant que vous la modifiez encore.
</p><p>Pour signaler une page, ajoutez soit <code>{{Page in progress}}</code> ou <code>{{UnfinishedDocu}}</code> en premi&egrave;re ligne. Avec <code>{{UnfinishedDocu}}</code>, vous invitez les autres &agrave; se joindre &agrave; vous pour terminer la page, tandis que <code>{{Page in progress}}</code> indique que vous ferez le travail vous-m&ecirc;me et que les autres doivent vous laisser du temps.
</p><p>Une fois le travail termin&eacute;, n'oubliez pas de retirer les avertissements!
</p><p><span id="Examples"></span>
</p>
<h2><span class="mw-headline" id="Exemples">Exemples</span></h2>
<p>Pour vous familiariser rapidement avec la structure et le style du wiki FreeCAD, consultez la page du mod&egrave;le&nbsp;: <a href="../fr/GuiCommand_model.html" title="GuiCommand model/fr">Mod&egrave;le GuiCommand</a>.
</p>
<div class="mw-collapsible mw-collapsed toccolours">
<h2><span class="mw-headline" id="Structure">Structure</span></h2>
<div class="mw-collapsible-content">
<p>Le <a href="../fr/User_hub.html" title="User hub/fr">Documentation pour utilisateurs</a> fournit une <a href="../fr/Online_Help_Toc.html" title="Online Help Toc/fr">Table des mati&egrave;res</a>. Ceci est utilis&eacute; comme r&eacute;f&eacute;rence principale pour cr&eacute;er automatiquement l'aide hors ligne que vous pouvez atteindre &agrave; partir de FreeCAD ainsi que la documentation PDF hors ligne.
</p><p>Le <a href="../Template;Docnav.html" title="Template:Docnav">Template:Docnav</a> est utilis&eacute; pour lier s&eacute;quentiellement des pages, en suivant la structure de la <a href="../fr/Online_Help_Toc.html" title="Online Help Toc/fr">Table des mati&egrave;res de l'aide en ligne</a>. Voir <a href="#Mod.C3.A8les">Mod&egrave;les</a> pour une liste de tous les mod&egrave;les.
</p><p><span id="Page_names"></span>
</p>
<h3><span class="mw-headline" id="Noms_de_page">Noms de page</span></h3>
<p>Les noms de page doivent &ecirc;tre courts et utiliser la casse&nbsp;: chaque mot doit commencer par une majuscule, sauf s'il s'agit d'articles, de pr&eacute;positions, de conjonctions ou d'autres particules grammaticales (par exemple, "of", "on", "in", "a", "an", "and").
</p>
<dl><dt>Nom de page incorrect</dt>
<dd></dd>
<dd>Construction of AeroCompany airplanes</dd></dl>
<dl><dt>Bon nom de page</dt>
<dd></dd>
<dd>Construction of AeroCompany Airplanes</dd></dl>
<p>Les noms des pages d'atelier de premier niveau doivent avoir le format suivant&nbsp;: <code>XYZ Workbench</code>, o&ugrave; <code>XYZ</code> est le nom de l'atelier, par exemple <a href="../PartDesign_Workbench.html" title="PartDesign Workbench">PartDesign Workbench</a>. Et les noms des pages d&eacute;crivant les commandes (ou outils) appartenant &agrave; un atelier doivent avoir ce format&nbsp;: <code>Commande XYZ</code>, par exemple <a href="../PartDesign_Pad.html" title="PartDesign Pad">PartDesign Pad</a>. Notez que vous devez utiliser le nom de la commande tel qu'il appara&icirc;t dans le code source.
</p><p><span id="Headings"></span>
</p>
<h3><span id="En-t.C3.AAtes"></span><span class="mw-headline" id="En-t&ecirc;tes">En-t&ecirc;tes</span></h3>
<p>Les titres des paragraphes doivent &ecirc;tre courts et utiliser la casse&nbsp;: tous les mots, sauf le premier et les noms propres, doivent &ecirc;tre en minuscules. Vous ne devriez pas utiliser les titres <code>H1</code> (<code>=&nbsp;Heading&nbsp;=</code>) dans votre balisage wiki puisque le titre de la page est automatiquement ajout&eacute; comme titre principal <code>H1</code>.
</p><p><span id="Links"></span>
</p>
<h3><span class="mw-headline" id="Liens">Liens</span></h3>
<p>Vous devez utiliser le nom du lien d'origine pour les liens dans la mesure du possible. Cela clarifie la page r&eacute;f&eacute;renc&eacute;e dans la documentation imprim&eacute;e ou hors ligne. Veuillez &eacute;viter les mots non significatifs pour le lien.
</p>
<dl><dt>Mauvais lien</dt>
<dd>Pour plus d'informations sur le dessin d'objets 2D, cliquez sur <a href="../fr/Draft_Workbench.html" title="Draft Workbench/fr">ici</a>.</dd></dl>
<dl><dt>Bon lien</dt>
<dd>Pour plus d'informations sur le dessin d'objets 2D, consultez l'<a href="../fr/Draft_Workbench.html" title="Draft Workbench/fr">Atelier Draft</a>.</dd></dl>
<p>Le format pr&eacute;f&eacute;r&eacute; pour un lien est&nbsp;:
</p><p><code>[[Name_of_Page|Name of Page]]</code>
</p><p>Traduit en&nbsp;:
</p><p><code>[[Name_of_Page/fr|Nom de la Page]]</code>
</p><p>Notez que pour la partie avant le caract&egrave;re <code>|</code>, le lien r&eacute;el, la casse est pertinente. Si le nom de votre page est <code>Nom_de_page</code>, le lien &eacute;chouera si vous tapez <code>Nom_de_page</code> (P majuscule). Avant le caract&egrave;re <code>|</code>, tous les espaces doivent &ecirc;tre remplac&eacute;s par des tirets bas (<code>_</code>). Ceci a pour but d'aider les traducteurs qui utilisent un logiciel de traduction. Sans les traits de soulignement, le lien serait traduit par le logiciel, ce qui n'est pas souhaitable.
</p><p>Pour cr&eacute;er un lien vers un certain paragraphe, ajoutez un signe <code>#</code> et ses intitul&eacute;s au nom de la page. Exemple&nbsp;:
</p><p><code>[[WikiPages#Links|WikiPages]]</code>
</p><p>Traduit en&nbsp;:
</p><p><code>[[WikiPages/fr#Liens|WikiPages]]</code>
</p><p>Dans la m&ecirc;me page, vous pouvez omettre le nom de la page. Exemple&nbsp;:
</p><p><code>[[#Links|Links]]</code>
</p><p>Pour cr&eacute;er un lien vers le haut de la page, vous pouvez utiliser&nbsp;:
</p><p><code>&lt;/translate&gt;{{Top}}&lt;translate&gt;</code>
</p><p>Ce mod&egrave;le doit automatiquement afficher le texte correct en fonction de la langue de la page. Un lien vers le haut de la page est particuli&egrave;rement utile pour les pages longues, car il permet &agrave; l'utilisateur de revenir rapidement &agrave; la table des mati&egrave;res. Vous pouvez le placer &agrave; la fin de chaque paragraphe. Assurez-vous qu'il y a une ligne vide avant et apr&egrave;s le mod&egrave;le.
</p>
<dl><dt>Lien image</dt>
<dd><span typeof="mw:File"><a href="../Draft_Wire.html" title="Texte facultatif qui s'affiche lorsque vous survolez l'image"><img alt="Texte facultatif qui s'affiche lorsque vous survolez l'image" src="../File/Draft_Wire.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span>.</dd></dl>
<p>Pour utiliser une image comme lien&nbsp;:
</p><p><code>[[Image:Draft_Wire.svg|24px|Texte facultatif qui s'affiche lorsque vous survolez l'image|link=Draft_Wire]]</code>
</p>
<dl><dt>Lien image + lien texte</dt>
<dd><span typeof="mw:File"><a href="../Draft_Wire.html" title="Draft Wire"><img src="../File/Draft_Wire.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../fr/Draft_Wire.html" title="Draft Wire/fr">Draft Polyligne</a></dd></dl>
<p>Si vous ne tenez pas compte du texte facultatif, le lien lui-m&ecirc;me s'affichera au survol de l'image, ce qui est pr&eacute;f&eacute;rable et vous devez &eacute;galement ajouter un lien texte apr&egrave;s le lien image&nbsp;:
</p><p><code>[[Image:Draft_Wire.svg|24px|link=Draft_Wire]] [[Draft_Wire/fr|Draft Polyligne]]</code>
</p><p><span id="Workbench_pages"></span>
</p>
<h3><span class="mw-headline" id="Les_pages_atelier">Les pages atelier</span></h3>
<p>Une page d'atelier de haut niveau devrait commencer par&nbsp;:
</p>
<ul><li>Une description de l'utilisation de l'atelier.</li>
<li>Une image pour illustrer la description.</li></ul>
<p>Voir <a href="#Capture_d.27.C3.A9cran">Capture d'&eacute;cran</a> pour les conventions sur l'inclusion d'images.
</p><p><span id="Command_pages"></span>
</p>
<h3><span class="mw-headline" id="Pages_de_commande">Pages de commande</span></h3>
<p>Les pages de commandes d&eacute;crivant les outils de l'atelier ne doivent pas &ecirc;tre trop longues, elles doivent seulement expliquer ce qu'une commande peut faire et ce qu'elle ne peut pas faire, et comment l'utiliser. Les images et les exemples doivent &ecirc;tre r&eacute;duits au minimum. Les tutoriels peuvent d&eacute;velopper la mani&egrave;re d'utiliser l'outil et fournir des d&eacute;tails &eacute;tape par &eacute;tape.
</p><p>Veuillez vous r&eacute;f&eacute;rer &agrave; la page <a href="../fr/GuiCommand_model.html" title="GuiCommand model/fr">Mod&egrave;le GuiCommand</a> pour plus de d&eacute;tails
</p><p><span id="Tutorials"></span>
</p>
<h3><span class="mw-headline" id="Tutoriels">Tutoriels</span></h3>
<p>Un tutoriel bien r&eacute;dig&eacute; doit permettre d'apprendre comment obtenir rapidement certains r&eacute;sultats pratiques. Il ne doit pas &ecirc;tre trop long, mais doit inclure suffisamment d'instructions &eacute;tape par &eacute;tape et d'images pour guider l'utilisateur. Au fur et &agrave; mesure de l'&eacute;volution de FreeCAD, les tutoriels peuvent devenir obsol&egrave;tes, il est donc important de mentionner la version de FreeCAD utilis&eacute;e dans, ou requise pour, un tutoriel.
</p><p>Pour des exemples, consultez la page <a href="../fr/Tutorials.html" title="Tutorials/fr">Tutoriels</a>.
</p>
</div> 
</div> 
<div class="mw-collapsible mw-collapsed toccolours">
<p><span id="Templates"></span>
</p>
<h2><span id="Mod.C3.A8les"></span><span class="mw-headline" id="Mod&egrave;les">Mod&egrave;les</span></h2>
<div class="mw-collapsible-content">
<p>Le style des pages du wiki FreeCAD est r&eacute;alis&eacute; gr&acirc;ce &agrave; l'utilisation de mod&egrave;les (<a href="../Help;Editing.html#Templates_and_transcluding_pages" title="Help:Editing">Help:Editing#Templates_and_transcluding_pages</a>). Ils garantissent une apparence standardis&eacute;e pour toutes les pages et permettent &eacute;galement de modifier le style du wiki. Vous pouvez voir la liste compl&egrave;te des mod&egrave;les d&eacute;finis en acc&eacute;dant &agrave; <a href="../Special;PrefixIndex/Template;.html" title="Special:PrefixIndex/Template:">Special:PrefixIndex/Template:</a>. Mais veuillez n'utiliser que les mod&egrave;les figurant dans les tableaux ci-dessous. Vous ne devez utiliser directement les balises HTML que dans des cas tr&egrave;s particuliers.
</p><p>Cliquez sur le lien du mod&egrave;le pour voir les instructions d'utilisation d'un mod&egrave;le et voir son impl&eacute;mentation. Les mod&egrave;les sont une fonctionnalit&eacute; puissante du logiciel MediaWiki. Vous devez &ecirc;tre un utilisateur exp&eacute;riment&eacute; de wiki si vous souhaitez proposer des ajouts et des modifications aux mod&egrave;les existants. S'ils ne sont pas correctement mis en &oelig;uvre, les mod&egrave;les rendent difficile la traduction des pages dans d'autres langues. Leur utilisation doit donc &ecirc;tre limit&eacute;e au formatage du texte et la transclusion des pages doit &ecirc;tre &eacute;vit&eacute;e. Voir <a class="external text" href="https://www.mediawiki.org/wiki/Help:Templates">MediaWiki Help:Templates</a> pour en savoir plus.
</p><p><span id="Simple_templates"></span>
</p>
<h3><span id="Mod.C3.A8les_simples"></span><span class="mw-headline" id="Mod&egrave;les_simples">Mod&egrave;les simples</span></h3>
<p>Ces mod&egrave;les acceptent un simple param&egrave;tre de texte et le mettent en forme avec un style particulier.
</p>
<table border="2" cellspacing="0" cellpadding="4" rules="all" class="hintergrundfarbe1 rahmenfarbe1" style="margin:1em 1em 1em 0; border-style:solid; border-width:1px; border-collapse:collapse; empty-cells:show;">
<tbody><tr>
<th style="width:10%;">Mod&egrave;le
</th>
<th style="width:20%;">Apparence
</th>
<th style="width:70%;">Description
</th></tr>
<tr>
<td><a href="../Template;Top.html" title="Template:Top">Top</a>
</td>
<td>
<p><a href="#top">En haut</a></p>
</td>
<td>Utilisez-le pour ajouter un lien en haut de la page.
</td></tr>
<tr>
<td><a href="../Template;Emphasis.html" title="Template:Emphasis">Emphasis</a>
</td>
<td><i>emphasis</i>
</td>
<td>Utilisez-le pour mettre en valeur un &eacute;l&eacute;ment de texte.
</td></tr>
<tr>
<td><a href="../Template;KEY.html" title="Template:KEY">KEY</a>
</td>
<td><span class="key" style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #888888; border-radius: 0.3em; padding: 0px 5px 1px 5px; color:#202122;">Alt</span>
</td>
<td>Utilisez-le pour indiquer une touche du clavier qui doit &ecirc;tre enfonc&eacute;e.
</td></tr>
<tr>
<td><a href="../Template;ASCII.html" title="Template:ASCII">ASCII</a>
</td>
<td><span typeof="mw:File"><a href="../index.php?title=Ascii_065.svg&amp;filetimestamp=20191120142208&amp;.html" class="mw-file-description"><img src="../File/Ascii_065.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="48" data-file-height="48"></a></span>
</td>
<td>Utilisez-le pour indiquer une touche ascii dans une image (.svg) qui doit &ecirc;tre utilis&eacute;e. Vous devez donner le caract&egrave;re souhait&eacute; ou le num&eacute;ro du code ascii du caract&egrave;re.
</td></tr>
<tr>
<td><a href="../Template;Button.html" title="Template:Button">Button</a>
</td>
<td><span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">Cancel</span>
</td>
<td>Utilisez-le pour indiquer un bouton de l'interface utilisateur graphique sur lequel il faut appuyer.
</td></tr>
<tr>
<td><a href="../Template;RadioButton.html" title="Template:RadioButton">RadioButton</a>
</td>
<td><span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #989898; border-radius: 0.2em; padding: 0px 10px 1px 10px; font-weight:normal;"><span typeof="mw:File"><a href="../index.php?title=RadioButtonFalse.svg&amp;filetimestamp=20200323161942&amp;.html" class="mw-file-description"><img src="../File/RadioButtonFalse.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> Option<span></span></span>
</td>
<td>Utilisez-le pour indiquer un bouton radio dans l'interface utilisateur graphique qui doit &ecirc;tre <span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #989898; border-radius: 0.2em; padding: 0px 10px 1px 10px; font-weight:normal;"><span typeof="mw:File"><a href="../index.php?title=RadioButtonTrue.svg&amp;filetimestamp=20200323161550&amp;.html" class="mw-file-description"><img src="../File/RadioButtonTrue.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> Selected<span></span></span> ou <span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #989898; border-radius: 0.2em; padding: 0px 10px 1px 10px; font-weight:normal;"><span typeof="mw:File"><a href="../index.php?title=RadioButtonFalse.svg&amp;filetimestamp=20200323161942&amp;.html" class="mw-file-description"><img src="../File/RadioButtonFalse.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> Not<span></span></span>.
</td></tr>
<tr>
<td><a href="../Template;CheckBox.html" title="Template:CheckBox">CheckBox</a>
</td>
<td><span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #989898; border-radius: 0.2em; padding: 0px 10px 1px 10px; font-weight:normal;"><span typeof="mw:File"><a href="../index.php?title=CheckBoxFalse.svg&amp;filetimestamp=20200323161434&amp;.html" class="mw-file-description"><img src="../File/CheckBoxFalse.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> Option<span></span></span>
</td>
<td>Utilisez-le pour indiquer une case &agrave; cocher dans l'interface utilisateur graphique qui doit &ecirc;tre <span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #989898; border-radius: 0.2em; padding: 0px 10px 1px 10px; font-weight:normal;"><span typeof="mw:File"><a href="../index.php?title=CheckBoxTrue.svg&amp;filetimestamp=20200323161507&amp;.html" class="mw-file-description"><img src="../File/CheckBoxTrue.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> Checked<span></span></span> ou <span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #989898; border-radius: 0.2em; padding: 0px 10px 1px 10px; font-weight:normal;"><span typeof="mw:File"><a href="../index.php?title=CheckBoxFalse.svg&amp;filetimestamp=20200323161434&amp;.html" class="mw-file-description"><img src="../File/CheckBoxFalse.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> Not<span></span></span>.
</td></tr>
<tr>
<td><a href="../Template;SpinBox.html" title="Template:SpinBox">SpinBox</a>
</td>
<td><span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #989898; border-radius: 0.2em; padding: 2px 5px 3px 5px; font-weight:normal;">1.50  <span typeof="mw:File"><a href="../index.php?title=SpinBox.svg&amp;filetimestamp=20200327215243&amp;.html" class="mw-file-description"><img src="../File/SpinBox.svg" decoding="async" width="17" height="17" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span><span></span></span>
</td>
<td>Utilisez-le pour indiquer une spinbox dans l'interface utilisateur graphique qui doit &ecirc;tre modifi&eacute;e.
</td></tr>
<tr>
<td><a href="../Template;ComboBox.html" title="Template:ComboBox">ComboBox</a>
</td>
<td><span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #989898; border-radius: 0.2em; padding: 2px 5px 3px 5px; font-weight:normal;">Menu 1  <span typeof="mw:File"><a href="../index.php?title=ComboBox.svg&amp;filetimestamp=20200329183052&amp;.html" class="mw-file-description"><img src="../File/ComboBox.svg" decoding="async" width="17" height="17" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span><span></span></span>
</td>
<td>Utilisez-le pour indiquer une combobox dans l'interface utilisateur graphique qui doit &ecirc;tre modifi&eacute;e.
</td></tr>
<tr>
<td><a href="../Template;LineEdit.html" title="Template:LineEdit">LineEdit</a>
</td>
<td><span style="background: #f9f9f9; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 1px solid #989898; border-radius: 0.2em; padding: 2px 5px 3px 5px; font-weight:normal;">Metal Nickel (Ni)</span>
</td>
<td>Utilisez-le pour indiquer un LineEdit dans l'interface utilisateur graphique qui doit &ecirc;tre modifi&eacute;.
</td></tr>
<tr>
<td><a href="../Template;FALSE.html" title="Template:FALSE">FALSE</a>, <a href="../Template;False.html" title="Template:False">false</a>
</td>
<td><code>false</code>, <code>false</code>
</td>
<td>Utilisez-le pour indiquer une valeur bool&eacute;enne fausse, par exemple, en tant que propri&eacute;t&eacute; dans l'<a href="../fr/Property_editor.html" class="mw-redirect" title="Property editor/fr">&Eacute;diteur de propri&eacute;t&eacute;s</a>. Il s'agit d'un raccourci. Comme il s'agit d'une valeur, pr&eacute;f&eacute;rez Template <a href="../Template;Value.html" title="Template:Value">Value</a> <code>false</code>
</td></tr>
<tr>
<td><a href="../Template;TRUE.html" title="Template:TRUE">TRUE</a>, <a href="../Template;True.html" title="Template:True">true</a>
</td>
<td><code>true</code>, <code>true</code>
</td>
<td>Utilisez-le pour indiquer une valeur bool&eacute;enne vraie, par exemple, en tant que propri&eacute;t&eacute; dans l'<a href="../fr/Property_editor.html" class="mw-redirect" title="Property editor/fr">&Eacute;diteur de propri&eacute;t&eacute;s</a>. Il s'agit d'un raccourci. Comme il s'agit d'une valeur, pr&eacute;f&eacute;rez Template <a href="../Template;Value.html" title="Template:Value">Value</a> <code>true</code>
</td></tr>
<tr>
<td><a href="../Template;MenuCommand.html" title="Template:MenuCommand">MenuCommand</a>
</td>
<td><b>File &rarr; Save</b>
</td>
<td>Utilisez-le pour indiquer l'emplacement d'une commande dans un menu particulier.
</td></tr>
<tr>
<td><a href="../Template;FileName.html" title="Template:FileName">FileName</a>
</td>
<td><span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">File name</span>
</td>
<td>Utilisez-le pour indiquer le nom d'un fichier ou d'un r&eacute;pertoire.
</td></tr>
<tr>
<td><a href="../Template;SystemInput.html" title="Template:SystemInput">SystemInput</a>
</td>
<td><span style="font-weight:bold; font-family:monospace, Consolas, Courier New, Courier;">Type this text</span>
</td>
<td>Utilisez-le pour indiquer le texte d'entr&eacute;e tap&eacute; par l'utilisateur.
</td></tr>
<tr>
<td><a href="../Template;SystemOutput.html" title="Template:SystemOutput">SystemOutput</a>
</td>
<td><span style="font-weight:normal; font-family:monospace, Consolas, Courier New, Courier; border: 1px solid #d8d8d8; padding: 2px 5px 2px 5px;">Output text</span>
</td>
<td>Utilisez-le pour indiquer la sortie de texte du syst&egrave;me.
</td></tr>
<tr>
<td><a href="../Template;Incode.html" title="Template:Incode">Incode</a>
</td>
<td><code>import FreeCAD</code>
</td>
<td>Utilisez-le pour inclure du code source en ligne avec une police monospace. Il doit tenir sur une seule ligne.
</td></tr>
<tr>
<td><a href="../Template;PropertyView.html" title="Template:PropertyView">PropertyView</a>
</td>
<td><span style="font-size:60%; padding-right:0.8em;">Vue</span><b>Color</b>
</td>
<td>Utilisez-le pour indiquer une propri&eacute;t&eacute; de vue dans l'<a href="../fr/Property_editor.html" class="mw-redirect" title="Property editor/fr">&Eacute;diteur de propri&eacute;t&eacute;s</a>. Des exemples de propri&eacute;t&eacute;s de vue incluent <i>Line Color</i>, <i>Line Width</i>, <i>Point Color</i>, <i>Point Size</i>, etc.
</td></tr>
<tr>
<td><a href="../Template;PropertyData.html" title="Template:PropertyData">PropertyData</a>
</td>
<td><span style="font-size:60%; padding-right:0.8em;">Donn&eacute;es</span><b>Position</b>
</td>
<td>Utilisez-le pour indiquer une propri&eacute;t&eacute; Data dans l'<a href="../fr/Property_editor.html" class="mw-redirect" title="Property editor/fr">&Eacute;diteur de propri&eacute;t&eacute;s</a>. Les propri&eacute;t&eacute;s de donn&eacute;es sont diff&eacute;rentes selon les types d'objets.
</td></tr>
<tr>
<td><a href="../Template;Properties_Title.html" title="Template:Properties Title">Properties Title</a> / <a href="../Template;TitleProperty.html" class="mw-redirect" title="Template:TitleProperty">TitleProperty</a>
</td>
<td><span style="color: #fdfdfd; background-color: #909090; font-size: 112%; font-weight: bold; margin-bottom: .3em; padding: 0px 10px 1px 10px; page-break-after: avoid;">Base</span>
</td>
<td>Utilisez-le pour indiquer le titre d'un groupe de propri&eacute;t&eacute;s dans l'<a href="../fr/Property_editor.html" class="mw-redirect" title="Property editor/fr">&Eacute;diteur de propri&eacute;t&eacute;s</a>. Le titre ne sera pas inclus dans la table des mati&egrave;res automatique.
</td></tr>
<tr>
<td><a href="../Template;Obsolete.html" title="Template:Obsolete">Obsolete</a>
</td>
<td><span style="font-size:small;"><a href="../Release_notes_0.19.html" title="Release notes 0.19">obsolete in 0.19</a></span>
</td>
<td>Utilisez-le pour indiquer qu'une fonctionnalit&eacute; est devenue obsol&egrave;te dans la version de FreeCAD sp&eacute;cifi&eacute;e.
</td></tr>
<tr>
<td><a href="../Template;Obsolete.html" title="Template:Obsolete">VersionNoteObsolete</a>
</td>
<td><sup><a href="../Release_notes_0.19.html" title="Release notes 0.19">obsolete in 0.19</a>
</sup></td>
<td>Idem (variante de l'exposant).
</td></tr>
<tr>
<td><a href="../Template;Version.html" title="Template:Version">Version</a>
</td>
<td><span style="font-size:small;"><a href="../Release_notes_0.18.html" title="Release notes 0.18">introduced in 0.18</a></span>
</td>
<td>Utilisez-le pour indiquer qu'une fonctionnalit&eacute; a &eacute;t&eacute; introduite dans la version de FreeCAD sp&eacute;cifi&eacute;e.
</td></tr>
<tr>
<td><a href="../Template;Version.html" title="Template:Version">VersionNote</a>
</td>
<td><sup><a href="../Release_notes_0.18.html" title="Release notes 0.18">introduced in 0.18</a></sup>
</td>
<td>Idem (variante de l'exposant).
</td></tr>
<tr>
<td><a href="../Template;VersionMinus.html" title="Template:VersionMinus">VersionMinus</a>
</td>
<td><span style="font-size:small;color:blue;">0.16 and below</span>
</td>
<td>Utilisez-le pour indiquer qu'une fonctionnalit&eacute; est disponible dans la version de FreeCAD sp&eacute;cifi&eacute;e et les versions ant&eacute;rieures.
</td></tr>
<tr>
<td><a href="../Template;VersionMinus.html" title="Template:VersionMinus">VersionNoteMinus</a>
</td>
<td><sup style="color:blue;">0.16 and below</sup>
</td>
<td>Idem (variante en exposant).
</td></tr>
<tr>
<td><a href="../Template;VersionPlus.html" title="Template:VersionPlus">VersionPlus</a>
</td>
<td><span style="font-size:small;color:green;">0.17 and above</span>
</td>
<td>Utilisez-le pour indiquer qu'une fonctionnalit&eacute; est disponible dans la version de FreeCAD sp&eacute;cifi&eacute;e et les versions ult&eacute;rieures.
</td></tr>
<tr>
<td><a href="../Template;VersionPlus.html" title="Template:VersionPlus">VersionNotePlus</a>
</td>
<td><sup style="color:green;">0.17 and above</sup>
</td>
<td>Idem (variante de l'exposant).
</td></tr>
<tr>
<td><a href="../Template;ColoredText.html" title="Template:ColoredText">ColoredText</a>
</td>
<td><span style="background-color: #ffeeee">Colored Text</span>
</td>
<td>Utilisez ce mod&egrave;le pour colorer l'arri&egrave;re-plan, le texte, ou l'arri&egrave;re-plan et le texte. (<a href="../Template;ColoredText.html" title="Template:ColoredText">ColoredText</a> page pour plus d'exemples)
</td></tr>
<tr>
<td><a href="../Template;ColoredParagraph.html" title="Template:ColoredParagraph">ColoredParagraph</a>
</td>
<td><div style="background-color: #ffeeee">Colored Paragraph</div>
</td>
<td>Utilisez ce mod&egrave;le pour colorer le fond, le texte, ou le fond et le texte d'un paragraphe entier. (La page <a href="../Template;ColoredParagraph.html" title="Template:ColoredParagraph">ColoredParagraph</a> pour plus d'exemples)
</td></tr></tbody></table>
<p><span id="Complex_templates"></span>
</p>
<h3><span id="Mod.C3.A8les_complexes"></span><span class="mw-headline" id="Mod&egrave;les_complexes">Mod&egrave;les complexes</span></h3>
<p>Ces mod&egrave;les requi&egrave;rent davantage de param&egrave;tres d'entr&eacute;e ou produisent un bloc de texte d'un format particulier.
</p>
<table border="2" cellspacing="0" cellpadding="4" rules="all" class="hintergrundfarbe1 rahmenfarbe1" style="margin:1em 1em 1em 0; border-style:solid; border-width:1px; border-collapse:collapse; empty-cells:show;">
<tbody><tr>
<th style="width:10%;">Mod&egrave;le
</th>
<th style="width:45%;">Apparence
</th>
<th style="width:45%;">Description
</th></tr>
<tr>
<td><a href="../Template;Prettytable.html" title="Template:Prettytable">Prettytable</a>
</td>
<td>Ce tableau
</td>
<td>Utilisez-le pour formater des tableaux comme celui-ci. Des propri&eacute;t&eacute;s de tableaux suppl&eacute;mentaires peuvent &ecirc;tre ajout&eacute;es.
</td></tr>
<tr>
<td><a href="../Template;Caption.html" title="Template:Caption">Caption</a>
</td>
<td><div style="width:400px;"><p style="text-align:left; font-style:italic; max-width:800px; box-sizing:border-box; margin-block:1em; margin-inline:clamp(1em, 6vw, 2em); padding-inline:clamp(0.75em, 4vw, 2em); word-break:normal; overflow-wrap:break-word;">Une l&eacute;gende pour une image</p></div>.
</td>
<td>Utilisez-le pour ajouter une explication sous une image. Elle peut &ecirc;tre align&eacute;e &agrave; gauche ou au centre.
</td></tr>
<tr>
<td><a href="../Template;Clear.html" title="Template:Clear">Clear</a>
</td>
<td>
</td>
<td>Utilisez-le pour effacer des colonnes. Suivez la d&eacute;finition du mod&egrave;le pour une explication d&eacute;taill&eacute;e. Il est souvent utilis&eacute; pour emp&ecirc;cher le texte de d&eacute;border &agrave; c&ocirc;t&eacute; d'images sans rapport.
</td></tr>
<tr>
<td><a href="../Template;Code.html" title="Template:Code">Code</a>
</td>
<td><div class="mw-highlight mw-highlight-lang-python mw-content-ltr" dir="ltr"><pre><span></span><span class="kn">import</span> <span class="nn">FreeCAD</span>
</pre></div>
</td>
<td>Utilisez-le pour inclure des exemples de code multi-lignes avec une police monospace. Le langage par d&eacute;faut est Python, mais d'autres langages peuvent &ecirc;tre sp&eacute;cifi&eacute;s.
<p>Le code <a href="../fr/Python.html" title="Python/fr">Python</a> doit adh&eacute;rer aux recommandations g&eacute;n&eacute;rales &eacute;tablies par <a rel="nofollow" class="external text" href="https://www.python.org/dev/peps/pep-0008/">PEP8: Style Guide for Python Code</a>. En particulier, les parenth&egrave;ses doivent imm&eacute;diatement suivre le nom de la fonction et un espace doit suivre une virgule. Cela rend le code plus lisible.
</p>
</td></tr>
<tr>
<td><a href="../Template;CodeDownload.html" title="Template:CodeDownload">CodeDownload</a>
</td>
<td><div class="plainlinks" style="width:300px; text-align:center; margin:10px auto;">
<div style="border:1px outset #9eb4b5; background:#f0fdf8; margin:5px; padding:5px; white-space:nowrap; -webkit-border-radius: 5px; -moz-border-radius: 5px;">
<p><span typeof="mw:File"><a href="https://wiki.freecad.org/Main_Page/fr" rel="nofollow"><img src="../File/Nuvola_apps_download_manager.png" decoding="async" width="35" height="35" class="mw-file-element" data-file-width="128" data-file-height="128"></a></span>
</p><p><span class="CodeDownload" style="font-weight:bold"><a rel="nofollow" class="external text" href="https://wiki.freecad.org/Main_Page/fr">Quelques &eacute;tiquettes</a></span>
</p>
</div>
</div>
</td>
<td>A utiliser pour cr&eacute;er un lien sur une page <a href="../fr/Macros.html" title="Macros/fr">macro</a>.
</td></tr>
<tr>
<td><a href="../Template;Codeextralink.html" title="Template:Codeextralink">Codeextralink</a>
</td>
<td><div class="toccolours mw-collapsible mw-collapsed" style="cursor:not-allowed">
<p>Temporary code for external macro link. Do not use this code. This code is used exclusively by <a href="../Std_AddonMgr.html" title="Std AddonMgr">Addon Manager</a>. <i>Link for optional manual installation: <a rel="nofollow" class="external text" href="https://wiki.freecad.org/Main_Page/fr">Macro</a></i>
</p>
<div class="mw-collapsible-content">
<pre>

# This code is copied instead of the original macro code
# to guide the user to the online download page.
# Use it if the code of the macro is larger than 64 KB and cannot be included in the wiki
# or if the RAW code URL is somewhere else in the wiki.

from PySide import QtGui, QtCore

diag = QtGui.QMessageBox(QtGui.QMessageBox.Information,
    "Information",
    "This macro must be downloaded from this link\n"
    "\n"
    "https://wiki.freecad.org/Main_Page/fr" + "\n"
    "\n"
    "Quit this window to access the download page")

diag.setWindowFlags(QtCore.Qt.WindowStaysOnTopHint)
diag.setWindowModality(QtCore.Qt.ApplicationModal)
diag.exec_()

import webbrowser 
webbrowser.open("https://wiki.freecad.org/Main_Page/fr")
</pre>
</div>
</div>
<div style="display:none;">&lt;class="rawcodeurl"&gt;&lt;a href="<a rel="nofollow" class="external free" href="https://wiki.freecad.org/Main_Page/fr">https://wiki.freecad.org/Main_Page/fr</a>"&gt;raw code&lt;/a&gt;</div>
</td>
<td>A utiliser si le code d'une <a href="../fr/Macros.html" title="Macros/fr">macro</a> est trop volumineux pour &ecirc;tre h&eacute;berg&eacute; sur le wiki. Le code peut alors &ecirc;tre h&eacute;berg&eacute; ailleurs, et le lien brut vers celui-ci sp&eacute;cifi&eacute; avec ce mod&egrave;le. Le <a href="../fr/Std_AddonMgr.html" title="Std AddonMgr/fr">gestionnaire des extensions</a> utilisera ce lien.
</td></tr>
<tr>
<td><a href="../Template;Fake_heading.html" title="Template:Fake heading">Fake heading</a>
</td>
<td><div style="background: none; color: #000; margin: 0; overflow: hidden; page-break-after: avoid; page-break-before: avoid; border-bottom: 1px solid #a2a9b1; font-family: 'Linux Libertine', 'Georgia', 'Times', serif; font-size: 1.8em; font-weight: normal; line-height: 1.3; margin-bottom: 0.25em; margin-top: 1em; padding: 0;">Heading</div>
</td>
<td>Utilisez-le pour cr&eacute;er un titre qui ne sera pas automatiquement inclus dans la table des mati&egrave;res.
</td></tr>
<tr>
<td><a href="../Template;GuiCommand.html" title="Template:GuiCommand">GuiCommand</a>
</td>
<td>See <a href="../GuiCommand_model.html" title="GuiCommand model">GuiCommand model</a>
</td>
<td>UUtilisez-le pour cr&eacute;er une bo&icirc;te contenant des informations utiles pour documenter les commandes de l'atelier (outils).
</td></tr>
<tr>
<td><a href="../Template;TutorialInfo.html" title="Template:TutorialInfo">TutorialInfo</a>
</td>
<td>Voir par exemple <a href="../fr/Basic_modeling_tutorial.html" title="Basic modeling tutorial/fr">Tutoriel de mod&eacute;lisation de base</a>.
</td>
<td>Utilisez-le pour cr&eacute;er une bo&icirc;te contenant des informations utiles pour documenter les <a href="../fr/Tutorials.html" title="Tutorials/fr">tutoriels</a>.
</td></tr>
<tr>
<td><a href="../Template;Macro.html" title="Template:Macro">Macro</a>
</td>
<td>Voir par exemple <a href="../fr/Macro_FlattenWire.html" title="Macro FlattenWire/fr">Macro FlattenWire</a>.
</td>
<td>Utilisez-le pour cr&eacute;er une bo&icirc;te contenant des informations utiles pour documenter les <a href="../fr/Macros.html" title="Macros/fr">macros</a>.
</td></tr>
<tr>
<td><a href="../Template;Docnav.html" title="Template:Docnav">Docnav</a>
</td>
<td><div class="docnav">
    <div><span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-left.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span> Online Help Startpage</div>
    <div>Feature list <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Arrow-right.svg" decoding="async" width="16" height="16" class="mw-file-element" data-file-width="64" data-file-height="64"></span></span></div>
    <div><a href="../fr/Online_Help_Toc.html" title="Online Help Toc/fr">Index</a> <span class="mw-default-size" typeof="mw:File"><span><img src="../File/Online_Help_Toc.svg" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span></div>
</div>
</td>
<td>Utilisez-le pour cr&eacute;er une barre avec des fl&egrave;ches et des liens appropri&eacute;s, ce qui est utile pour placer des pages dans un ordre particulier.
</td></tr>
<tr>
<td><a href="../Template;VeryImportantMessage.html" title="Template:VeryImportantMessage">VeryImportantMessage</a>
</td>
<td><div class="warning-box">Important Message</div>
</td>
<td>Utilisez-le pour cr&eacute;er une bo&icirc;te en surbrillance contenant un message tr&egrave;s important. Utilisez-le avec parcimonie, uniquement pour indiquer des probl&egrave;mes majeurs dans la fonctionnalit&eacute; du logiciel, l'abandon d'outils, etc.
</td></tr>
<tr>
<td><a href="../Template;Page_in_progress.html" title="Template:Page in progress">Page in progress</a>
</td>
<td><div class="warning-box"><figure class="mw-halign-left" typeof="mw:File"><span><img src="https://upload.wikimedia.org/wikipedia/commons/d/d5/Under_construction_icon-blue.svg" decoding="async" width="45" height="38" class="mw-file-element" data-file-width="600" data-file-height="500"></span><figcaption></figcaption></figure> This documentation is a work in progress. Please don't mark it as translatable since it will change in the next hours and days.
</div>
</td>
<td>Utilisez cette option pour les pages qui sont toujours en cours ou qui sont en train d'&ecirc;tre retravaill&eacute;es. N'oubliez pas de le supprimer lorsque la page est pr&ecirc;te.
</td></tr>
<tr>
<td><a href="../Template;UnfinishedDocu.html" title="Template:UnfinishedDocu">UnfinishedDocu</a>
</td>
<td><div class="warning-box">
<p>This documentation is not finished. Please help and contribute documentation.
</p><p><a href="../GuiCommand_model.html" title="GuiCommand model">GuiCommand model</a> explains how commands should be documented. Browse <a href="../Category;UnfinishedDocu.html" title="Category:UnfinishedDocu">Category:UnfinishedDocu</a> to see more incomplete pages like this one. See <a href="../Category;Command_Reference.html" title="Category:Command Reference">Category:Command Reference</a> for all commands.
</p><p>See <a href="../WikiPages.html" title="WikiPages">WikiPages</a> to learn about editing the wiki pages, and go to <a href="../Help_FreeCAD.html" title="Help FreeCAD">Help FreeCAD</a> to learn about other ways in which you can contribute.
</p>
</div>
</td>
<td>Utilisez-le pour cr&eacute;er une bo&icirc;te en surbrillance indiquant une page de documentation inachev&eacute;e.
</td></tr>
<tr>
<td><a href="../Template;Softredirect.html" title="Template:Softredirect">Softredirect</a>
</td>
<td>
</td>
<td>Utilisez-la &agrave; la place de la redirection normale, lorsque vous redirigez vers une page sp&eacute;ciale (comme Media: ou Category:), auquel cas la redirection normale est d&eacute;sactiv&eacute;e.
</td></tr>
<tr>
<td><a href="../Template;Quote.html" title="Template:Quote">Quote</a>
</td>
<td><blockquote class="templatequote"><p>Cry "Havoc" and let slip the dogs of war.</p><div class="templatequotecite">&mdash;William Shakespeare,&nbsp;<cite><i>Julius Caesar</i>, act III, scene I</cite></div>
</blockquote>
</td>
<td>Utilisez-le pour cr&eacute;er un encadr&eacute; de texte avec une citation et une r&eacute;f&eacute;rence litt&eacute;rale.
</td></tr>
<tr>
<td><a href="../Template;Userdocnavi.html" title="Template:Userdocnavi">Userdocnavi</a>, <a href="../Template;Powerdocnavi.html" title="Template:Powerdocnavi">Powerdocnavi</a>
</td>
<td>
</td>
<td>Utilisez-les pour cr&eacute;er des bo&icirc;tes de navigation pour la documentation utilisateur, la documentation pour les utilisateurs exp&eacute;riment&eacute;s et la documentation pour les d&eacute;veloppeurs. Cela permet de passer rapidement d'une section &agrave; l'autre de la documentation. Ils placent &eacute;galement la page correspondante dans la cat&eacute;gorie appropri&eacute;e.
</td></tr></tbody></table>
</div> 
</div> 
<div class="mw-collapsible mw-collapsed toccolours">
<p><span id="Graphics"></span>
</p>
<h2><span class="mw-headline" id="Illustrations">Illustrations</span></h2>
<div class="mw-collapsible-content">
<p>Les images et les captures d'&eacute;cran sont n&eacute;cessaires pour produire une documentation compl&egrave;te de FreeCAD. Elles sont particuli&egrave;rement utiles pour illustrer les exemples et les tutoriels. Les images doivent &ecirc;tre affich&eacute;es dans leur taille originale, afin de pr&eacute;senter suffisamment de d&eacute;tails et d'&ecirc;tre lisibles si elles contiennent du texte. Les images <a href="../fr/Bitmap.html" title="Bitmap/fr">Bitmap</a> ne doivent pas &ecirc;tre redimensionn&eacute;es.
</p><p>&Eacute;vitez les images anim&eacute;es (GIF) dans les pages d'aide g&eacute;n&eacute;rales. Les animations et les vid&eacute;os doivent &ecirc;tre r&eacute;serv&eacute;es aux tutoriels qui ne sont pas destin&eacute;s &agrave; &ecirc;tre utilis&eacute;s comme documentation PDF hors ligne.
</p><p>Les images peuvent &ecirc;tre t&eacute;l&eacute;charg&eacute;es via la page <a href="../Special;Upload.html" title="Special:Upload">T&eacute;l&eacute;verser un fichier</a>.
</p><p><span id="Name"></span>
</p>
<h3><span class="mw-headline" id="Nom">Nom</span></h3>
<p>Donnez des noms significatifs &agrave; vos images. Si vous avez une image qui pr&eacute;sente les caract&eacute;ristiques d'une commande particuli&egrave;re, vous devez utiliser le nom de cette commande avec <code>_example</code> &agrave; la fin. Par exemple, pour la commande <a href="../fr/Draft_Offset.html" title="Draft Offset/fr">Draft D&eacute;caler</a>, l'image doit s'appeler <code>Draft_Offset_example.png</code>.
</p><p><span id="Screen_capture"></span>
</p>
<h3><span id="Capture_d.27.C3.A9cran"></span><span class="mw-headline" id="Capture_d'&eacute;cran">Capture d'&eacute;cran</span></h3>
<p>Les tailles recommand&eacute;es pour les captures d'&eacute;cran sont&nbsp;:
</p>
<ul><li>Native 400x200 (ou width=400 et height&lt;=200), pour les pages <a href="../fr/GuiCommand_model.html" title="GuiCommand model/fr">Mod&egrave;le GuiCommand</a>, pour permettre &agrave; l'image de tenir dans la partie gauche de la page, et pour les autres captures d'&eacute;cran standard.</li>
<li>Native 600x400 (ou width=600 et height&lt;=400), pour les pages <a href="../fr/GuiCommand_model.html" title="GuiCommand model/fr">Mod&egrave;le GuiCommand</a>, lorsque vous avez vraiment besoin d'une image plus grande, tout en permettant &agrave; l'image de tenir dans la partie gauche de la page, et pour d'autres instantan&eacute;s standard.</li>
<li>Native 1024x768 (ou largeur=1024 et hauteur&lt;=768), uniquement pour les images en plein &eacute;cran.</li>
<li>Des tailles plus petites sont possibles pour l'affichage des d&eacute;tails.</li>
<li>&Eacute;vitez les images de plus grande r&eacute;solution, car elles ne seront pas tr&egrave;s portables sur d'autres types d'&eacute;crans ou sur la documentation PDF imprim&eacute;e.</li></ul>
<p>Vous ne devriez pas d&eacute;pendre d'une configuration personnalis&eacute;e de votre bureau ou de votre syst&egrave;me d'exploitation lorsque vous cr&eacute;ez des captures d'&eacute;cran et vous devriez utiliser les d&eacute;fauts visuels de l'interface FreeCAD chaque fois que possible.
</p><p>Pour cr&eacute;er une capture d'&eacute;cran, vous pouvez utiliser les options fournies par votre syst&egrave;me d'exploitation, ou l'une de ces macros&nbsp;: <span typeof="mw:File"><a href="../index.php?title=Snip.png&amp;filetimestamp=20190803232007&amp;.html" class="mw-file-description"><img src="../File/Snip.png" decoding="async" width="24" height="23" class="mw-file-element" data-file-width="44" data-file-height="42"></a></span> <a href="../fr/Macro_Snip.html" title="Macro Snip/fr">Macro Snip</a> et <span typeof="mw:File"><a href="../index.php?title=Macro_Screen_Wiki.png&amp;filetimestamp=20200321195325&amp;.html" class="mw-file-description"><img src="../File/Macro_Screen_Wiki.png" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../fr/Macro_Screen_Wiki.html" title="Macro Screen Wiki/fr">Macro Screen Wiki</a>.
</p><p><span id="Text"></span>
</p>
<h3><span class="mw-headline" id="Texte">Texte</span></h3>
<p>Pour faciliter la traduction de la documentation, essayez d'&eacute;viter les captures d'&eacute;cran contenant du texte. Si vous ne pouvez pas l'&eacute;viter, envisagez de prendre des captures d'&eacute;cran distinctes de l'interface et de la <a href="../fr/3D_view.html" class="mw-redirect" title="3D view/fr">Vue 3D</a>. L'image de la vue 3D peut &ecirc;tre r&eacute;utilis&eacute;e dans chaque traduction, tandis qu'un traducteur peut prendre une capture d'&eacute;cran de l'interface localis&eacute;e si n&eacute;cessaire.
</p><p><span id="Icons_and_graphics"></span>
</p>
<h3><span id="Ic.C3.B4nes_et_illustrations"></span><span class="mw-headline" id="Ic&ocirc;nes_et_illustrations">Ic&ocirc;nes et illustrations</span></h3>
<p>R&eacute;f&eacute;rez-vous &agrave; la page <a href="../fr/Artwork.html" title="Artwork/fr">Graphisme</a> pour toutes les illustrations et ic&ocirc;nes qui ont &eacute;t&eacute; cr&eacute;&eacute;es pour FreeCAD, et qui peuvent &eacute;galement &ecirc;tre utilis&eacute;es dans les pages de documentation. Si vous souhaitez contribuer aux ic&ocirc;nes, veuillez lire les <a href="../fr/Artwork_Guidelines.html" title="Artwork Guidelines/fr">Recommandations pour la charte graphique</a>.
</p>
</div> 
</div> 
<div class="mw-collapsible mw-collapsed toccolours">
<p><span id="Translations"></span>
</p>
<h2><span class="mw-headline" id="Traductions">Traductions</span></h2>
<div class="mw-collapsible-content">
<p>D'avis g&eacute;n&eacute;ral, la page de r&eacute;f&eacute;rence dans le wiki est la page anglaise, qui doit &ecirc;tre cr&eacute;&eacute;e en premier. Si vous souhaitez modifier ou ajouter du contenu &agrave; une page, vous devez d'abord le faire sur la page en anglais et une fois la mise &agrave; jour termin&eacute;e, portez la modification sur la page traduite.
</p><p>Le wiki FreeCAD prend en charge une extension de traduction qui permet de g&eacute;rer plus facilement les traductions entre les pages&nbsp;; pour plus de d&eacute;tails, voir <a href="../fr/Localisation.html#Traduire_le_wiki_FreeCAD" title="Localisation/fr">Localisation Traduire le wiki</a>.
</p><p>D'autres ressources utiles sont&nbsp;:
</p>
<ul><li><a rel="nofollow" class="external text" href="https://fr.wikipedia.org/wiki/Liste_des_codes_ISO_639-1">Liste des codes ISO 639-1</a> pour identifier le code &agrave; deux lettres d'une langue particuli&egrave;re vers laquelle vous souhaitez traduire.</li>
<li><a rel="nofollow" class="external text" href="https://translate.google.com/">Traducteur de Google</a> pour obtenir de l'aide sur les traductions.</li>
<li><a rel="nofollow" class="external text" href="https://www.deepl.com/translator">Traducteur Deepl</a> pour obtenir de l'aide sur les traductions.</li></ul>
<p><span id="Some_tips_for_translators"></span>
</p>
<h2><span class="mw-headline" id="Quelques_conseils_pour_les_traducteurs">Quelques conseils pour les traducteurs</span></h2>
<p><span id="Translate_GuiCommand"></span>
</p>
<h3><span class="mw-headline" id="Traduire_le_GuiCommand">Traduire le GuiCommand</span></h3>
<pre>{{GuiCommand
|Name=FEM EquationFlux
|MenuLocation=Solve &rarr; Flux equation
|Workbenches=[[FEM_Workbench|FEM]]
|Shortcut={{KEY|F}} {{KEY|S}}
|Version=0.17
|SeeAlso=[[FEM_tutorial|FEM tutorial]]
}}
</pre>
<p>Traduit en&nbsp;:
</p>
<pre>{{GuiCommand/fr
|Name=FEM EquationFlux
|Name/fr=FEM &Eacute;quation d'&eacute;coulement
|MenuLocation=Solveur &rarr; &Eacute;quation de flux
|Workbenches=[[FEM_Workbench/fr|Atelier FEM]]
|Shortcut={{KEY|F}} {{KEY|S}}
|Version=0.17
|SeeAlso=[[FEM_tutorial/fr|FEM Tutoriel]]
}}
</pre>
<p><span id="Translate_navi"></span>
</p>
<h3><span class="mw-headline" id="Traduire_les_navi">Traduire les navi</span></h3>
<pre>{{FEM_Tools_navi}}
</pre>
<p>Traduit en&nbsp;:
</p>
<pre>{{FEM_Tools_navi/fr}}
</pre>
<p><span id="Translate_link"></span>
</p>
<h3><span class="mw-headline" id="Traduire_les_liens">Traduire les liens</span></h3>
<pre>[[Part_Workbench|Part Workbench]]
</pre>
<p>Traduit en&nbsp;:
</p>
<pre>[[Part_Workbench/fr|Atelier Part]]
</pre>
<p><span id="Translate_Docnav"></span>
</p>
<h3><span class="mw-headline" id="Traduire_les_Docnav">Traduire les Docnav</span></h3>
<pre>{{Docnav
|[[About_FreeCAD|About FreeCAD]]
|[[Installing_on_Windows|Installing on Windows]]
}}
</pre>
<p>Traduit en&nbsp;:
</p>
<pre>{{Docnav/fr
|[[About_FreeCAD/fr|&Agrave; propos de FreeCAD]]
|[[Installing_on_Windows/fr|Installation sous Windows]]
}}
</pre>
<p>Exemple avec des ic&ocirc;nes&nbsp;:
</p>
<pre>{{Docnav
|[[Std_Save|Save]]
|[[Std_SaveCopy|SaveCopy]]
|[[Std_File_Menu|Std File Menu]]
|IconL=Std_Save.svg
|IconR=Std_SaveCopy.svg
|IconC=Freecad.svg
}}
</pre>
<p>Traduit en&nbsp;:
</p>
<pre>{{Docnav/fr
|[[Std_Save/fr|Enregistrer]]
|[[Std_SaveCopy/fr|Enregistrer une copie]]
|[[Std_File_Menu/fr|Menu fichier]]
|IconL=Std_Save.svg
|IconR=Std_SaveCopy.svg
|IconC=Freecad.svg
}}
</pre>
</div> 
</div> 
<p><span id="Create,_rename_and_delete_pages"></span>
</p>
<h2><span id="Cr.C3.A9er.2C_renommer_et_supprimer_des_pages"></span><span class="mw-headline" id="Cr&eacute;er,_renommer_et_supprimer_des_pages">Cr&eacute;er, renommer et supprimer des pages</span></h2>
<p><span id="Create_pages"></span>
</p>
<h3><span id="Cr.C3.A9er_des_pages"></span><span class="mw-headline" id="Cr&eacute;er_des_pages">Cr&eacute;er des pages</span></h3>
<p>Avant de cr&eacute;er une nouvelle page, vous devez d'abord v&eacute;rifier si une page similaire existe d&eacute;j&agrave;. Si c'est le cas, il est g&eacute;n&eacute;ralement pr&eacute;f&eacute;rable d'&eacute;diter cette page existante. En cas de doute, veuillez d'abord ouvrir un sujet sur le forum <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewforum.php?f=21">Wiki</a>.
</p><p>Pour cr&eacute;er une nouvelle page, effectuez l'une des op&eacute;rations suivantes&nbsp;:
</p>
<ul><li>Visitez l'URL avec le nom de page souhait&eacute;, par exemple&nbsp;: <code>https://wiki.freecad.org/My_New_Page</code> et cliquez sur "cr&eacute;er cette page".</li>
<li>Faites une recherche wiki sur le nom de la page et cliquez sur le texte rouge dans "Cr&eacute;er la page "Ma nouvelle page" sur ce wiki!".</li></ul>
<p><span id="Rename_pages"></span>
</p>
<h3><span class="mw-headline" id="Renommer_les_pages">Renommer les pages</span></h3>
<p>FreeCAD &eacute;tant un projet en d&eacute;veloppement permanent, il est parfois n&eacute;cessaire de r&eacute;viser le contenu du wiki. Si les noms des commandes sont modifi&eacute;s dans le code source, les pages wiki qui les documentent doivent &eacute;galement &ecirc;tre renomm&eacute;es. Cette op&eacute;ration ne peut &ecirc;tre effectu&eacute;e que par les administrateurs du wiki. Pour les informer, ouvrez un sujet dans le forum <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewforum.php?f=21">Wiki</a> et indiquez l'op&eacute;ration de renommage n&eacute;cessaire dans ce formulaire&nbsp;:
</p>
<pre>old name         new name
Old_page_name_1  New_page_name_1
Old_page_name_2  New_page_name_2
...
</pre>
<p><span id="Delete_files_and_pages"></span>
</p>
<h3><span class="mw-headline" id="Supprimer_les_fichiers_et_les_pages">Supprimer les fichiers et les pages</span></h3>
<p>Si vous devez supprimer un fichier, allez sur sa page (<code>https://wiki.freecad.org/File:***.***</code>) et modifiez-la. Peu importe que la page soit vide ou non, ajoutez ceci comme premier &eacute;l&eacute;ment&nbsp;: <code>{{Delete}}</code> et directement en dessous, d&eacute;crivez pourquoi la page doit &ecirc;tre supprim&eacute;e. En outre, ouvrez un sujet dans le forum <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewforum.php?f=21">Wiki</a>.
</p><p>Pour les pages, la proc&eacute;dure est la m&ecirc;me.
</p>
<h2><span class="mw-headline" id="Discussion">Discussion</span></h2>
<p>Le <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewforum.php?f=21">sous-forum sur le wiki</a> du <a rel="nofollow" class="external text" href="https://forum.freecad.org">forum de FreeCAD</a> offre un espace d&eacute;di&eacute; pour discuter des sujets relatifs au wiki, de l'apparence du wiki et de tout autre sujet li&eacute; au wiki. Posez-y vos questions et faites-y des suggestions.
</p><p><span id="Terminology_-_naming_policy"></span>
</p>
<h2><span id="Terminologie_-_R.C3.A8gles_de_d.C3.A9nomination"></span><span class="mw-headline" id="Terminologie_-_R&egrave;gles_de_d&eacute;nomination">Terminologie - R&egrave;gles de d&eacute;nomination</span></h2>
<p><span id="English"></span>
</p>
<h3><span class="mw-headline" id="En_anglais">En anglais</span></h3>
<p>Voir <a href="../fr/Glossary.html" title="Glossary/fr">Glossaire</a>.
</p><p><span id="Other_languages"></span>
</p>
<h3><span class="mw-headline" id="Autres_langues">Autres langues</span></h3>
<ul><li><a href="../Italian_Translation.html" title="Italian Translation">Italien</a></li>
<li><a href="../French_Translation.html" title="French Translation">Fran&ccedil;ais</a></li>
<li><a href="../German_Translation.html" title="German Translation">Allemand</a></li>
<li><a href="../Polish_Translation.html" title="Polish Translation">Polonais</a></li>
<li><a href="../Spanish_Translation.html" title="Spanish Translation">Espagnol</a></li>
<li><a href="../Japanese_Translation.html" title="Japanese Translation">Japonais</a></li>
<li><a href="../Russian_Translation.html" title="Russian Translation">Russian</a></li></ul>
<!-- 
NewPP limit report
Cached time: 20260216153623
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.187 seconds
Real time usage: 0.339 seconds
Preprocessor visited node count: 1136/1000000
Post&#8208;expand include size: 12108/2097152 bytes
Template argument size: 1180/2097152 bytes
Highest expansion depth: 7/100
Expensive parser function count: 1/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 5333/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%  139.289      1 -total
  7.18%    9.999      1 Template:Code
  4.60%    6.411      1 Template:ASCII
  4.24%    5.912      2 Template:Value
  3.87%    5.393      1 Template:PropertyView
  3.09%    4.309      1 Template:ColoredText
  2.80%    3.906      1 Template:Caption
  2.62%    3.646      1 Template:VersionNoteObsolete
  2.58%    3.594      1 Template:ColoredParagraph
  2.53%    3.521      1 Template:Fake_heading
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:210296-0!canonical and timestamp 20260216153623 and revision id 1755537. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>