<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Wikihouse porting tutorial/fr</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="fr" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Wikihouse+porting+tutorial&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/Wikihouse_porting_tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Tutorium Wikihouse-Migration (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Wikihouse_porting_tutorial.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Wikihouse porting tutorial (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../es/Wikihouse_porting_tutorial.html" class="mw-pt-progress mw-pt-progress--low" title="Wikihouse porting tutorial/es (5% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="fr" dir="ltr">fran&ccedil;ais</span></li>
<li><a href="../it/Wikihouse_porting_tutorial.html" class="mw-pt-progress mw-pt-progress--med" title="Tutorial Wikihouse portabile (50% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Wikihouse_porting_tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="Poradnik przenoszenia Wikihouse (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><a href="../ro/Wikihouse_porting_tutorial.html" class="mw-pt-progress mw-pt-progress--med" title="Wikihouse porting tutorial (50% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><a href="../ru/Wikihouse_porting_tutorial.html" class="mw-pt-progress mw-pt-progress--complete" title="&#1056;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086; &#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1102; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; Wikihouse &#1074; FreeCAD (100% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li></ul></div>
<table class="fcinfobox wikitable ct" style="width: 230px; float: right; margin-left: 1em">
<tbody><tr>
<td class="ctTitle" style="font-weight: bold; font-size: 125%;"><span typeof="mw:File"><span><img src="../File/Freecad.svg" decoding="async" width="32" height="32" class="mw-file-element" data-file-width="48" data-file-height="48"></span></span> Tutoriel
</td></tr>
<tr>
<th class="ctOdd">Th&egrave;me
</th></tr>
<tr>
<td class="ctEven">Tutoriel de portage Wikihouse
</td></tr>
<tr>
<th class="ctOdd">Niveau
</th></tr>
<tr>
<td class="ctEven">Intermediaire/Avanc&eacute;
</td></tr>
<tr>
<th class="ctOdd">Temps d'ex&eacute;cution estim&eacute;
</th></tr>
<tr>
<td class="ctEven">60 minutes
</td></tr>
<tr>
<th class="ctOdd">Auteurs
</th></tr>
<tr>
<td class="ctEven">
</td></tr>
<tr>
<th class="ctOdd">Version de FreeCAD
</th></tr>
<tr>
<td class="ctEven">
</td></tr>
<tr>
<th class="ctOdd">Fichiers exemples
</th></tr>
<tr>
<td class="ctEven">
</td></tr>
<tr>
<th class="ctOdd">Voir aussi
</th></tr>
<tr>
<td class="ctEven"><i>None</i>
</td></tr>
<tr>
<td class="ctToc"><br><meta property="mw:PageProp/toc">
</td></tr></tbody></table>
<h2><span class="mw-headline" id="Introduction">Introduction</span></h2>
<p>Ce tutoriel va vous montrer comment convertir les fichiers <a rel="nofollow" class="external text" href="https://sketchup.com">SketchUp</a> utilis&eacute;s par le projet <a rel="nofollow" class="external text" href="https://wikihouse.cc/">WikiHouse</a> en FreeCAD, en utilisant l'outil <a href="../fr/Arch_Panel.html" title="Arch Panel/fr">Arch Panneau</a> dans FreeCAD. Le r&eacute;sultat est une copie compl&egrave;te du fichier SketchUp d'origine, la diff&eacute;rence est qu'il est devenu enti&egrave;rement param&eacute;trique. Le niveau de param&eacute;trage du fichier final d&eacute;pend du travail que vous y consacrez, comme expliqu&eacute; ci-dessous. Mais il est tout &agrave; fait possible de faire le travail pas &agrave; pas, et de reconstruire le fichier Wikihouse rapidement, et de laisser la plus longue conversion des profils de base aux esquisses pour plus tard.
</p><p>Ce tutoriel n&eacute;cessite une connaissance interm&eacute;diaire de FreeCAD, c'est-&agrave;-dire que vous &ecirc;tes capable de vous rep&eacute;rer entre les diff&eacute;rents ateliers et outils, que vous &ecirc;tes d&eacute;j&agrave; capable de mod&eacute;liser des objets simples, et surtout que vous &ecirc;tes &agrave; l'aise avec <a href="../fr/Draft_Move.html" title="Draft Move/fr">Draft D&eacute;placer</a> et <a href="../fr/Draft_Rotate.html" title="Draft Rotate/fr">Draft Pivoter</a>. Il utilisera principalement les outils de <a href="../fr/Draft_Workbench.html" title="Draft Workbench/fr">Draft</a> et <a href="../fr/Arch_Workbench.html" title="Arch Workbench/fr">Arch</a>, mais la connaissance de l'<a href="../fr/Sketcher_Workbench.html" title="Sketcher Workbench/fr">atelier Sketcher</a> deviendra n&eacute;cessaire lors de la conversion des profils de base en esquisses.
</p><p>Puisque le projet Wikihouse est ouvert naturellement, les fichiers sont faciles &agrave; trouver sur le site Web du projet, mais aussi sur le <a rel="nofollow" class="external text" href="https://3dwarehouse.sketchup.com/search.html?q=wikihouse&amp;backendClass=both">SketchUp 3D Warehouse</a> ou dans le projet <a rel="nofollow" class="external text" href="https://github.com/wikihouseproject">github repositories</a>. Le format pr&eacute;f&eacute;r&eacute; utilis&eacute; par le projet est Sketchup, donc la plupart des fichiers que vous trouverez sont dans ce format.
</p><p>Dans ce didacticiel, nous avons utilis&eacute; le fichier <a rel="nofollow" class="external text" href="https://github.com/wikihouseproject/Microhouse/blob/master/microhouse_0.5_chassis.skp">Chassis</a> du sous-projet Microhouse de Wikihouse.
</p><p><span id="Preparing_the_Sketchup_file"></span>
</p>
<h2><span id="Pr.C3.A9paration_du_fichier_Sketchup"></span><span class="mw-headline" id="Pr&eacute;paration_du_fichier_Sketchup">Pr&eacute;paration du fichier Sketchup</span></h2>
<p>La premi&egrave;re chose &agrave; faire est d'ouvrir le fichier dans SketchUp et de supprimer tout ce que vous ne voulez pas exporter. Nous n'exporterons qu'une seule section de la Microhouse, donc tout le reste doit &ecirc;tre supprim&eacute;.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_05.jpg&amp;filetimestamp=20161217190528&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_05.jpg" decoding="async" width="1380" height="920" class="mw-file-element" data-file-width="1380" data-file-height="920"></a></span>
</p><p>Les &eacute;l&eacute;ments de la Wikihouse, dans SketchUp, sont r&eacute;alis&eacute;s d'une mani&egrave;re sp&eacute;cifique&nbsp;: En ajoutant de petites "pi&egrave;ces" ensemble afin de cr&eacute;er les diff&eacute;rents composants&nbsp;:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_06.jpg&amp;filetimestamp=20161217190817&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_06.jpg" decoding="async" width="1418" height="907" class="mw-file-element" data-file-width="1418" data-file-height="907"></a></span>
</p><p>Ce n'est pas ainsi que nous allons proc&eacute;der dans FreeCAD. Puisque l'une des fonctions les plus puissantes de FreeCAD est les <a href="../fr/Sketcher_Workbench.html" title="Sketcher Workbench/fr">esquisses constraintes</a>, nous ferions mieux d'en profiter, et de baser tous nos &eacute;l&eacute;ments de la Wikihouse sur des esquisses. De cette fa&ccedil;on, la modification de n'importe quelle pi&egrave;ce peut &ecirc;tre faite dans l'<a href="../fr/Sketcher_Workbench.html" title="Sketcher Workbench/fr">atelier Sketcher</a>, ce qui est beaucoup plus confortable.
</p><p>Afin de transformer nos objets SketchUp en croquis FreeCAD, qui peuvent ensuite &ecirc;tre utilis&eacute;s pour cr&eacute;er des objets <a href="../fr/Arch_Panel.html" title="Arch Panel/fr">Arch Panneau</a>, nous devons extraire une face plane de chaque pi&egrave;ce de la Wikihouse. L'&eacute;paisseur sera rajout&eacute;e plus tard, dans FreeCAD, directement dans les propri&eacute;t&eacute;s du panneau d'arche. De cette fa&ccedil;on, nous conserverons &eacute;galement le param&eacute;trage. Pour transformer chaque composant de la Wikihouse en une seule face plate, entrez dans chaque composant en double-cliquant dessus, puis s&eacute;lectionnez chaque sous-composant, et faites un clic droit &rarr; &Eacute;clater, jusqu'&agrave; ce que tous les sous-composants soient &eacute;clat&eacute;s, et que votre composant ne soit compos&eacute; que de faces et d'ar&ecirc;tes&nbsp;:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_08.jpg&amp;filetimestamp=20161217192027&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_08.jpg" decoding="async" width="1398" height="927" class="mw-file-element" data-file-width="1398" data-file-height="927"></a></span>
</p><p>Une fois que c'est fait, s&eacute;lectionnez tout ce qui se trouve dans votre composant, et d&eacute;s&eacute;lectionnez, en faisant Shift + double-clic, chaque face avant de votre composant. Veillez &agrave; faire un double-clic au lieu d'un simple clic, car sinon vous ne d&eacute;s&eacute;lectionnerez que la face et non ses bords (que nous devrons &eacute;galement conserver). Apr&egrave;s cela, nous aurons d&eacute;s&eacute;lectionn&eacute; tout ce que nous voulons conserver, il ne nous restera plus qu'&agrave; appuyer sur la touche de suppression. Notre composant n'est plus qu'une grande face plate.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_07.jpg&amp;filetimestamp=20161217192011&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_07.jpg" decoding="async" width="1410" height="899" class="mw-file-element" data-file-width="1410" data-file-height="899"></a></span>
</p><p>R&eacute;p&eacute;tez cette op&eacute;ration pour chaque composant. Comme beaucoup d'entre eux sont dupliqu&eacute;s, ce n'est pas une t&acirc;che aussi &eacute;norme qu'il n'y para&icirc;t. De plus, si vous n'&ecirc;tes pas familier avec le syst&egrave;me Wikihouse, cette &eacute;tape vous donnera une bonne compr&eacute;hension de son fonctionnement.
</p><p>Lorsque notre maison est enti&egrave;rement compos&eacute;e d'&eacute;l&eacute;ments plats, nous pouvons tout s&eacute;lectionner et l'exporter vers un fichier .dae, puis importer ce fichier dans FreeCAD. Assurez-vous de cocher la case "trianguler tout"
</p><p><span id="Solving_the_double_faces_bug"></span>
</p>
<h2><span id="R.C3.A9solution_du_probl.C3.A8me_des_doubles_faces"></span><span class="mw-headline" id="R&eacute;solution_du_probl&egrave;me_des_doubles_faces">R&eacute;solution du probl&egrave;me des doubles faces</span></h2>
<p>Il existe un probl&egrave;me d&eacute;sagr&eacute;able pour lequel je n'ai pas trouv&eacute; de meilleure solution&nbsp;: Les faces des maillages export&eacute;s de SketchUp au format .dae sont dupliqu&eacute;es. Chaque face devient en fait deux faces. Le moyen le plus simple que j'ai trouv&eacute; jusqu'&agrave; pr&eacute;sent est d'ouvrir le fichier export&eacute; dans <a rel="nofollow" class="external text" href="https://blender.org">Blender</a> pour le r&eacute;parer&nbsp;:
</p>
<ol><li>Ouvrez le fichier dae dans Blender (<b>Fichier &rarr; Importer &rarr; Collada</b>).</li>
<li>S&eacute;lectionnez un composant et appuyez sur <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">TAB</span> pour passer en mode &eacute;dition.</li>
<li>Appuyez sur <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">A</span> pour tout d&eacute;s&eacute;lectionner, puis sur <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">A</span> &agrave; nouveau pour tout s&eacute;lectionner.</li>
<li>Appuyez sur <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">W</span> &rarr; Supprimer les doubles</li>
<li>Appuyez sur <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">TAB</span> pour quitter le mode d'&eacute;dition.</li>
<li>R&eacute;p&eacute;tez l'op&eacute;ration pour tous les composants</li>
<li>Enregistrez un nouveau fichier <a href="../fr/Arch_DAE.html" title="Arch DAE/fr">DAE</a> (<b>Fichier &rarr; Exportation &rarr; Collada</b>).</li></ol>
<p>Normalement, l'op&eacute;ration ci-dessus ne devrait pas modifier l'&eacute;chelle, mais il est toujours sage de v&eacute;rifier, &agrave; l'aide des outils de mesure, que la g&eacute;om&eacute;trie import&eacute;e est &agrave; l'&eacute;chelle correcte avant d'aller plus loin. Vous devrez peut-&ecirc;tre modifier les param&egrave;tres d'exportation Collada de Blender si n&eacute;cessaire.
</p><p><span id="Importing_and_converting_to_wires"></span>
</p>
<h2><span class="mw-headline" id="Importer_et_convertir_en_polylignes">Importer et convertir en polylignes</span></h2>
<p>Remarquez qu'il peut &ecirc;tre plus facile d'aller par parties et de traiter + exporter les objets groupe par groupe, comme nous l'avons fait ci-dessous, nous avons export&eacute; seulement la premi&egrave;re couche, faite d'&eacute;l&eacute;ments jaunes dans SketchUp. Ces &eacute;l&eacute;ments arriveront dans FreeCAD en tant qu'objets <a href="../fr/Mesh_Workbench.html" title="Mesh Workbench/fr">Mesh</a>&nbsp;:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_09.jpg&amp;filetimestamp=20161217193633&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_09.jpg" decoding="async" width="1569" height="893" class="mw-file-element" data-file-width="1569" data-file-height="893"></a></span>
</p><p>L'&eacute;tape suivante consiste &agrave; cr&eacute;er des fils &agrave; partir de chacun de nos maillages. Il existe une macro pratique nomm&eacute;e <a href="../fr/Macro_Extract_Wires_from_Mesh.html" title="Macro Extract Wires from Mesh/fr">Macro Extract Wires from Mesh</a> qui fait exactement cela. Installez-la (consultez la page <a href="../fr/Macros.html" title="Macros/fr">Macros</a> pour obtenir des instructions), puis, un par un (vous pouvez les faire tous en m&ecirc;me temps, mais cette macro prend un certain temps), convertissez tous nos maillages en objets filaires&nbsp;:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_10.jpg&amp;filetimestamp=20161217202027&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_10.jpg" decoding="async" width="1348" height="875" class="mw-file-element" data-file-width="1348" data-file-height="875"></a></span>
</p><p>Nous pourrions d&eacute;j&agrave; cr&eacute;er des objets <a href="../fr/Arch_Panel.html" title="Arch Panel/fr">Arch Panneau</a> &agrave; partir de chacun de ces objets filiformes, simplement en les s&eacute;lectionnant et en appuyant sur le bouton <a href="../fr/Arch_Panel.html" title="Arch Panel/fr">Arch Panneau</a>. Cependant, leur forme de base ne serait pas param&eacute;trique. Nous avons maintenant plusieurs options&nbsp;: Nous pouvons transformer chaque composant en une esquisse, &agrave; l'aide de l'outil <a href="../fr/Draft_Draft2Sketch.html" title="Draft Draft2Sketch/fr">Draft Draft vers Esquisse</a>, mais il s'agira d'esquisses plut&ocirc;t lourdes, qui risquent de ne pas &ecirc;tre tr&egrave;s faciles &agrave; g&eacute;rer sur une machine lente, ou nous pouvons transformer chaque polyligne (le contour et chaque trou) de l'esquisse en une esquisse distincte. Cela nous permettrait, par exemple, de r&eacute;utiliser un trou typique, de le faire une seule fois, puis de le dupliquer avec <a href="../fr/Draft_Clone.html" title="Draft Clone/fr">Draft Cloner</a> pour faire les autres trous. De cette fa&ccedil;on, il suffirait d'en &eacute;diter un pour les &eacute;diter tous.
</p><p>La <a href="../fr/Macro_Extract_Wires_from_Mesh.html" title="Macro Extract Wires from Mesh/fr">Macro Extract Wires from Mesh</a> &eacute;choue aussi parfois &agrave; trouver des fils ferm&eacute;s &agrave; l'int&eacute;rieur d'un maillage, ce qui ne produira pas des panneaux corrects. Une proc&eacute;dure simple pour recomposer les fils d'un composant est la suivante&nbsp;:
</p>
<ol><li>S&eacute;lectionner le composant, &eacute;ventuellement cacher tout le reste pour mieux voir</li>
<li><a href="../fr/Draft_Downgrade.html" title="Draft Downgrade/fr">Draft D&eacute;gradez</a> le. Il sera &eacute;clat&eacute; en une s&eacute;rie d'ar&ecirc;tes</li>
<li>Commencez &agrave; s&eacute;lectionner les trous avec Ctrl ou en utilisant Shift + B pour faire une s&eacute;lection par bo&icirc;te.</li>
<li>Appuyez sur <a href="../fr/Draft_Upgrade.html" title="Draft Upgrade/fr">Draft Agr&eacute;ger</a> pour transformer chaque trou en polylignes.</li>
<li>Enfin, s&eacute;lectionnez toutes les ar&ecirc;tes restantes dans l'arborescence, qui forment le contour, et <a href="../fr/Draft_Upgrade.html" title="Draft Upgrade/fr">Draft Agr&eacute;ger</a>.</li>
<li>S&eacute;lectionnez <b>Part &rarr; Cr&eacute;er un composite</b> pour r&eacute;unir tous ces polylignes en un seul objet.</li>
<li>S&eacute;lectionnez le composite et appuyez sur le bouton <a href="../fr/Arch_Panel.html" title="Arch Panel/fr">Arch Panneau</a>.</li></ol>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_11.jpg&amp;filetimestamp=20161217205016&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_11.jpg" decoding="async" width="1882" height="983" class="mw-file-element" data-file-width="1882" data-file-height="983"></a></span>
</p><p>Il y a plusieurs strat&eacute;gies possibles ici, selon le degr&eacute; d'&eacute;ditabilit&eacute; et de pr&eacute;cision dont vous avez besoin pour le r&eacute;sultat. L'objet <a href="../fr/Arch_Panel.html" title="Arch Panel/fr">Arch Panneau</a> a besoin d'un objet de base fait de fils. La fa&ccedil;on dont cet objet est fabriqu&eacute; n'a pas d'importance, qu'il s'agisse d'une seule esquisse ou, comme dans l'exemple ci-dessus, d'un compos&eacute; de diff&eacute;rentes esquisses ou d'un objet Draft.
</p><p><span id="Converting_to_Sketches"></span>
</p>
<h2><span class="mw-headline" id="Convertir_en_esquisses">Convertir en esquisses</span></h2>
<p>Il est &eacute;galement possible de faire cette partie plus tard, vous pourriez d&eacute;j&agrave; cr&eacute;er des panneaux &agrave; partir de chacun des composants, mais voyons d&eacute;j&agrave; comment convertir un objet filaire en un esquisse&nbsp;:
</p>
<ol><li>Cr&eacute;ez une copie de votre objet filaire avec <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">Ctrl</span>+<span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">C</span>, <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">Ctrl</span>+<span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">V</span>. Ainsi, nous pouvons le modifier tout en le gardant &agrave; son emplacement correct.</li>
<li>D&eacute;placez et faites-le pivoter pour qu'il se trouve dans le plan XY, en utilisant <a href="../fr/Draft_Move.html" title="Draft Move/fr">Draft D&eacute;placer</a> et <a href="../fr/Draft_Rotate.html" title="Draft Rotate/fr">Draft Pivoter</a>. Ce n'est pas indispensable, mais le point suivant &eacute;choue parfois autrement</li>
<li>Utilisez <a href="../fr/Draft_Draft2Sketch.html" title="Draft Draft2Sketch/fr">Draft Draft vers Esquisse</a> pour transformer le fil en esquisse. Attention, cela peut &eacute;chouer ou prendre beaucoup de temps pour les longues polylignes. Il est pr&eacute;f&eacute;rable de d&eacute;composer votre objet en lignes individuelles comme indiqu&eacute; ci-dessus.</li>
<li>Si la commande ci-dessus &eacute;choue, utiliser <a href="../fr/Draft_Upgrade.html" title="Draft Upgrade/fr">Draft Agr&eacute;ger</a> deux fois sur un objet filaire, pour le convertir en Face puis en <a href="../fr/Draft_Wire.html" title="Draft Wire/fr">Draft Polyligne</a>, avant d'utiliser <a href="../fr/Draft_Draft2Sketch.html" title="Draft Draft2Sketch/fr">Draft Draft vers Esquisse</a>, fonctionne g&eacute;n&eacute;ralement mieux, car le Draft Wire garde une meilleure trace de l'ordre des vertices dans un fil.</li>
<li>Les courbes sont constitu&eacute;es de plusieurs petits segments. Elles peuvent &ecirc;tre laiss&eacute;es telles quelles, mais elles introduisent beaucoup de contraintes au niveau des extr&eacute;mit&eacute;s. Il est pr&eacute;f&eacute;rable de les remplacer par des arcs. C'est assez facile &agrave; faire, il suffit de supprimer les petits segments et de les remplacer par un arc. L'arc peut ensuite &ecirc;tre rendu tangentiel aux segments voisins, mais assurez-vous que la position de ces segments est verrouill&eacute;e avant de le faire, car cette op&eacute;ration les fera bouger.</li>
<li>Si vous avez travaill&eacute; avec plusieurs esquisses, faites-en un <a href="../fr/Part_Compound.html" title="Part Compound/fr">Part Composite</a>.</li>
<li>Cr&eacute;ez un <a href="../fr/Arch_Panel.html" title="Arch Panel/fr">Arch Panneau</a> &agrave; partir de celui-ci.</li>
<li>Faites-le pivoter/remettre en place avec <a href="../fr/Draft_Move.html" title="Draft Move/fr">Draft D&eacute;placer</a> et <a href="../fr/Draft_Rotate.html" title="Draft Rotate/fr">Draft Pivoter</a>.</li></ol>
<p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_12.jpg&amp;filetimestamp=20161218215657&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_12.jpg" decoding="async" width="1183" height="705" class="mw-file-element" data-file-width="1183" data-file-height="705"></a></span>
</p><p><span id="Rebuilding_the_Wikihouse_and_exporting_cut_sheets"></span>
</p>
<h2><span id="Reconstruire_la_Wikihouse_et_exporter_les_panneaux_d.C3.A9coup.C3.A9s"></span><span class="mw-headline" id="Reconstruire_la_Wikihouse_et_exporter_les_panneaux_d&eacute;coup&eacute;s">Reconstruire la Wikihouse et exporter les panneaux d&eacute;coup&eacute;s</span></h2>
<p>Veillez &eacute;galement &agrave; ne pas refaire les pi&egrave;ces dupliqu&eacute;es. S&eacute;lectionnez plut&ocirc;t l'outil <a href="../fr/Draft_Clone.html" title="Draft Clone/fr">Draft Cloner</a> pour dupliquer les pi&egrave;ces bas&eacute;es sur le m&ecirc;me profil, de sorte qu'elles partagent toutes le m&ecirc;me objet de profil. Puis, puisque nous avons le contour au bon endroit pour l'utiliser comme guide, il est assez facile de faire pivoter et de d&eacute;placer le clone dans sa position correcte avec <a href="../fr/Draft_Move.html" title="Draft Move/fr">Draft D&eacute;placer</a> et <a href="../fr/Draft_Rotate.html" title="Draft Rotate/fr">Draft Pivoter</a>.
</p><p>Apr&egrave;s un certain temps, toute notre section Microhouse est termin&eacute;e.
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_01.jpg&amp;filetimestamp=20161217165244&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_01.jpg" decoding="async" width="932" height="801" class="mw-file-element" data-file-width="932" data-file-height="801"></a></span>
</p><p>Nous pouvons maintenant cr&eacute;er facilement les panneaux d&eacute;coup&eacute;s, qui sont des fichiers DXF qui seront envoy&eacute;s &agrave; l'atelier qui coupera les panneaux r&eacute;els. La fa&ccedil;on la plus simple de proc&eacute;der est de s&eacute;lectionner tout ce qui se trouve dans votre document avec <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">Ctrl</span>+<span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">A</span>, puis d'utiliser l'outil <a href="../fr/Arch_Panel_Cut.html" title="Arch Panel Cut/fr">Arch D&eacute;coupe de panneaux</a>. Cela produira un objet Panneau d&eacute;coup&eacute; pour chaque objet Panneau trouv&eacute; dans la s&eacute;lection. En les s&eacute;parant, nous obtenons une vue claire de toutes nos pi&egrave;ces&nbsp;:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_02.jpg&amp;filetimestamp=20161217165259&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_02.jpg" decoding="async" width="1565" height="873" class="mw-file-element" data-file-width="1565" data-file-height="873"></a></span>
</p><p>Il faut ensuite "embo&icirc;ter" nos pi&egrave;ces, c'est-&agrave;-dire les d&eacute;placer et les faire pivoter pour qu'elles occupent le plus possible l'espace d'un panneau donn&eacute;, afin de g&eacute;n&eacute;rer le moins de perte mat&eacute;rielle possible. Cette op&eacute;ration doit malheureusement &ecirc;tre faite &agrave; la main, mais si vous utilisez un projet Wikihouse qui a d&eacute;j&agrave; produit des panneaux d&eacute;coup&eacute;s, les copier va assez vite&nbsp;:
</p>
<ol><li>Pour &ecirc;tre s&ucirc;r que tout restera dans le plan XY, il est conseill&eacute; de r&eacute;gler le <a href="../fr/Draft_SelectPlane.html" title="Draft SelectPlane/fr">Draft Plan de travail</a> sur XY (haut).</li>
<li>Cr&eacute;ez un <a href="../fr/Arch_Panel_Sheet.html" title="Arch Panel Sheet/fr">Arch Panneau de feuille</a>.</li>
<li>Donnez-lui les valeurs de largeur et de hauteur souhait&eacute;es (les maisons Wiki sont g&eacute;n&eacute;ralement imprim&eacute;es sur des feuilles de contreplaqu&eacute; de 122x244cm)</li>
<li>D&eacute;placez-la &agrave; un endroit appropri&eacute; avec <a href="../fr/Draft_Move.html" title="Draft Move/fr">Draft D&eacute;placer</a>.</li>
<li>Optionnellement, d&eacute;finissez ses valeurs de marge pour vous aider &agrave; positionner les pi&egrave;ces d&eacute;coup&eacute;es.</li>
<li>D&eacute;placez et faites pivoter les objets individuels <a href="../fr/Arch_Panel_Cut.html" title="Arch Panel Cut/fr">Arch panneaux d&eacute;coup&eacute;s</a> pour qu'ils s'ins&egrave;rent dans la feuille de panneau.</li>
<li>Lorsque vous &ecirc;tes plus ou moins pr&ecirc;t, s&eacute;lectionnez le panneau et double-cliquez dessus dans l'arborescence pour passer en mode &eacute;dition.</li>
<li>S&eacute;lectionnez toutes les coupes de panneau que vous souhaitez y ins&eacute;rer (vous pouvez passer de l'arborescence &agrave; l'onglet "projet" pour s&eacute;lectionner dans la <a href="../fr/Tree_view.html" class="mw-redirect" title="Tree view/fr">Vue en arborescence</a>).</li>
<li>S&eacute;lectionnez la section "groupe" dans la vue des t&acirc;ches de la feuille de panneau.</li>
<li>Cliquez sur le bouton <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">Ajouter</span>.</li>
<li>Appuyez sur le bouton <span class="ButtonTemplate" style="background: #f5f5f5; -moz-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); -webkit-box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); box-shadow: 0.1em 0.1em 0.2em rgba(0,0,0,0.1); border: 2px solid #989898; border-radius: 0.3em; padding: 0px 8px 1px 8px; font-weight:normal;color: #202122;">OK</span>.</li></ol>
<p>Dans la vue des t&acirc;ches de la feuille de panneau, il y a &eacute;galement un bouton qui vous permet de d&eacute;placer les coupes de panneau individuelles apr&egrave;s qu'elles ont &eacute;t&eacute; ins&eacute;r&eacute;es dans la feuille. Apr&egrave;s un certain temps, nos feuilles sont pr&ecirc;tes&nbsp;:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_03.jpg&amp;filetimestamp=20161217165326&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_03.jpg" decoding="async" width="1496" height="719" class="mw-file-element" data-file-width="1496" data-file-height="719"></a></span>
</p><p>La derni&egrave;re &eacute;tape consiste simplement &agrave; s&eacute;lectionner toutes les feuilles, puis &agrave; les exporter au format DXF &agrave; partir du menu Fichier &rarr; Exporter. Le contenu des feuilles sera export&eacute; s&eacute;par&eacute; en diff&eacute;rentes couches, avec le m&ecirc;me code couleur couramment utilis&eacute; par le projet Wikihouse&nbsp;:
</p><p><span class="mw-default-size" typeof="mw:File"><a href="../index.php?title=Arch_Wikihouse_04.jpg&amp;filetimestamp=20161217165748&amp;.html" class="mw-file-description"><img src="../File/Arch_Wikihouse_04.jpg" decoding="async" width="1437" height="872" class="mw-file-element" data-file-width="1437" data-file-height="872"></a></span>
</p><p>Ces fichiers sont pr&ecirc;ts &agrave; &ecirc;tre envoy&eacute;s aux ateliers qui effectueront la d&eacute;coupe proprement dite. Il serait &eacute;galement possible de g&eacute;n&eacute;rer le code G &agrave; envoyer &agrave; la machine CNC directement &agrave; partir de FreeCAD, mais cela fera l'objet d'un autre tutoriel.
</p>
<!-- 
NewPP limit report
Cached time: 20260228141552
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.062 seconds
Real time usage: 0.099 seconds
Preprocessor visited node count: 187/1000000
Post&#8208;expand include size: 5163/2097152 bytes
Template argument size: 160/2097152 bytes
Highest expansion depth: 3/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 1885/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%    5.950      1 -total
 40.40%    2.404      1 Template:TutorialInfo/fr
 27.38%    1.629     13 Template:Button
 18.52%    1.102      2 Template:MenuCommand
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:97718-0!canonical and timestamp 20260228141552 and revision id 1760938. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>