<link href="../site.css" rel="stylesheet" type="text/css"/><div class="mw-page-container"><h1 id="firstHeading" class="firstHeading mw-first-heading"><span class="mw-page-title-main">Help FreeCAD/pt</span></h1><?xml encoding="UTF-8"><div class="mw-content-ltr mw-parser-output" lang="pt" dir="ltr"><div class="mw-pt-languages noprint navigation-not-searchable" lang="en" dir="ltr"><div class="mw-pt-languages-label">Other languages:</div><ul class="mw-pt-languages-list"><li><a href="../index.php?title=Special;Translate&amp;group=page-Help+FreeCAD&amp;language=&amp;task=view.html" class="new" title="Start translation for this language" lang="" dir="ltr"></a></li>
<li><a href="../de/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--complete" title="FreeCAD Unterst&uuml;tzen (100% translated)" lang="de" dir="ltr">Deutsch</a></li>
<li><a href="../Help_FreeCAD.html" class="mw-pt-languages-ui mw-pt-progress mw-pt-progress--complete" title="Help FreeCAD (100% translated)" lang="en" dir="ltr">English</a></li>
<li><a href="../tr/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="FreeCAD'e yard&#305;m edin (19% translated)" lang="tr" dir="ltr">T&uuml;rk&ccedil;e</a></li>
<li><a href="../es/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="Ayuda a FreeCAD (68% translated)" lang="es" dir="ltr">espa&ntilde;ol</a></li>
<li><a href="../fr/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--complete" title="Contribuer &agrave; FreeCAD (100% translated)" lang="fr" dir="ltr">fran&ccedil;ais</a></li>
<li><a href="../hr/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="Pomozite FreeCAD-u (61% translated)" lang="hr" dir="ltr">hrvatski</a></li>
<li><a href="../it/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--complete" title="Contribuire a FreeCAD (100% translated)" lang="it" dir="ltr">italiano</a></li>
<li><a href="../pl/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--complete" title="Pom&oacute;&#380; w rozwoju FreeCAD (100% translated)" lang="pl" dir="ltr">polski</a></li>
<li><span class="mw-pt-languages-selected mw-pt-progress mw-pt-progress--complete" lang="pt" dir="ltr">portugu&ecirc;s</span></li>
<li><a href="../pt-br/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="Ajude o FreeCAD (68% translated)" lang="pt-BR" dir="ltr">portugu&ecirc;s do Brasil</a></li>
<li><a href="../ro/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="Help FreeCAD (32% translated)" lang="ro" dir="ltr">rom&acirc;n&#259;</a></li>
<li><a href="../fi/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--low" title="Auta FreeCADi&auml; (3% translated)" lang="fi" dir="ltr">suomi</a></li>
<li><a href="../sv/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--high" title="Hj&auml;lp FreeCAD (94% translated)" lang="sv" dir="ltr">svenska</a></li>
<li><a href="../cs/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="Help FreeCAD (26% translated)" lang="cs" dir="ltr">&#269;e&scaron;tina</a></li>
<li><a href="../bg/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--low" title="Help FreeCAD/bg (0% translated)" lang="bg" dir="ltr">&#1073;&#1098;&#1083;&#1075;&#1072;&#1088;&#1089;&#1082;&#1080;</a></li>
<li><a href="../ru/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--complete" title="&#1055;&#1086;&#1084;&#1086;&#1075;&#1080; FreeCAD (100% translated)" lang="ru" dir="ltr">&#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a></li>
<li><a href="../uk/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--low" title="Help FreeCAD (3% translated)" lang="uk" dir="ltr">&#1091;&#1082;&#1088;&#1072;&#1111;&#1085;&#1089;&#1100;&#1082;&#1072;</a></li>
<li><a href="../zh-cn/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="&#24110;&#21161;FreeCAD (52% translated)" lang="zh-Hans-CN" dir="ltr">&#20013;&#25991;&#65288;&#20013;&#22269;&#22823;&#38470;&#65289;</a></li>
<li><a href="../zh-tw/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="&#24171;&#21161;FreeCAD (16% translated)" lang="zh-Hant-TW" dir="ltr">&#20013;&#25991;&#65288;&#33274;&#28771;&#65289;</a></li>
<li><a href="../ja/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="FreeCAD&#12408;&#12398;&#36002;&#29486; (19% translated)" lang="ja" dir="ltr">&#26085;&#26412;&#35486;</a></li>
<li><a href="../ko/Help_FreeCAD.html" class="mw-pt-progress mw-pt-progress--med" title="FreeCAD &#46037;&#44592; (35% translated)" lang="ko" dir="ltr">&#54620;&#44397;&#50612;</a></li></ul></div>
<div style="clear:right; margin-bottom: .5em; float: right; padding: .5em 0 .8em 1.4em; background: none;"><meta property="mw:PageProp/toc"></div>
<p><span id="Introduction"></span>
</p>
<h2><span id="Introdu.C3.A7.C3.A3o"></span><span class="mw-headline" id="Introdu&ccedil;&atilde;o">Introdu&ccedil;&atilde;o</span></h2>
<p>Se gosta do FreeCAD e gostaria de ajudar este projecto, h&aacute; muitas coisas que pode fazer, n&atilde;o importa se prefere contribuir com tempo, dinheiro, ou se sabe ou n&atilde;o programar.
</p><p><span id="Donate_money"></span>
</p>
<h2><span id="Doa.C3.A7.C3.B5es_em_dinheiro"></span><span class="mw-headline" id="Doa&ccedil;&otilde;es_em_dinheiro">Doa&ccedil;&otilde;es em dinheiro</span></h2>
<p>Embora o FreeCAD n&atilde;o precise de dinheiro para continuar a ser desenvolvido, as doa&ccedil;&otilde;es ajudam o projecto a crescer mais r&aacute;pido e mais longe. A p&aacute;gina de <a href="../index.php?title=Donate/pt&amp;action=edit&amp;redlink=1.html" class="new" title="Donate/pt (page does not exist)">Doa&ccedil;&otilde;es</a> lista todas as op&ccedil;&otilde;es que tem para poder doar dinheiro para o projecto.
</p><p><span id="Work_on_the_documentation"></span>
</p>
<h2><span id="Trabalhar_na_documenta.C3.A7.C3.A3o"></span><span class="mw-headline" id="Trabalhar_na_documenta&ccedil;&atilde;o">Trabalhar na documenta&ccedil;&atilde;o</span></h2>
<p>Ajude-nos a construir, corrigir e ampliar esta documenta&ccedil;&atilde;o. Corrigir erros, ampliarr ou corrigir p&aacute;ginas que n&atilde;o estejam claras, criar novas p&aacute;ginas se faltar um t&oacute;pico, etc. Contribuir para o wiki do FreeCAD &eacute; f&aacute;cil, em <a href="../Special;MyLanguage/WikiPages.html" title="Special:MyLanguage/WikiPages">PaginasWiki</a> voc&ecirc; pode encontrar as diretrizes gerais e a ajuda necess&aacute;ria para come&ccedil;ar. Para editar o wiki, voc&ecirc; precisar&aacute; de uma conta wiki com permiss&otilde;es de "Editor" (o wiki &eacute; protegido contra grava&ccedil;&atilde;o para evitar &lsquo;spam&rsquo;). Pode solicitar uma conta <a rel="nofollow" class="external text" href="http://forum.freecad.org/viewtopic.php?f=21&amp;t=6830%7Cno">f&oacute;rum</a> ou no <a rel="nofollow" class="external text" href="https://wiki.freecad.org/Help#Chat%7Ccanal">IRC</a>. Note que o canal do IRC pode n&atilde;o ser t&atilde;o imediato a responder como o f&oacute;rum. <a rel="nofollow" class="external text" href="https://forum.freecad.org">O f&oacute;rum oficial do FreeCAD</a> deve ser o local principal para fazer perguntas e iniciar debates, pois ajudar&aacute; a preservar a experi&ecirc;ncia e o conhecimento da comunidade.
</p><p>Algumas &aacute;reas que beneficiam com o seu trabalho:
</p>
<ul><li>A p&aacute;gina <a href="../Category;Command_Reference.html" title="Category:Command Reference">Category:Command Reference</a> lista e documenta todos os <a href="../Command.html" title="Command">commands</a> FreeCAD. A maioria deles cont&eacute;m pouca ou at&eacute; nenhuma informa&ccedil;&atilde;o no momento. Por favor consulte as <a href="../WikiPages.html" title="WikiPages">WikiPages</a> ver bons exemplos sobre como as p&aacute;ginas de documenta&ccedil;&atilde;o de comandos devem ser.</li>
<li>A sec&ccedil;&atilde;o de <a href="../index.php?title=Tutorials/pt&amp;action=edit&amp;redlink=1.html" class="new" title="Tutorials/pt (page does not exist)">Tutoriais</a> precisa de exemplos sobre como utilizar as bancadas de trabalho. Se desenvolveu algo interessante com o FreeCAD, porque n&atilde;o documentar como o fez para a posteridade?</li>
<li>Existem tickets abertos no FreeCAD <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/issues">"bug tracker"</a> marcados como <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/issues?q=is%3Aopen+is%3Aissue+label%3Adocumentation">"documentation"</a> que precisam de algum amor.</li></ul>
<p><span id="Share_your_FreeCAD_knowledge"></span>
</p>
<h2><span class="mw-headline" id="Partilhe_o_seu_conhecimento_do_FreeCAD">Partilhe o seu conhecimento do FreeCAD</span></h2>
<p>A comunidade de utilizadores em torno do FreeCAD ainda &eacute; pequena, mas j&aacute; inclui v&aacute;rios utilizadores experientes que fazem um trabalho muito importante a mostrar aos rec&eacute;m-chegados como utilizar o &lsquo;software&rsquo;. Se come&ccedil;ar a sentir-se confort&aacute;vel com o FreeCAD, os seus conhecimentos poder&atilde;o ser muito valiosos para outros, e poder&aacute; contribuir com recursos importantes como, por exemplo:
</p>
<ul><li>Mostrando o trabalho que fez com o FreeCAD no f&oacute;rum <a rel="nofollow" class="external text" href="http://forum.freecad.org/viewforum.php?f=24">'Users Showcase forum'</a>. Pode colocar capturas de ecr&atilde; e melhor ainda se anexar os arquivos do FreeCAD, para que outras pessoas possam examin&aacute;-lo e compreender como foi feito.</li>
<li>Gravar <a rel="nofollow" class="external text" href="http://www.youtube.com/user/FreeCADNews">v&iacute;deos</a> mostrando como fez algo interessante no FreeCAD. Estes v&iacute;deos fazem normalmente um excelente trabalho mostrando novas funcionalidades.</li>
<li>Escrever <a rel="nofollow" class="external text" href="http://freecad-tutorial.blogspot.com/">tutoriais</a> descrevendo ou ensinando algo interessante. Pode escrever tutoriais no seu pr&oacute;prio "blog", diretamente no nosso wiki, ou mesmo no f&oacute;rum.</li>
<li>Publique na rede social de c&oacute;digo aberto <a rel="nofollow" class="external text" href="https://joinmastodon.org/">Mastodon</a> (e <a rel="nofollow" class="external text" href="https://fosstodon.org/@FreeCAD">siga o FreeCAD l&aacute;</a>) ou na comunidade do <a rel="nofollow" class="external text" href="https://www.facebook.com/groups/416491481766626">Facebook</a>.</li>
<li>Veja os &uacute;ltimos posts FreeCAD no <a rel="nofollow" class="external text" href="https://www.reddit.com/search/?q=freecad&amp;type=link&amp;sort=new">Reddit</a>, <a rel="nofollow" class="external text" href="https://3dprinting.stackexchange.com/search?tab=newest&amp;q=freecad">3dprinting.stackexchange</a>, <a rel="nofollow" class="external text" href="https://stackoverflow.com/search?q=freecad">StackOverflow</a>... Tente responder e participe das discuss&otilde;es partilhando a sua experi&ecirc;ncia e informa&ccedil;&atilde;o.</li>
<li>Participar do canal IRC FreeCAD ou  <a rel="nofollow" class="external text" href="https://www.freecad.org/wiki/Help#Chat">outras salas de conversa</a>.</li></ul>
<p><span id="Translate_FreeCAD"></span>
</p>
<h2><span class="mw-headline" id="Traduzir_o_FreeCAD">Traduzir o FreeCAD</span></h2>
<p>Traduza o FreeCAD para o seu idioma. Todas as 'strings' de texto do interface FreeCAD podem ser facilmente traduzidas para outros idiomas. Tudo o que &eacute; preciso &eacute; algu&eacute;m que saiba esses outro idioma e alguma vontade em ajudar! Todas as tradu&ccedil;&otilde;es s&atilde;o feitas online em <a rel="nofollow" class="external text" href="https://crowdin.net/project/freecad">Crowdin</a>.
</p><p>Para mais detalhes sobre tradu&ccedil;&otilde;es, consulte <a href="../Special;MyLanguage/Localisation.html" title="Special:MyLanguage/Localisation">Tradu&ccedil;&atilde;o</a>.
</p><p><span id="Translate_the_documentation"></span>
</p>
<h2><span id="Traduzir_a_documenta.C3.A7.C3.A3o"></span><span class="mw-headline" id="Traduzir_a_documenta&ccedil;&atilde;o">Traduzir a documenta&ccedil;&atilde;o</span></h2>
<p>Traduzir &eacute; f&aacute;cil, o FreeCAD wiki auxilia com um plugin que permite que traduza do Ingl&ecirc;s base para outros idiomas.
</p><p>Para mais detalhes sobre tradu&ccedil;&atilde;o, consulte <a href="../Localisation.html#Traduzindo_o_wiki" title="Localisation">Localisation#Traduzindo o wiki</a>.
</p><p>Por favor, certifique-se de que est&aacute; familiarizado com os fundamentos de marca&ccedil;&atilde;o wiki; ver <a href="../Help;Editing.html" title="Help:Editing">Ajuda:Editando</a> como refer&ecirc;ncia.
</p><p>Depois dirija-se a <a href="../WikiPages.html" title="WikiPages">WikiPages</a> para se familiarizar com o estilo usado neste wiki, principalmente quando se trata de modelos.
</p><p><span id="Help_others_to_know_FreeCAD"></span>
</p>
<h2><span class="mw-headline" id="Ajudar_os_outros_a_conhecer_o_FreeCAD">Ajudar os outros a conhecer o FreeCAD</span></h2>
<ul><li>Fale sobre o FreeCAD a outras pessoas que possam ter interesse.</li>
<li>Se encontrar usos interessantes para o FreeCAD, documente-os, usando capturas de ecr&atilde; como exemplo. O FreeCAD &eacute; bastante jovem, e muitas pessoas n&atilde;o imaginam o que se pode fazer com ele. Se j&aacute; &eacute; um f&atilde; do FreeCAD, certamente sabe algo interessante que o FreeCAD pode fazer. Ajude-nos a mostrar isso a outros!</li>
<li>Passe pelo f&oacute;rum e ajude os rec&eacute;m-chegados a resolver quest&otilde;es b&aacute;sicas.</li>
<li>Escreva tutoriais, grave v&iacute;deos, etc., mostrando o que pode fazer com o FreeCAD.</li>
<li>Contribua com ficheiros, desenhos, etc. Ainda faltam bons ficheiros de exemplo do que pode ser feito com o FreeCAD.</li>
<li>Ajude a promover o FreeCAD no GitHub dando uma <a rel="nofollow" class="external text" href="https://help.github.com/articles/be-social/#watch-a-project">"Estrela" e "Observando"</a> o <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD">reposit&oacute;rio FreeCAD</a></li></ul>
<p><span id="Report_bugs_and_ask_for_interesting_features"></span>
</p>
<h2><span class="mw-headline" id="Reportar_falhas_e_solicitar_funcionalidades_interessantes">Reportar falhas e solicitar funcionalidades interessantes</span></h2>
<figure class="mw-default-size mw-halign-center" typeof="mw:File"><a href="../index.php?title=Bugreport-workflow.png&amp;filetimestamp=20170609105123&amp;.html" class="mw-file-description"><img src="../File/Bugreport-workflow.png" decoding="async" width="871" height="83" class="mw-file-element" data-file-width="871" data-file-height="83"></a><figcaption></figcaption></figure>
<p>Embora o local adequado para relatar erros confirmados e sugerir novas funcionalidades seja, eventualmente, o <b><a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/issues">FreeCAD Issue Tracker on GitHub</a></b>,por favor publique sempre primeiro os relat&oacute;rios de erros e pedidos de funcionalidades no f&oacute;rum de Ajuda. Para poupar tempo aos desenvolvedores (triagem e tratamento de erros dif&iacute;ceis de entender pode ser muito demorado) e evitar frustra&ccedil;&otilde;es porque o seu problema n&atilde;o foi tratado da forma como gostaria, por favor leia o seguinte:
</p>
<ul><li>Erros e pedidos de funcionalidades s&atilde;o tratados no mesmo sistema de rastreio. Basta marcar o seu item como "bug" (algo que n&atilde;o funciona como deveria) ou "feature" (algo que n&atilde;o existe mas que acha que seria bom ter).</li>
<li>Embora originalmente fosse poss&iacute;vel submeter problemas anonimamente, infelizmente isso teve de ser cancelado devido a spam. Agora, se deseja criar/editar tickets, ter&aacute; de criar uma conta. Ser&aacute; ent&atilde;o notificado por defeito quando algu&eacute;m adicionar notas ao item. Em muitos casos, a pessoa que tratar&aacute; do erro precisar&aacute; de mais informa&ccedil;&otilde;es suas.</li>
<li>Ao relatar um erro, o ponto mais importante &eacute; permitir que os desenvolvedores o reproduzam. Certifique-se de incluir os passos exatos necess&aacute;rios para que o erro aconte&ccedil;a, para que outra pessoa possa fazer o mesmo e ver o erro acontecer na sua m&aacute;quina tamb&eacute;m. Se o desenvolvedor n&atilde;o puder ver o erro, tamb&eacute;m n&atilde;o poder&aacute; resolv&ecirc;-lo.</li>
<li>Inclua tamb&eacute;m informa&ccedil;&otilde;es que ajudem os desenvolvedores a situar o problema, como o sistema operativo em que est&aacute; a executar o FreeCAD, a vers&atilde;o exata do FreeCAD e as bibliotecas relevantes. Por favor publique todos os dados usando o bot&atilde;o "copy to clip board" no di&aacute;logo Ajuda (menu) &rarr; Sobre o FreeCAD.</li>
<li>Independentemente de qu&atilde;o certo esteja de que encontrou um erro, por favor discuta-os sempre primeiro no <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewforum.php?f=3">Help forum</a>.</li>
<li>Antes de submeter um pedido de funcionalidade, discuta-o sempre primeiro com outros utilizadores no <a rel="nofollow" class="external text" href="https://forum.freecad.org/viewforum.php?f=8">Open discussion forum</a>, para que possa acabar com uma proposta mais s&oacute;lida, com mais hip&oacute;teses de interessar um desenvolvedor a implement&aacute;-la.</li>
<li>Lembre-se de que o FreeCAD &eacute; desenvolvido por volunt&aacute;rios que utilizam o seu tempo livre para trabalhar nele. Embora todos tentem dar o seu melhor para criar a melhor aplica&ccedil;&atilde;o poss&iacute;vel, o seu relat&oacute;rio de erro pode ser tratado com baixa prioridade ou cancelado se n&atilde;o puder fornecer informa&ccedil;&atilde;o suficiente, e o seu pedido de funcionalidade pode ser adiado ou at&eacute; recusado se nenhum desenvolvedor tiver interesse em implement&aacute;-lo ou se isso exigir uma quantidade irrealista de trabalho.</li></ul>
<p><span id="Triage_bugs"></span>
</p>
<h2><span class="mw-headline" id="Triagem_de_erros">Triagem de erros</span></h2>
<p>H&aacute; dezenas de erros reportados em <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/issues">GitHub</a> semanalmente. &Eacute; preciso muito tempo para os ler, categoriz&aacute;-los, verificar se o problema pode ser reproduzido, ver se com alguns passos pode reproduzir o problema, ou pedir &agrave; pessoa que reportou o problema para disponibilizar mais informa&ccedil;&atilde;o. Ajudando com a triagem &eacute; f&aacute;cil, v&aacute; at&eacute; a <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/issues">GitHub</a> e coloque os seus coment&aacute;rios em qualquer situa&ccedil;&atilde;o que veja que pode ajudar a resolver!
</p><p><span id="Design_artwork"></span>
</p>
<h2><span id="Projeto_art.C3.ADstico"></span><span class="mw-headline" id="Projeto_art&iacute;stico">Projeto art&iacute;stico</span></h2>
<p>Veja as p&aacute;ginas <a href="../index.php?title=Artwork/pt&amp;action=edit&amp;redlink=1.html" class="new" title="Artwork/pt (page does not exist)">Objectos gr&aacute;ficos</a> e <a href="../index.php?title=Artwork_Guidelines/pt&amp;action=edit&amp;redlink=1.html" class="new" title="Artwork Guidelines/pt (page does not exist)">Diretrizes para trabalhos gr&aacute;ficos</a> orienta&ccedil;&otilde;es sobre a cria&ccedil;&atilde;o de icons para o FreeCAD.
</p><p><span id="Write_code"></span>
</p>
<h2><span id="Escreva_c.C3.B3digo"></span><span class="mw-headline" id="Escreva_c&oacute;digo">Escreva c&oacute;digo</span></h2>
<p>Escrever c&oacute;digo para o FreeCAD n&atilde;o &eacute; dif&iacute;cil, e n&atilde;o precisa de qualquer permiss&atilde;o &mdash; pode come&ccedil;ar j&aacute; a trabalhar em algo que deseja, depois submeter um 'patch' no <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD/issues">issue tracker</a> ou pedir um 'merge' a partir de um <a rel="nofollow" class="external text" href="https://github.com/FreeCAD">git branch</a>. Para evitar dores de cabe&ccedil;a, deve primeiro cumprir os seguintes pr&eacute;-requisitos:
</p>
<ul><li>Informa&ccedil;&atilde;o sobre <a href="../Developer_hub.html#Compiling_FreeCAD/pt" title="Developer hub">como compilar o FreeCAD</a> est&aacute; dispon&iacute;vel para diferentes sistemas operativos.</li>
<li>Antes de come&ccedil;ar a programar para o FreeCAD, deve saber como o FreeCAD funciona. Isto parece &oacute;bvio, mas se n&atilde;o souber como &eacute; suposto funcionar, n&atilde;o saber&aacute; o que fazer internamente ou como faz&ecirc;-lo.</li>
<li>Quase tudo pode ser feito em Python ou C++. Os internos funcionam praticamente da mesma forma em ambas as linguagens. Sugerimos que leia as p&aacute;ginas do <a href="../Power_users_hub.html" title="Power users hub">Power users hub</a>, mesmo que v&aacute; programar em C++, pois dar-lhe-&aacute; uma boa vis&atilde;o geral do funcionamento interno.</li>
<li>Se vai trabalhar em C++, certifique-se primeiro de que consegue compilar o FreeCAD sem problemas.</li>
<li>Apresente-se aos outros desenvolvedores. O FreeCAD &eacute; antes de mais um projeto social &mdash; discutimos muitas coisas no <a rel="nofollow" class="external text" href="https://forum.freecad.org">f&oacute;rum</a> antes de as implementar, e &eacute; sempre melhor discutir as suas ideias e dizer &agrave;s pessoas o que planeia fazer antes de realmente o fazer. Tamb&eacute;m temos um <a rel="nofollow" class="external text" href="https://wiki.freecad.org/Help#Chat">canal IRC</a> que est&aacute; sincronizado com o nosso canal <a rel="nofollow" class="external text" href="https://matrix.to/#/#FreeCAD_FreeCAD:gitter.im">Matrix</a>, bem como um <a rel="nofollow" class="external text" href="https://discord.gg/w2cTKGzccC">canal Discord</a>.</li>
<li>Desde 2016, o FreeCAD tamb&eacute;m participa no <a href="../Google_Summer_of_Code_2020.html" title="Google Summer of Code 2020">Google Summer of Code 2020</a>. Certifique-se de verificar l&aacute; as nossas ideias caso esteja interessado em participar na pr&oacute;xima edi&ccedil;&atilde;o.</li>
<li>Cada vez mais funcionalidades do FreeCAD n&atilde;o s&atilde;o escritas no pr&oacute;prio c&oacute;digo do FreeCAD, mas sim em addons, macros e extens&otilde;es. Em conjunto, este ecossistema &eacute; o que torna o FreeCAD poderoso. Muitas vezes, trabalhar num addon &eacute; mais f&aacute;cil porque h&aacute; menos c&oacute;digo para ler e compreender, e menos pessoas envolvidas. Veja o <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD-addons">reposit&oacute;rio de Addons</a> e o <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD-macros">reposit&oacute;rio de Macros</a> para obter algumas ideias!</li></ul>
<p><span id="Create_models"></span>
</p>
<h2><span class="mw-headline" id="Criar_modelos">Criar modelos</span></h2>
<p>O FreeCAD inclui uma <a rel="nofollow" class="external text" href="https://github.com/FreeCAD/FreeCAD-library">Models library</a> que &eacute; livre e aberta a todos. Porque n&atilde;o adicionar l&aacute; algumas pe&ccedil;as &uacute;teis, que possam ser reutilizadas por outros? Certifique-se de criar os modelos voc&ecirc; mesmo, do zero, para manter a biblioteca 100% livre de componentes possivelmente protegidos por direitos de autor ou n&atilde;o livres.
</p><p><br>
</p>
<div class="NavFrame" style="margin: 0px; text-align: center; border-collapse: collapse; font-size: 100%; border-top-style: double; border-top-style: 1px; clear:both;">
    <div class="NavHead mw-collapsible mw-collapsed" style="margin: 1px; font-weight: normal; background-color: var(--background-color-neutral-subtle, #fefefe);"><span typeof="mw:File"><a href="../index.php?title=User_hub.png&amp;filetimestamp=20190221145008&amp;.html" class="mw-file-description"><img src="../File/User_hub.png" decoding="async" width="24" height="24" class="mw-file-element" data-file-width="64" data-file-height="64"></a></span> <a href="../pt/User_hub.html" title="User hub/pt">User documentation</a>
        <div class="NavContent mw-collapsible-content" style="margin: 10px; border: 1px solid var(--border-color-base, #aaaaaa); text-align: left; border-collapse: collapse; font-weight: normal; font-size: 100%; clear:both; margin-top: 1px; background-color: var(--background-color-neutral-subtle, #fefefe);">
<ul><li><b><a href="../pt/Getting_started.html" title="Getting started/pt">Getting started</a></b></li>
<li><b>Installation:</b> <a href="../pt/Download.html" title="Download/pt">Download</a>, <a href="../pt/Installing_on_Windows.html" title="Installing on Windows/pt">Windows</a>, <a href="../pt/Installing_on_Linux.html" title="Installing on Linux/pt">Linux</a>, <a href="../pt/Installing_on_Mac.html" title="Installing on Mac/pt">Mac</a>, <a href="../pt/Installing_additional_components.html" title="Installing additional components/pt">Additional components</a>, <a href="../index.php?title=Compile_on_Docker/pt&amp;action=edit&amp;redlink=1.html" class="new" title="Compile on Docker/pt (page does not exist)">Docker</a>, <a href="../index.php?title=AppImage/pt&amp;action=edit&amp;redlink=1.html" class="new" title="AppImage/pt (page does not exist)">AppImage</a>, <a href="../index.php?title=Ubuntu_Snap/pt&amp;action=edit&amp;redlink=1.html" class="new" title="Ubuntu Snap/pt (page does not exist)">Ubuntu Snap</a></li>
<li><b>Basics:</b> <a href="../pt/About_FreeCAD.html" title="About FreeCAD/pt">About FreeCAD</a>, <a href="../index.php?title=Interface/pt&amp;action=edit&amp;redlink=1.html" class="new" title="Interface/pt (page does not exist)">Interface</a>, <a href="../pt/Mouse_navigation.html" title="Mouse navigation/pt">Mouse navigation</a>, <a href="../pt/Selection_methods.html" title="Selection methods/pt">Selection methods</a>, <a href="../index.php?title=Object_name/pt&amp;action=edit&amp;redlink=1.html" class="new" title="Object name/pt (page does not exist)">Object name</a>, <a href="../pt/Preferences_Editor.html" title="Preferences Editor/pt">Preferences</a>, <a href="../pt/Workbenches.html" title="Workbenches/pt">Workbenches</a>, <a href="../pt/Document_structure.html" title="Document structure/pt">Document structure</a>, <a href="../pt/Property.html" title="Property/pt">Properties</a>, <a class="mw-selflink selflink">Help FreeCAD</a>, <a href="../index.php?title=Donate/pt&amp;action=edit&amp;redlink=1.html" class="new" title="Donate/pt (page does not exist)">Donate</a></li></ul>
<hr>
<ul><li><b>Help:</b> <a href="../index.php?title=Tutorials/pt&amp;action=edit&amp;redlink=1.html" class="new" title="Tutorials/pt (page does not exist)">Tutorials</a>, <a href="../pt/Video_tutorials.html" title="Video tutorials/pt">Video tutorials</a></li>
<li><b><a href="../pt/Workbenches.html" title="Workbenches/pt">Workbenches</a>:</b> <a href="../index.php?title=Std_Base/pt&amp;action=edit&amp;redlink=1.html" class="new" title="Std Base/pt (page does not exist)">Std Base</a>, <a href="../index.php?title=Assembly_Workbench/pt&amp;action=edit&amp;redlink=1.html" class="new" title="Assembly Workbench/pt (page does not exist)">Assembly</a>, <a href="../index.php?title=BIM_Workbench/pt&amp;action=edit&amp;redlink=1.html" class="new" title="BIM Workbench/pt (page does not exist)">BIM</a>, <a href="../pt/CAM_Workbench.html" title="CAM Workbench/pt">CAM</a>, <a href="../pt/Draft_Workbench.html" title="Draft Workbench/pt">Draft</a>, <a href="../pt/FEM_Workbench.html" title="FEM Workbench/pt">FEM</a>, <a href="../pt/Inspection_Workbench.html" title="Inspection Workbench/pt">Inspection</a>, <a href="../index.php?title=Material_Workbench/pt&amp;action=edit&amp;redlink=1.html" class="new" title="Material Workbench/pt (page does not exist)">Material</a>, <a href="../pt/Mesh_Workbench.html" title="Mesh Workbench/pt">Mesh</a>, <a href="../pt/OpenSCAD_Workbench.html" title="OpenSCAD Workbench/pt">OpenSCAD</a>, <a href="../pt/Part_Workbench.html" title="Part Workbench/pt">Part</a>, <a href="../pt/PartDesign_Workbench.html" title="PartDesign Workbench/pt">PartDesign</a>, <a href="../pt/Points_Workbench.html" title="Points Workbench/pt">Points</a>, <a href="../pt/Reverse_Engineering_Workbench.html" title="Reverse Engineering Workbench/pt">Reverse Engineering</a>, <a href="../pt/Robot_Workbench.html" title="Robot Workbench/pt">Robot</a>, <a href="../pt/Sketcher_Workbench.html" title="Sketcher Workbench/pt">Sketcher</a>, <a href="../pt/Spreadsheet_Workbench.html" title="Spreadsheet Workbench/pt">Spreadsheet</a>, <a href="../pt/Surface_Workbench.html" title="Surface Workbench/pt">Surface</a>, <a href="../pt/TechDraw_Workbench.html" title="TechDraw Workbench/pt">TechDraw</a>, <a href="../index.php?title=Testing/pt&amp;action=edit&amp;redlink=1.html" class="new" title="Testing/pt (page does not exist)">Test Framework</a></li></ul>
<hr>
<ul><li><b><a href="../index.php?title=Addon/pt&amp;action=edit&amp;redlink=1.html" class="new" title="Addon/pt (page does not exist)">Addons</a>:</b> <a href="../pt/Std_AddonMgr.html" title="Std AddonMgr/pt">Addon Manager</a>, <a href="../pt/External_workbenches.html" title="External workbenches/pt">External workbenches</a>, <a href="../index.php?title=Scripting_and_macros/pt&amp;action=edit&amp;redlink=1.html" class="new" title="Scripting and macros/pt (page does not exist)">Scripting and macros</a></li></ul>
<hr>
<ul><li><b>Hubs:</b> <a href="../pt/User_hub.html" title="User hub/pt">User hub</a>, <a href="../pt/Power_users_hub.html" title="Power users hub/pt">Power users hub</a>, <a href="../pt/Developer_hub.html" title="Developer hub/pt">Developer hub</a></li></ul></div>
    </div></div>
<!-- 
NewPP limit report
Cached time: 20251115221216
Cache expiry: 86400
Reduced expiry: false
Complications: [show&#8208;toc]
CPU time usage: 0.068 seconds
Real time usage: 0.185 seconds
Preprocessor visited node count: 142/1000000
Post&#8208;expand include size: 5782/2097152 bytes
Template argument size: 1905/2097152 bytes
Highest expansion depth: 5/100
Expensive parser function count: 0/100
Unstrip recursion depth: 0/20
Unstrip post&#8208;expand size: 3732/5000000 bytes
-->
<!--
Transclusion expansion time report (%,ms,calls,template)
100.00%   11.559      1 -total
 72.62%    8.394      1 Template:Userdocnavi/pt
 25.50%    2.947      1 Template:Navigation_menu_2
 23.30%    2.693      1 Template:TOCright
-->

<!-- Saved in parser cache with key freecadweb_db01-wiki_:pcache:idhash:33504-0!canonical and timestamp 20251115221216 and revision id 1692649. Rendering was triggered because: edit-page
 -->
</div>
</div><script src="../site.js"></script>